[{"id": "2210219999377078", "text": "Trying to get to Alberobello... seems best route is train to Bari and then bus? Can we pre-purchase bus tickets or is that necessary?\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2210219999377078/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "The bus goes from the back of the train station. You can buy a ticket in the shop beside the bus stop. Just turn up a bit before the departure time. The last bus back to Bari is 8.30 that one was crowded.\nWe did a great walking tour with local food booked with GetYourGuide and the guide was excellent."}]}, {"id": "2210225509376527", "text": "Hey everyone, My bf and I are flying to Italy from MIA at October, we have a layover in Paris for 9 hours! did anyone have an experience with leaving the airport and stroll around? or is it not recommended ? we have never been at the airport in Paris and not sure if it will be ok with timing. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210225509376527/", "likes": 0, "comments": [{"username": "Karen Schmidt", "comment_text": "There are two airports in Paris. Charles de Gaulle is about an hour away from the centre or €100 by taxi and a one hour drive . I suspect you’ll be arriving at this one. ￼You can take the metro, but nine hours really doesn’t give you enough time to take the metro there, walk around and take the metro back and be in time for checking in on your next flight ￼ and going through security. ￼ I suppose you could try to see Paris for two or three hours ￼or so if you really wanted\n\nhttps://\nwww.sleepinginai\nrports.net/\nlayovers/\nthings-to-do-on-\nlayover-paris-c\nharles-de-gaull\ne-airport.htm￼"}, {"username": "Paul Anderson", "comment_text": "Depends which airport your flying into. CDG is 30 km north of the city but it is well connected with a train station in the airport. Orley is in the southwest part of the city and is more or less in the city. You will lose time traveling to the center either way. Bottom line you with perfect conditions will only have 4 hours max in the city and you’ll risk missing your connection. I would do it. But I would rent a car so I had control of the transportation"}, {"username": "Jessica Stewart", "comment_text": "My husband and I are flying out of Mia in September straight to Rome"}, {"username": "Laura Uribe", "comment_text": "I think you have enough time for a few hours in Paris. Arrange a private driver to meet you allowing time to go through customs. Door to door service. They can drive you on a short tour of Paris. I researched it for us but they said it’s about 1.5 hours each way with potential traffic and we only had 6 hours so we don’t have time. You need to be back in time to make it back through security so I allowed two hours for that."}, {"username": "Kejdi Okej", "comment_text": "My husband and l are flying out of mia in september straight to rome"}, {"username": "Regina-Rich Krett", "comment_text": "A couple of years ago we flew out of Paris and it took over two hours to get through security. That was our only time flying from Paris so I am not sure if that is normal."}, {"username": "Nancy Lewis", "comment_text": "The airport is good for a meal and shopping too if you decide to wait."}, {"username": "Linda Corriveau", "comment_text": "Does your 9 hours include your time to get off the plane and go through immigration and customs in Paris? That can take quite a long time so be sure to factor that in to your plans. And I would give myself at least 3 hours to get back for the connection - you have to find your gate and flights generally close quite a while before actual departure time. CDG is huge and crazy busy."}]}, {"id": "2210227066043038", "text": "Has anyone flown SAS Airlines to Rome? Do they weigh your carry on bag?", "link": "facebook.com/groups/1373361046396315/permalink/2210227066043038/", "likes": 0, "comments": [{"username": "Gillian O'Callaghan", "comment_text": "All airlines in Europe are clamping down on carryon for a number of reasons including oversized bags delaying flights. Stick to the measurements and you won't have to worry about paying extra or having your bag go in the hold."}]}, {"id": "2210227656042979", "text": "Hi, may I know what's the price of Colosseum, Roman Forum and Palatine Hill for children under 15 from Coopculture?\nDo I need to buy full tickets for them? We are not EU Citizen.\nI saw there is a category said it's free for children under 18. But I couldn't add to cart.\nAnybody have experience to buy tickets for children under 18?\nThank you very much.", "link": "facebook.com/groups/1373361046396315/permalink/2210227656042979/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Tickets are free for children under 18 for the basic ticket, which is just entrance into the Colosseum. If you get a ticket with a guide, underground, etc. then there is a fee for the children."}]}, {"id": "2210228546042890", "text": "Looking for places around Catania to visit - nice beaches - quaint little towns - nice vibe! Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2210228546042890/", "likes": 1, "comments": [{"username": "Sergio Milone", "comment_text": "The only sand beach in Catania is “la playa”. There is also a small black beach close to city center called San Giovanni li Cuti.\n\nOtherwise with lava rocks:\nQuaint little town in the area: Aci castello, Aci trezza. Some nice village around Acireale like Santa Maria la scala, Santa tecla, Stazzo."}]}, {"id": "2210232669375811", "text": "what is the best month to visit Italy?\nand what is the best destination?\namlfi cost . roma . Lake como what else ?", "link": "facebook.com/groups/1373361046396315/permalink/2210232669375811/", "likes": 4, "comments": [{"username": "Billie Frances Swanda", "comment_text": "April"}, {"username": "Frank Hunt", "comment_text": "Do you like it warm, cold, scenic, cities, mountains, coastal?"}, {"username": "Jenny Payne", "comment_text": "I don’t go in summer 2 hot other than that any time is great ,even winter I love. Rome,Florence,S\niena,Lucca, the list goes on and on 🌻🌻"}, {"username": "Debbi Beston", "comment_text": "May, Lake Garda."}, {"username": "Etschi Bruckner", "comment_text": "none of the above - but I guess a first-timer has to go to Roma!"}, {"username": "Alexandra A Welker", "comment_text": "Late September to mid October the weather is at it's best, not too cold not too hot. For destination it depends what you're looking for; history, museums, beach, countryside Italy as it all. Just visit all. 🤩 When I went the first time I hit major cities: Rome, Florence, Bologna and Venice."}, {"username": "Carol McDonald", "comment_text": "I love Sept/October"}, {"username": "Laura Piccinini", "comment_text": "June!"}, {"username": "Gaby Devyll", "comment_text": "Summer anywhere in Italy is nice."}, {"username": "La Cinzia", "comment_text": "Tuscany, with Volterra and San Gimignano"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "September/\nOctober"}, {"username": "Aimeelee Tillett", "comment_text": "May/June/\nSeptember Ive found the best months to visit."}, {"username": "Renae Larcus", "comment_text": "We love May or Sept/Oct. great weather and fewer crowds."}, {"username": "Donna Mangone", "comment_text": "I have been in March, April, September, and October.\nIn my opinion the best months."}, {"username": "Lucrezia Folger", "comment_text": "Depends on what you like weather-wise. Weather is just weather, however, I like the winters for numerous reasons. Fewer tourists love the winter fashions, and lower prices on everything, I prefer cooler climates and I love the rain and I never make reservations or buy tickets in advance for anything. As far as places you listed, that's like asking which child do you like best? All are completely different in every way. One is a lake, one is on the ocean and one is a city full of life and history. What else, there's plenty. I go 3 months a year, how long are you going for? In Italy, not even Rome can you see everything in a year. And you don't want to run from place to place you want to breathe it all in and savor the amazing beauty, light, foods, sites, people, .........."}, {"username": "Carol Volpe Moriarty", "comment_text": "Anytime between January and December 😂😂😂. I’m happy to be in Italy ANYTIME!😁😁😁"}, {"username": "Daisy Yoo", "comment_text": "Cooler weather also easier to put important things inside and less ppl"}, {"username": "Rose Turdo", "comment_text": "Alberobello\nBolsena Lake"}, {"username": "Julia Salmon", "comment_text": "This summer went to Florence, Positano and Rome. Florence was our favorite!! So beautiful"}, {"username": "Nancy Lewis", "comment_text": "Lake Como and Rome"}, {"username": "Ann Applegarth Veith", "comment_text": "Not August. A lot of businesses and restaurants close for vacation the second and third week of August."}]}, {"id": "2210237916041953", "text": "Venice: that' s amore", "link": "facebook.com/groups/1373361046396315/permalink/2210237916041953/", "likes": 126, "comments": [{"username": "Paulette Woschee", "comment_text": "Great pictures"}, {"username": "Nikki Delaney", "comment_text": "Wow"}, {"username": "Cris Montenegro", "comment_text": "Awesome ❤️"}, {"username": "SD Allen", "comment_text": "Magical Venice! Loved visiting."}, {"username": "Suzanne Sullivan", "comment_text": "Nice pics! I’m here now as well"}, {"username": "Joyce Kinnunen", "comment_text": "Beautiful"}]}, {"id": "2210240596041685", "text": "What are the things we need to prebook in Florence pls? Like in Rome, I bought tickets for Vatican museums and Colosseum area combo. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2210240596041685/", "likes": 27, "comments": [{"username": "John Cosenza", "comment_text": "we did a tour of the cathedral with a tour of the roof tops. It was unbelievable and a highlight of my trip"}, {"username": "Kejdi Okej", "comment_text": "We did a tour of the cathedral with a tour of the roof tops it was unbelievable and a highlight of my trip"}, {"username": "Silvia Arndt", "comment_text": "May I ask who you prebooked with?"}, {"username": "Amanda Elias", "comment_text": "Academia to see David!\nThe Duomo!\nA walking tour is a must!\n….. the veryyyy least."}, {"username": "Alicia Burno", "comment_text": "I just left Florence and didn’t have to buy tickets ahead of time. Got them the same day."}, {"username": "Lilly Koszta Edmunds", "comment_text": "Accedamia, duomo"}, {"username": "Diane Smith Frederick", "comment_text": "I used FloranceTown. They were awesome"}, {"username": "Judi Rinaldo", "comment_text": "Statue of David"}, {"username": "Sunny Whitman Mays", "comment_text": "Sunset Vespa Tour of the countryside was highlight"}, {"username": "Samantha Richardson", "comment_text": "First Sunday in every month is free to visit the Museums, which includes the Uffizi and David. ❤️"}, {"username": "Mandy Thurmon McLaughlin", "comment_text": "Accedemia to see statue of David, Uffizi for sure, climb the dumo, and a wine tour."}, {"username": "Cory Lee", "comment_text": "I have a bad knee and need to stop repeatedly going up a lot of stairs. I can get there. I just need to take some breaks. Is this possible in that small space? Were there other people taking breaks?"}, {"username": "Jess Plombon", "comment_text": "Wine tasting in the Tuscan hills, day trip to Pisa."}, {"username": "Julie Payne", "comment_text": "Following"}, {"username": "Jane Eichhorn", "comment_text": "Uffizzi if you want to see the masters. Academia for David statue. Duomo/dome\nDo NOT useGet Your Guide. They cancelled two of our tours last minute and we couldn’t get replacement tickets. They don’t have a lot of English guides."}, {"username": "Gillian O'Callaghan", "comment_text": "I booked Uffizi, Accademia Gallery and Cappelle Medicee a few days ahead."}, {"username": "Kelly Ford", "comment_text": "Uffizi & try for 1st thing in morning as it’ll be less crowded."}, {"username": "Denise Chapman Toth", "comment_text": "L’Academia, Uffizi, Duomo tours"}, {"username": "Scott Fridkin", "comment_text": "I got the 5 day museum pass which included about a dozen museums (not David though) including Pitti Palace and Boboli Gardens. The Uffizi was the only one you have to pick a day time, five days start from then. You can only enter each museum once, but you get to decide your order and which days."}, {"username": "Valerie Goulds", "comment_text": "The David. (Try to get tickets first thing in the Am), The Uffizi, the palace"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2210245839374494", "text": "Trevi fountain pic today 😍", "link": "facebook.com/groups/1373361046396315/permalink/2210245839374494/", "likes": 3490, "comments": [{"username": "Tracy Crouch", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Mariya Yankelevych", "comment_text": "Mariya Yankelevych"}, {"username": "Mary Holle", "comment_text": "Beautiful photo!"}, {"username": "Bernadette Butera Bokan", "comment_text": "Bernadette Butera Bokan"}, {"username": "Dyli Kei", "comment_text": "Bellissima! Grazie mille"}, {"username": "Dawn Weisser Vande Vegte", "comment_text": "How did you get that close? It is so crowded!"}, {"username": "Barbie Munoz", "comment_text": "Barbie Munoz"}, {"username": "Ali Makki", "comment_text": "Ali Makki"}, {"username": "Olga Vongrey Jelényiné", "comment_text": "❤️boldogan visszamennék❤️"}, {"username": "Mary Lyons", "comment_text": "Ann Marie McNaul xxx"}, {"username": "Hajnalka Krupa", "comment_text": "Engem vár😊"}, {"username": "Stanislawa Stoparczyk", "comment_text": "Byliśmy, widzieliśmy, zwiedziliśmy."}, {"username": "Наташа Штен", "comment_text": "Наташа Штен"}, {"username": "Yolanda Warwar", "comment_text": "Been. There love Rome"}, {"username": "Rita Westerman", "comment_text": "Been there! Threw as Coin there!"}, {"username": "Nadia Aliche", "comment_text": "C était l été dernier ,j avais jeté qq sous pour le salut d une personne spéciale"}, {"username": "Mirco Lachmann", "comment_text": "vs. Reality"}, {"username": "Plummet Airlines", "comment_text": "Beautiful"}, {"username": "Patricia Giner", "comment_text": "Mai 2023"}, {"username": "Lesley Stracey", "comment_text": "Can't wait to see this"}, {"username": "Ângela Montarroios", "comment_text": "Quero voltar....."}, {"username": "Lucia Goncalves", "comment_text": "Belíssimo já estive aí adorei"}, {"username": "Karen Stewart", "comment_text": "Amanda Stewart so looking forward to us seeing this in Nov"}, {"username": "Marge Jones Sykes", "comment_text": "INCREDIBLE,💙"}, {"username": "Barbara Fleury", "comment_text": "I would go back in a heartbeat"}, {"username": "Mariana Mocanu", "comment_text": "Mariana Mocanu"}, {"username": "Grażyna Drewniak", "comment_text": "Jak zwykle piekna"}, {"username": "Key Mac", "comment_text": "Dec 2022"}, {"username": "Olive Howarth", "comment_text": "Olive Howarth"}, {"username": "Tracey Dunne", "comment_text": "I went5 years ago was fab"}]}, {"id": "2210247809374297", "text": "Does anybody know if Italiarail is reliable? Im taking the fast train from Rome to Pisa and I bought the ticket on this website. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210247809374297/", "likes": 0, "comments": []}, {"id": "2210251426040602", "text": "Cinque Terre number 1", "link": "facebook.com/groups/1373361046396315/permalink/2210251426040602/", "likes": 4, "comments": []}, {"id": "2210252622707149", "text": "Hello friends! We’re hoping you’ll share your favorite recommendations with us and this group for restaurants located near our stops on our upcoming 19 day trip to Italy. First timers here and cannot wait to see Italy! Please, please, please share your favs, any place, any details, and we’d be most grateful. We’re not picky! Thank you in advance! 🇮🇹 🍝 🐠 🥐 🍽️\n\nRome, Florence, Chianti (Tuscany), Naples, Amalfi Coast, Capri, Palermo and Taormina", "link": "facebook.com/groups/1373361046396315/permalink/2210252622707149/", "likes": 1, "comments": [{"username": "Jessica Olivero", "comment_text": "Risotteria Melotti — by far one of our favorite meals of our entire trip!"}, {"username": "Bill Gillespie", "comment_text": "Naples, visit the Archeological Museum it is Amazing, \"The Veiled Christ\" is unbelievable, just north of Naples, Caserta and the Largest Royal Palce in the World - so amazing, very few tourists. Looking for a hotel, highly recommend Hitel Foro Carolino located at Piazza Dante, the historic district. I could go on and on, lived there for 4 years."}, {"username": "Rose Turdo", "comment_text": "From Palermo take thd Cefalu exit onto SS113, follow to Santo Stefano di Camastra, dinner L'Angolo di Manueliana. It's an incredibly beautiful stretch of coastline. Catch a sunset in Santo Stefano facing Mistretta Bridge.\nIf heading back towards Cefalu, stop at Tus Hotel on SS113\nGreat restaurant across the street"}, {"username": "Louis Passariello", "comment_text": "Take a side trip to seinna you will love it."}, {"username": "Erika Kl", "comment_text": "All’s Mille Adriana near the Vatican in Rome and Poseidon in Florence, they were both recommended to us by locals. Also Ristorante Santi in time has the best lasagna I’ve ever had"}, {"username": "Alberta Brack McAviney", "comment_text": "D Enzo suburb of Rome. In Trastevere.\nBest Burrata cheese and fried artichoke ever!!"}, {"username": "Ike Simoncini", "comment_text": "When will you go? Im in chianti from 6 to 31 september i have selected 14 restaurants and will visit them all dont know wich of them are realy good pm me and if you.are there after me i will let you know"}, {"username": "Shelley Sclavos", "comment_text": "Tonarello in Travastere in Rome..food is outstanding\n\nIl Tridente in Positano for beautiful food and spectacular view"}, {"username": "Shelley Frise", "comment_text": "We stayed 3 weeks in Italy mostly in the south and never had a bad meal."}, {"username": "Ike Simoncini", "comment_text": "OK here we go:)\n\nFirst of all sicily is one of the best places to eat there are not a lot of tourist traps but i always recomend not to eat in the tourist hot spots. Look for the places up in the mountains or in little streets or ask the locals where they eat.\n\nBeacausse its an island there is a lot of realy realy good fish. For example the sword fish is delicious there is this dish\n\nhttps://\nricette.gialloza\nfferano.it/\nInvoltini-di-pes\nce-spada.html\n\nthat you realy should try and one more must eat is the famous canolli siciliana made out of fresh sheep ricotta. You can get it in europe.,USA or other parts of italie then sicily but it will NEVER be as good as it is on sicily i can asure you that\n\nAs for going 3 weeks i would realy not stay in one place and travel all the time i would stay in a couple of places for a couple of days.\n\nYou could start in palermo causse there is one of the airports. Palermo Is just like every big city nice for 2/3 days maximum and i would recomend an hotel in mondello(thats the part of palermo at the beach)\n\nhere is a lot to visit one of the nicest things is monreale the cathedral with a golden ceiling. As for local food there is this realy nice and cheap kind of streadfood called\n\nhttps://\nwww.mangiabedda.\ncom/\npanelle-sicilian\n-chickpea.../\n\nthat you should try.\n\nNext if you go to the left is trapanni a smaller realy nice town famous for its tuna fishing.\n\nA nice place to visit is erice a castle on top of the mountain next to trapani its realy not far from palermo so easy do drive there within an hour\n\nNext on the list is agrigento witch is on the south coast. Here you have the\n\nhttps://\nwww.visitsicily.\ninfo/.../\nvalley-of-the-te\nmples/\n\nWitch is lovely to visit there are also nice beaches afcourse so you could stay here couple of days to relax as well\n\nIf we go on you could go away a little from the coast and visit\n\nhttps://\nen.wikipedia.org\n/wiki/Enna\n\nwitch is the highest town in sicily just one or two days is fine.\n\nFrom there you could go to siracusa another coast town with lots of archeological sights.\n\nSicily has been under influence of the vikings, ottomans, byzanthium, romans, greeks etc etc.\n\nFrom there you should go to taormina it is verry touristic but still lovely you can visit the etna from here and take the elevator up to the historic center. Take a Hotel Downstairs so you will probably have a private beach\n\nLast one i recomend is\n\nhttps://\nwww.checkoutsam.\nnl/\ncefalu-de-mooist\ne-plaatsen-op-s\nicilie/\n?fbclid=IwAR0kzl\nPknlwXg4T3zYXTt\nZAysN9SR3z_0VF0\nGzOYztxhvyW_yhX\nb8Jg7pwY\n\nif you want to stay somewhere and relax its a perfect place beautifull and not to big with lots of nice beaches"}]}, {"id": "2210253259373752", "text": "What type of luggage is the best to travel with on a 2 week European vacation requiring airplane/train rides to multiple cities? Backpack, carry on, or checking in a suitcase???", "link": "facebook.com/groups/1373361046396315/permalink/2210253259373752/", "likes": 167, "comments": [{"username": "Tarah-Lee Cotie", "comment_text": "Definitely a backpack that can slide over the handle of your carryon (make sure it rolls well and in all directions) is the best combo. I’ll never do a big suitcase again. It was 50 degrees a few weeks ago and I wished I’d packed lighter"}, {"username": "Leah Hurley", "comment_text": "I frequently do three weeks in a carry-on and a backpack! Trains, planes and automobiles!"}, {"username": "Mary Timpane Acord", "comment_text": "I took a carryon and a backpack. It was great"}, {"username": "Bonnie Delecki", "comment_text": "Who makes the lightest wheeled backpack??"}, {"username": "Cynthia Tarantino", "comment_text": "Small"}, {"username": "Sari Elizabeth", "comment_text": "Carry on 100%"}, {"username": "Debbie Manzon", "comment_text": "Has no one heard of washing clothes on vacation?"}, {"username": "Lisa RC", "comment_text": "Lisa RC"}, {"username": "Allison Campbell", "comment_text": "Definitely hand luggage . Cost us a fortune in porter fees, checked baggage etc bec we were away for 5 weeks."}, {"username": "David Brightbill", "comment_text": "I usually am in Italy for 2+ months every year. I bring two carryon size bags. One, a backpack with my video equipment (I’m a YouTuber), prescription meds, a change of clothes, etc. goes with me in the overhead bin. The other, an expandable roller, gets checked.\n\nIf I wasn’t carrying camera gear and a computer, I could easily get by with one carryon."}, {"username": "Lorraine Braid", "comment_text": "Backpack and small carry-on sufficient for 4 weeks for me - just pack smartly."}, {"username": "Deborah Marler", "comment_text": "A carry-on backpack with wheels."}, {"username": "Jade Morgan", "comment_text": "2 weeks with this carry on and didn't even use half the stuff in there 👍"}, {"username": "Sophia Howarth", "comment_text": "Roll wheels, med size and not too heavy 100%"}, {"username": "Lisa Martinson", "comment_text": "Victronix"}, {"username": "Grace D'Onofrio", "comment_text": "backpack"}, {"username": "Renee Rundle Stoneham", "comment_text": "Back pack and carryon!\nHauling luggage through train stations and along cobblestone streets etc…\nLess luggage!!\nI did 15 days France/Italy with a 21” roller and a backpack.\nCompression packing cubes are your friend!\nPlan a laundry day!\nYou really only need 2 pair of shoes 1)good walking tennis shoes (or booties if fall/winter) and sandals for evenings. We were hiking so I needed hiking shoes too…"}, {"username": "Melissa Wade", "comment_text": "I also recommend taking carry on bags. I took laundry detergent pods and washed a few times on our trip and it worked out really well.\nSome places don’t have elevators and you may be on the 2nd or 3rd floor (we were on our trip) and it’s much easier to maneuver a carry on than a large suitcase."}, {"username": "Donna Jones", "comment_text": "I am thinking carry on suitcase with a bag that fits over handle and can unzip bottom for more space."}, {"username": "Lauren Smigielski", "comment_text": "This backpack was also amazing and fit so much! Can use as a carry on!"}, {"username": "Shawn Kopp", "comment_text": "🥸what time should i wake up when i get to my destination ?"}, {"username": "Jan Varas", "comment_text": "Few of my friends are traveling now and only took carry on."}, {"username": "Nicole Darness", "comment_text": "Less is best, travel light. Summer requires little clothing and lots of water. 🤣💙☀️🏝"}, {"username": "Jen Enssle Brown", "comment_text": "My daughter and I each used a Osprey duffel backpack and it worked out perfectly. We visited 5 countries in 16 days so we did a LOT of traveling via train, car, and in and out of multiple hotels.\n\nThey’re waterproof, sturdy and easy to carry and pack.\n\nEdit to add: they have several sizes of this bag."}, {"username": "Michelle Stavros-Monje", "comment_text": "If you check a bag, medium will fit in overhead bin on trains, large will not."}, {"username": "Patrizia Burford", "comment_text": "TravelPro"}, {"username": "Jody Strong Guler", "comment_text": "Once you travel internationally\n, if you are in charge of carrying your own luggage for all your transportation;\nI believe a majority will pack lighter on the next trip. I am a shopper, I look up ahead of time in the larger areas ￼we will be visiting to find the closest MAILBOXETC. ￼ It doesn’t happen every trip.. but I ship items that I have bought if they will make my luggage too heavy. I make a list of what is going to be in the box and they wrap it, pack it and ship it home for you. I’ve always had great success using them. Yes, it does cost, but that way I’m not lugging around an extra suitcase full of items that I have bought."}, {"username": "Kim Butler Oam", "comment_text": "I’ll be checking in a Medium size suitcase with 4 very good quality swivel wheels. I’m not stressing about trying to take carry on only. Just buying a good quality suitcase with priority on 4 strong durable wheels"}, {"username": "Brooke McCulloch", "comment_text": "We are travelling now (5 of us) with Osprey 40L Fairview/\nFarpoint bags, and a small handbag each for under seat on the plane, they have been great as carry-on."}, {"username": "Helene Moccia", "comment_text": "Can anyone tell me if I can still bring my handbag along with my carry on and a small backpack\nThanks so much"}, {"username": "Nikki Ocampo Moreno", "comment_text": "small"}, {"username": "Debbie Brenner-Deline", "comment_text": "Just dont do what I did...went to Italy, bought so many wonderful and beautiful stuff that I had to purchase 2 suitcases to bring everything home...cost me over $500. Now those were some expensive souvenirs!"}, {"username": "Keri Travis", "comment_text": "For all that is good and pure- you can travel with a carry-on and personal item (backpack/\nsmall duffel) for LIFE! If it lasts for a week, it can last forever. My children and I have traveled for four months carry on only. Choose the most comfortable for you, but I’d say if you’re young a travel pack with zip off daypack, older a soft roller with small bag that slips over the handle."}, {"username": "Deborah Gold", "comment_text": "We liked our smallish rolling bags. My son only ever goes with a backpack. It depend on your style. And we rented a car to go all over Italy."}, {"username": "Trudy Lingham", "comment_text": "Trudy Lingham"}, {"username": "Catherine Mai An", "comment_text": "Backpack and carry on only! We just got back from being in Europe for 3 weeks, 6 different countries."}, {"username": "Kristen Anne", "comment_text": "The least possible!"}, {"username": "Lynn Bittner von Schneidau", "comment_text": "I went to Europe and Asia for a month. Only had a carry on and a shoulder bag. I researched the exact size maximum dimensions for every air carrier so they wouldn’t make me check it. That thing was so heavy! and in Turkey i had to lug it up flight stairs and then lifting it into the overheads. That was hard sometimes but so glad i just had a carry-on for 4 countries and several flights. Always think about what you need to have if your luggage that you checked got lost- which seems to be very common these days. Better ti not risk it."}, {"username": "Theresa M. Iorfino Telesco", "comment_text": "Always a backpack and carry on bag"}, {"username": "Jenna Phillips Clabeaux", "comment_text": "Ok, this sounds great with a carry on and back pack but let’s be honest is this even feasible with a one year old?"}, {"username": "Brandi-Lee Rice", "comment_text": "I just did it with my family of 3. 2 weeks across France, Slovenia and Italy. Needed clothes for multiple seasons as weather was quite different country to country. We traveled with 2 rolling suitcases, 2 backpacks and a hockey gear bag and sticks. Bus, taxi, train and plane. We didn't find it bad and we wore everything that was packed except swimsuits 🤣 each to their own."}, {"username": "Karla Villaseñor", "comment_text": "It Luggage carry on!"}, {"username": "Jeannie Dargle", "comment_text": "REI -backpack & have them fit you for it"}, {"username": "Jennifer Secrist", "comment_text": "A backpack"}, {"username": "Neah Kelly", "comment_text": "Carry on 💯"}, {"username": "Lori Huffaker", "comment_text": "We took backpacks as our carry-on. Never checked them. Everything went smoothly. We alternated VRBO’s with hotels, for various reasons. The VRBOs always had a washer so we would check in, and start washing right away, to hang dry and have everything clean for the next leg of our trip. Definitely recommend backpacks."}, {"username": "Tammy LeNormand Sill", "comment_text": "2 weeks is a long time. I'm headed to Paris in about a month. There will be a carry-on and a large checked bag. The carry-on will have 3 complete sets of cloths, 2 pairs of shoes, medicine and anything else that I simply cannot loose. The large bag will have the remainder of clothes and shoes, anything that cannot go theough TSA and room for purchases."}, {"username": "Jackie Alvaro", "comment_text": "Mono or Away brand carry on luggage is great and a backpack for extra items. My husband and I went to Greece this summer…Carry on was the best for all the travel on planes, ferries, taxis…"}, {"username": "Ivana Costantini", "comment_text": "I don't know what the fascination is with cramming everything in a backpack or carry-on. Here is what I rolled around France and Italy. The bag is heavy but for me it's more important that it is not falling over or off when rolling."}, {"username": "Hilary Corbin", "comment_text": "We just did Rome-Orvieto-Fl\norence-Bologna-\nVenice with carryon and backpacks. We did laundry in Orvieto. I did end up buying a cheap suitcase in Florence for souvenirs/more room"}, {"username": "Al Burger", "comment_text": "Ten days, 1 backpack, 1 wheeled carry on. We shipped home items we purchased for others and ourselves. The two stores we used were Magee of Donegal and The Blarney Store. Shipped free. Plus we took a nylon lightweight travel bag (Amazon) for our return trip back to the States. We put clothes in it and checked that bag. It left my backpack open for items in the duty free shops at the airport (liquor, perfume, small gifts)"}, {"username": "Jay Greco", "comment_text": "Smaller is better. You can always buy some items along the way."}, {"username": "Bronx Louise Vicidomini", "comment_text": "Laurie Esposito-Joudi"}, {"username": "Kathleen George", "comment_text": "Mary Tash King"}, {"username": "Gabrielle Marie", "comment_text": "Hiking Backpack"}, {"username": "Lisa Roberts O'Neil", "comment_text": "Back pack and carryon. And it’s nice if the back pack has that sleeve that allows it to go over handle of carryon suitcase when you are walking. Helps to have a hand free for passport etc at airport. No big suitcases. A lot of the streets are cobblestone, too, so we saw a lot of people struggling with big suitcases. I also took a very small crossbody and would put it in my backpack, so it wouldn’t count as separate personal item in addition to backpack. Then off the plane I could pull it out and throw it on."}, {"username": "Guinness Mydog", "comment_text": "Carryon and small backpack. Perfect"}, {"username": "Marlene Filewich", "comment_text": "Away!"}, {"username": "Lisa Gargis Hey", "comment_text": "We did carryon and a small tote bag. If you are on and off or trains then you will want something super easy to carry or to roll around."}, {"username": "Kevin P. Wrenn", "comment_text": "Carryon or back pack!!"}, {"username": "Mary Lou McColl", "comment_text": "carryon"}, {"username": "Mary Lou McColl", "comment_text": "carryon"}, {"username": "Sofia Kanack", "comment_text": "i took a backpack and a carry-on suitcase. was good enough for me for 2 weeks"}, {"username": "Barrie Maynor Vela", "comment_text": "Yes! carry on and a backpack ( with trolly strap) and a small day pack or crossbody that holds a water bottle for day outing we did a 2 week trip with a girl scout troop in italy and switzerland and having just a carryon and backpack worked perfect!"}, {"username": "Suzan Yarington Kearns", "comment_text": "Unless your totally valet travel w a tour company, minimize!!!"}, {"username": "Kathy Catalina", "comment_text": "P("}, {"username": "Donna Wilson", "comment_text": "My problem is shoes! We are going to a wedding and festivities, then hiking. Hard to get all those shoes in a backpack!"}, {"username": "Sissi Lee", "comment_text": "I had one carry on backpack for more than 100 days in Europe involved cheap flights, trains, boats, rental cars, buses, underground and walking. Didn’t check baggage unless it was requested. I learned from my first Europe trip that no suitcase and no check in luggage. Packing cubes are a must, layer of lightweight down jackets and raincoat instead of one heavy coat for cold weather. Get some clothes designed for traveling(Eddie\nBauer), shoes cover for rain(Amazon). Don’t bring your wallet, hide your cash, credit cards and id in inside separate pockets that other people difficult to reach."}, {"username": "Sandra Reagan Gates", "comment_text": "I took medium suitcase to check and 1 overhead bag that had things i could not replace plus a change of clothes and my purse. I used a couple of plastic compression bags for sweaters and slacks. Worked great!"}, {"username": "Denise DeSha-Soberanis", "comment_text": "DO NOT bring a large suitcase that requires checking in. YOU WILL REGRET IT. We did! All I really remember about our first trip was getting all sweaty and flustered lugging around our big unwieldy suitcases full of clothes I didn’t even wear! Besides, ask yourself why? No one knows you wore that outfit a couple of days ago.\nNow have carry ons with wheels and backpack straps that tuck into the back.\nI LOVE TRAVELING LIGHT AND MOBILE. Never going back to a big suitcase.\nHave fun!"}, {"username": "Colleen Ohira", "comment_text": "We did carry on suitcase with a backpack…15 days, but we also had washer at all Airbnb places."}, {"username": "Holly Keeley", "comment_text": "One small rolling bag"}, {"username": "Stephanie Dean", "comment_text": "Type = small. 😋"}, {"username": "Pam Henline", "comment_text": "21” hard-side spinner. Won’t fall over and cause you to say bad words. Plus canvas bag with trolley sleeve. (Cobbler sewed one on a Lands End bag for me. 25+ years of hard travel and still in good shape)"}, {"username": "Donna D'Arena Henry", "comment_text": "Vera Bradley shoulder bag and carryon with wheels.\nLongest trip was 38 days in Italy"}, {"username": "Angela Tucker", "comment_text": "Just a carry on and a backpack. I am a woman who loves clothes and shoes but was able to pack for three weeks in Europe with just a carry on suitcase and backpack. You will regret checking luggage."}, {"username": "Marie Jill", "comment_text": "Backpack with fold up bags to use for doing laundry or shopping."}, {"username": "Dawn Williams", "comment_text": "Who knows of good, comfy backpacks"}, {"username": "Angie Harding", "comment_text": "I exclusively use a backpack & am gone for minimum of 2 weeks. You won’t regret it."}, {"username": "Griselda Gentilesca", "comment_text": "I just purchased a beis carry-on. I usually take a carry-on and throw in all of my my essentials along with my husbands. Things we absolutely can’t be without like undies and at least one pair of swimming trunks and bikini. I like to leave our backpacks kinda empty so we aren’t carrying around too much and we check-in one luggage (I usually take good tequila because it’s always a big hit when you visit other people on other parts of the world) with all the outfits and things that wouldn’t derail us if the checked in luggage didn’t make it to our destination. Then i carry the carry-on and make my Husband carry the checked-in luggage 💅 🧳 👨🏻"}, {"username": "Marilyn Meade Penrod", "comment_text": "Small wheel suitcase and personal item bag with a shoulder strap. Also a slashproof strap pocket book like Travelon."}, {"username": "Ntokozo Bhiya", "comment_text": "A cabin bag\nPlus a “Ryanair “ bag that can fit in under the chair"}, {"username": "Chanie Raksin", "comment_text": "Following"}, {"username": "Isagani Abalos", "comment_text": "Travel light. Wash often. Laundry mats are available. You may have to climb stairs on double-decker trains."}, {"username": "Isagani Abalos", "comment_text": "You only have a few seconds to get on or off the trains."}, {"username": "Cathy Clarkin", "comment_text": "Stupid question , but if you travel light are there stores a plenty to grab shampoo , etc??"}, {"username": "Charvette Fernandes", "comment_text": "Backpack 🎒"}, {"username": "Anthony Fistek", "comment_text": "Grocery store bag"}, {"username": "Rosario Cristina Micaletti", "comment_text": "Travel light, I recommend a backpack or even a carryon size suitcase. We are currently in a multi country trip by planes and trains and anything can happen at the last minute."}, {"username": "Alejandra Adela Ferrari", "comment_text": "Backpack + carry on"}, {"username": "Lien Tran Griffin", "comment_text": "Our family of 3 went on a 28-day European vacation. We travelled by plane, cruise ship and train. Each of us brought only one carry on and one backpack. It was the best decision. We were able to easily navigate stairs, cobblestone streets, airports and train stations. No need to worry about lost check-in luggages. It was liberating. We did have to use laundry service on the cruise and washed our clothes."}, {"username": "Tammy Arcieri Lim", "comment_text": "Carry on"}, {"username": "D.p. Buonaccorsi", "comment_text": "We went for two weeks\nRome, Sienna, Florence Cirque Terri and Lucca and both of us used carry on and a backpack best decision ever. Don’t over think it have fun 😎"}, {"username": "Chelsea Runaas", "comment_text": "Backpack!"}, {"username": "Mary Gavia-Barajas", "comment_text": "One small carry on, thEuropean size and my Tumi backpack."}, {"username": "Runn Cynn", "comment_text": "I went for 3 weeks with a backpack and a carry on. Was fine. I like to travel light and can switch up the clothes as I go. Must be the army training. And so much easier getting onto the trains."}, {"username": "Jeff McLellan", "comment_text": "Small carry on suitcase and a normal sized backpack"}, {"username": "Sal Arms", "comment_text": "a small luggage and a backpack"}, {"username": "Joanne Murphy", "comment_text": "I’d recommend you don’t choose a different colour from black, so easy to get mixed with other people particularly on busy trains. Unfortunately on our trip to Pisa they lady next to us had a black backpack stolen in a carriage full of people. It was black so indistinguishab\nle and no one noticed it being taken from over head rack."}, {"username": "Stephanie Vogel", "comment_text": "One carry on and a small duffel. It’s been working well for me and we are here for two weeks. If you can go without the duffle do that and do a backpack. Also if you back gets delayed from airline mishandling then you will never get it back, they will not be able to catch up to you on your trip. DON’T CHECK. I checked a bag to France and it didn’t get to me 5 days into my 7 day trip, sucked and they never reached out to me, eventually they dumped it at a post office and didn’t tell me."}, {"username": "Sherry Galloway", "comment_text": "We do Osprey (carry on only) backpacks with wheels and we leave in 16 days for 6 weeks. (4 countries) This will be our 3rd trip to Europe this way. You can carry when you’re on a train, or roll them through the street."}, {"username": "Lisa Kakoufas", "comment_text": "Hybrid. Backpack with wheels…."}, {"username": "Andi Perry Gowin", "comment_text": "The four of us on our trip all had the same backpacks with roller for our two week trip. Nothing more but fanny packs and shoulder bags."}, {"username": "David AndMo Welchman", "comment_text": "Carry on. If you are touring and your check in bag is lost, it would never catch up with you"}, {"username": "Isa Van Wyk", "comment_text": "Cabin bag !"}, {"username": "Susan Bouchon", "comment_text": "For me vacation means I'm not carrying anything on my body. I roll a lightweight 25\" hardwire that I check."}, {"username": "Jennifer Drysdale", "comment_text": "Small suitcase/\nbackpack with wheels. You don’t need to take a heap of clothes. Truely. 😀"}, {"username": "Colleen Campbell Bussey", "comment_text": "Went for a month in spring, used one carryon suitcase & bag to carry. You wash undies in the sink and rotate/mix match clothes, and if need be buy clothes!"}, {"username": "Brian Sturkie", "comment_text": "Seema Parmar Sturkie - comments are golden."}, {"username": "Colleen Sepulveda", "comment_text": "Also I just wanted paid 100e for a checked luggage on Vueling.:: but clothes are not that cheap in Italy so it depends if you can wash while you are there. Also Venice was hardddd with large luggage."}, {"username": "Anne-marie Thomson", "comment_text": "Minimum! Hand luggage!"}, {"username": "Giovanna Hodges", "comment_text": "Carry on"}, {"username": "Ilona Kuligowska", "comment_text": "Doing it right now with a 20 kg suitcase. So far no problem and plenty of choices for clothes. We had to pack for northern and southern Europe weather so carry on would not have sufficed for me. We are on our 4th stop and no issues so far."}, {"username": "Dana Adaline", "comment_text": "1 backpack, and wash clothes. Per person."}, {"username": "Chris Logan Densmore", "comment_text": "ADVICE pack any small bag or backpack then . . Carry it around the block and then decide how much you need to pack."}, {"username": "Larry Basirico", "comment_text": "Away carryon and a personal bag. Pack wisely and it’s all you need."}, {"username": "Krystle Waggy Konečný", "comment_text": "Carry on luggage and a backpack. If I can do it, anyone can!"}, {"username": "Karima Baroud Zannotti", "comment_text": "Small carry on and backpack. Anything more and your will regret it. Car/taxi trunks are not often large, navigating steps and cobblestones, trains, etc can be very challenging with large bags."}, {"username": "Gillian Cannon Lynch", "comment_text": "10kg cabin suitcase & backpack 🎒"}, {"username": "Natalie Ault Wheeler", "comment_text": "Rolling carryon and a backpack. Best decision ever. Next time I wont bring as many shoes"}]}, {"id": "2210254039373674", "text": "Not all who wander are lost.(Monterosso Al Mare) #reels #reelsinstagram #instagram #trending #viral #explore #love #instagood #explorepage #reelitfeelit #follow #photography #fyp #reel #instadaily आणखी #reelsvideo #like #memes #foryou #music #facebookreels #facebook #facebookviral #reelsviral #reelsviralvideo #reelstrending #trendingnow #reelstrendingvideo #facebookpost #riomaggiore #monterossoalmare #manarola #corniglia #vernazza #cinqueterre #laspezia #reels2023 #ristoranteilgabbiano #paanokumitasafacebookreels #facebookreelssahod #facebookreelsearnings #metaverified #metaverifiedaccount #facebookreelsmonitization #facebookreel #fbreels #facebookreelssettings #facebookreelsincome #facebookreelsplaybonusprogram #facebookreelsvideo #facebookreelseligibility #facebookreelsviral #facebookreelspayout #facebookverified #bonassola #levanto #adsonreelsfacebook #adsonfacebookreels #adsonreelsmonetization #monterossobeach #monterosso", "link": "facebook.com/groups/1373361046396315/permalink/2210254039373674/", "likes": 3, "comments": []}, {"id": "2210256792706732", "text": "How many Euros in CASH (for food, taxi, shopping,etc) does one need on a 2 week France/Italy vacation? Airplane, train and activities are already paid for. This is more for the places that don’t take credit cards.", "link": "facebook.com/groups/1373361046396315/permalink/2210256792706732/", "likes": 4, "comments": [{"username": "Stephen Dawson", "comment_text": "i have been in france for 2 weeks and spent 50 euro in cash. Almost everywhere takes card even some restrooms. I use contactless payment 99 percent of the time"}, {"username": "Terry Hamlet", "comment_text": "Schwab has ATM free worldwide. Take a limited amount from home then use the Schwab card to withdraw in country."}, {"username": "Erin Mitchell", "comment_text": "We were in Italy for almost 2 weeks and Genova was the only place where the Taxi drivers preferred cash. And we only took them from the train station to hotel.\nShopping really depends on what you are looking to buy, and food again, they do contactless. We paid cash for gelato most of the time."}, {"username": "Caroline Ní Fhaolain", "comment_text": "That's really difficult to answer. Most taxi drivers prefer cash, if you're going to go to any markets again cash is required, tour guides you would normally tip in cash. It all depends on the activities you would be involved in but cash machines are everywhere in Italy and France so you should be able to judge it day by day."}, {"username": "Dianne Smith Durham", "comment_text": "Just got back from 2 weeks Italy & Paris. Most places took cards except American Express ( rare in Italy, 50/50 in Paris). we used about 400 euros at markets, small cafes & businesses. Need a few $1 euro coins for public bathrooms, also keep a pack of tissues."}, {"username": "निनावी सहभागी", "comment_text": "Thank you all for the great advices 🙏🙏🙏 I think I will take some euro cash and pay mostly with Visa/ master cards."}, {"username": "Shirley Lewis", "comment_text": "there are probably more place in Europe that take credit cards than in the US! by law taxi drivers must take credit cards so don't fall for the old credit card machine is broken!"}, {"username": "Sierra Behrens Tibbetts", "comment_text": "Is venmo a thing in Itlay?"}, {"username": "Megan Rachal", "comment_text": "We prefer to travel with cash — we budget $250-300usd per day"}, {"username": "Eileen Muro", "comment_text": "We went for 10 days. We took 500 Euros and the last day we still had 300 Euros. 99% of places take card. We ended up spending our last 300 on things that we could have paid with card."}, {"username": "Linda McNelis", "comment_text": "Autumn Mcnelis"}, {"username": "Mary Ann Shepard", "comment_text": "Crazy to carry a lot of cash in Europe"}, {"username": "Alicia Burno", "comment_text": "2 weeks in Italy and I spent 80 euros in cash ( for a ride in a gondola)"}, {"username": "Shelley Frise", "comment_text": "We used a wise card. Very easy and inexpensive to transfer funds and exchange the currency online. Then found a bank with an atm whenever we we’re running low on euros. You can also use it like a Visa card."}]}, {"id": "2210259802706431", "text": "Learning a lot from this group!! Thanks for sharing all the lovely posts!!\n\nPlanning a trip for 2 weeks. Self, husband and two kids age 9 & 11. I am a teacher so my choices of dates are limited.\n\nWhich would you pick- early July or Xmas&New Years?\nPlease share your reasons! You are all so helpful and fantastic thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2210259802706431/", "likes": 0, "comments": []}, {"id": "2210267869372291", "text": "Train question!\nFlying into Milan, landing at 8:45am. I need to immediately take the train to Genoa..should I book ahead of time? If so what time would be enough to clear customs but too late that I'm wasting the day? This will be in early November. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210267869372291/", "likes": 0, "comments": []}, {"id": "2210269276038817", "text": "What’s your favorite restaurant in La Morra??", "link": "facebook.com/groups/1373361046396315/permalink/2210269276038817/", "likes": 1, "comments": [{"username": "Greg Morris", "comment_text": "This site should be called Discover Venice , Florence, Rome or should I tip in Italy lol"}]}, {"id": "2210276246038120", "text": "If anyone is looking for a karaoke bar in Sorrento I DO NOT RECOMMEND THIS PLACE!!! They will rip you off and it is not a karaoke bar for everyone it is more the owner on a microphone 🙄 you will be ripped off by 15€ stay away 😂", "link": "facebook.com/groups/1373361046396315/permalink/2210276246038120/", "likes": 19, "comments": [{"username": "Jason Yeoman", "comment_text": "This must be a personal experience because when I was there last year, my friends and I had a blast - singing and dancing all night long. There is a sign stating how much the first drink costs (essentially a cover) but all our drinks after that were reasonably priced."}, {"username": "Paul Cav", "comment_text": "Anna Cavallin"}, {"username": "Tina Fox", "comment_text": "Why are you travelling to Rome and going to American Karaoke 🤣🤣🤣"}, {"username": "CiCi LeCanard", "comment_text": "That is unAmerican..😂"}, {"username": "Gilda Capraro", "comment_text": "Did you mean 150 € ??? I don't see a problem with charging 15€ for the first drink, which is essentially a cover charge. Bars of this nature in some parts of my country charge admission. Sooo ... one way or the other, we have to pay. At the end of the day, I am sure I have \"lost\" more than $20 here and there, with being overcharged on food, drink, itinerary changes, cabs, etc. 15€ to me would be worth the price of admission just to see owners and staff make fools of themselves onstage ... or alternately, provide excellent entertainment 🤷‍♀️"}, {"username": "Ivette Lugo", "comment_text": "i’m confused? ripped off for $15 Euro? I pay thay for a drink in Miami, Florida.\nIs there more to it?"}, {"username": "Sophie Smith", "comment_text": "They charged 15€ just for entry but would not allow a stamp to go and come back. We were told we could not have the microphone to sing which a lot of people were expecting within the group. They were very rude in there. This may have been a personal experience but I preferably didn’t think it was worth 15€ and the same goes to a lot of people that were there last night. I heard a lot of people weren’t happy and they were turning others away.\nEveryone has their own experiences and opinions and that is fine. I’m glad you all enjoyed the night if you had been but personally me and the group I was with (a mix of ages) didn’t enjoy it"}, {"username": "Shelby Elizabeth Smith", "comment_text": "Why are you going to American themed places in Italy 💀 first red flag"}, {"username": "Lorissa Gill", "comment_text": "karaoke in italy 🥴"}, {"username": "Phyllis Flowers", "comment_text": "I only go Italian in Italy"}, {"username": "Barbara Bastianini", "comment_text": "Just my personal opinion, but I never go into anything advertised as “American” when I’m\nin another country. Because it won’t be American at all, but just someone’s view of what “American” might be. It’s usually better & more economical to frequent establishments that authentically represent the culture of the country you’re in.\n\nI’m sorry you were disappointed, but 15 Euros is a pretty small “rip off.” So I’d look at that as the cost of learning a lesson and move on. Things always happen when traveling and disappointments\ncan always occur. I hope this is the worst one you encounter."}]}, {"id": "2210276679371410", "text": "Deciding how many euros to take for two weeks. Will do all we can on cc, but what are must do cash expenses? I know tips. Someone said gondola ride? Taxi will need to do cc or we will go with someone else. I'd rather take enough euros where we don't need to use ATM, but don't want too much either. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210276679371410/", "likes": 25, "comments": [{"username": "Alexandra A Welker", "comment_text": "Anonymous participant small shops (shopping) prefer cash or even at coffee and gelato shops I used cash."}, {"username": "Rebecca Yeoh", "comment_text": "I hardly used cash. Even the toilets charging 1€ took card. Almost everywhere takes card but I preferred cash at markets and taxi rides. Ps tipping isn’t customary in Italy."}, {"username": "Anna Gambino", "comment_text": "We are going for two weeks. Will likely take 1500 euros and split between us (2) carrying in money belt under clothes. Taking trains this time so want to be more careful about concealing valuables."}, {"username": "Rodger Cravens", "comment_text": "Why bring a large sum and risk losing it or getting it stolen by a pickpocket? The ATMs at banks are fine to use and you only pull out what you need for the day. After a few days, you will know what your personal cash consumption is."}, {"username": "Janet Quinn Smith", "comment_text": "Why bring cash when you can use an ATM!"}, {"username": "Lynn Wheeler-Sahm", "comment_text": "You can ease use ATMs in Europe. Don’t carry too much cash."}, {"username": "Gene Hamilton", "comment_text": "Generally tips are a bit of an insult usually built into price\nCab rides better deal with cash some souvenir shops want cash we were there for 9 days used euros a lot went with 2000 came back with 250 used cc for some things but cash was definitely easier\nSome tips are ok ( cab rides) but most restaurants we ate at would charge a small fee (2 euros per person ) that was basically the tip as we understood just the research we did on tipping there is rare and not common they actually pay their employees there a good wage not like the states"}, {"username": "Lucrezia Folger", "comment_text": "No tips at restaurants. If you need euros, use an ATM attached to a bank."}, {"username": "Roy Wallin", "comment_text": "Tipping is not customary in Europe."}, {"username": "Juli Leyva Nix", "comment_text": "I am just back from 3 weeks in Italy and France. We found MANY vendors (taxis, stores, etc.) prefer cash. My husband asked a small shopkeeper how much the cc fee was since everyone insisted on cash. He said they are charged over 20% in fees for cc transactions. Not sure if that is true or not, but it was universally frowned upon to use a cc. We had more than one restaurant lie and make a big show of our credit cards being declined, we tried 4 different cards, all “declined”. We paid cash and contracted our banks and all said that no charges were declined. They were adamant and deceptive to not allow us to use a cc. In Murano, we were buying a lot of glass as souvenirs and then went up to the register and there was a sign saying their cc machine wasn’t working. We told them that all we had was cc and miraculously her machine worked. All of this to say that we ended up using far more cash than we expected. For 21 days for a family of 3 we ended up using about $900. We started out with just enough for bathrooms and small purchases and ended up getting cash several times."}, {"username": "Steve Grossman", "comment_text": "Use a bank atm while in italy. Do not use any a t m unless it is a bank a t m."}, {"username": "Tracey Fairbrother", "comment_text": "Take a couple of hundred if you do need more use tge atm at the bank"}, {"username": "Laura Barnes-Hirst", "comment_text": "Is debit card okay to use rather than credit card?"}, {"username": "Victoria Marchetti", "comment_text": "I was surprised how many taxis were cash only..."}, {"username": "Michelle Anderson- Rowland", "comment_text": "Start by figuring out if you have any hotels and how much the city taxes are because a lot of them only take cash.."}, {"username": "Tanja Tanja", "comment_text": "Gondola 80 euro's cash, 30 min trough Venice ( i was with husband and children)."}, {"username": "Karen Tanner Rawn", "comment_text": "We have booked a gondola through our tour group and its not a private ride. Anyone have an idea on what to tip? TIA"}, {"username": "Charlotte Ingram", "comment_text": "We just returned from 18 days in Italy. Each couple took 1000 in euros and we spent it all. We had many tours with guides, 2 restaurants each day, cab rides that did not take cc, boat rides, housekeeping, private transportation that was due in cash, lots of bottled water, bathrooms, and so on."}, {"username": "Tamanna Parekh", "comment_text": "Things we needed cash for: City tax, toilets, maids/\ncleaners, some boat rides eg traghetto/\ngondola, vending machines for eg water, although unnecessary we gave tips in cash if we had great service, Souvenirs (a lot of shop keepers gave a discount if we used cash). Hope this helps...have a fab trip!"}, {"username": "Francesca Giovanelli", "comment_text": "Don’t go around in the stations or metro with cash pickpockets look for tourists"}, {"username": "Liz Del Signore", "comment_text": "They have atms everywhere."}, {"username": "Karen Curci", "comment_text": "Keep coins with you for the restrooms. Small businesses and small towns prefer cash to avoid a credit card fee for them."}, {"username": "Jo Tunnicliffe", "comment_text": "Last time I went I got a multi currency card and used that there could see exactly where I was with my money using the online app, could switch my £ to è when needed and see exchange rate being given. Using it again in a few weeks when I return."}, {"username": "Amanda Igoe", "comment_text": "There are banks and ATM machines!!!"}, {"username": "Jennifer McDonnell", "comment_text": "In major cities you can pretty much use cc like at home - tapped my way through Florence in April. Like anywhere smaller places will be less equipped for cc. I don’t normally bring much more than €200 cash but I’m going for shorter stays. Had more trouble paying cc in NYC in March than I did in Florence the following week tbh."}, {"username": "Diana Wilson", "comment_text": "You should notify bank.before uou\ngo\nThey blocked mine"}, {"username": "Theresa Kearon Maggiore", "comment_text": "Theresa Kearon Maggiore"}, {"username": "Scott Bingman", "comment_text": "We just took Euros out as we needed it from Italiano ATM banks. Other wise mostly we just use cc everywhere. We have been many many times never a problem."}, {"username": "Anna Butt", "comment_text": "Since covid, we’ve found travelling that the majority of places do not want cash. Credit card/tap is preferred. We always came back with cash."}, {"username": "Sophia Lin", "comment_text": "The only place that requested cash only so far was at a convenience stand in a car rental place, cc works 99% of the time."}, {"username": "Rhona OConnor", "comment_text": "We took €500 for 3 weeks."}, {"username": "निनावी सहभागी", "comment_text": "Thanks all. Should have been clearer in my post. I'm asking what we will need euros for besides tips. Thanks!"}, {"username": "Emma Chadwick", "comment_text": "We took about €250 in cash for 15 days and didn’t use it all. Used card for most things."}, {"username": "Greg Saba", "comment_text": "We once left $1600 euro in a taxi in Brussels (didn't get it back), because we were juggling luggage, trying to figure out where an unfamiliar place was, a bit jet lagged and trying to find $$$ to pay taxi fare. That was the last time we took any substantial amount. Now, no more than $200 euro, even for 6 weeks. ATM's work great (make sure they are bank ones, even better, one affiliated with your local bank). Cards are used almost everywhere."}, {"username": "Ky Bean", "comment_text": "We're taking €860 for 25 days an will use it for all small purchases, some transport an will use it over cc should we still have alot $$ by our last stop."}, {"username": "Cecilia Christine Costantini", "comment_text": "For public toilets, maybe some smaller gelaterie or take-away pizza slices places, to drop a few coins in donation boxes in churches, for smaller shops that might require you pay cash if you spend less than (5€, 10€, it depends)."}, {"username": "Pam Gerretsen", "comment_text": "I think it's good to have cash for small bills - gelato, coffee, souvenirs, etc - cc charges for small businesses add up, you're certainly going to help them by using cash. Usually nothing dodgy about this, they will still issue a receipt (which is required by law), but rather benefit the individual than the multinational company!"}, {"username": "Linda McShane Payne", "comment_text": "We're taking $1000 worth and splitting it between us to carry...."}, {"username": "Mike Guluk", "comment_text": "Just use an atm"}, {"username": "Cris Wimer", "comment_text": "Usually paid cash for travel stickers or other small dollar souvenirs, toilets, tips. Always had enough to pay for dinner just in case their machine didn’t work."}, {"username": "Diane Davis Lawyer", "comment_text": "Many cities have a 'city tax' per person staying in a hotel or Airbnb. You will pay those in cash, as far as I know. If you stay someplace that has an elevator, you'll need small coins for those. Some hosts will leave coins in the apartment for that purpose, some won't."}, {"username": "Richard Meek", "comment_text": "The post office atms seemed to ve the best for us if you get stuck.\n\nHow much is like how long is a piece of string question imo..."}, {"username": "Allan Olexa", "comment_text": "We use cash euros only for street markets, purchases below the credit minimum, and the tiny shops that don’t take cards."}, {"username": "Basia Szokarski", "comment_text": "Credit Agricole doesn't charge atm fee.\nBesides tips, some purchases at gift shops for less than 10E, gelato or coffee shop for less than 5 may require cash. I'm not sure about gondola ride..I'm guessing you have more negotiating power with cash. I think $150-$200 is plenty. You can always spend what you have left on last day instead of using card."}, {"username": "Debbie Watts", "comment_text": "You need euros for public restrooms, water bottles ( I thought the water from the fountains tasted stagnant after being in my reusable bottle for a while) some of the smaller souvenir places , a couple of the gelato places if you were paying by cc had to go inside instead of the walk up entrance that took cash. We also had a taxi that would take us if only cash told him he had to use meter though.Our hotel was further away from the city center and 3 other taxis wanted to charge us 45 euros. Always have some on you."}, {"username": "Kim Sousa Andrews", "comment_text": "Taxi’s like cash. We took $1,000 for 2 weeks and it was perfect."}, {"username": "Katrina Gibson", "comment_text": "Lots of info in comments Jordan Mildenberger Kianna T Jason Gibson"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Why are people so insistent about getting euros at home vs ATMs in Italy? I don’t get it!"}, {"username": "Zoom-Zoom Nation", "comment_text": "My buddy called it a mafia tax in 2017 had to meet the air BandB and pay 40 euro for the keys in 2 different cities. Had to be cash."}, {"username": "Laura McSweeney", "comment_text": "If you use an atm make sure it is a bank ATM."}, {"username": "Alicia Burno", "comment_text": "We are doing a 2 week trip right now and so far I needed cash for the gondola (80 euros for the gondola, cash). Everything else is on Credit Card. Tips are not expected."}, {"username": "Rose Turdo", "comment_text": "100 per day"}, {"username": "Brian Osman", "comment_text": "I took 700,and got 400 more while I was there"}, {"username": "Brian Osman", "comment_text": "Get your cash from your bank before you leave"}, {"username": "Dori Reader", "comment_text": "Following"}, {"username": "Lisa Hartert", "comment_text": "We ordered 200 before we left then used BANK atms- remember to refuse conversion rate. 😜"}, {"username": "Cindy Wesely", "comment_text": "Most taxis like cash and say their machine is broke. Lol ask before you get in"}, {"username": "Todd N Nicole Clarke", "comment_text": "You need cash for city tax at hotels as well, I did just under 3 weeks with 160 cash, used credit and debit card mostly and had them in my apple wallet so didn’t have to carry cards"}, {"username": "Theresa Sorrentino Pagan", "comment_text": "I believe capital one checking doesn’t charge international fees either when using the ATM. Just open an acct."}, {"username": "Kathryn Wild", "comment_text": "Been around pisa, Florence and Venice this week- used cc for everything (including gondola) apart from postcard/ fridge magnet stalls- not sure about taxis yet- will find out tomorrow!"}, {"username": "Jenny Payne", "comment_text": "I always take €1500 and if I need extra money I use a post office as u have to go inside . Have been going every year for a long time and so far nothing has happened. Need a lot of commonsense and blend in, don’t stand out as if your going to get pick pocketed ,you will be the target🌻"}]}, {"id": "2210287739370304", "text": "Love Venice, Italy 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2210287739370304/", "likes": 3, "comments": []}, {"id": "2210291339369944", "text": "Recently there was a posting on Rome, where to go, eat and stay. Now I can’t find it again. Help please?", "link": "facebook.com/groups/1373361046396315/permalink/2210291339369944/", "likes": 0, "comments": []}, {"id": "2210327612699650", "text": "E-sim topic:\nAiralo or Holafly?\nI like that holafly offers unlimited data but I’ve seen more good reviews for Airalo (doesn’t offer unlimited data)\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2210327612699650/", "likes": 0, "comments": [{"username": "Karen Landini", "comment_text": "Airalo worked like a charm. Data was inexpensive and I bought more than I needed. You can add more along the way if you need to. Not sure if this is the case, but sometimes unlimited plans have fine print about speeds slowing down when you start to use alot. Might be worth confirming for Holafly."}]}, {"id": "2210342122698199", "text": "Siena Cathedral, Italy 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2210342122698199/", "likes": 4, "comments": [{"username": "Aranya Charo", "comment_text": "Wow! Amazing!"}]}, {"id": "2210354272696984", "text": "Beautiful Venice, Italy 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2210354272696984/", "likes": 2, "comments": []}, {"id": "2210356106030134", "text": "Help or Suggestions needed!!\nSo If I have to Travel from Sorrento to Milan and reach Milan before midnight. So is this my best and cheapest option or should I take flight from Napels? And if I do take these trains then should I prebook the tickets from some website or just take the train passes?", "link": "facebook.com/groups/1373361046396315/permalink/2210356106030134/", "likes": 0, "comments": [{"username": "Martin Totta", "comment_text": "Trenitalia.it is the website where you can buy the tickets, also you can buy the tickets in the train station, but is so easy to buy it from the website, the trip in train it takes more time but is a very nice experience, I think so! If you want to be faster just take a plane. If you buy tickets in the website you don t need to validate the ticket you just show to the train officer the QR code, but if you buy the ticket in the train station you will need to validate it in the machine which is in the train station!"}, {"username": "Martin Totta", "comment_text": "I read from the tickets that you want to select that you only have 9 minutes to change trains to Milan, to be sure you don't miss it, I suggest you find a train for Milan that leaves a little later or in any case arrive in Naples a little earlier so you have all the time you need to change trains, I say this because I'm Italian, I love traveling by train and I know that sometimes it can be difficult to change trains that you are not familiar with the screens that indicate the platforms!"}, {"username": "Martin Totta", "comment_text": "https://\nshop.flixbus.it/\nsearch?departure\nCity=6187d07a-8\n421-4536-97da-c\n3f138fd36f8&arr\nivalCity=40ddcc\n6e-8646-11e6-90\n66-549f350fcb0c\n&route=Sorrento\n-Milano&rideDat\ne=11.08.2023&ad\nult=1&_locale=i\nt&features%5Bfe\nature.enable_di\nstribusion%5D=1\n&features%5Bfea\nture.train_citi\nes_only%5D=0&fe\natures%5Bfeatur\ne.webc_search_s\ntation_suggesti\nons_enabled%5D=\n0&features%5Bfe\nature.darken_pa\nge%5D=1&atb_pdi\nd=d61a4ccd-f412\n-4add-990f-48a5\nec8bb0df&_sp=33\nd648b8-2f82-4a0\n0-aea9-c6ef7212\n6b9e&_spnuid=34\n0c2572-f699-439\n2-b858-ac9f8750\nd5da !! An other very cheep option is to travel by bus, yes it takes 16 hours, but is just 36€ as you see, is up to you 😅"}, {"username": "Ibbu Mohd", "comment_text": "Take ferry from sorrento to naples (ferryhopper -app)\nTake train from naples station to milan (italo treno-app, book seats)"}]}, {"id": "2210360302696381", "text": "Any particular apps that have been helpful while travelling Italy? Translation apps, transit apps, etc.\n\nThank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2210360302696381/", "likes": 1, "comments": []}, {"id": "2210379522694459", "text": "Has anyone stayed in these hotels? We need something close to the airport in Naples for a 6:30am flight. Thanks for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2210379522694459/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2210381346027610", "text": "Heading to Rome and Sorrento in a couple days. What are some good places to eat that are less touristy?", "link": "facebook.com/groups/1373361046396315/permalink/2210381346027610/", "likes": 0, "comments": [{"username": "Kally Trahearn", "comment_text": "In Sorrento - La Cantinaccia del Popolo - not high end but definitely a favourite of the locals. Google it, read the reviews. You will not be disappointed. You can't reserve, so get there early and expect to wait until a table is free for the size of your party.\nEnjoy xx"}]}, {"id": "2210388249360253", "text": "Anyone use Marriott points in Italy? Trying to decide if we stay in Genoa on Marriott points, can we take a day trip to portofino or do we need to stay in portofino because Genoa isn't that great? I'd love some help!!", "link": "facebook.com/groups/1373361046396315/permalink/2210388249360253/", "likes": 0, "comments": [{"username": "Ted Cabot", "comment_text": "Genoa is a gritty ancient port city. It’s like Naples north. It has amazing charm but also is a blue collar place. The focaccia spots in the old town are the best in all of Italy, antico forno and titti focaccia are our favorite two. Portofino is amazingly beautiful and also a quick ferry ride from Santa margherita, similar vibe but less tourists. We have used Marriott points a few times with no problem, take the train from Genoa to Santa margherita and then you can take the ferry to Portofino!"}, {"username": "Rose Stolarek", "comment_text": "We spent 4 days in Genoa and loved it . Food was sensational"}, {"username": "Emma Chadwick", "comment_text": "Genoa is a wonderful place to stay and fairly easy to get to portofino"}, {"username": "Ann Lombardi-Perkins", "comment_text": "Stay in Genova, it's fantastic"}, {"username": "Barbara Krot Barrett", "comment_text": "Marriott has many lovely places throughout Italy."}, {"username": "Colleen Dawson", "comment_text": "Interesting question, not sure why staying at a hotel with points have anything to do with taking a day trip."}]}, {"id": "2210407682691643", "text": "Hello Legends, looking for best and most direct way to travel from Cinque Terre to Sorrento in a couple months time, travelling in October….Appreciate all your wonderful tips and advise…Grazie Mille 🙏🙏", "link": "facebook.com/groups/1373361046396315/permalink/2210407682691643/", "likes": 2, "comments": []}, {"id": "2210468452685566", "text": "We’ll be in Napoli in just a few weeks, and I’m having trouble figuring out which restaurant to book at/near/by Castel dell’Ovo.\n\nI’m on The Fork app trying to figure it out, and not having much luck.\n\nI’ve seen some gorgeous dinner sunset pictures taken somewhere there; it looked very romantic and picturesque - I just don’t know where this spot isआणखी exactly. 🫠💔😆\n\nAny help would be greatly appreciate! Trying to surprise my hard working guy with something a little extra special. As well as any other amazing, less touristy spots you may have to recommend.\n\nGratzi! ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2210468452685566/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "Quick advice: grab an aperitivo on the rooftop bar of gran hotel Vesuvio (call to book first). 20 € for person, nice drinks, good snacks and amazing view. Then go to dinner in one of the many good local pizzerias"}, {"username": "Elena Eugeni", "comment_text": "Elena Eugeni"}, {"username": "Iris Garza", "comment_text": "We had dinner at Il Comandante Restaurant - Romeo hotel this past Thursday. It is a 1 Star Michelin 2023. It's not for everyone's palate, but we loved it. The experience and roof top view at night was spectacular 👌"}]}, {"id": "2210486276017117", "text": "If you were to rent a holiday house for one month in September in Tuscany or surrounding areas, is there any website where I can look for?\nI know about AirBnB. I am trying to get another options.", "link": "facebook.com/groups/1373361046396315/permalink/2210486276017117/", "likes": 1, "comments": [{"username": "Karen Landini", "comment_text": "We've rented through VRBO."}]}, {"id": "2210491432683268", "text": "My husband and I will be celebrating our 15 year anniversary in December 2024. We are Catholic but got married non-denominationally; we have our hearts set on getting married in the church finally for our anniversary. I know there are hoops to jump through to do so and we are working on that, but the idea of narrowing down an itinerary feels overwhelming. We’ve never been to Italy and while I know it’s not the most ideal touristy time to go, we are still so excited!\n\nSo, I thought I might ask where you would want to get married and what your perfect 10-12 days would look like…\n\nHere are a few details:\n- we will have our parents, 2-3 additional couples and then our 3 kids ages 8-15, so likely airbnbing throughout\n- we were thinking Tuscany for the ceremony weekend? But where?\n- afterwards, we would love to head somewhere along the coast\n- indifferent about hitting Rome or other typical bigger cities, but considering we’d likely have to fly into one, would be open to a few days if there was an overwhelming “can’t miss” opinion\n\nAnyway, hoping you might consider dreaming with me and providing a little inspiration!", "link": "facebook.com/groups/1373361046396315/permalink/2210491432683268/", "likes": 0, "comments": []}, {"id": "2210498902682521", "text": "Hi everyone, I am traveling with my wife and 2 kids Rome & Venice first week of October. Do we need tickets to visit The Pantheon, Colosseum, and so on or we can just walk bay and take pictures. We are only staying for few days (Rome 3 days and 1 night in Venice) have no time to spend hours in tours. We just want to enjoy our stay without rushing into tours. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2210498902682521/", "likes": 1, "comments": [{"username": "Karen Landini", "comment_text": "You can definitely get close enough on the outside for pictures. Pantheon lines go quickly, no tour needed and it doesn't take much time inside. Worth seeing if you aren't going into anything else."}, {"username": "Jenny Payne", "comment_text": "They have started charging for going into pantheon , I take friends as I have lived in Rome & Florence, just do the head phones works well and less expensive. I take friends to the Vatican around 2:30pm less crowds, but it has been really busy this year and the weather is warm never used to be🌻"}, {"username": "Gundega Barkane", "comment_text": "Pantheon- is quite quick line. Colloseum- I would visit later ar night just for an outside picture."}, {"username": "Dann Hrusch", "comment_text": "Both are worth going in. Tickets in advance for the Colosseum for sure. You'll skip the line and realistically can be in and out in 30 minutes if you just want to do a lap inside and take some pics. No need to get tickets in advance for the Pantheon. Also is a quick visit but you cannot appreciate it from the outside."}, {"username": "Mil Myvegas", "comment_text": "This is the official website for tickets to the Pantheon. https://\nwww.direzionemus\neistataliroma.b\neniculturali.it\n/\npantheon_english\n-version/"}, {"username": "Gillian O'Callaghan", "comment_text": "Yes....I just walked around the outside of both."}]}, {"id": "2210511562681255", "text": "Good morning, maybe someone will have tickets for the vatican museum for the period 12-16 august and is ready to sell ( 3 adults)", "link": "facebook.com/groups/1373361046396315/permalink/2210511562681255/", "likes": 0, "comments": []}, {"id": "2210405592691852", "text": "Does anyone know of a clothing store/brand in Italy that sells athletic wear, similar to Lululemon? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2210405592691852/", "likes": 9, "comments": [{"username": "Costero Home", "comment_text": "These guys sell similar, https://\nwww.decathlon.it\n/"}, {"username": "Bonnie Loftspring", "comment_text": "I think it’s spelt Sapora or something like that. I’ll look & correct when I get home"}, {"username": "Kejdi Okej", "comment_text": "I think its spelt sapora something like that l ll look correct when l get home"}, {"username": "Ellie Hwong", "comment_text": "Most comfortable travel leggings / jeans I find is from Calzedonia. They do great swimwear too and very affordable and great quality. So it’s not exactly like lululemon but more suited for European causal wear.\nhttps://\nwww.calzedonia.c\nom/us/"}, {"username": "Grazia Maria Giordano", "comment_text": "No nothing similar to lululemon in Italy but you can try at OYSHO (many stores around Italy) for nice activewear."}, {"username": "Leslie Goodland", "comment_text": "Decathlon. Not sure where in Italy you'll be."}, {"username": "Alessandra Pasteris", "comment_text": "Diadora https://\nwww.diadora.com/\nit/it/"}, {"username": "Monica Roman-Fazio", "comment_text": "Subdued"}, {"username": "Alyce Henry", "comment_text": "Ck out luluman in Paris great place ever"}, {"username": "Asli Deniz Genc", "comment_text": "There is nothing like Lululemon, I still order online and delivery is quite fast."}, {"username": "Rhona OConnor", "comment_text": "You can get lululemon in Italy if you are looking for it."}]}, {"id": "2210413259357752", "text": "We will stay a week in Sestriere close to Torino early September. Any ideas for day trips?", "link": "facebook.com/groups/1373361046396315/permalink/2210413259357752/", "likes": 1, "comments": []}, {"id": "2210430629356015", "text": "This might be a dumb question but I’m asking for a friend 😉\nIf I buy a SIM card at Athens Airport, can I use it in Italy too?", "link": "facebook.com/groups/1373361046396315/permalink/2210430629356015/", "likes": 2, "comments": [{"username": "Elena Innocenti", "comment_text": "For us, as European Customer with our mobile plan, we can use at same price our sim in all EU country (we have only same limit but if you go for holiday it’s ok, never reach the limit), but I don’t know if tourist sim plan working in the same way.\nYou have to check with greek operator end ask how it works for european rooming."}, {"username": "Maria Brozou", "comment_text": "Hi! I am Greek. You buy the SIM open the phone and call support to ask if roaming is activated. If not you ask to activate it without any cost. After that you are ok to travel all over the EU without extra costs and it works just fine."}, {"username": "Paul Lowe", "comment_text": "Best and cheapest SIM is Smarty. Works for uk EU and Scandinavia you need an address to post it to. Very fast and efficient a few days only.\n\nhttps://\nsmarty.co.uk/"}]}, {"id": "2210507012681710", "text": "We’re traveling from Venice to Milan today. Are there any local cheese making farmer places or factories one can visit on the way? We’re a group of 7 with 3 kids.\n\nTIA!", "link": "facebook.com/groups/1373361046396315/permalink/2210507012681710/", "likes": 1, "comments": []}, {"id": "2210206832711728", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2210206832711728/", "likes": 9, "comments": [{"username": "Cyndi Riley", "comment_text": "Any way you record these so us working people can watch? Or do them later in the day."}, {"username": "Kejdi Okej", "comment_text": "Any way you record these so us working people can watch or do them later in the day"}]}, {"id": "2210195289379549", "text": "Perched on top of a beautiful hill in scenic Val d’Orcia, Pienza will enchant you with its charming stone architecture, romantic alleys, world-famous pecorino cheese and picture-perfect landscapes.\n\nJoin our NEWआणखी virtual experience: https://nextstop-italy.com/virtual-tours/pienza/\n\n#italytravel #artlovers #hiddengems #italygram #vacationmood #virtualworld #history #italytrip #medievalarchitecture #medievalart #medievalhistory #medievalcastle #italytrip #hiddengems #artlovers #tuscany #tuscanygram #tuscanyitaly #tuscanytravel #tuscanypeople #tuscanyexperience #pienza #pienzaitaly #pienzatuscany #renaissance #renaissanceart #orciavalley #valdorcia", "link": "facebook.com/groups/1373361046396315/permalink/2210195289379549/", "likes": 14, "comments": [{"username": "Donna Austin Jones", "comment_text": "Gary Jones! Nine more months!!!"}, {"username": "Natasha Samarin", "comment_text": "lovely"}, {"username": "Henry Paciullo", "comment_text": "Looks like she’s right out of a Fairy Tale!"}]}, {"id": "2210119692720442", "text": "Picture-perfect towns, boat rides, amazing landscapes, archaeological sites and delicious food…that, and much more, is a journey to Sicily.\nPlaced in the heart of the Mediterranean Sea, Sicily is the dream ofआणखी every vacationer who loves nature, culture and history.\n\nOur expert guide will lead you on a virtual journey through this beautiful island, to explore the most beautiful places of Sicily.\nYou will discover (just to mention a few) the vibrant and chaotic Palermo, Sicily’s capital; the Byzantine splendour of Monreale; the charming coastal town of Cefalù, home to a massive Norman Cathedral; the majestic Mt. Etna; the romantic town of Taormina; the magnificent Baroque cities of the Noto Valley; the Greek engineering feat of Selinunte and the famous Valley of the Temples, one of Sicily’s most famous historical attractions.\n\nVibrant sunsets,dramatic sceneries, precious archaeological sites, ancient cities and impressive volcanoes… come visit one of Italy’s most stunning destinations. You’ll be amazed of its beauty!\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2210119692720442/", "likes": 5, "comments": []}, {"id": "2208375476228197", "text": "Thoughts on the following itinerary,\nplease:\nDay 1: Rome to Pompeii. Morning tour of Pompeii then travel to Sorrento via Naples. Late afternoon and evening touring Sorrento. Sleep in Sorrento.\nDay 2: Sorrentoआणखी to Capri. Tour Capri and return to Sorrento to sleep.\nDay 3: Sorrento to Positano. All day in Positano, then travel to Amalfi Town. Sleep in Almafi Town.\nDay 4: Morning in Almafi Town. Afternoon and evening in Paestum. Evening train to Naples. Sleep in Naples.\nDay 5: Naples to Home.\nMain concerns are: Is that enough time in Pompeii and what to do in Amalfi Town?? There is a possibility of extending one more day if needed to fit everything in…Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2208375476228197/", "likes": 28, "comments": [{"username": "Starla Dawn", "comment_text": "Don’t miss Ravello it’s right there and the most unique peaceful place."}, {"username": "Jeff McLellan", "comment_text": "If there is any way you can overnight on Capri I feel it is worth it as it is a completely different place at night. How are you planning on moving between towns on Amalfi Coast?"}, {"username": "Flavia Di Bello", "comment_text": "Sorrento is highly overrated, I wouldn’t spend so much time there (mostly a sprawl of bad and cheap recent architecture, with a tiny pretty centre, not as pretty as most other places in the area IMO) and opt for a base in Amalfi instead, from where you can reach Positano and Capri by boat and Ravello by bus.\nHalf day in Pompeii is enough but consider how long it takes to get there and back."}, {"username": "Gena Kona-Mancini", "comment_text": "Also we spent 2 hours in Pompeii and it was NOT enough. BUT we saw a lot of it and was really wonderful. It's something crazy like 17 acres of land go explore! So depends how nuch you want to walk."}, {"username": "Kyna Martin Autrey", "comment_text": "Day 1 and 2 are exactly what we did. It was plenty of time in Pompeii. We were hot and bored pretty fast. We didn’t do a tour and ended up glad we didn’t. We saw and we left.\nWe did an all day boat tour on day 2 to Capri. It was amazing !!"}, {"username": "Prithviraj Sengupta", "comment_text": "ur program looks good. But then on Day 1 , if you go from Rome to Pompei then why do you need to go from Pompei to Sorrento via Naples. Why do you want to go backwards ,I did not understand . travel from Pompei to Sorrento unless I am missing something"}, {"username": "Laura Cary Veeder", "comment_text": "I’d stay in Capri rather than Amalfi. Honestly, you can go to Positano, Amalfi and Ravello in a day with a private driver. We stayed in Sorrento, drove to Positano, had lunch in Positano, shopped in Amalfi and dinner in Ravello. Lots of stops in between. It was a great day."}, {"username": "Rachael Richardson", "comment_text": "You can go straight from Pompeii to sorrento, you need 3-4 hours in pompeii , they have luggage storage at Pompeii if needed , don’t understand why you need to go back to Naples ?\nAlso I’d skip Capri , heaving with tourists not enjoyable in the daytime or stay overnight then have a few hours in positano, you don’t need a full day"}, {"username": "Frank Knights", "comment_text": "Had that basic itinerary on May. Busy but doable. Would take the extra day to allow for weather and crowds. Didn’t make Pompeii due to weather. Amalfi lunch, shopping, dinner. Enjoy"}, {"username": "Alicia Cox", "comment_text": "Well Sorrento is wonderful so you are short changing Sorrento. Pompei is easily a day. So bottom line, I think ur cramming too much in. I would add a day if you can & I would stay in Sorrento only. See Capri, see Sorrento, see either positano or Amalfi. Depending on when you are going & the crowds, what you think will be 4 hours can easily be 8 hours & you will end up seeing just an overview & feel rushed the entire time."}, {"username": "Francine Lapointe", "comment_text": "Seems like a lot of moving and maybe not brought of enjoying…"}, {"username": "Annette Mayer", "comment_text": "Pompeii is Huge! 1/2 day misses the mark"}, {"username": "Lisa Lynn", "comment_text": "I stay five days in Amalfi every year,\n￼ The small town of Amalfi is wonderful. There are ￼ a few hotels ￼ built into the cliffs with an elevator down to the pool overlooking the sea. ￼ Would definitely go up to see Ravelo, and seeing\n￼Villa Cimbrone is a must!\nIf you go to Amalfi, see if you can have lunch at hotel, Santa Catarina.\n￼ We took a boat from Amalfi to Nerano, which has the restaurant, Stanley Tucci visit it for the zucchini pasta- ￼ it’s a fantastic day. If you can rent a boat to go to Positano, and then Nerano for lunch.\n\n￼ Ferry’s are great way to get ￼ from town to town.\n￼ I’ve taken the train through Naples and down to Sorrento, where we catch the ferry to Amalfi. ￼ We’ve taken the ferry from Amalfi to Capri Amalfi to Positano.- ￼ no traffic and beautiful sites!\n\nIf you’re staying in Amalfi or Positano, the walk of the gods is a fantastic unbelievable way to spend the morning .\n\n￼￼"}, {"username": "Carmela Noble", "comment_text": "I would say Pompeii is a full day trip are you driving or taking the train? Either way your mom 2.5 hours. Parking there can be crazy and so can the lines to get in. Amalfi town is a half day trip at most…It’s very small not much to do unless you just want to chill and eat. Positano is my favourite and the same can be seeing in just a day, I’ve never been to capri but hear there is a lot to do. I would sleep in positano over amalfi town"}, {"username": "Lisa Lynn", "comment_text": "I would also say, Pompeii is incredible- ￼ I would highly highly recommend a tour guide. ￼\n￼ Capri is totally tourist, crowded, and would not go back- ￼\nBut wherever you’re staying along the coast, wonderful to take a day and relax by a pool or on the beach and go swimming in the water .\n￼ Don’t know when you’re going, but l September ￼ and October are the best months to visit the Amalfi coast."}, {"username": "Michael Tantillo", "comment_text": "Must visit Ravello when in Amalfi. 3 hours is more than enough time in Pompeii. Must get a guide to really learn the history. I’m not really into guides but I’m really glad I did get one for Pompeii she was one of the archeologists that worked on the site. Learned so much 😎🇺🇸🇮🇹 my guides name was Imma and can be found on Airbnb"}, {"username": "Sarah Magnusson", "comment_text": "Hi! Recommend that you travel direct from Pompeii to Sorrento. One night there, then make your base in Positano for remaining time and extend by one day.\nWe visited Capri, and all the towns along Amalfi coast over a few days from Positano by local bus (which was great) and boat (over to Capri and beautiful Ischia). It was fantastic. Hike the path of the Gods from Praiano for unbelievable views. You’ll love everything. We’ve visited a few times over the years and always find something new to do. This may give you some ideas: https://\ncruisetrail.com/\nhow-to-get-to-so\nrrento-from-nap\nles-or-rome/"}, {"username": "Julie Atkinson", "comment_text": "You can “express” do Pompeii in 2 hours but to really appreciate it, Pompeii is worthy of at least five hours. You can go to Sorrento from Pompeii. No need to return back to Naples. If you are only spending the day in Capri, leave on the earliest ferry boat. Crowds from cruise-ships will start at at 8:00 am and leave by 6 pm. Latest ferry leaves just after 7 pm. Book return ticket ahead or you may not get a seat. Consider staying overnight on Capri. It’s a much better vibe at night time once cruisers and daytime crowds leave. From Capri, you can take the ferry boat to Positano. This will save you time. Go to La Tagliata for lunch (high up on the hills from Positano but incredible view and good food and experience). Skip Paestum. Go to Ravello instead and see two main gardens. Ceramic shops are wonderful here. Add one more day on Amalfi Coast. More time needed for beaches, dining, exploring and possibly hiking Path of Gods if you are super fit. Or hire a driver to see Positano, Amalfi, and Ravello all in one day. I’ve done this on a cruise. It’s manageable. But I’ve also stayed in Sorrento and Positano. My choices for over night stays would be Capri and Positano. Sorrento is central but doesn’t feel like Amalfi Coast and technically it isn’t. Although having said that Sorrento is cheaper and one of my favourite hotels is there - Grand Hotel Excelsior Vittoria - 10++. All depends on your budget, your interests, what time of year you go, what hotels you like."}, {"username": "Jaclyn Kastrava", "comment_text": "Why not fly into Naples if you’re not doing anything in Rome? That way you have more time to spend at Pompeii. You could also check out Ravelo after you’re finished Amalfi if you feel like you’re going to have extra time that you don’t know what to do with."}, {"username": "Shelley Frise", "comment_text": "I agree with you on sorrento it was way too crowded. Although I bought a leather coat scarfs and found some beautiful table cloths."}, {"username": "Donna Austin Jones", "comment_text": "I love that you included Paestum. We were blown away with the place."}, {"username": "Yvette Pavone", "comment_text": "Pompeii is HUGE. But after an hour! You’ve seen enough dirt you’ll be ready to go. You don’t have to go back to naples from pompeii to get to sorrento! Just take the train right near the entrance over to sorrento"}, {"username": "Barbara Bastianini", "comment_text": "The amount of time to spend in Pompeii depends on your interest level\nIf you want to see it because it’s so famous a morning tour will probably be enough for you. If you have a particular interest in archeology and history, which we do, then you’d want more time. We’ve been there multiple times and have always spent an entire day each time, from opening until closing. And that was never long long enough. But I’ve known people who felt bored after two hours. So everyone’s different. And it really all depends on your own preferences."}, {"username": "Virginia Walton", "comment_text": "Unrelated comment but question. How would you say “love of trees” in Italian?"}, {"username": "Terri Kolesar Rigano", "comment_text": "Don't miss Ravello!"}]}, {"id": "2210081619390916", "text": "lake como🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2210081619390916/", "likes": 29, "comments": [{"username": "Roger W Ilsley", "comment_text": "Bucket list"}, {"username": "YokeChing Liew", "comment_text": "Wow ! that's awesome! M going in two weeks."}, {"username": "Leo Sy", "comment_text": "Where you live, you can see beautiful scenery."}]}, {"id": "2210082612724150", "text": "Back from the most amazing trip!! Stayed in Naples in a hotel that was beyond gorgeous and right in the middle of everything we needed to get to! We hired a car and went to the almafi coast spent the day inआणखी Sorrento and went into Naomi town center had the best food and it was just amazing!!! Ca not wait to go back again!! 🇮🇹 Italy had my heart", "link": "facebook.com/groups/1373361046396315/permalink/2210082612724150/", "likes": 68, "comments": [{"username": "Sarah Toomey Janus", "comment_text": "Can you share which Naples hotel you loved?"}, {"username": "Sony Ucciferri", "comment_text": "Beautiful"}, {"username": "Wilma Resta", "comment_text": "Awesome ❤️"}, {"username": "Dana Grobe", "comment_text": "We are going to Naples in October how expensive was it to hire a car to go to Amalfi Coast?\nBeautiful pictures!"}, {"username": "Soc Cer", "comment_text": "Can you share the driver company you used please?"}, {"username": "Kim Grace", "comment_text": "Which hotel in Naples pls ?"}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "Were u close to Pompeii ruins"}]}, {"id": "2210108856054859", "text": "Amazing time in Italy… seafood was the best near the coast. From Rome, to Cetara, along the southern coast of Italy (Solerno, Amalfi, Positano, Sorrento, then to Florence, Pisa, and Manarola 😊. Managed to even squeeze in a little Tuscany and the hot springs 😉 Will be back for sure, until next time 💕", "link": "facebook.com/groups/1373361046396315/permalink/2210108856054859/", "likes": 57, "comments": [{"username": "Judy Grayson", "comment_text": "Wonderful pictures"}, {"username": "Laura Miller", "comment_text": "How did you enjoy the hot springs in Tuscany?"}, {"username": "Karen Anglin", "comment_text": "Beautiful! What was your favorite restaurant in Rome?"}, {"username": "Nathan Earl Stellenberg", "comment_text": "awesome pics."}, {"username": "Denise Incandela Boccio", "comment_text": "Absolutely gorgeous!!! 🇮🇹"}, {"username": "Kelly Thuy-Trang Doan", "comment_text": "I was looking at the pictures and reading the post and thinking to myself. Why does this look so familiar?"}, {"username": "Kelly Thuy-Trang Doan", "comment_text": "Kelly Thuy-Trang Doan"}, {"username": "Arnie Lagadia", "comment_text": "Amazing"}, {"username": "Jesse Crawford", "comment_text": "Korri Sullivan"}, {"username": "Jules Winter", "comment_text": "Love your photos Lena. Really inspiring thank you. Would you recommend any one of your stops in particular and how good was Sorrento please"}, {"username": "Pam Lewis", "comment_text": "great shots, thanks"}]}, {"id": "2210109636054781", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2210109636054781/", "likes": 285, "comments": [{"username": "Pietro Adami", "comment_text": "And no pizza with pineapples 😂"}, {"username": "Daniele Morani", "comment_text": "Wait, they don't serve Fettuccine alla Bolognese and Lasagna? What kind of Italian restaurant is that?"}, {"username": "Linda Kuper Mortensen", "comment_text": "Sort of rude in my opinion - if you’re catering to tourists, you need to be prepared for language idiosyncrasies"}, {"username": "Barb Krieg-Stepien", "comment_text": "Love it! Just came home from Italy and was disappointed if we saw Alfredo or “American Italian” on menu. We wanted authentic Italian cuisine. Not Olive Garden"}, {"username": "Eric Parks", "comment_text": "Fine. I'll take the chicken parm please. 🤪"}, {"username": "Frances McDonagh", "comment_text": "Kinda weird I got bolognese and cappuccinos no problem every time I have visited Italy. I don't know what Olive garden is as I am from Europe but guessing its a chain in US"}, {"username": "Michael Barnes", "comment_text": "Add to that chicken fingers, hamburgers, hot dogs, Mac and cheese."}, {"username": "Flora Johnson", "comment_text": "And no garlic bread or bread to go with your pasta! 🥴"}, {"username": "Gerri Treacy", "comment_text": "Now I’m craving spaghetti and meatballs…🤷‍♀️"}, {"username": "Kika Dibiky", "comment_text": "How about garlic knots? 😅"}, {"username": "Ovidiu Canura", "comment_text": "Right."}, {"username": "Viral Patel", "comment_text": "But the real question is, did it come with all you can eat salad and breadsticks?😜😂"}, {"username": "Barbara Asaro Sciuto", "comment_text": "I’m sure you can find what you want at other places…this place is just saying what they don’t serve."}, {"username": "Joyce Herring Beene", "comment_text": "Now you’re just teasing…show us the rest of the menu🙃😋😋😋"}, {"username": "Elisabetta Coppo", "comment_text": "Food is a veeeery serious matter here in Italy! 😄"}, {"username": "Tracey Palombo", "comment_text": "Cappuccino definitely exists in Italy. We drink it everyday. In a very small village away from tourists."}, {"username": "Ed Enfield", "comment_text": "Cappuccino not after noon, must be a dinner menu."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208560382876373", "text": "🎶drove my chevy to the trevi but the trevi was dry🎶\n\n-Paige A Clark", "link": "facebook.com/groups/1373361046396315/permalink/2208560382876373/", "likes": 189, "comments": [{"username": "Vikki Hudson", "comment_text": "They empty it on Mondays from what I’ve read"}, {"username": "Lena Lai", "comment_text": "Oh man, I forgot to throw coins in there 🤦🏻‍♀️ Kelly Thuy-Trang Doan next time"}, {"username": "Renee Rundle Stoneham", "comment_text": "They collect the coins on Mondays.."}, {"username": "Saška Bajat", "comment_text": "That suckkkssss! I had the same happen to us in adrians villa. I was dying to see the big pool. Amd it was empty! Omg ."}, {"username": "Paige A Clark", "comment_text": "🎶took my Chevy to the Trevi but the Trevi was dry🎶"}, {"username": "Stephanie Osborn Rushing", "comment_text": "That’s crazy, we were there this morning at 6:30 and all fountain!"}, {"username": "Anna Russell", "comment_text": "We were there at 4pm and it was full"}, {"username": "Jan Armstrong", "comment_text": "It’s Monday!!"}, {"username": "Mary Lou Goodwin", "comment_text": "This happened to us the last time we went. We got up early walked all the way from our hotel. And they were cleaning the fountain just like that.🤷‍♀️"}, {"username": "Alice-Rachel Bowen", "comment_text": "Taylor Gilmour 😂"}, {"username": "Angelo Adamo", "comment_text": "the coin collectors"}, {"username": "Catalina Daniel", "comment_text": "Cleaning of the fountain ⛲️"}, {"username": "Kim Baughman", "comment_text": "Oh no ! They probably got tired of people using the water to cool off and putting their dogs in it. 🙈"}, {"username": "Nancy Rogers Caradonna", "comment_text": "I believe they drain and remove coins every Monday."}, {"username": "Sharon Myers", "comment_text": "Oh no!!!"}, {"username": "David Kirkpatrick", "comment_text": "They drain regularly to collect all the coins."}, {"username": "Larry Reinier", "comment_text": "The money?"}, {"username": "Milagros Melendez", "comment_text": "Where is my rare coin?"}, {"username": "Caroline Dombey", "comment_text": "Water"}, {"username": "Lorraine Christina", "comment_text": "Sorry you missed it!"}, {"username": "Debbie Bradbery", "comment_text": "Did the same in May! Just go back in a few hours and the water will reappear 😂"}, {"username": "Kathy Flood", "comment_text": "Same!"}, {"username": "Jojo Terencio", "comment_text": "Went to Trevi in 2014 and it was totally gone! 🤣 that's why i told myself then... i will definitely return to throw coins. And i have visited it 2x since then 🙂"}, {"username": "Mike Dawood", "comment_text": "Tanya Cutri babe looks like the coins have been removed we're gonna have to resort to plan B 😂"}, {"username": "Kerri Shooter", "comment_text": "Belinda Watt 😳"}, {"username": "Robin Bryan", "comment_text": "Time to collect the coins!"}, {"username": "Cortnee Hogans", "comment_text": "Deana Lynn good to know"}, {"username": "Cindy Breneman Hattrich", "comment_text": "Cleaning the fountain?"}, {"username": "Alan Micallef", "comment_text": "Marisabelle Micallef"}, {"username": "Queen Dorcas", "comment_text": "Buy this Italy travel guide on Amazon and thank me later\nIt’s what you need"}, {"username": "Cari Greco Auth", "comment_text": "What the heck??"}, {"username": "Giovanni Caligula", "comment_text": "Someone stole the penguins 😱"}, {"username": "Gabriel Cilia", "comment_text": "Weekly cleaning twice a week once on monday and on fridays, usually from 8am and lasts a couple of hours"}, {"username": "Katie Ewers", "comment_text": "Still counts!"}, {"username": "Michele Wilson Joseph", "comment_text": "At least it’s less crowded!"}, {"username": "Audrey Wilks", "comment_text": "When we went in 2014, they were doing work on the fountain and had scaffolding up so we could walk up closer to the statues! Definitely not what we were expecting, but so cool!!"}, {"username": "Marcia Weinstein", "comment_text": "What do the coins go towards?"}, {"username": "Carol Johnson", "comment_text": "Sorry I got thirsty and drank all the water..🥂🧐😏🥂"}, {"username": "Sharon Hiesler", "comment_text": "Just revisit, throw a coin in for us as we forgot with the crowd xx"}, {"username": "Scott Heran", "comment_text": "Some wack jobs threw some black dye in there a few weeks ago. Maybe a clean up."}, {"username": "Lynn Crane", "comment_text": "Monday cleaning/coin collecting."}, {"username": "Miyuki Kanno Paul", "comment_text": "It must be on Monday, eh?"}]}, {"id": "2210004336065311", "text": "So leaving beautiful Venice to Milan by train after a quick lightning visit.\n\nSo beautiful.\n\nGood news is no signs of anything untoward and kept an eye on things.\n\nFast train with free wifi and a snack and process works well.\n\nAlso have not been asked for passport or identification at all and have caught four trains.", "link": "facebook.com/groups/1373361046396315/permalink/2210004336065311/", "likes": 76, "comments": [{"username": "Sonia Smith", "comment_text": "Did you purchase your vepretto tickets there or before arrival? TIA"}, {"username": "Ana Belen Ayard", "comment_text": "Beautiful pictures"}]}, {"id": "2210011156064629", "text": "If I want to explore Tuscany and Umbria regions, where is a good base? Preferably a quaint, charming town that has good parking options.", "link": "facebook.com/groups/1373361046396315/permalink/2210011156064629/", "likes": 3, "comments": [{"username": "Jim Kelleher", "comment_text": "I’ve got the perfect town for you: Catiglione del Lago on beautiful Lake Trasimeno in northern Umbria. A short ride to Perugia, Spello, Orvieto, Assisi, Cortona, and Montepulciano.S\nmall, charming and plenty of free parking. It also features my favorite B & B, Antica Gabella. Charming beyond words."}, {"username": "Ken Vecchia", "comment_text": "Orvieto a beautiful place on a hill"}, {"username": "Amelia Alati", "comment_text": "Le Tre Vaselles hotel in Torgiano."}, {"username": "Donna Tedford", "comment_text": "San Gemiano"}, {"username": "Mike Laudick", "comment_text": "Orvieto or Foligno are located on train lines with parking. Perugia has great parking but the train station is slightly out of town. These are all in Umbria."}, {"username": "Ike Simoncini", "comment_text": "Lucca"}, {"username": "Connie Lubinsky", "comment_text": "Terontola. Casa Dina B&B on Airbnb is perfect if you have a car (I didn’t and enjoyed the walk to town). Access to all small towns in Tuscany and Umbria. Her place is awesome."}, {"username": "Ruth Weinheimer Walsh", "comment_text": "That's what we did and stayed in Montepulciano"}, {"username": "Carol Taylor Tisdale", "comment_text": "Il Banditello farmhouse on VRBO. Overlooks Montepulciano. Gorgeous and a great base."}]}, {"id": "2210020279397050", "text": "Hello there\nHas anyone stayed at Marina Grande Residence in Sorrento?\nHonest opinion please.\nWe plan on making Sorrento our home base for 4 nights and doing day trips.", "link": "facebook.com/groups/1373361046396315/permalink/2210020279397050/", "likes": 0, "comments": []}, {"id": "2210021119396966", "text": "Buongiorno Tutti da Miami,\nI have a question, my friends and I are traveling to Milano, we are a group of 7 and would like a private tour of just us 7 to the Milano Duomo and The Last Supper. Is that possible? Any suggestions who or what company to contact?\nThank you in advance🙏", "link": "facebook.com/groups/1373361046396315/permalink/2210021119396966/", "likes": 1, "comments": [{"username": "Maria F. Ruiz", "comment_text": "You're interested in having a private guide, or having the Las Supper opening just for your group? Both are possible but the price is very different!"}, {"username": "Kejdi Okej", "comment_text": "You re interested in having a private guide or in having a las supper opening just for your group both are possible but the price is very different l"}]}, {"id": "2210021859396892", "text": "Traveling to Italy in December/January...wondering how to pack light (carry on only) for the cold weather. Any tips would be great! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2210021859396892/", "likes": 1, "comments": [{"username": "Charleen Siegler Schuss", "comment_text": "A great warm rain coat with a hood that you wear or carry on to the plane. At least 2 comfortable walking shoes, warm scarves, stuff you can layer and you will be fine"}, {"username": "Rhonda Hope", "comment_text": "Layers , a packable down jacket and Ponte pants or leggings etc , thin long sleeve layers"}, {"username": "Rhonda Hope", "comment_text": "Boots that are comfortable"}, {"username": "Allan Olexa", "comment_text": "We are in Napoli/Roma annually at Christmas. Our experiences are pleasant weather…light jacket and even shorts during the daylight hours."}, {"username": "Teisha DeVore Fernandez", "comment_text": "Thank yall!"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Wear your bulkiest items/boots on the flight. Bring lots of layering options."}]}, {"id": "2210021909396887", "text": "Staying in a hotel just out of Bologna and I plan to take taxis home after supper.\nWhat’s the best option? Taxis or Uber? Is there another Uber-like company ? Thnx!", "link": "facebook.com/groups/1373361046396315/permalink/2210021909396887/", "likes": 2, "comments": [{"username": "Paulyn Hoffman", "comment_text": "There aren’t Ubers in Bologna… except for Uber Black. Luxury vehicles for much higher price. They do have taxi’s."}, {"username": "John Bruckman", "comment_text": "In Bologna stick with taxis.. safer"}, {"username": "Kejdi Okej", "comment_text": "In Bologna stock with taxis safer"}]}, {"id": "2209619389437139", "text": "Flying Jacksonville FL to Rome with changing planes in Atlanta GA. Delta\n\nReturning same route Rome to Jacksonville with changing planes in Atlanta. Delta\n\nAt which points do I go through customs in addition to TSA precheck?\n\nI have only been to Europe once before and appreciate your tips. My layover in Atlanta is 1 hour 40 minutes going, then 3 hours returning so I should be okay, correct?", "link": "facebook.com/groups/1373361046396315/permalink/2209619389437139/", "likes": 2, "comments": [{"username": "Jennifer Lynn Davis", "comment_text": "You'll go through customs at your first stop in the US. You'll have to pick up and recheck your bags there."}, {"username": "Collette Lawson Duffield", "comment_text": "Going, You'll go through customs and immigration when you get to Rome. Returning home, you'll go through customs and immigration in Atlanta."}, {"username": "Linda Prunkel Reinhard", "comment_text": "If your return layover is only 1 hr 40 min, You might have a problem. You have to get your checked luggage then bring it to your domestic connection. They are always extremely backed up and don’t care about tsa pre check. We missed our connection to Jax once because of it. We now allow at least 2 hours for Atlanta customs.\nOh, just saw you have 3 hours coming back. That should be good."}, {"username": "Jeff Overman", "comment_text": "And to answer your question re TSA pre check - that only applies when you go through TSA in the US, so you’ll use pre check in Jax when you start your trip (as long as your boarding pass shows pre. Heck, it’s not guaranteed). When you return, there’s no TSA pre check because you’re outside the US (in Rome, in your case)\n\nI have seen Mastercard fast lanes in airports outside the US - not sure if they have that in Rome. It may only apply to certain levels of Mastercard. And each person needs to show their own Mastercard - we flew out of San Jose Costa Rica and our friend used her Mastercard, but couldn’t take any of us with her, so we went through the regular security line and met her on the other side of security. Have a good trip!"}, {"username": "Paul Kafer", "comment_text": "You will need to go back through security in Atlanta for your flight to Jax so you can use precheck there. Liquid rules apply for that flight so out anything you buy like wine in check in luggage."}, {"username": "Mike McClane", "comment_text": "I’m confused with your statement that you’re not changing planes for the ATL to FCO flight. I know of no Delta flight from JAX to FCO without a plane change."}, {"username": "Kim Hollein", "comment_text": "So just to clarify. If you are flying out of the stars and have a connection stateside, you have to retrieve your checked baggage at your connecting airport, go through customs, recheck the bag and board flight to Italy. Then the opposite on the way back???"}, {"username": "निनावी सहभागी", "comment_text": "Leaving the U.S round trip - airline handles luggage for U.S connection, I retrieve luggage in Rome and go through customs there.\n\nReturning to U.S. round trip - airline handles luggage for U.S. connection - I go through Customs with carry on only in connecting city (lands in Atlanta International concourse), change concourse to get the last leg home - retrieve luggage at home airport.\n\nIS THIS A CORRECT EXPECTATION?"}, {"username": "Patricia Foley Mastrorilli", "comment_text": "Atlanta"}, {"username": "Kathy Holden Reams", "comment_text": "We actually did the same two weeks ago. Jax to Rome then back. The security checks/customs were longer on the way back. I think you’re good"}, {"username": "Lyn Pappas Dahm", "comment_text": "You can download an app called Mobile passport control that will get you through customs faster in Atlanta. You will fill out your form as soon as you land. I was the first one through on my last trip."}, {"username": "Monica Roman-Fazio", "comment_text": "As long as you don't leave the terminal and your luggage is on the same flight you will go at the last stop of the trip"}]}, {"id": "2210007569398321", "text": "Where to get sandals made in either Sorrento, Capri or Positano? How long does it usually take?", "link": "facebook.com/groups/1373361046396315/permalink/2210007569398321/", "likes": 2, "comments": [{"username": "Nicole Gouzoules Sheehan", "comment_text": "All three have them. You’ll see several. Sorrento will be less expensive than Capri or Positano."}, {"username": "Rachael Richardson", "comment_text": "They have shops all over ! The ones in capri were more expensive , the ones in sorrento were cheaper but looked just as good , I think if you go first thing you can collect later"}, {"username": "Ana Calderon", "comment_text": "I saw many shops there that made sandals to fit."}, {"username": "Roxanne Patti", "comment_text": "I paid about $60 for mine in Capri and it was quick. I stayed while he did it and took pictures of the process. I will say that I stopped at the 1st shop I came to in Capri and was given a price for what I wanted. I walked further down and got the same pair for less. So, shop around if it matters to you. I'm sorry I don't recall the name of the store where I bought them."}]}, {"id": "2209991562733255", "text": "Hi everyone!\nMy Husband and I will be traveling from Siena to Bari in December. We know that it's at least a 6 hour drive and would like to stop somewhere overnight. Does anyone have any recommendations for a larger town (and/or hotel recommendations) that we could use?\nMany thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2209991562733255/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Viterbo https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194950-d2382\n5216-Reviews-PA\nLAZZO_UBERTINI_\nUrban_Suites-Vi\nterbo_Province_\nof_Viterbo_Lazi\no.html"}, {"username": "Ville Lignell", "comment_text": "Depends on the route you choose. Would you drive across the peninsula or get on the Adriatic coast way?"}]}, {"id": "2209990636066681", "text": "A few tips from this week in Rome:\n-cooling towels & fans weren’t necessary\n-Fatamorgana for gelato 👌🏻👌🏻\n-Ristorante Al 34, Grano & Gino Sorbillo were Great! (All recommended by locals & walking distance from the Spanish steps)\n-private tour of Rome was perfect (worth the $$ if you have kids)\n-our photographer was GREAT!\n\n**feel free to message/comment for details! This group was so helpful in my planning", "link": "facebook.com/groups/1373361046396315/permalink/2209990636066681/", "likes": 19, "comments": [{"username": "Christopher Dyke", "comment_text": "Thank you for sharing. We will be traveling next year and love to have family photos. Where did you take your pics? What time of day? Could you share photographer? Also, who did you use for private tour? Thank you!"}, {"username": "Karen Bowman", "comment_text": "Where did you stay in Rome?"}, {"username": "Angie Moss", "comment_text": "Can you please tell me more about your private your? TIA🤗"}, {"username": "Christina Ulewicz", "comment_text": "Can you share your photographer?"}, {"username": "Marshia Gibson", "comment_text": "."}, {"username": "Meredith Carney", "comment_text": "Ian Carney"}, {"username": "Leah Herbener", "comment_text": "Stefanie DiFronzo-Fodera can you tell me more about the private tour we are travelling with 2 boys in sept"}, {"username": "Sara Beth", "comment_text": "Cooling towels and fans were certainly necessary during the heatwave the 3rd week of July! Lol 108!"}, {"username": "Maureen King", "comment_text": "Private tour guide\n\nWhere did you go?"}, {"username": "Elizabeth Mary", "comment_text": "Thanx for the tips. I'm also interested in knowing about this private tour, thanx!"}, {"username": "Lexie Enlow", "comment_text": "Why did you find that fans and cooling towels weren’t necessary ?"}]}, {"id": "2209997816065963", "text": "Recommendations for pasta cooking experience in Florence or Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2209997816065963/", "likes": 7, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.viator.com/\ntours/Florence/\nPastamania-Pasta\n-making-class/\nd519-125387P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Rome https://\nwww.viator.com/\ntours/Rome/\nPasta-and-Tirami\nsu-Lovers-Works\nhop-in-the-Hear\nt-of-Rome/\nd511-21369P11?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Paula Bodden", "comment_text": "Cooking Classes in Rome. That’s the name. It’s in Trastevere. Chef Andrea Consoli. Amazing experience."}, {"username": "Maureen Judice", "comment_text": "Cecile Broussard\nEileen Huval\nSusan Rabalais Duplantier"}, {"username": "Kimberly Lampros", "comment_text": "Airbnb experience out of Florence - Luca & Lorenzo, Cooking in Chianti Hills"}, {"username": "Kelly Huntley Clark", "comment_text": "Riccardo Cooking Class!"}, {"username": "Rose Perez Swartz", "comment_text": "We did the Pastamania class and it was fun and informative"}, {"username": "Chamila Zacky", "comment_text": "Thank you soo much everyone"}, {"username": "Jennifer Bernardino", "comment_text": "Chef Ryan Hanley. #1 chef in Tuscany…Debora Mazzierli"}, {"username": "Camille Desroches", "comment_text": "Steve Etesonne"}, {"username": "Kelly Breinich", "comment_text": "Pasta mania was okay. I’d definitely go there if I had kids. Otherwise, Francys pasta, gnocchi, and Italian home sauces on Airbnb experiences was very highly recommended to me from a friend and wished we had gone. Both in Florence"}, {"username": "Mike Conway", "comment_text": "Accidental tourist is awesome. They pick you up and drive you into the countryside to a wine making castle and then to an old estate for cooking. Awesome experience."}, {"username": "Annette Bertram", "comment_text": "* I booked two through Viator. Both classes were held at Gusto restaurant (just outside Piazza Navona). In the first class we made 2 types of pasta as well as tiramisu. It was a lot of fun. The next day I did another one, and made pizza and gelato. After the class, you eat with the other participants in the restaurant. A really great experience."}]}, {"id": "2209983402734071", "text": "Interested in visiting Florence in October.\nAny recommendations where to stay?\nDo you stay in hotel or A-BNB?", "link": "facebook.com/groups/1373361046396315/permalink/2209983402734071/", "likes": 1, "comments": [{"username": "Jeanne Eliason", "comment_text": "My answer always is Hotel David if they have rooms. We are staying there this October. Have been staying there every year for 8 years except for covid year. Google it."}, {"username": "Pao Magnoler", "comment_text": "Airbnb. I stayed here. Near the Duomo. It was amazing."}, {"username": "Paula Brink", "comment_text": "Always hotels. Depends on your budget. http://\nwww.hotelleduefo\nntaneflorence.c\nom/\nThat’s one that is quite reasonable, according to friends who have stayed there it is not fancy but clean and has everything you need and location is fantastic.\n\nhttps://\nwww.25hours-hote\nls.com/en/\nhotels/florence/\npiazza-san-paoli\nno?set_language\n=1649843771&gcl\nid=CjwKCAjw8sym\nBhAqEiwAaTA__Gm\nz0Yx3jYvNcOmxNN\nyVyzPHQQsO_bUQU\nw4Dr7BcqV_bPz8c\nI3awyhoC5egQAvD\n_BwE\nI stayed in this one in April, it was great- fun decor, great location, clean, comfortable, nice restaurant, but a bit more $ than the first one or the Hotel David someone else mentioned.\nI have stayed at Hotel David too- very nice, a bit further out but there is bus service."}, {"username": "Gayle Moores", "comment_text": "We stay in hotels and recommend the Cerretani Firenze!Beautif\nul hotel within walking distance close to the Santa Novella train station. Close to the main square with the Cathedral of Santa Maria del Fiore and Uffizi gallery.Many good restaurants near the hotel."}, {"username": "Ana Ka", "comment_text": "I stayed at this brand new aparthotel last time and loved it. Price to quality to location were superb: http://\nbsj15.it/"}]}, {"id": "2209683746097370", "text": "Okay I’ve been researching and pricing everything out. We are planning an Italy trip in late April/May. So I’ve looked at tours compared to doing it yourself. Also looked at partial guided to full guided tours. I actually don’t think I like the idea of everything being planned and on someone else’s timeline. Maybe a partial tour but not sure yet.आणखी So my question is, I’m thinking about 3 days in Rome, 2 or 3 days in Florence, 2 days or maybe 3 in Venice and thinking about Sorrento for a couple of days. What hotels do you suggest or have been to that you thought was wonderful. I’m not opposed to Airbnbs either. I know I have a train to the 3 major areas…but what about Sorrento? I’m also open to other suggestions as I don’t have anything booked yet and this is our 1st time in Italy. Thank you all, this page is so helpful!!!", "link": "facebook.com/groups/1373361046396315/permalink/2209683746097370/", "likes": 8, "comments": [{"username": "Kim Pacer", "comment_text": "We used jayway. They pick you up take you to hotels book hotels and will book excursions. It is all about what you want to do. You get to choose and they just make it happen. Good luck"}, {"username": "Clint Madsen", "comment_text": "Venus is a LONG WAY FROM ITALY ! There’s no train to it.😝"}, {"username": "Allyson Pisciotta", "comment_text": "There is a train to sorrento that you catch in Naples.\nThe itinerary you describe is def something people do but for me I think it’s a lot. It depends on what kind of trip you want and if you would like to try to do another Italy trip someday. If you stay 2 nights somewhere you really only have one full day and that’s not really enough in my opinion. For example Depending on what you want to see in each area even two full days isn’t enough. From sorrento do you want to go to Capri? Amalfi? Positano? Pompeii or Vesuvius? Ravello? ￼the list can get way longer too lol. You will be spending a lot of time in trains and train stations. If you decide to shorten your destinations list I would get rid of Venice it’s the farthest away. You can save that for a northern Italy trip sometime. Like I said though for a lot of people that would be a great itinerary. I did one Italy trip a few years ago which was Rome, Tuscany and Florence (day trip to several small towns in the area and Sienna) I am going again in April and I am doing Rome (because my son hasn’t seen it) and then 6 nights in Sorrento as my home base and traveling all around that area. Good luck."}, {"username": "Jason Hobel", "comment_text": "I was in the same situation as you are, deciding to plan the whole trip myself or join a tour group. After costing everything out and looking at schedules, I decided to plan the whole trip myself. And I was so happy that I did. We went the last few days of April to May 8th and the weather was very good and not as crowded either. I liked the idea of setting my own schedule and not rush through places and I learned a lot more about Italy doing my own planning too and saved a lot of money. We flew into Rome and took the trains to Sorrento. I wish we stayed in Sorrento longer and not as long in Florence and more time in Rome. It was out first trip to Italy so we learned a lot and can't wait for my next trip to beautiful Italy. And the next trip will be more concentrated in certain regions. We used trains to travel everywhere. Used the bus twice, no taxis. We did side trips from Sorrento and Florence. You can search my name and see the pictures from the different areas we visited. So long story short, plan yourself and enjoy the adventure and learning experience from it. Any questions that I can help to answer, just PM me and I can see if I can help 😊"}, {"username": "Cyndi Riley", "comment_text": "Planning ours. $20K for 10 weeks or use a TA. They book high end places, 3 weeks $15K. No brainer to do it ourselves. We booked AirB&B’s. Next March-May.\nI’m sure it won’t be perfect all the time but we are travelers and work well with change. I’d rather have more experiences then not. Trip if a lifetime. We are so excited."}, {"username": "Greg Saba", "comment_text": "Extremely easy to do it yourself. It will save you money and allow you to follow things like weather to have a more flexible trip. We have done a couple dozen trips to Italy, four in the last year."}, {"username": "Nancy Lewis", "comment_text": "Get to Lake Como for sure"}, {"username": "Deborah Clegg-Wolfe", "comment_text": "Check out railbookers.com\nCan do their itinerary or will customize. Also can book hotels through them."}, {"username": "Lucrezia Folger", "comment_text": "You haven't mentioned how many weeks or months your trip is."}, {"username": "Jeff McLellan", "comment_text": "Just do it yourself. I couldn’t imagine paying anyone to plan my travel for me or control my schedule/time once I am there."}, {"username": "Rebecca Yeoh", "comment_text": "Try to do it yourself as much as you can, it’s a very easy country to move around via the high speed trains (such as Trenitalia). I would recommend booking a day tour in Florence that will take you around Tuscany (look at Walkabout Tours, one of my fav days on the whole trip). I stayed at The Frame Hotel in Florence which was a 5 mins walk from the train station, and positioned around the corner from the Duomo. In Rome, stay near the Pantheon / Piazza Navona / Campo de’ Fiori areas. You can walk to all the major sites from there. I stayed at Hotel Smeraldo, strongly recommend. I’d also suggest Cinque Terre instead of Sorrento in that time frame, it’s coastal too. That way you aren’t stretching yourself too thin in terms of travelling distance because Sorrento is the opposite direction you want to go."}, {"username": "Leslie Goodland", "comment_text": "Count a travel day as a whole day. Plan the trip yourself."}, {"username": "Lisa Wylin", "comment_text": "In my opinion, for your first time, do a tour, pack your bags and enjoy. You don’t have to do any work!\nAnd you get some free time. So much easier and you get so much out of it!💗🇮🇹"}, {"username": "Lynette Stanley", "comment_text": "I always do our own itinerary - just decide what’s most important for you & ur fellow travellers to see or do then make a personal plan by doing lots of homework prior! Part of the planning is the excitement of the trip! Enjoy it!"}]}, {"id": "2185197985212613", "text": "Positano with a view 🥰\nLe Agavi is the first hotel you come to in Positano, an enchanting place, where the sea blends into the sky!\nDiscover more: … आणखीhttps://www.tkqlhce.com/click-100692842-12291623?url=https%3A%2F%2Fwww.tripadvisor.it%2FHotel_Review-g194863-d202899-Reviews-or10-Le_Agavi_Hotel-Positano_Amalfi_Coast_Province_of_Salerno_Campania.html%23REVIEWS", "link": "facebook.com/groups/1373361046396315/permalink/2185197985212613/", "likes": 26, "comments": []}, {"id": "2209969249402153", "text": "Wanting to go to Cinque Terre as a day trip from Pisa! Best way to do this? Would local trains be fine to get tickets on the day. Otherwise any tour recommendations? Can’t seem to find any tours leaving from Pisa", "link": "facebook.com/groups/1373361046396315/permalink/2209969249402153/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Pisa/\nCinque-Terre-Day\n-Trip-from-Pisa\n-Including-Wine\n-Tasting/\nd520-6693CINQUET\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Michael Broadwater", "comment_text": "You don't need a tour for Cinque Terre but it's gonna be difficult to see all 5 towns in one day and spend a decent amount of time in each of them."}]}, {"id": "2209970259402052", "text": "Hello!\n\nWe are travelling to Italy in September.\n\nWe are landing at the Rome airport but our first airbnb is in Florence. What is the best way to get there?", "link": "facebook.com/groups/1373361046396315/permalink/2209970259402052/", "likes": 0, "comments": [{"username": "Kerri Cole Batista", "comment_text": "There’s a once daily train direct from the airport - or multiple train options if you’re willing to connect downtown. Depends on your dates and times."}, {"username": "Alicia Burno", "comment_text": "By train"}]}, {"id": "2209828679416210", "text": "Good morning!!! I am thinking about a 5-6 days trip to Bologna... Do you have any suggestions for day trips around? Also, do you think that i could stay in another town some of those days? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2209828679416210/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Bologna/\nA-day-in-the-win\nery-wine-trekki\nng-tastings-and\n-tour-of-the-Do\nzza-village/\nd791-125389P99?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Bologna/\nDay-tour-of-Parm\niggiano-Ferrari\n-Balsamic-Lambr\nusco-with-lunch\n-and-transfer/\nd791-316397P3?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Scott Perry", "comment_text": "Guero for cocktails! The them Scott sent you. 😁"}, {"username": "Andrea Bainbridge", "comment_text": "We enjoyed a day trip to Modena. Great private guide Caterina.schene\ntti@gmail.com"}, {"username": "Cecilia Christine Costantini", "comment_text": "Day trip to Ferrara, lovely town, visit the Castle."}, {"username": "Gina Rovello Keenan", "comment_text": "There are many options! Google day trips from Bologna. Ravenna, Parma, Modena, Ferrara, Florence."}, {"username": "Kejdi Okej", "comment_text": "We enjoyed a day trip to modena great private guide caterina schentti a gamail com"}]}, {"id": "2209611056104639", "text": "Should Sicily be included for first timer to Italy? How many days should be spent?", "link": "facebook.com/groups/1373361046396315/permalink/2209611056104639/", "likes": 14, "comments": [{"username": "Sabina Ileršič", "comment_text": "I went for first time 25th of September for 8 days."}, {"username": "Allan Olexa", "comment_text": "We are in Italy a couple times annually. Our favorite destinations are Napoli and Catania on Sicily."}, {"username": "Rick Schneider", "comment_text": "I love Sicily but first time should include Rome , Florence and Venice. Then Amalfi Coast and Pompeii. That easily uses up 2 weeks. More time visit Taormina and Syracusa and Palermo in Sicily"}, {"username": "Erick Abutin", "comment_text": "7 days in Sicily with car"}, {"username": "Heath Conn", "comment_text": "I’d say second or third trip. This is my favorite region but seeing Rome, Florence, and Venice first makes sense to me. We did 7 days with car and could’ve used another 2-3 days."}, {"username": "Ike Simoncini", "comment_text": "Sicily is amazone but if you go you should do a 2 week trip travel around for 7 and stay in cefalu for a week to chill"}, {"username": "Lesley Vullo Pino", "comment_text": "YES ! As many as you can lol ☺️"}, {"username": "Lainie Bennett", "comment_text": "Help us help you! Do you like art, architecture, food/\nwine, outdoor activities, swimming? What time of the year do you plan on going? Will it be adults only or will you bring the kiddos? Any information you can provide will help us make better recommendations. ;)"}, {"username": "Jeff Gentner EA", "comment_text": "There's a huge difference between SEEING Italy and EXPERIENCING Italy. Plan accordingly. To experience Sicily, you need at least 8 - 10 days."}, {"username": "Lynn Francisco Casella", "comment_text": "Off a cruise ship one day is enough for some day tours."}, {"username": "Shawn Galbraith", "comment_text": "I did it as a separate trip -10 days"}, {"username": "Starla Dawn", "comment_text": "I took my daughter to HOTEL MEA in Lipari, Sicily and it was absolutely amazing!!"}, {"username": "Jose Velez", "comment_text": "I have been in Italy over 40 times in the last 55 years and until last year had the curiosity to go to Sicily. I had a good time but Rome, Florence and Venice is best for a first visit"}, {"username": "Greg Rogers", "comment_text": "Not a first time trip. So much to see on the mainland."}, {"username": "Rosa Butta D'Astolto", "comment_text": "Definitely and forever❤️🇮🇹"}, {"username": "Larry Reinier", "comment_text": "We spent 3 weeks and loved every bit of it"}, {"username": "Rosa Zordan", "comment_text": "Most definetly yes. 3 days at least."}, {"username": "Alan Gan", "comment_text": "First time there rome and venice is a must. If you have time to fit another then choose between florence or amalfi naples"}, {"username": "Don Bussolari", "comment_text": "Sicily is a big Island. Take the Rick Steves tour to Sicily you will see more things and places than if you did it alone."}, {"username": "Attila Wido", "comment_text": "The all of them :)"}, {"username": "Lina Costantino Sirianni", "comment_text": "Most definitely! So much to see and do. A month still won’t cover it"}, {"username": "Joyce Huffer", "comment_text": "But keep it on your list"}]}, {"id": "2209848116080933", "text": "Has anyone got any recommendations for car hire from Milan Malpensa Airport? We will be flying to Milan in September to travel up to the Dolomites for a week in Calfosch/Colfosco.\n\nAll the hire companies I haveआणखी looked at have got some terrible reviews. Does anyone have any recommendations from first hand experience?\n\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2209848116080933/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly sicilybycar or enterprise"}, {"username": "Costero Home", "comment_text": "Europcar We rent from them every year for 3 - 6 months in various parts of Italy and Spain. Never had an issue. Always newer cars with automatic option available."}, {"username": "Tara Doyle", "comment_text": "We hired Joe Bananas for our September transfer from Milan airport. Their customer service so far has been amazing!"}, {"username": "Kejdi Okej", "comment_text": "We hired joe bananas for our September transfer from milan airport their customer service so far has been amazing"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209590476106697", "text": "Hi just needing some input for my itinerary please, I am loving this group - so much valuable information.\nDay 1 - Arrive in Venice - all we're going to do is the Gondala Ride - incase of Jetlag and depending what time we get in.\nDay 2 - Look around Venice\nDay 3 - Leave Venice - head to Milan early (don't sleep in) where we will drop off our luggage, go for a look at the Duomo and head back to Sirimione by train to do a tour of Lake Garda (I realise we will be back tracking but I wanted to leave our luggage at our accommodation in Milan and not worry about what to do with it when we did the Lake tour.\nDay 4 - Day trip by tour to Lake Como, Bellagio and Lugano\nDay 5 - Early Morn -Head to Lucca by train where we are basing ourselves for 5 days, after settled into accommodation take the train to Pisa for the afternoon.\nDay 6 -Hire Vespas and drive around countryside - Cooking Class booked for Dinner\nDay 7 - Full Day Trip to Florence by train (this is what I'm not sure about whether I have allowed enough time in Florence) but we have a free day tomorrow\nDay 8 - Either back to Florence or Chianti Region\nDay 9 - Day trip by train to Cinque Terre\nDay 10 - Early Morn - Head to Sorrento by train (basing ourselves for 3 days) Check in and look around locally\nDay 11 - Pompeii tour and then look around\nDay 12 - Full Day at Amalfi Coast, Positiano and Ravello not quite sure how yet\nDay 13, 14,15 - Head to Rome where we will spend 3 days and with all your great advice on this site visit the local attractions and just absorb the area.\nDay 16 - Fly out from Rome\nI'm still a bit sketchy on things, and I know Day 3 will be tight but appreciate any kind of input. I've decided not to travel around lugging our suitcase with us and just base ourselves in a few places and trip around doing day trips by train mainly..", "link": "facebook.com/groups/1373361046396315/permalink/2209590476106697/", "likes": 10, "comments": [{"username": "Chamila Zacky", "comment_text": "Who did you book the cooking class with?"}, {"username": "Valerie Collanton", "comment_text": "Sounds great. Days 7, 8 and 9 are very ambitious. I do not think you will see much of Florence or Cinque Terre with that schedule. I would consider two days in Florence minimum. And one day to do a full day Chianti tour. And save Cinque Terre for another visit."}, {"username": "Stacey Miller", "comment_text": "Pack lighter, hand wash as you need to. Luggage slows you down!\n\nYou need more time in Florence. Maybe less in Rome, depends if this is your 1 and only trip to Italy."}, {"username": "Debbie Potter", "comment_text": "Wait until you have a question and you get mean and ugly comments and they make fun of you... then you won't be liking this group anymore... just sayin because it happens a lot."}, {"username": "Maria O'Callaghan", "comment_text": "That is a lot of travelling."}, {"username": "David Dowd", "comment_text": "Slow down, spend more time in each place you really want to see and look forward to your next trips seeing all the other places you didn’t get to this to this time. Italy will still be there in future, you can spend time enjoying the place you are in rather than travelling between places and enjoying nothing. Have a great time"}, {"username": "Jenny Payne", "comment_text": "Make sure your travel insurance covers your scooter ride? read the fine print 🌻"}, {"username": "Karen Espinoza", "comment_text": "If you can still make some changes and spend at lease 2 days in cinque terre.\n( I am still in shock of how beautiful CT is, but everything and everywhere in Italy is beautiful…just enjoy every second… have an amazing trip 🌸\n\nAnd is never enough time in my favorite places anyway. So, I think, oh well, I will be back 🫶"}, {"username": "Meg Johnson Ignacio", "comment_text": "If you have time in Milan, go see da Vinci’s The Last Supper mural painting. It’s incredible!"}, {"username": "Chris Avanzato", "comment_text": "I would change 5 days Lucca to 5 days Florence (;sommuch more to see) and go to Lucca and Siena as day teips from Florence."}, {"username": "Chris Avanzato", "comment_text": "Forget Pisa! Day trips from Florence : Lucca, Siena, Cinque Terra!"}, {"username": "Serenna Davies", "comment_text": "I think you are packing too much into your trip. Its exciting to see alot. You may find it stressful and exhausting. Have a great time."}, {"username": "Graham Sherlock", "comment_text": "A day in Florence will give you a feel for this gorgeous city"}, {"username": "Lucrezia Folger", "comment_text": "Not only do I think you've got way, way, way too much going, and going, For example, Day 4 - Day trip by tour to Lake Como, Bellagio, and Lugano. Do you know how large for instance Largo Como is? That it's not just saying you got there, and then on to the next, it's experiencing these magical places, breathing in the air, watching the light change, strolling, seeing a sweet cafe or restaurant, and on the spur of the moment going and enjoying. Just the way I guess you write about these places, it's all about stops, Day 2, look around Venice, Leave Venice, don't sleep in, etc, etc. I know I often say less is more, however, it's really true."}, {"username": "Judith Tobin", "comment_text": "The itinerary is full of really cool places. Good on you for being brave enough to hire Vespas. A day trip to Florence is possible but I remember being frustrated when I did this in 2004. We had a car and the parking was a hassle. A long and tiring day and we could only do a few things. So plan that but tightly. Lake Garda is beautiful just to stroll along the lakeside and soak it all up. Lucca is gorgeous. Actually almost anywhere in Italy is. I’m heading there myself in September - this time 3 days for Florence."}, {"username": "Hollis H McGuire", "comment_text": "OOOOH BOY, I don’t like your Day3!!! I understand your wanting to keep\nLuggage safe but that’s 4-5 hours lost!\nLake Garda is lovely but Como even more; I respectfully suggest you SKIP GARDA, have a leisurely morning in Venice (sooooo worth it!) and train back to Milan. Go see the magnificent cathedral, have some great food, and breathe for Day3.\nYou’ll never have enough time in Florence (and it’s horribly crowded) so just realize that. Consider keeping your rooms in Lucca (for your luggage!) (or ask them to hold your luggage, which I believe they’ll do if you’re returning) and get a hotel for one night in Florence, so that you have most of 2 days there.\nChianti region is glorious but you can see a bit from the Lucca-Florence train. You don’t have time to see it all.\n😘"}, {"username": "Claire Dowson", "comment_text": "Going to Milan on day 3 is making your journey time to Garda over 4 hours. I would look to see if there is a bag store at Desenzsno (Sirmione) station and go straight there from Venice. It’s a 15 minute walk to the port to catch the boat to Sirmione, which takes about 20 minutes. You can get day boat passes. It might be better choosing one lake from Como or Garda and seeing that. The boats travel at a leisurely pace, unless it’s the fast hydrofoil, then you are inside only and it’s not as nice. Just spent three nights in Lake Como, four in Garda and three in Venice. Wished I’d had longer in each dur to the travel."}, {"username": "Mithu Tai", "comment_text": "A very busy itinerary with slot of travel could be exhausting and take away the energy to enjoy\nWatch your bags and backs for pickpockets. Be vigilant"}, {"username": "Anxhela Papa", "comment_text": "It’s look like military training to me.\nPlane- gondola - train - vespa - train - train - train…….\nTake a minute and breathe. You are in vacation."}, {"username": "Fiona Cameron", "comment_text": "Spend the extra day in Florence!"}, {"username": "Colleen Dee", "comment_text": "I’m like you - I want to see it all… As others have said though that’s a tight itinerary. All places are worth some time except Pisa. It’s the tower & not much more."}]}, {"id": "2209573536108391", "text": "Your thoughts on visiting Saturnia, Toscana, Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2209573536108391/", "likes": 1, "comments": [{"username": "Jessica Olivero", "comment_text": "I wanted to go so badly last August but we decided against it with the crowds."}, {"username": "Mike Ball", "comment_text": "Firstly you will need a car or a private driver to reach Saturnia, it’s in a remote spot with no public transport stops,\n\nDefinitely avoid it in July and August, it’s far too busy and overcrowded. I’ve been once , enjoyed the experience but I wouldn’t want to return."}, {"username": "Kejdi Okej", "comment_text": "I wanted to go so badly last august but we decided against it with the crowds."}]}, {"id": "2209287956136949", "text": "Has anyone been here ??? Where to stay from Brescia to Trompia Valley to view Valley of Lights", "link": "facebook.com/groups/1373361046396315/permalink/2209287956136949/", "likes": 7, "comments": [{"username": "Jules Blumke", "comment_text": "F"}]}, {"id": "2209299982802413", "text": "What are your must visit places in Northern Italy with kids (12,10,6 yrs)? We’ll be travelling from Switzerland.", "link": "facebook.com/groups/1373361046396315/permalink/2209299982802413/", "likes": 1, "comments": [{"username": "Tanja Adamovic Vukasovic", "comment_text": "Gardaland"}]}, {"id": "2209475596118185", "text": "To anyone here who has flown business class with Air Europa, what do you think?", "link": "facebook.com/groups/1373361046396315/permalink/2209475596118185/", "likes": 0, "comments": []}, {"id": "2209512052781206", "text": "We will be traveling abroad to Europe for the first time next year. There is a 9 hour ahead time change. Should we try to book an afternoon flight? This would get us to our destination early afternoon. Or should we leave in the evening? Trying to figure out the best way so we are somewhat rested!!", "link": "facebook.com/groups/1373361046396315/permalink/2209512052781206/", "likes": 1, "comments": [{"username": "Susy Zimny", "comment_text": "We’re heading to Rome and our flight from east coast leaves at 6:30pm Friday night . We arrive in Rome at 9am Saturday morning"}, {"username": "Angie Hoff-Hess", "comment_text": "Inportant fact, are you travelling from US? East or Weat coast?"}, {"username": "Jenny Payne", "comment_text": "I never travel on weekends ,mainly if they are having any strikes that’s when it will happen. I think you can Google and the city of Italy can tell you when a strike will happen. Have been going to Italy for many years, so have learned a lot 🌻"}, {"username": "Gina Rovello Keenan", "comment_text": "depends on your options. Out of Philadelphia the only option is evening. Our flight to Venice leaves at 7:30 PM and arrives at 9:25 AM Italy time."}, {"username": "Colleen Dawson", "comment_text": "Presuming you are flying from the USA, most Transatlantic flights will be during the night.Returning\nto the USA the flights are usually during day time."}, {"username": "Leslie Goodland", "comment_text": "Don't forget your visa."}, {"username": "Renae Larcus", "comment_text": "Either way, you will not feel rested when you land. We are in the Southwest and usually are on an early flight, but. It always. Many transatlantic flights are at night."}, {"username": "Wendy Spano Bracco", "comment_text": "I pick a 5pm because I like to arrive at 7am or earlier. I’m in NY."}, {"username": "Gregory Smith", "comment_text": "You are basically screwed unless you can afford business class. I’d get in earlier and book your hotel the night before so you can go straight to your room. Get a short nap and and a shower and try to get onto local time. No nap if possible."}, {"username": "Daisy Yoo", "comment_text": "I always try to get to my destination earlier try not to be at night (sometimes u can not avoid it), I never have jetlag bc I sleep on the plane"}, {"username": "Karen Trom", "comment_text": "We use the app Timeshifter and it really works. We fly overnight and hit the ground running.\nDon’t think about what time it is at home. Immediately adjust your thinking to local time."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "We left so we got there in the evening. That way we could go to bed and wake up fresh. It seemed to work quite well"}, {"username": "Chris N Lynn", "comment_text": "Download the timeshifter app. Leave at 7pm ish and land around 7/8am. Timeshifter will get you to change your sleep schedule two days ahead getting you to fall asleep on the plane and alter your circadian rhythm."}, {"username": "Lauran Cantwell", "comment_text": "You're not really going to have much of an option. 90% of flights to Europe leave late afternoon/\nearly evening and arrive in Europe in the am. There are exceptions of course but this is typically the rule."}, {"username": "Alicia Cox", "comment_text": "You will be tired either way. Just pick the most direct flight or the one with the best price. When you arrive, keep it moving, eat an early supper & go to bed early - like 8 or 9 pm. Then next day you should be on schedule. DONT nap in the afternoon after arriving, just keep going, but don’t plan any big excursions your arrival day."}, {"username": "Amy So", "comment_text": "We arrived Venice at 11 am. Got to our hotel and dropped off luggage and started visiting sites. We were fine and slept good(except I had to take ambien the entire trip)"}, {"username": "Leigh Church", "comment_text": "Try fly over night- arriving early evening is horrible from my experience"}, {"username": "Nancy Day", "comment_text": "As of 2024 you need “authorization”\nthey say cost $7.00 but no one knows much about it and not available to fill out and get it done .Another screw up by our government no implementation policy.Wonder if going to push it back again (originally was going to be implemented yrs ago but covid happen)"}]}, {"id": "2209545052777906", "text": "Do I need an International Drivers License to rent a car in Italy? Also, did you make your reservations prior to leaving or just pick request one at the airport? We will be flying into Naples.\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2209545052777906/", "likes": 3, "comments": [{"username": "Karen Landini", "comment_text": "I never count on having a car available at any airport. Make a reservation and look at the company requirements for renting."}, {"username": "Paula Rosati", "comment_text": "You need international drivers permit. If you’re USA then AAA can provide one. Mine is good for a year and cost was reasonable, definitely less than $50"}, {"username": "Carole Tarlap", "comment_text": "YES.....Google it and you will see the LAW and FINES if pulled over or in an accident 💥 NOT worth the risk 🤷"}, {"username": "Jennifer Lynn Davis", "comment_text": "You don't want to drive in Italy. Js. Lol. Those taxi drivers are terrifying."}, {"username": "Jessica Stewart", "comment_text": "Yes and go to your local AAA it took my husband yesterday 20 min in and out with it in hand"}, {"username": "Tyffany Tubajon", "comment_text": "I got my International and I booked a car in advance."}, {"username": "Carrie Stallard", "comment_text": "If you reserve a car let them know if your flight is over 30 minutes late. They gave our car away and didn’t get our money back because we did not notify them that our flight was delayed"}, {"username": "Tony Campanella", "comment_text": "In our experience, you don't need the IDL to rent a car. The rental car company didn't care that we had our IDL. However, you DO need it to drive. We always reserve the rental before we get there. In our 5 trips, we were never stopped, until our last trip. Carabinieri doing random checks in Sicily."}, {"username": "Sonia Scotto Lubrano", "comment_text": "You technically need it to drive however they never asked for mine at the rental car places in Napoli airport\n\nI would reserve it\nESPECIALLY if you don’t know how to drive a manual car."}, {"username": "Janet Messanelli Bozzone", "comment_text": "You ~should~ but the place we rented a car from didn’t care. Some do! It is good to have in case you are stopped by the police or get into an accident. $20 plus the cost of a picture (which was free for me being a member). No appointment. Ready in about 10 minutes. I would advise you to have one."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Definitely need an international license. I was there in June and rented at the Naples airport and they asked for it."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "Yes. I got it in like 15 min at AAA. They asked for it in Naples but not in Perugia. Just an FYI"}, {"username": "Debra Quinney", "comment_text": "Depends where your coming from if from the UK no"}, {"username": "Sande Ricci", "comment_text": "Yes."}, {"username": "Mike Guluk", "comment_text": "There will be all kinds of comments but there is only one answer NO NIEN NIENTE NON NOTTA"}, {"username": "Cherie Coe", "comment_text": "Quentin Coe"}, {"username": "Tracey Fairbrother", "comment_text": "If you're American yes UK no"}, {"username": "Gillian O'Callaghan", "comment_text": "Depends where you live so perhaps edit post....."}, {"username": "Glenn Todd Webb", "comment_text": "Don’t need IDP to rent a car, need one to drive though. Better reserve car ahead of time."}, {"username": "Colette Guerriero", "comment_text": "Is an Irish license just as good as an international 🤷🏻‍♀️"}, {"username": "Sherilyn Adler", "comment_text": "Does AAA only provide that service for members?"}, {"username": "Bob Dook", "comment_text": "It is not really about renting a car with or without an Intl Driving Permit (note not Licence), as some agencies ask and some don't. What is more important is the Police. If they stop you and you do not have an IDP, you could suffer a heavy fine. For me, not worth the risk. IDP's extremely cheap anyway."}, {"username": "Joshua Pickles", "comment_text": "FIRST, it’s not a license it is a PERMIT. You don’t need it to rent a car but you are required to have it if you get stopped by the police are are in an accident. It’s only $20 at AAA and you don’t need to be e member. The fine is a lot higher."}, {"username": "Rebecca Korpershoek", "comment_text": "Regardless if other’s experience, if your from US or AUS etc (basically not in Europe) than yes by law you need to get a IDL to drive in Italy and have that plus your drivers license on you while driving. It can be done online and costs are minimal, just get if your intending to drive"}, {"username": "Cris Wimer", "comment_text": "Yes, and highly recommend reservation if want automatic car which I would recommend due to steep hills in towns."}, {"username": "Giovanni Pianigiani", "comment_text": "Not if you are German... Or Spanish... Or French\nOr should everyone just assume you're American?🙄"}, {"username": "Alexandra A Welker", "comment_text": "Walk, walk, walk and you'll definitely stumble upon gems in Fira town, Oia, and Imerovigli."}]}, {"id": "2209634412768970", "text": "I was in Italy for 25 days in late May and June. While I loved it, I took too many day tours which with the heat and trying to keep up with the tour guide (my body kept reminding me I’m not 20 anymore or 50 for that matter). I also moved cities too many times (Rome, Naples, Florence, Como, Trieste, and Venice). I am planning to return next spring for 4 weeks - likely mid/late April to early/mid-May. I am focusing on Northern Italy and thinking of staying in 3 or 4 cities and taking trains to neighbouring cities to explore on my own. At the moment I am thinking of Genoa, Bologna, and Udine or Trieste as my base cities. From Genoa, I was thinking of going to Cinque Terre - maybe to walk through all or take a boat trip. I was also thinking about Lucca but think that may be too far to go to and back and have time to explore. That brought up the idea of staying less time in Genoa and staying in Lucca for a few nights on the way to Bologna. And then I think I didn’t see all I wanted in Florence so maybe a few in Florence and go to Lucca from there. Most of the time I would spend in Bologna and take the train to Modena, Parma, Verona and other cities in the area. I missed a lot of what I wanted to see in Trieste so am working out which city to stay in Udine or Trieste. Does this sound reasonable or am I trying to pack too much in again? Does anyone have recommendations for places to stay, possibly B&B or apartments? I am a solo traveller so don’t need a big place and not going to have a car so needs to be somewhat central. Suggestions for self-directed walking tours or those aimed at slower walkers?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2209634412768970/", "likes": 12, "comments": [{"username": "Betty Stilt", "comment_text": "5 nights in each city is what I aim for."}, {"username": "Laura Piccinini", "comment_text": "I would do, 4 days in Bologna\n1-Bologna\n1-Modena and Castelvetro Hills ,also Maranello for Ferrari if you like\n1-Ferrara\n1-Parma and reggia di Colorno\nFor all of those you can rent a car ,Will be very Easy tu go around and Explore Hills (lot of castels )\nAfter Bologna i would go to Dolomites! I would stop in Verona and Garda Lake along Road and then stay in\n2 night in Bressanone with daily trip in Selva di val Gardena (sasso piatto,sasso lungo) and other Daily trip in \"rifugio delle Odle\" in val di funes.\nFinally some days,maybe 2 or 3 in Val Pusteria,seeing\nBraies Lake ,Dobbiaco ,San candido and 3 cime.\nYou Will Need a car,but really awsome,lots of UNESCO site 😊"}, {"username": "Sande Ricci", "comment_text": "My husband and I were in Genoa this past May as a small part of our trip. We loved it so much we're going back in September of 24 and spending 10 days there taking day trips or an overnight trip."}, {"username": "Gary W Anderson", "comment_text": "You’re all over the place on base cities and towns. Cinque Terre is a series of 5 towns stay in one walk the others, take the train to Florence it is very central and easy access to Tuscany and Siena day trips, Milan is relaxing and access to the Dolomites. Go to relax, learn and be at awe. Travel safe, eat well and enjoy gelato."}, {"username": "Lucrezia Folger", "comment_text": "Easily way too much. Just reread your post. You're doing the same thing."}, {"username": "Al Filizetti", "comment_text": "I had 3 week end of May into June. Had 2 Airbnb’s . One in Ranzanico by the alps located on lake ￼Endine. The other which we used as home base was located on a hill overlooking Vineyards in Castelfiorentin\no in the Tuscany area south of Florence. From there we had access to train station. We went to Rome, Venice, Florence, and Pisa. We couldn’t have done it without a car. ￼As we were out in the country and getting groceries and other supplies we couldn’t do it without the car plus we would park the car at the train station. That way we could come and go as we wanted."}, {"username": "Sigrid Cormier", "comment_text": "Input your city and he has very clear interesting walking routes with options. We’ve downloaded his app. Hope this helps you. And have a lot of fun.\nhttps://\nwww.gpsmycity.co\nm/"}, {"username": "Beth Searight Millar", "comment_text": "Some very interesting ideas but I will not be having a car. This limits some of the places I could see but I want to stop for lunch and enjoy a glass of wine or beer and don't relish searching for parking. To be honest, the traffic I saw last spring did not look like something I wanted to partake in."}, {"username": "Pegi Fuller", "comment_text": "Check out this B&B. It is near Lake Garda. You can arrange private tours with Anna and her husband Jacques. She also teaches cooking classes. They speak several languages including French & English as well as Italian. They are lovely, sweet people! Check it out\n\nhttps://\nwww.villasanpiet\nrobylakegarda.c\nom/\n\nIf you communicate with them, tell them I sent you lol!"}, {"username": "Lucrezia Folger", "comment_text": "Less is more. Even 4 base cities is too much."}, {"username": "Valerie Nicole", "comment_text": "You could always stay in one place like Florence and take day trips out to most of these cities that way it’s not as much moving. You can take the train from Florence to a lot of the ￼ cities you have mentioned."}, {"username": "Heath Conn", "comment_text": "Your story somewhat mimics our story. Now, we go somewhere and stay a little extra time with the majority of time walking around, eating gelato, and drinking red wine. Pursuing the beautiful art of idleness and falling into the Italian vibe.\n\nAll of the big towns up north are wonderful. Turin is underrated. Sicily is amazing."}, {"username": "Laura Uribe", "comment_text": "We stay 4-5 nights in most cities. Occasionally we drop down to 3. We usually only do one or maybe two day trips per city maximum. You could easily spend 3 days in Cinque Terre. And spend time hiking between the cities if your health permits. It’s such a beautiful view."}, {"username": "Deborah Larsen", "comment_text": "Trieste over Udine, for sure. IMHO."}, {"username": "Rose Turdo", "comment_text": "The best way to travel through Italy and get the most of it is to rent a car and drive at your own pace. Do not pre-book anything, appointments are not for vacation.\nDay trips only double your travel time backtracking."}, {"username": "Ali Everson", "comment_text": "We were based in Genoa for 3 months. Fantastic authentic experience. 👏 🤗💖"}, {"username": "Phyllis Flowers", "comment_text": "Seems like too much I realize you want to see as many places as possible. If I was going for a month I would pick 4 places only and insert lots of time to really take in each place"}, {"username": "Simona Pollak", "comment_text": "Just stay in one place, Lucca and enjoy the daily life there, for 4 weeks. You can take day trips to 20 miles away little towns by bus, the places you didn’t mention but you will soon find out once there. You can see the rest of the famous cities you mentioned in a guide book. But to feel the place you need to live there. You need 6 months for Trieste to understand it. So is every city like that."}, {"username": "Wilma Resta", "comment_text": "Always stay 5 days in wach city and get to know it more. Enjoy!"}, {"username": "Amanda Rogers", "comment_text": "Hi - I’m just back from an amazing holiday - solo female traveller. Not too far from Genoa is Santa Margherita Ligure. I stayed there for 5 nights. Incredible beyond words. Recommend Sabini Rentals. This property is owned by a brother and sister who were so helpful and property was in a perfect location and clean. I stayed in Genoa for 4 days - although thoroughly enjoyed - SML was magical. From SML I had 5 nights in Monterosso - there I travelled Cinque Terre. There are no words to describe the beauty - serene, magical, breathtaking…… enjoy everything 😀"}, {"username": "Jim Hash", "comment_text": "We spend 30-45 days twice a year in Italy. All of the places you’ve mentioned are beautiful, but need time to enjoy. You should consider two base cities and spend time learning about them and enjoying them. From each base city we would recommend one or two day trips to cities you haven’t been to before. These trips would be reconnaissance visits for possible base cities on future trips. Our sweet spot is Florence but any of the cities you’ve mentioned could turn out to be yours.\n\nGo slow, talk to locals, drink it all in with your eyes and ears and of course drink an Aperol every afternoon. Hydration is an important part of an Italian lifestyle."}]}, {"id": "2209554269443651", "text": "Anyone in Italy know what is going on with Bologna - Florence train line? We've been stuck in Bologna for 3 hours. Flying home from Rome tomorrow!!", "link": "facebook.com/groups/1373361046396315/permalink/2209554269443651/", "likes": 1, "comments": [{"username": "Tania Lyons", "comment_text": "F"}, {"username": "Padmini Rajagopalan", "comment_text": "There was a bomb threat last night that was resolved. Some delays today as a result of that."}, {"username": "Paul Anderson", "comment_text": "You can always rent a car."}, {"username": "Irene Estlund", "comment_text": "Abigail Massey & Edward Massey is this what affected y’all?"}, {"username": "Allison Taeger Wilson", "comment_text": "We were delayed almost 5 hours in Bologna. Not a pleasant situation, very limited information on what was happening. Everyone behaved well but 5 hours is along to wait on a train\nAnyway we were finally released travel around 1230 am and made it to Rome around 3 am. Lots of time for our afternoon flight home."}]}, {"id": "2209591222773289", "text": "Question, we are working on our Sorrento stop for our October itinerary, is this trying to do too much for the time we have, family of five.\n\nIn Sorrento we have a half day when we check in and two full days.\nDo we...\nDay 1- half day- arrive in Sorrento, check out town for the afternoon\nDay 2 full day - take a driving tour up the coast that stopsआणखी at positano, Amalfi and revallo. (7-8 hrs)\nDay 3 full day - take a boat tour to Capri (6-8 hrs)\nDay 4- Head back to Rome.\n\nOr do we omit one of these full day tours and spend a day in/around Sorrento?\nAlso, private tours vs group tours, any preferences?\nThank you, appreciate all of your insight!", "link": "facebook.com/groups/1373361046396315/permalink/2209591222773289/", "likes": 0, "comments": [{"username": "Jenny Payne", "comment_text": "Are you not going to Pompeii ? So worth doing, I organised a guide and we were picked up & dropped back at the station in Sorrento. If you go to Capri do the chair lift have to take a taxi to the next town was fun🌻"}, {"username": "Sigrid Cormier", "comment_text": "We are taking the small group tour (8pp) from Sorrento with a short boat tour of the Amalfi coast, then Amalfi, Positano and Ravello. Offer by both Viator and Get Your Guide.\nOur thoughts were, we cover what we really want to see and if we think that we haven’t seen all in Ravello (total 1hr 40min) we could go back independently the next day…..the only challenge is, Ravello is extremely difficult to get to by public transport, and private car/driver is terribly expensive."}, {"username": "Sigrid Cormier", "comment_text": "If you not every visited Pompeii, I really would highly recommend it. It’s an easy train ride from Sorrento, there is a train stop right in Pompeii. If you e never been I would suggest a tour, because it’s massive and the guide will give you background history. Take a hat or umbrella as there is no shade."}, {"username": "Kally Trahearn", "comment_text": "All sounds very doable, however, add Pompeii in there somewhere too. If you can get there as early as it opens and have a guided tour, you still have the whole afternoon free for mooching around in Sorrento.\nAlternatively, do it on the way back to Rome."}, {"username": "निनावी सहभागी", "comment_text": "Thank you all for your replies!\nIt’s overwhelming at times trying to plan everything lol\nPompeii is definitely a consideration, we were thinking of stopping there on our way back to Naples.\nOnly wish we had more time ; )"}, {"username": "Shelley Frise", "comment_text": "It also depends on if the boats are running. We wanted to take the ferry to Positano but due to the high winds no boat tours were available. Do we spent the day in Pompeii which should not be missed if you are in the area"}, {"username": "Jaclyn Kastrava", "comment_text": "That’s pretty much what I’m doing for an itinerary next sept."}, {"username": "Jayne Dawn Richardson", "comment_text": "Sorrento is a great holiday destination so you need to actually see it and enjoying!"}]}, {"id": "2209596696106075", "text": "Hi. Has anyone been to Cinque Terre in the winter months?", "link": "facebook.com/groups/1373361046396315/permalink/2209596696106075/", "likes": 0, "comments": []}, {"id": "2209600769439001", "text": "Hi! Can anyone recommend a good phone back-up charger? Took a Belkin to Africa last year, and it was great. But now it is not working. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2209600769439001/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/3qnhTiu"}, {"username": "Sharon Menegoni", "comment_text": "clutch"}, {"username": "Dann Hrusch", "comment_text": "Anker has always worked great for me and has a pretty wide range of products."}, {"username": "Chris N Lynn", "comment_text": "Portable Charger Power Bank... https://\nwww.amazon.com/\ndp/\nB091BSG9GS?ref=p\npx_pop_mob_ap_s\nhare"}]}, {"id": "2209610592771352", "text": "Considering a trip to Italy next summer. I will have a 2 and 4 year old. Am I out of my mind or is it possible to have an enjoyable vacation under these circumstances? Lol", "link": "facebook.com/groups/1373361046396315/permalink/2209610592771352/", "likes": 8, "comments": [{"username": "Christine Ann", "comment_text": "I just returned from a trip there with my 17 year old. It was difficult enough with him. Definitely not a great trip for littles"}, {"username": "Dixie Kotylak", "comment_text": "Really hot in July….with toddlers I honestly wouldn’t recommend it…. 🤷🏼‍♀️"}, {"username": "Elizabeth May La Duca", "comment_text": "Not a good idea"}, {"username": "Dina Veneziale Horn", "comment_text": "My kids first went when they were 2 & 3. When we were in Rome it was 106 degrees and we all had a blast. We also traveled to the Amalfi coast, Pescara and to my hometown in the Molise region. I say why not and start them young!!!!"}, {"username": "Irene Oda", "comment_text": "June through August it's incredibly hot. It really depends what you envision to be a holiday. Do you plan to stay in one place and explore or do plan to be on the move?"}, {"username": "Tom Manno", "comment_text": "Yes, and no."}, {"username": "Gillian O'Callaghan", "comment_text": "If you can go in April and early May, or September then do it."}, {"username": "Annika Banks Taylor", "comment_text": "I would say 100% don’t take them"}, {"username": "Rachel Tillman Cornish", "comment_text": "We travel all the time with our two young kids and started when they were babies. You need to adjust your idea of great travel if you’re hoping for lots of rest and long days in museums, but you can do it and everyone will think it was amazing, especially several months after you return."}, {"username": "Ashley Tardi-Salzo", "comment_text": "We are going this summer with our 6 and 3 year olds and we planned the trip for them.. beach day, pool day, boat tour to beaches and swimming, ice cream making, farm with animals and pizza making - they are really excited for it all ( Sorrento / Positano and then going near our family in a small town outside Napoli)"}, {"username": "Lexie Enlow", "comment_text": "Taking my 18 month old in 2 weeks 🙂\n\nI suggest kid friendly travel groups such as Italy with kids -Travel Ideas and Advice or Travelling With Babies And Toddlers\n\nMuch more positive vibes about traveling with children 🙂\n\nSome people don’t have the option to leave their children with family. I find the comments to “leave the kids with grandma” to be insensitive and offensive personally."}, {"username": "Lucia Nayeli Ramirez", "comment_text": "My brother and sister in law went to Italy with my niece and nephew, age 3 and 7 at that time. They went to Rome, Venice, and another city I can't remember. They rode the train and let me tell you, seeing the pictures of my niece and nephew stuffing their faces on gelato was priceless. It was my sister in law's dream to go to Italy and who else to share that experience than your husband and kids. Core memories for sure. I say go for it! Just plan very well and you guys will be great 🤗"}, {"username": "Laura Torres Palomino", "comment_text": "They won’t remember or appreciate it… but if you can afford it go for it."}, {"username": "Kathie Lehane Melia", "comment_text": "We can’t wait to help, Molly Phong!"}, {"username": "Joanne Wright", "comment_text": "Honestly? I’d say no."}, {"username": "Martha Lee", "comment_text": "It depends on what you consider enjoyable. Its going to be hot. I wouldn’t find that enjoyable with little kids"}, {"username": "Stephanie Osborn Rushing", "comment_text": "No way, we brought our 11 year old and was perfect age. She is interested in learning and reading about everything but not too teen yet that she is annoyed with us. Has been working great so far!"}, {"username": "Simona Santabarbara", "comment_text": "Absolutely go! Traveling with children is a wild ride, but it’s totally worth it! They may not remember, but you will. And the experience becomes a part of them as global citizens."}, {"username": "Laura Barnes-Hirst", "comment_text": "We go on Monday to cecina Town in tuscany on the coast . We're staying in a holiday home with a private pool and large enclosed gardens with slides and things for the children , the host is providing a games console and bored games too! My youngest child is 21 months old, the eldest will celebrate her 21st birthday there and my 40th that week and i have other children in between! We wanted to experience italy as a family and didn't want to wait any longer! Who knows what's around the corner? Make these amazing memories now and take plenty of photos to show the younger children when they are older . We intend to catch the 30 minute train to pisa on one of the days and visit the aqua place in cecina at some point too, other than that there's the beach and chilling at our large holiday home by the pool and with the bbq facilities they provide 😀 good luck! X"}, {"username": "Amanda Conradie", "comment_text": "Out of yr mind. You will NOT enjoy yr trip. It is not selfish to take time 4 yourself and leaving kids at home. I did it once, never again"}, {"username": "Melissa Ann", "comment_text": "People travel all over the world with little kids. I recommend joining Italy with kids -Travel Ideas and Advice, you will get much better ideas to go with little kids."}, {"username": "Phyllis Snyder", "comment_text": "I would go to an area where there’s less traffic, crowds and headaches!"}, {"username": "Rhonda Dinzey", "comment_text": "Are you going multiple places or staying in one?"}, {"username": "Flavia Di Bello", "comment_text": "I’ve been travelling to Italy multiple times a year with my kids since they were respectively 2 and 3 months old. We’ve been to Tuscany/\nUmbria, Sicily, Puglia, Calabria and endless times to Naples/Amalfi Coast/Cilento and Ischia (my parents live in Campania, I was born in Naples). Happy to share tips! I would just avoid peak summer months (July and August) as it can be unbearably hot if you are not used to it. Unless you visit the north where temperatures are a little milder.\nWe are about to travel up north to the Alps to Andalo, a holiday resort town in the mountains specifically catering to families. Just another option to consider 😊\nFeel free to ask if you have specific questions!"}, {"username": "Annalisa Shulde", "comment_text": "Ive done it many times, granted i stay in one place and have a kitchen and laundry…essenti\nal with kids. I suggest to stick with one location, rent a car, and take short day trips from your location. Half your “vacation” will be planning meals, shopping, cooking. Just like any other place you’d go with children. The only difference is that you are in Italy, the most beautiful country in the world. Still, it is worth every second! Have fun!"}, {"username": "Lindsay Storry", "comment_text": "We just got back from our trip with a 6 year old. She is still speaking the Italian she learned while there. The locals were so good to her and I found she opened up so many different opportunities to interact with locals. It was a wonderful experience for us all - I say go for it!"}, {"username": "Kejdi Okej", "comment_text": "If you can go in april and early may .or September then do it ."}, {"username": "Karen Losey", "comment_text": "Well, I am doing it in the middle of the hot summer, with all the tourists and the crowds and all the blah blah blah! We will go and take everything Italy has to offer to us! You only live every day, and it is not fair to put off traveling just because you have small children. Children are resilient and they will adjust you fine. Please go and report back 😊"}, {"username": "Alicia Cox", "comment_text": "I personally would not take children that young, but that’s me. I’d go when they are a little older & can remember & appreciate it."}, {"username": "Melanie Fay Wais", "comment_text": "Only if you go with another adult. That is too much for one person."}, {"username": "Eugene Klein", "comment_text": "Will it be enjoyable? I doubt it 🙂 But you can make it less painful. But seriously, please keep in mind: it will be very HOT and very CROWDED. So, do not make too many hotel changes, plan with little kids in mind. Where do you plan to go?"}, {"username": "Pauline Newton", "comment_text": "I love Italy and travelled there many times before I had a child - and then I WAITED- Italy was still there and my 11 year old enjoyed it- I think NO! And not in summer!"}, {"username": "Lee Hostettler", "comment_text": "Italians absolutely love children.\n\nBut I don’t think I would do it in the middle of the summer. With little kids you don’t have to wait until they are out of school so I would choose another time to go, November - March\n\nStay outside of Rome or Florence and take a train into the city\n\nFind a wonderful small town where you can become part of the community and make day trips\n\nEverything is less expensive, ￼ less crowded and ￼ if you’re near Roma, the temperature is wonderful"}, {"username": "Victoria Moorhead Murrow", "comment_text": "The first option."}, {"username": "Breianna Ceccattini", "comment_text": "I am here now with children the same ages, plus a 7 month old.\nSecond time to Italy, first time we came we had no children and did all the tourist things. This trip was purely to visit family we have here so it’s been pretty chill and how I would think any holiday with kids would be. Some days have been difficult, especially if walking is involved (my 2 year old hates walking).\nHowever, I did say to my husband that I wouldn’t want to be doing touristy things such as Rome with the kids at this age, I think it would be hard, they would just have no interest and be bored."}, {"username": "Dawn Falsinotti", "comment_text": "I would say No. While Italians love children, I don’t think you’d have much fun. It’s very draining plus also very hot."}, {"username": "Gabrielle Anastacia", "comment_text": "We are currently here with a 16 month old. Only one child so can only comment on that. But We travelled around Tuscany in a car for week which he loved as we had a pool in two places we stayed. We then did Florence for 5 nights which wasn’t as chilled as it was more city but we found a few parks and he loved watching what was going on. We are now in Bologna for two nights. I would say the Tuscan countryside is more suited for children than cities but I am so glad we have done it."}, {"username": "Laura Fournier", "comment_text": "It really depends on you and your kids. I can't imagine trying to fly with two toddlers and trying to see the sites would be exhausting . Have you done any smaller trips with them?"}, {"username": "Daniela Parhar", "comment_text": "I took my 3.5 year old to Florence, Rome and Cinque Terre and had an amazing time! You can make it enjoyable. We used Hop in Hop offs and loooots of gelato as brine. My husband did have to carry the stroller up and down many stairs but that was the only downside of it. Don’t stress and enjoy it!"}, {"username": "Molly Phong", "comment_text": "Doing it in 40 days with a 2 year old! Luckily we will have lots of help but will let you know 😉\n\nI keep telling myself that life doesn't stop just cuz I have a kid. V much looking forward to it!"}, {"username": "Kristina Ruk", "comment_text": "Well it is question more are you ready to travel with 2 kids.. I have no problem with traveling we went even skiing with 1.5years and 4 years..so its more how parents handle excaustic kids and how kids feel in not home situation ;)"}, {"username": "Cindy Sguazzin", "comment_text": "Hi! Canadian Teacher here! Husband’s family from Friuli. Spent many glorious summers with two kids at Lignano—beautif\nul long sandy beach— also Grado or Bibione! Lots of apartments or room with kitchen to make snacks or light meals—lots of nice restaurants! Kids adored these days summer days!"}, {"username": "Linda Mascaro", "comment_text": "Too hot and crowded for little ones!"}, {"username": "Linda San Paolo", "comment_text": "I would advise you not to take small children..... it's hard enough to get around on your own. Enjoy!!"}, {"username": "Peggy Fisher", "comment_text": "Just do it!!! Who knows when it will be available to you again . Beautiful country. Don’t put off life. ❤️"}, {"username": "Pam Gerretsen", "comment_text": "Absolutely you should do it! Maybe think about one location, find somewhere with a kitchen and a bbq, so you can enjoy the evenings when the children are asleep. Umbria/Tuscany is perfect, lots of little villages and towns to go for day trips and experience Italy without major stress, and Lago Trasimeno is good for swimming - it's really shallow so perfect for small children."}, {"username": "Sshona Ssmillie", "comment_text": "It depends, would you pick a place you want or your kids would like. Years ago we went to the Turkish holiday village. Basically Butlins in the sun, my kids loves it, the water parks, the slide, the flumes the outside night time entertainment. I would never go back without really young kids but I would highly recommend it to people with young kids. My kids would have been 3 and 5. Never been to the Gardaland doesn’t read very italian but probably the nearest thing they have to a holiday resort"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Leave the kids home until they are older."}, {"username": "Allison Ahroni", "comment_text": "Going with a 6 year old and 3 year old soon. Happy to report back 🙂"}, {"username": "Michelle Krogsgaard", "comment_text": "Go to a beach town. Summers are hot."}, {"username": "Stephanie Evans", "comment_text": "I went to Italy last year and couldn’t imagine having my kids there especially that young. I hope to bring them in their teens."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Yes crazy, especially in the summer. Don’t do it. The only way to travel to Italy with young children is to rent a villa and bring a nanny."}, {"username": "Chelsea Gudith", "comment_text": "Just got back- we left my 2 year old at home, thank GOD. My 9 year old came with us, and while I’m happy we gave her the experience of a lifetime, I wish it would have just been my husband and I. I did not find it enjoyable… dragging around her luggage. Listening to her complain about her mosquito bite.\n\nAgain, glad we took her because I know she’ll remember this forever, but I prefer almost anything without kids if I really want to enjoy myself.\n\nI’d leave a 2 and 4 year old home for SURE"}, {"username": "Rebecca Yeoh", "comment_text": "I did it 🙋🏻‍♀️! In honest opinion it is hard so if you are going to do it then set yourself up well. Summer is HOT over there. Base yourself somewhere for at least 5 days at a time and make sure there is somewhere to swim. Surrender to the fact that you may not get to see the things you want to see. I took my young children to England and Tuscany (from Australia). The Tuscany trip was hard bc I wanted to see it all but it was hot and my kids were not interested in doing anything much more than staying in the pool."}, {"username": "Avril Samuel", "comment_text": "I’d hire a car and stay in an agriturismo with a pool south of Florence and then take day trips to Florence and the wonderful little villages that surround it."}, {"username": "Dani Stewart", "comment_text": "Oh my goodness yes they will be amazing I took my eldest at 10 months- we are going next year with all 4 children"}, {"username": "Magdalena Graywolf", "comment_text": "Why? I mean obviously you can but why travel with that age? They'd enjoy much more a long weekend at grandmas than Italy"}, {"username": "Robin Anderson-Keller", "comment_text": "Nope! A lot of expense and not much fun for anyone. Especially you. Even the teenagers we saw were totally bored."}, {"username": "Marti Campbell", "comment_text": "Entirely too hot and crowded. The children are too young"}, {"username": "David King", "comment_text": "I often wonder what people with very young children are thinking when traveling to Italian cities and towns…\nThe major considerations include that the weather is incredibly hot in summer; there is a massive amount of walking; even with strollers, it’s hard since none of the sidewalks are even and sometimes cobblestones, if there are any at all—as in Tuscany."}]}, {"id": "2209605282771883", "text": "Hello everyone, We are leaving in month for our trip of a lifetime to Italy. I wanted to ask should I have an app or an iPad or some kind of technology for our trip. I know all about power adaptors, I am asking about train, city or water taxi apps or even city guides.\n\nThanks in advance on your reply.", "link": "facebook.com/groups/1373361046396315/permalink/2209605282771883/", "likes": 12, "comments": [{"username": "Janet Messanelli Bozzone", "comment_text": "Smart phones are great but I bring my chromebook as well."}, {"username": "Laura Uribe", "comment_text": "I use my iPhone a lot. This year I’m not taking a tablet for the first time. Can do everything from my phone so it’s crazy to drag extra weight!"}, {"username": "Paula Rosati", "comment_text": "If you don’t have one, research power banks. All the map apps drain batteries quickly."}, {"username": "Basia Szokarski", "comment_text": "If you have a good smartphone then you should be fine."}, {"username": "Pietro Di Sorbo", "comment_text": "I would say don't take IPad or notebook, if you have bring a good camera for taking high quality photos.\nPhotographing the beauties of Italy with smartphones is an injustice."}, {"username": "Mary Agozzino Derrick", "comment_text": "You'll want WhatsApp & Google Maps your cellphone will be what you need"}, {"username": "Valerie Collanton", "comment_text": "The Fork app for restaurant reservations was very useful."}, {"username": "Wendy Spano Bracco", "comment_text": "I take my iPad as my backup in case something happens to my phone. But I also watch Netflix in the plane. I could not do that on my phone."}, {"username": "Ken Lerch", "comment_text": "If you have a phone that can access apps, maps, schedules, can read bar codes, you should be ok. However, a tablet that can hold travel guides and novels so that you don’t carry books can be convenient. You also need to have photo records of all important papers including photos of prescription drugs."}, {"username": "Cindy Ann Muntz", "comment_text": "Just go with the flo I am here now researched for ages it all goes out the window. Just come enjoy and go what feels right at the time. Book the essential tours through the proper sites not through agencies and then just enjoy"}, {"username": "Pegi Fuller", "comment_text": "Apparently the app Flush is good for finding available restrooms Wish we had it when we were there last time! Lol!"}, {"username": "Mike Guluk", "comment_text": "If you are on Verizon, 100 for 30 days full phone and data"}, {"username": "Renae Larcus", "comment_text": "You would be wise to have the train app if whatever trains you are using. Also Uber, Bolt or app for whatever rideshare service there is where you are going."}, {"username": "Mary Anne", "comment_text": "Many places communicate thru WhatsApp (especially tours and drivers.) Take a portable phone recharger. We always take a power board to plug in phones, rechargers, etc as there is never enough PowerPoints in hotel rooms. Google maps is also handy. For trains we used Trainline app as it shows all companies. A weather app is also handy."}, {"username": "Stacey Miller", "comment_text": "Rick Steves' app"}, {"username": "Victoria Showmo", "comment_text": "iTaxi app worked great for us"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Frank Hunt", "comment_text": "Sim card, trainline app and log in to wifi as much as possible. Plenty of other good suggestions here."}, {"username": "Debi Sicurella Krulisky", "comment_text": "What about an app for taxis?"}, {"username": "Leigh Ann Fan Farmer", "comment_text": "We used Google Maps (lifesaver when walking around Venice), What’s App(a lot of our accommodations contacted us through what’s app), Trenitalia (if you are taking train), Yelp (for recommendations\non restaurants, businesses). there was also a taxi app in Rome but can’t remember it. Also as you plan to use all these apps, make sure you have international cellular service to use them. Phone is probably better to use than iPad. Easier size to manage. Have fun!!"}, {"username": "Lisa Szal", "comment_text": "Download the mobile passport control app to get back into US customs very easily. It is free and I got into LAX from France with only three people ahead of me. Genius."}, {"username": "Lisa Szal", "comment_text": "Trenitalia train app."}, {"username": "Lisa Szal", "comment_text": "Google translate"}, {"username": "Lois Heisler", "comment_text": "4"}, {"username": "Kelly Kummer Moss", "comment_text": "We used both Trenitalia and Italo Treno while there. We were told that Trenitalia was more “local” routes (think Florence to Pisa), but Italo Treno has the fast train for longer routes (which is awesome, by the way)."}, {"username": "William Blackburn", "comment_text": "Thank everyone!"}, {"username": "Rose Turdo", "comment_text": "Cellhire for wifi, Google Maps on phone."}, {"username": "Allan Olexa", "comment_text": "Citymapper, Google Map, Google Translate"}, {"username": "Francesca Giovanelli", "comment_text": "trenitalia.it is the website where you can check the train time table and buy the tickets. I suggest you to ask to your host/\nreceptionist for websites that can help you to organise your stay"}, {"username": "Rachel Cooksley", "comment_text": "MAPS.ME is good for having maps to use without internet. Just download the map of the places you’re going, before you go"}, {"username": "Chris N Lynn", "comment_text": "Italy is a large country. Where you will be will help people help you."}, {"username": "Jennifer Lynn Davis", "comment_text": "There are apps. The bed and breakfast that I stayed at gave me the apps that were best for Rome. So I would definitely ask the hotel staff what would be best."}, {"username": "Kally Trahearn", "comment_text": "Rome2Rio app is really good for travel options - try it before you leave to see how it works. It gives you options how on how to get from where you are to where you want to go and it gives you approx costs too. If you choose walking, it'll guide you there."}, {"username": "Kally Trahearn", "comment_text": "Also, Trenitalia is the train service - that's a good app to download"}, {"username": "Melissa Cortez", "comment_text": "Yes. I suggest it. It was very helpful for directions, bookings, etc."}, {"username": "Jose Velez", "comment_text": "Google maps is useful for restaurants, directions, bus & train schedules"}]}, {"id": "2209617022770709", "text": "Hello all,\nCan someone suggest nice restaurant near Colosseum for a birthday dinner?\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2209617022770709/", "likes": 0, "comments": []}, {"id": "2209617752770636", "text": "Hei, iam in naples right now. What is the best and cheap way to go from naples to capri or positano ?", "link": "facebook.com/groups/1373361046396315/permalink/2209617752770636/", "likes": 0, "comments": [{"username": "Joseph Damiano", "comment_text": "Best and cheap don’t exactly go together\nCheapest is the train from Napoli to Sorrento then bus to Positano\nBest is by car\nYou gotta work out if you wanna spend 10 euro or 150 euro plus"}, {"username": "Diane Davis Lawyer", "comment_text": "You can also do the ferry."}, {"username": "Tam Wong", "comment_text": "Have to do the bus ones just for the experience😂🤣😂"}, {"username": "Katherine Capizzi", "comment_text": "Best way to Capri is Hydrofoil fast but not so cheap. In the long run it gives you a full day to spend in Capri."}, {"username": "Flavia Di Bello", "comment_text": "Hydrofoil is the best value for money and the weather is good enough right now 😉 I’m in Naples too, have fun!"}, {"username": "Genevieve Bastien", "comment_text": "Check out Ferryhopper"}]}, {"id": "2209618566103888", "text": "My wife and I will be Belgirate on the west coast of lago maggiore for 3 nights in late September. We need to find a place for a couple of nights between there and Milan to finish our trip, although we do not want to stay in Milan proper. We will be flying out of Milan. Not really thinking Como, but open to all sorts of suggestions. ￼", "link": "facebook.com/groups/1373361046396315/permalink/2209618566103888/", "likes": 0, "comments": [{"username": "Pietro Di Sorbo", "comment_text": "Per la verità pensavo che ne avessero fatti già 4 o 5 di ponti sullo stretto, un tizio che da poco è venuto a mancare ci ha costruito 30 anni di carriera politica."}, {"username": "Andrea Bainbridge", "comment_text": "Stresa is a great town. Only 45 minutes from the airport"}]}, {"id": "2209621836103561", "text": "Has anyone stayed at hotel Artmede in Rome with their family? Is it required to have 2 rooms if it’s more than 3 people? I have 2 young kids and I would hate for my husband and I have to stay in separate rooms. I feel we can make accommodate but not sure if the hotel would charge more.", "link": "facebook.com/groups/1373361046396315/permalink/2209621836103561/", "likes": 1, "comments": [{"username": "Stella Kevin", "comment_text": "We did a few years ago. Had a junior suite very nice only downside was it faced the front of the building and the noise was unbearable"}, {"username": "Janice El", "comment_text": "Very nice hotel. We had 3 in a room, I’m not sure if they have larger rooms or not. Our daughter was given a small cot."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Try Pantheon Inn we had room for 4"}, {"username": "Karen Blackmore", "comment_text": "Hotel has a great rooftop bar and restaurant! As for rooms, website says they have junior suites which sleep 4. Other rooms do say Max 3 people"}, {"username": "Nidhi Khanna Bansal", "comment_text": "Thank you for the information"}]}, {"id": "2209630112769400", "text": "Please I need help...we have an iPhone 13 mini that is unlocked. I am so confused on esim's...do we just order one to download and when does it kick-in? Do we just leave the regular sim card in as well? We leave for Italy in 5 wks. 🤦‍♀️ thanks for any help", "link": "facebook.com/groups/1373361046396315/permalink/2209630112769400/", "likes": 2, "comments": [{"username": "Chris N Lynn", "comment_text": "Depends on the carrier what your options are:\nWe went without a plan and just lived off of wifi. Downloaded Citymapper and Google Maps for offline use. Same for google translate.\niMessage works off wifi.\nWe downloaded WhatsApp to communicate (via wifi) with others back home who didn't have an iPhone.\n\nGPS will work on your phone in maps.\n\nYou can choose a plan and it will work fine. Just want you to know the options."}, {"username": "Mario Torre", "comment_text": "Following"}, {"username": "Mackinzie Rekers", "comment_text": "I have an iPhone 13 with service through Verizon. We are using the Airalo. We downloaded the esim the day before we left and installed it at the Chicago airport using Wi-Fi about an hour before we took off but turned it off. Then once we landed in Rome we followed the directions to turn it on. It has worked well for us so far, we just arrived yesterday. iMessage has been working, if we make a call we'll use WhatsApp. Hope this helps, I was pretty confused on how it all works too. Just make sure you follow the directions and turn off the data roaming on your primary at home service. (The directions show how to do that)"}, {"username": "Laura Uribe", "comment_text": "Do you have Verizon? They have a great program that provides coverage for $100 per month."}, {"username": "Carole Tarlap", "comment_text": "Ask your provider 🤷🤷"}, {"username": "Judith Tobin", "comment_text": "My plan for my upcoming trip is to buy an eSIM mainly so I can access data if I need it. I believe I keep the physical sim in the phone but when I initiate the eSIM I will get a new number for the duration of the trip. I’ll use wifi mainly. Roaming costs for a long trip are ridiculous and I’m not worried about missing calls f eg from home. Many are spam and friends know how to reach me."}, {"username": "Jenny Payne", "comment_text": "I have tried one for Italy last year and was costly , so I have a 2nd phone so used a sim from Italy from the Tim shop , google what the costs are & I photocopied it so I could show them the one I want to pay. Telstra & Optus both do deals , think it costs $5 per day 🌻"}, {"username": "Don Bussolari", "comment_text": "Go to Airalo pick your country . Down load the eSIM and install it, it will take a few minute to time out as it is looking for the country you picked which it cant find. Set it to off when done. When you arrive turn your primary phone off and your EU eSIM on. It is data only so Google, maps etc all work. Make sur Data Roaming is on on the EU eSIM. I usually turn my US number off before I leave so I don't accidentally activate it when I arrive."}, {"username": "Cris Wimer", "comment_text": "We are on a long trip and Maya Mobile with unlimited data was our best option. They sent very specific instructions on what to have on as far as settings. I had issue, emailed them and they answered immediately with the solution. (Something I did wrong)\nWe did the international plan with carrier because it was only $35 a month to keep phone number active. Was very limited on calls, texts and data, however….we could text other iPhones unlimited.\nUsed FaceTime for calls to family. What’s App to communicate with locals."}]}, {"id": "2209447072787704", "text": "Looking for reviews/suggestions/ personal experiences on the following hotels. Any feedback would be appreciated as I am completely overwhelmed planning this vacation😨. Thank you!\n\nRome: Boutique Centrale Palace Hotel\nCinque Terre: Paradiso Hotel\nFlorence: Room Mate Luca Hotel\nVenice: Ai Miri D’ Oriente Hotel", "link": "facebook.com/groups/1373361046396315/permalink/2209447072787704/", "likes": 0, "comments": [{"username": "Karole Owsley Matthews", "comment_text": "Nini Amato Riggs or Silvya Vitale Lewis…Can either of you provide any insight?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209317332800678", "text": "Did anyone stay in Best Western Plus Hotel Universo in Rome? Thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2209317332800678/", "likes": 2, "comments": [{"username": "Jim Painter", "comment_text": "Unless you're using points...why stay in a domestic US hotel. Get out, enjoy the local culture including cheaper Italian family owned lodging?"}, {"username": "Caroline Haraldsen Dadswell", "comment_text": "i stayed there in March. Decent location close to train station. I walked to all sights from there (I like walking).\nClean comfortable hotel.\nHotel Diana is across the street and also very similar."}, {"username": "Bambi Harris", "comment_text": "We stayed in the Best Western Art Deco in Rome and we are going to stay there again in a few weeks. We really liked it and it was in walking distance to Rome Termini and Trevi."}, {"username": "Darryl Vanstone", "comment_text": "We stayed there for 3 nights this summer. We loved it! Clean rooms, excellent service and a good location"}, {"username": "Gina Frainetti", "comment_text": "We stayed there in April and it was nice and clean. They have a great breakfast but certainly not a boutique style hotel. Rooms are small but so are all rooms in Europe"}]}, {"id": "2209638282768583", "text": "Mizurinalake", "link": "facebook.com/groups/1373361046396315/permalink/2209638282768583/", "likes": 2, "comments": []}, {"id": "2209643226101422", "text": "Hi all ! Newbie here! What are the must see/do in Florence and in Tuscany? Thx!!", "link": "facebook.com/groups/1373361046396315/permalink/2209643226101422/", "likes": 9, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nTuscany-Day-Trip\n-from-Florence-\nSiena-San-Gimig\nnano-Pisa-and-L\nunch-at-a-Winer\ny/\nd519-5070TUSCANY\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nFlorence-Accadem\nia-Gallery-and-\nMichelangelos-D\navid-Tour-Skip-\nthe-line/\nd519-31070P21?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Jessica Olivero", "comment_text": "San Gimignano!!"}, {"username": "Patricia Yeates", "comment_text": "Cinque terre, chianti wine region, Pisa."}, {"username": "Gary W Anderson", "comment_text": "The Uffizi, Academia (David), the Galileo museum, Medici palace and gardens, Duomo. A guided tour of Tuscany, a day trip to Siena and Ponte Vecchio at night, just for a few. A very walkable city."}, {"username": "Don Bussolari", "comment_text": "Florence is the capital of Tuscany."}, {"username": "Jason Hobel", "comment_text": "It all depends on your interest. The Tuscany region has a lot to offer. You have the museums throughout Florence and all the historical buildings and it is a very walkable city too. There are plenty of opportunities to take day trips from Florence if you decide to use as a base like San Gimignano, Lucca, Siena, Volterra among others. There are several winery tours that include tasting and food tours and well the possibilities are endless. Go in YouTube and watch videos of the region and see what appeals to you."}, {"username": "Linda Lindah", "comment_text": "Tuscany Vespa tour"}, {"username": "Juliette Sastrowitomo", "comment_text": "A roadtrip to Val d’ orcia avoid the main road. Assisi after visiting Assisi have a diner in Cortona. Aperitivo / wine tasting at\n\nhttps://\nwww.farmshoppizz\neria.com/\n\nif you're lucky, you'll also run into Sting in the Restaurant 😉\n\nVolterra and Castiglione Dela Pescaia\n\nEnjoy 🥰"}, {"username": "Leanne Jacobs", "comment_text": "You know what…. Just get out there and discover for yourself!!!! You’ll be glad you did"}, {"username": "Mike Alioto", "comment_text": "We really enjoyed Siena and Volterra, two really picturesque hill towns."}, {"username": "Jeanne Eliason", "comment_text": "If you are staying in Florence take a bus or taxi to Fiesole. We take a taxi there for about 30 euros, then get on the bus in the piazza and get off back in Florence. Google the town. It's beautiful."}, {"username": "Mike Pollard", "comment_text": "Walk around Florence. See David at Accademia. While in Tuscany go to San Giagmano"}, {"username": "Josh Pearce", "comment_text": "Amanda Pearce"}, {"username": "Ted Cabot", "comment_text": "Hi, the must do’s in Florence at the Uffizi to see the David, also I love the ancient instrument part of that museum, 500+ year old Stradivarius violins. Book ahead!! The best gelato in the city is Gelateria Santa Trinita, Aqua al due is great traditional Tuscan food, old school place.\nFor Tuscany, I highly recommend renting a car. You cannot see much without that. La dispensa is family owned in “Strada in Chianti” and one of the best lunches of my life, call for reservations and ask for Gregorio as he speaks English, his mom and dad do not. From there move on to “greve in Chianti” visit villa Calcinia wine shop there or book a tasting and tour ahead with them, the winery has been in the same family for 34 generations!! Be sure to visit the center of greve for a cool piazza and more great food and wine. Above greve is “panzano in Chianti” home of the famous Italian butcher Dario Cecchini. He has three restaurants to chose from in this tiny town, go for the uficio di bisteca, the office of steak option; amazing. Also all of the dinners start with apperativo on the street in front of the butcher shop, an experience all to itself!\nPM me for any other recommendations\n!"}, {"username": "Rosamaria Piccolo-Robison", "comment_text": "We absolutely loved San Gimignano with a tour of Torciano!!\n\nhttps://\nwww.torciano.com\n/en/"}]}, {"id": "2209645806101164", "text": "good morning Brains Trust........\nWe're spending a week in the Tuscany / Perugia region next May.\nWe'll be departing a cruise in Civitavecchia and heading to our base in Assisi.\n\nShould we take a train form Rome Termini, or hire a car from near the airport. (as we'll be flying out a week later.)", "link": "facebook.com/groups/1373361046396315/permalink/2209645806101164/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "you can take the car from Civitavecchia https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Dr-Jon Warnecke", "comment_text": "I lived in Perugia for 4 years, decades ago. Take the train to either Assisi or Perugia. Travel by car or train to your destinations from there. Enjoy!"}]}, {"id": "2209646096101135", "text": "Me and 3 girlfriends are planning Italy & Greece in May of 2025. We will be doing AirBnb's and i was curious when they say \"double bed\" do they mean queen bed by chance or is it a true double bed?", "link": "facebook.com/groups/1373361046396315/permalink/2209646096101135/", "likes": 1, "comments": [{"username": "Maria Brozou", "comment_text": "I Greece you have to ask specifically too. Most are queen to my experience but you never know unless you ask."}, {"username": "Eleni Koi", "comment_text": "The standard size of double bed in Greece is Width 140cm X Length 200cm. When you check with the properties make sure to clarify if you need a larger bed."}, {"username": "Kay Rendall", "comment_text": "I found that some doubles r what they call French double. We would call it a King single in Australia"}]}, {"id": "2209657932766618", "text": "For solo female travelers:\nWhat recommendations do you have for hotels, b&b's, etc:\nTraveling in Apr 2024:\nRome (6 nights)\nFlorence (4 nights)\nVenice (4 nights)\nWanting to stay in safe, nice areas close for walking to sites, close to bus, train, restaurants, etc. Affordable , not extravagant.\nAnd if anyone would like to join me on this trip , let me know. I plan to visit lots of historical areas, churches and museums that I missed on my first trip 20 years ago. Hubby and friends not interested so I am determined to go even if by myself!", "link": "facebook.com/groups/1373361046396315/permalink/2209657932766618/", "likes": 8, "comments": [{"username": "Maria Brozou", "comment_text": "avoid hotels near the train stations."}, {"username": "Leslie Goodland", "comment_text": "I just spent 10 weeks in Europe by myself. Trip of a lifetime. Use Booking dot com for lodging. Worked out well for me.\nFor Rome, consider splitting your nights in half and staying in different parts of the city. I did that, it was a great idea.\nGet a visa. New ordinance.\nHave a blast!"}, {"username": "Al Filizetti", "comment_text": "In Venice look at Hotel Bisanzio. An in Rome Hotel LaRovere."}, {"username": "Charleen Siegler Schuss", "comment_text": "Think about 2 nights in Venice and 2 in Siena. Rome Hotel Damaso, near Campo d Fiori, da Bruno near the Rialto in Venice. Have a ball."}, {"username": "Christine Robinson", "comment_text": "Michael Robinson x"}, {"username": "Ann Lombardi-Perkins", "comment_text": "I have never seen so many folks all going to the same places. No wonder the Italian people are getting a little cranky with the tourists."}, {"username": "Elizabeth May La Duca", "comment_text": "I recommend hotel castello, campo santi filippo e giacomo, Venice.. 3 minute walk from vaporetto stop=fermata San Zaccaria …get precise directions on Google Maps/\ndirections….grea\nt location, near St. Marks Square….price includes buffet breakfast in hotel’s restaurant & WiFi"}, {"username": "Diana Smith", "comment_text": "We did stay at the Memphis Hotel In Rome, very central! If you want to save some money stay in Vicenza and take the train to Venice. Is half an hr away but you will save a bundle. I forgot where we were in Florence because was years ago’… Have fun!"}, {"username": "Claire Dowson", "comment_text": "Have a look at Times Rime hotel. Everything walkable and felt safe."}]}, {"id": "2209650019434076", "text": "Hello guys. I am planning on going to Italy in January of 2024. It would be my first time traveling to Europe. I had initially planned the trip thru a travel agency but I think it would be way more inexpensive by booking everything by myself. Can you guys give me tips on how to go about where to stay, when to book the flight also do’s and dont’s? Thanks! The trip would be for 2 (boyfriend and I). Trip would be for about a week maybe a lil longer.", "link": "facebook.com/groups/1373361046396315/permalink/2209650019434076/", "likes": 4, "comments": [{"username": "Kristina Ruk", "comment_text": "Accomodation would recomend booking com. I just open map snd looking for convenient place for me. Sometimes write directly to a place and get better price (but I have high level on booking so can get good offers sometimes from page)."}, {"username": "Gena Kona-Mancini", "comment_text": "Sign up for Google flight alerts so you can see the flight prices and book when they drop! I also double booked some things because I wasn't sure of exact dates and places making sure I had free cancelation available and that way I could modify my trip as I planned more specifically. Also the last night, try to stay not too far from the airport if possible so it doesn't cause you any stress on getting there on time!"}, {"username": "Lucrezia Folger", "comment_text": "Check airline prices the same as you would booking anytime for anywhere. Decide where you want to go and fly into that city. As far as where to stay etc, decide how many days and where are you planing to go. A lot in-fact all of it is based on your decisions and research. You have to do the majority of figuring it out. Including how many weeks, months, cities, mode of transportation,\nbudget, will you need a kitchen, etc"}, {"username": "Jerry Kiger", "comment_text": "I’m pre plan stages myself. Most seem picking 3-4 cities, 3-4 days each city, book flights first, then hotels, then daily details. Jan will be temp colder time but also nice wintertime (so prob would skip lot of\nTime on the coast, depending)"}, {"username": "Rose Turdo", "comment_text": "Land in Milan, Depart from Rome\n\nRent a car from airport to airport\nDo Not Prebook Hotels\n\n1st Night Milan\n2nd Venice\nDay trip to Pisa\n3rd & 4th Florence\nMaybe stop in Siena or a night in Bolsena on the lake\nOff to Rome 2 nights\nArrivaderci Roma"}, {"username": "Jenny Payne", "comment_text": "I go often in January to Italy I fly to and out of Rome, stay at hotel near Roma termini Hotel Nord Nuova ( good when taking trains to other towns) . Leather boots with rubber soles & the secret is to Layer your clothes & a long puffer jacket. If your a walker you can walk most places as it will be cool but it is a beautiful time to go. Then I world train to Florence stay as long as you think is enough ( I have lived in Florence & love it) from Florence you can train to Lucca & bus to Siena as the bus drops u right in the city the train u need to catch a taxi back. Enjoy 🌻🌻"}, {"username": "Brian Osman", "comment_text": "I would consider using a tour for your first trip, just to gain a little experience, sorry just my opinion."}, {"username": "Lheah Bilgera Gearon", "comment_text": "Mark Fern"}, {"username": "Valerie Collanton", "comment_text": "First trip to Italy I would ordinarily recommend Florence and Venice as base cities. But in January the weather in Venice could be very rainy and cold. So I suggest Rome snd Florence. 3 nights Rome, 4 nights Florence. You can fly in and out of Rome. Or fly into Rome and out of Florence. I would start looking at flights now. There should be very good prices as that is the low season. Look on booking sites for hotels. But when you see ones you like, book directly on the hotel website. For Rome I would avoid the area near the train station. Otherwise anywhere city center is good. Hotels I like are Eitch Borromini. A beautiful hotel in an old palace right behind Piazza Navona. Should be a good price in January. Albergo Santa Chiara near the Pantheon. More basic but great location. Comfortable. For Florence near the train station is fine. Anywhere in the city center. Hotels I like: Hotel Monna Lisa, Hotel Cellai, Hotel L’Oralogio."}, {"username": "Irene Oda", "comment_text": "It would be helpful for you to share why you are choosing Italy. A week is a very short time in a country like Italy. Where are you coming from?"}, {"username": "Starla Dawn", "comment_text": "I successfully booked an entire trip myself and went in June.\nBest tip I have is to read current reviews of Airbnb’s and book the ones closest to what you want to be seeing/doing.\n\nFor example I booked my Sorrento BNB by location (and highest review) to the harbour for my Blue Grotto boat tour.\n\nAnd that host turned out to be a game changer helping me book a private driver for a trip to airport, trip to Amalfi Coast etc.\n\nThen just book flights if doing internal flights like I did to Catania to visit Sicily during good times."}, {"username": "Lisa Hartman", "comment_text": "I’m a huge fan of booking.com, you can rent an apartment but reserve with a cc. I only reserve apartments with free cancellations…w\nhich gives you some flexibility as you plan your trip. Figure out your flights, different cities from the US might require stops (Google flights is great to explore options) With one week you might want to only get a direct flight. Once you have flights then figure out the rest."}]}]