[{"id": "2207869769612101", "text": "Manarola Station,Via dell'Amore #reels #reelsinstagram #instagram #trending #viral #explore #love #instagood #explorepage #reelitfeelit #follow #photography #fyp #reel #instadaily #reelsvideo #आणखीlike #memes #foryou #music #facebookreels #facebook #facebookviral #reelsviral #reelsviralvideo #reelstrending #trendingnow #reelstrendingvideo #facebookpost #riomaggiore #monterossoalmare #manarola #corniglia #vernazza #cinqueterre #laspezia #reels2023 #ristoranteilgabbiano #paanokumitasafacebookreels #facebookreelssahod #facebookreelsearnings #metaverified #metaverifiedaccount #facebookreelsmonitization #facebookreel #fbreels #facebookreelssettings #facebookreelsincome #facebookreelsplaybonusprogram #facebookreelsvideo #facebookreelseligibility #facebookreelsviral #facebookreelspayout #facebookverified #bonassola #levanto #adsonreelsfacebook #adsonfacebookreels #adsonreelsmonetization #monterossobeach #monterosso", "link": "facebook.com/groups/1373361046396315/permalink/2207869769612101/", "likes": 0, "comments": []}, {"id": "2207918499607228", "text": "Florence & Pisa", "link": "facebook.com/groups/1373361046396315/permalink/2207918499607228/", "likes": 108, "comments": [{"username": "Karen HL", "comment_text": "☺️😘"}, {"username": "Tanya Lemmers de Boer", "comment_text": "Laurie Laurie Tinsley Chilcutt"}, {"username": "Anna Cichorek", "comment_text": "Anna Cichorek"}, {"username": "Anna Cichorek", "comment_text": "Anna Cichorek"}, {"username": "Enolita Castillo", "comment_text": "Been there...lovely"}, {"username": "Carlos Diaz", "comment_text": "I’m going in November if I stop by a little town between Florence and Rome and we need to stay to sleep ;would it be hard and very expensive to find a room ?"}, {"username": "Rolland VA", "comment_text": "Reminiscing the last time I went to those places!"}]}, {"id": "2207955906270154", "text": "Explore the incredible Borghese Gallery, a unique gem, filled up with masterpieces in the heart of Rome and some of the finest Renaissance-era artwork in the world!\n\nJoin us: आणखीhttps://nextstop-italy.com/virtual-tours/borghese-gallery/\n\n#history #art #italytrip #virtualworld #vacationmood #italytravel #VirtualTour #renaissanceart #italygram #italyiloveyou #borghesegallery #villaborghese #Bernini #bernini #canova #caravaggio #baroque #baroqueart #art #artlovers #artgallery #artoftheday #museum #museumlove #museumlover #museums #MuseumsForAll #arthistory #arthistorynerd", "link": "facebook.com/groups/1373361046396315/permalink/2207955906270154/", "likes": 5, "comments": []}, {"id": "2172555276476884", "text": "Siena and San Gimignano: Small-Group Tour with Lunch from Florence\nGet a taste of the Tuscan countryside on this full-day tour from Florence. Take a guided walking tour of Siena, home to the famous Palio horse… आणखी race, and explore the medieval hill town of San Gimignano. Midday, visit a family-owned winery for a lunch of seasonal Tuscan delicacies paired with local wines. Tour size is limited to a maximum of 25 people.\nRead more about Siena and San Gimignano: Small-Group Tour with Lunch from Florence - https://www.viator.com/tours/Florence/Siena-San-Gimignano-and-Monteriggioni-semi-private-tour-with-lunch-from-Florence/d519-5292P26?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2172555276476884/", "likes": 29, "comments": [{"username": "Tabitha B Fowler", "comment_text": "We just did this tour earlier this week. It was amazing! 🤩"}]}, {"id": "2207573496308395", "text": "Is this drink readily available in Venice?... Nice? 🍹", "link": "facebook.com/groups/1373361046396315/permalink/2207573496308395/", "likes": 137, "comments": [{"username": "Lauren Rutter", "comment_text": "I enjoyed many Bellini’s in Venice. Delicious 😋"}, {"username": "Zoë Anne", "comment_text": "Yes and the Rossini! Strawberry based!"}, {"username": "Brittany McCloy", "comment_text": "Yes very easy to get in Venice, can even buy it by the bottle and drink it on the streets in plastic cups! Can be cheap and cheerful or you can go to Harry's bar and get a very expensive, but apparently the original!"}, {"username": "Mat PO", "comment_text": "Yes; Hotel Cipriani…"}, {"username": "Vicki Slinn", "comment_text": "We went to Harry’s bar"}, {"username": "Angie Mattin", "comment_text": "It’s a standard long drink.. it’s just Prosecco and peach juice, available most places"}, {"username": "Matthew Livio Conti", "comment_text": "It’s readily available at any bar in the world."}, {"username": "Jocelyn Blanke Sia", "comment_text": "Available in grocery stores too."}, {"username": "Sue Sherwood", "comment_text": "Everywhere you go...."}, {"username": "Kristina Holdorf", "comment_text": "I remember having my first one in Harry’s Bar nearly 22 yrs ago!"}, {"username": "Carin Corriero Volpe", "comment_text": "I had my first one at Harry's Bar in Venice 2012."}, {"username": "Bethany Rudy", "comment_text": "We saw this almost everywhere"}, {"username": "Greg Saba", "comment_text": "\"On May 13, 1931, Giuseppe Cipriani Senior opened Harry’s Bar in Venice. Over the years, Harry’s Bar became the place where writers, painters, artists, aristocrats, kings and queens would meet. Among them there were: Barbara Hutton, Katherine Hepburn, Gary Cooper, Giancarlo Menotti, Peggy Guggenheim, Orson Welles, Frank Lloyd Wright, Joe di Maggio, Truman Capote and Ernest Hemingway. The keys to the success of this tiny Bar were: service, freedom and lack of imposition.\" You hardly get that feeling today in this crowded, tourist rip-off."}, {"username": "Mary Pharr McGowin", "comment_text": "Had my first at Harry’s Bar in 1981! Try a Peach Roger there, too. They are mighty proud of everything they serve- but the history of the place is unbelievable- check that out."}, {"username": "Isobel Young", "comment_text": "i bought bottles of it in grocery stores!!"}, {"username": "Carmine Napolitano", "comment_text": "oh yes"}, {"username": "Dawn Leitch", "comment_text": "Had a famous Harry’s Bellini last week in Rome 🇮🇹"}, {"username": "Eileen Muro", "comment_text": "I have to admit. I had quite a few of the bottled ones walking during the hot days while I was there 2 weeks ago. They were very refreshing ☺️"}, {"username": "Jodie Yates", "comment_text": "Hell yes"}, {"username": "Pat Beaulieu Hickey", "comment_text": "going to\nHarry’s Bar to get one or in September. i don’t care if it’s more expensive, will never be there again. we made reservations"}, {"username": "Crystal Waltz", "comment_text": "Yes! I had a Bellini in Burano. It was fabulous."}, {"username": "Connie Mascarenhas", "comment_text": "Favourite brunch drink"}, {"username": "Giessica Bormio", "comment_text": "You can drink in everywhere in Italy.\nYou can find bottles of Bellini in any grocery"}, {"username": "Angela Cagna Gaberel", "comment_text": "Yes, everywhere in Italy"}, {"username": "Rose Wolschlager Hinman", "comment_text": "Harry’s Bar in Venice"}, {"username": "Larry Fahey", "comment_text": "Gail Bob Tammy …"}, {"username": "Denyse Sexton", "comment_text": "🤩😜"}, {"username": "Jeff Gentner EA", "comment_text": "Norma Gentner"}, {"username": "Danelle Fernandez", "comment_text": "I drank this all over Italy! My drink of choice. Had one last night (in the US of course)."}, {"username": "Ed Enfield", "comment_text": "We went to Harry's bar in Venice and paid about $25 US for it. Sorry, I love cool places with history but this was small, crowded, and the drink was tiny. If you can get it elsewhere cheaper maybe. I would stick with an Aperol Spritz which you can find anywhere and sometimes as low as 5 euros at happy hour at some of the outside cafes."}, {"username": "Katie White-Meade", "comment_text": "Harry’s Bar"}, {"username": "Kerri Armitage", "comment_text": "It's easily available in most of Europe, I'm.in the UK and most bars sell them"}, {"username": "Luca Lookone Ferrentino", "comment_text": "It is available everywhere in Italy. You can also make it yourself, you only need a bottle of prosecco and a carton of peach juice."}, {"username": "Eleana Flores", "comment_text": "Yes we had one last week in Venice 🥂 it wasn’t as fancy as your picture, but I’m sure if you go to a high end bar they’ll make it look pretty.\nJust ask the waiters or bartenders if they have it before you sit down."}, {"username": "Trista D", "comment_text": "Yummy"}, {"username": "Judie Mc Adam", "comment_text": "Daniel Mc Adam"}, {"username": "Raquel Pickering", "comment_text": "The aperol spritz seems to have taken over Europe by storm. Go to any bistro at lunch, knock off time or cocktail hour and you'll see it. Massive wine glass filled with bitter orange."}, {"username": "Maria Minnuto Minervini", "comment_text": "Lisa RC"}, {"username": "Rhona OConnor", "comment_text": "Not alone in those places...... All over Europe!!"}, {"username": "Courtney Brown", "comment_text": "You can actually go to Harry’s bar and get one if you want!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Before ordering it ask if they do it with fresh peaches or peach juice: the first will be amazing, the second average and really sweet."}, {"username": "Ronelle Nadasen", "comment_text": "Yes, went to Harry's Bar. Paid around 22euros for it"}, {"username": "Laura DeCicco", "comment_text": "In Venice you should try the Select Spritz"}]}, {"id": "2207580996307645", "text": "Is it better to take a cab or the Leonardo from the airport to the train station? We are a group of 3.", "link": "facebook.com/groups/1373361046396315/permalink/2207580996307645/", "likes": 4, "comments": [{"username": "Irene Oda", "comment_text": "There is a train station at the airport that will take you directly into Rome Termini station."}, {"username": "Jay Parekh", "comment_text": "Train is easiest if your hotel is close to Termini. There are also buses available. Taxi is usually €50 flat fee and can be called via Uber as well."}, {"username": "Notarstefano Na Kori", "comment_text": "I always take the Train. It is easy, fast and cheap😊"}, {"username": "Kathleen Roll", "comment_text": "Whatever is cheaper - airport to accommodation - the more people there is often taxis are cheaper.\nBoth get you there 😂 taxis are a set price, depends where you want to end up and how far you have to carry your bags."}, {"username": "Karrie LeBlanc", "comment_text": "It really depends on where your hotel is in relation to Tremini. If you have to pay for another long cab ride back to hotel from station it may not make sense. The train is super easy though."}, {"username": "Robin Darmstadt Mancil", "comment_text": "Leonardo. Super easy"}, {"username": "Evelyn Jannet Garcia", "comment_text": "Train is perfect"}, {"username": "Stephen Henn", "comment_text": "Leonardo Express from FCO costs 14€ while a cab is about 50€. As mentioned previously, the Metro is convenient to get around Rome once you’re at Termini."}]}, {"id": "2207582506307494", "text": "Any recommendations for food, tours, or taxis in Volterra?", "link": "facebook.com/groups/1373361046396315/permalink/2207582506307494/", "likes": 0, "comments": []}, {"id": "2207584662973945", "text": "We are taking a cruise and going to Livorno/Florence/Pisa and Naples/Pompeii/Sorento and Amalfi Coast as well as Civitivecchia/Rome.\nIf you have any suggestions, I am really struggling with planning the shore excursion from Livorno to Rome. Of course, we want to go to the Colosseum and to the Vatican Museums and Basilica. I have transportation reserved and he is supposed to stay with us all day at an exorbitant cost but it seems that private transfer is the only way to be able to take in the sights we want to see. He is not a tour guide and just told me to get the entry tickets for whenever I want.\nWhere I am getting stuck is with the skip the line tickets for the Vatican Museums which sometimes include the Basilica and sometimes do not. Italy Made Easy for Seniors book refers to the doors to exit the Sistine Chapel with the one on the right taking us straight to the Basilica. This is the way I want to go, but am concerned if we are not with a tour, they will not let us go that way. It would throw the whole timing off if we have to go back out through the museums and then re-enter through Basilica security. I’m ok with not booking a tour.\nThis has become insurmountable to me. I don’t want to spend $1600 for this one day in Rome (we are a group of four). If anyone has any suggestions, I would appreciate the input. We will be there end of October.", "link": "facebook.com/groups/1373361046396315/permalink/2207584662973945/", "likes": 3, "comments": [{"username": "Rhona OConnor", "comment_text": "You will have a 3 hour drive each way.... That's 6 hours in the car before you get into Rome and see anything...... Perhaps see Rome another time and just enjoy the area you Dock in.\nYou could add an extra 2 days to your trip for $1600 and stay in Rome!"}, {"username": "Giovanni Pianigiani", "comment_text": "You say the ship is stopping at Civitavecchia too... that's a much shorter drive to Rome than Livorno"}, {"username": "Bill Elias", "comment_text": "I don’t know exactly but I seem to remember a very large door from the Sistine Chapel that is only opened for special dignitaries.\n\nI was there once when it was opened for some woman and her entourage, but immediately closed after they went through."}, {"username": "Paul Anderson", "comment_text": "The basilica is always free. If your getting charged for it you being ripped off."}, {"username": "Steph Craddock", "comment_text": "How long are you in Livorno for? It'll take at least 3 hrs each way from Livorno to Rome (not including any traffic jams) If you only have the day ,it wouldn't be worth it."}, {"username": "Lucrezia Folger", "comment_text": "Your cruise doesn't provide excursions?"}, {"username": "Marnie McKay-Perry", "comment_text": "On a side note….Can I ask what cruise your doing Holly Hoenig? Feel free to pm me. Ty!"}, {"username": "Diane Davis Lawyer", "comment_text": "Having a guided tour of the basilica does not entitle you to skip the line, as far as I can tell. My research and reading says that you must re-enter the security line to get into the basilica since it is free, there are no tickets. I see no way to avoid the security line. I have not found a tour yet that 'allows' skipping the line for the basilica. Have you tried the Vatican's website and checked what they have available? Maybe one of their direct tours allows skipping the security but I somehow doubt it."}, {"username": "D'Anna Hohe", "comment_text": "Why would you go from Livorno all the way to Rome. Does the cruise end or start at Civitivecchia? Just go early or stay late and see Rome then."}, {"username": "Holly Hoenig", "comment_text": "Whoops! I’m actually porting in Civitivecchia and going to Rome for a day. Thanks for the heads up on my typo. I’ve had my head in this project that I’m eating Italian for dinner!!"}, {"username": "Angelita Reyes Lara", "comment_text": "I'm going in that same cruise route, you can find information in Google, just put the name of the port. I will stay 3 more days in Rome. From Civitavechia to Rome is one hour train. I'm not traveling with tour."}, {"username": "Cristina Guerrero Rodríguez", "comment_text": "We just did the same cruise ports and from Civitavecchia we did get a tour that took us to Rome, we walked with the guide through many of the most important places and in the end we had enough time to get to the basilica"}]}, {"id": "2207586272973784", "text": "Suggestions please: my husband sells motorcycles in the US and we are avid riders.\n\nWe are in Italy next month in Rome, Florence, Venice and are considering renting a motorcycle in Florence and a Vespa in rome.\n\nAre day trips to Tuscany to San Gimigano, Pisa, Siena possible on motorcycle if we only have one day?\n\nWe are debating from Florence take moto to Cinque Terre or Tuscan towns? Wish we had time for both, but we only have 3 nights in Florence so if we go to both from Florence we won’t have much time in the city.", "link": "facebook.com/groups/1373361046396315/permalink/2207586272973784/", "likes": 1, "comments": [{"username": "Margaret Mackenzie", "comment_text": "Definitely you can do some of this. I think trying to do it all might be too much. Can you skip Siena? Or Pisa?"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "San Gimignano and Siena one day, Pisa and 5 Terre the other day. You can’t squeeze all in one day.\nBut the motorcycle ride around Siena and San Gimignano will be amazing!"}, {"username": "Paola Coppi", "comment_text": "Motorcyclists love Tuscan hills. I went myself once on a tour of Tuscany by Vespa and I remember it with affection because it is unique and funny. I'd rent the moto in Florence and go here and there without a specific destination passing through the most iconic towns. About the renting of a Vespa in Rome I heard that the Capital traffic is intense and the roads are full of holes. I don't know..."}, {"username": "Tad Hashimoto", "comment_text": "If you want to enjoy the places you're going, I don't think you can do that in one day.\n\nI ride in the states and planned a ride route out of Florence with vespas for my wife, daughter, and myself. We planned on a route to the south of Florence, stopping at little towns along the way. We made it about 2/3 of the way down to Castellina before turning back to head home. We could have gone farther had we not stopped as much, but we wouldn't have been able to enjoy each town we stopped in.\n\nWe did a half day to Siena and ended up skipping a couple things we might otherwise have done.\n\nIf you want to ride to enjoy the ride, you can hit all of your targets. But you'd be short changing yourself on each of those stops."}, {"username": "Lisa Ann", "comment_text": "Thank you all. We were thinking Tuscany one day then cinque terre the next but that limits our actual time in Florence.\n\nWe have extended our stay to go to misano for the moto gp and will drive there."}, {"username": "Sylvie Hogg Murphy", "comment_text": "When in Rome, do as the Romans do…. Drive a Vespa! There is an awesome tour company called Scooteroma that takes you all around the city with different themed itineraries. It’s designed mostly for people who don’t drive scooters but want that experience (participants ride on the back of a Vespa driven by a local guide) — however, experienced riders like you can also take the tour and rent a Vespa (to drive yourselves) from the rental place where the tour starts, and then follow the leader. Great way to feel the exhilarating history of Rome like a local and not have to worry about directions. It’s a blast! (And then you can add on days with that rental place - it’s like 50 euros a day I think.) For anyone comfortable driving them, motorini 🛵 are the best way to get around Rome - there is nothing more giddy than zipping past some ancient marble and brick ruins under a blue sky (or a baroque fountain, or a Renaissance church dome… you get the idea…) on a candy-colored Vespa! Have fun!"}, {"username": "Marianne Hendriks", "comment_text": "Buy this Michelin map and follow the smaller roads and tour on the strade bianche. It ‘s doable when experienced. I would just do Siena and San Gimignano. You need to stop a lot for the views."}, {"username": "Berndt Weihs", "comment_text": "Pisa will not possible at the same day.Siena and San Gimigano ,yes!And to drve with motorcycle through the Chianti hills is wonderful"}]}, {"id": "2207589319640146", "text": "Planning are future trip! Going for 12 days 2 of them are for the travel there and back so 10 days to explore.\nWe are doing Rome, Venice , Capri, Amalfi coast and Sorrento… anyone where else we could fit in or should I go visit instead of one of these places !?", "link": "facebook.com/groups/1373361046396315/permalink/2207589319640146/", "likes": 0, "comments": [{"username": "Paola Coppi", "comment_text": "When are you leaving and what are the ages or inclinations of the party members?"}, {"username": "Tiffany Rossi", "comment_text": "A year at least , trying to plan ahead ! And my husband and I were in our middle 20’s early 30’s both in good health"}]}, {"id": "2207589989640079", "text": "Hi everyone, whereyou purchase tickets for the hop on hop off bus in Rome thank you 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2207589989640079/", "likes": 4, "comments": [{"username": "Rhona OConnor", "comment_text": "Look up the website.... That will tell you. Probably available on the bus."}, {"username": "Jojo Hanna", "comment_text": "There’s a booth at the train station or find the Route and stops and buy on the bus."}, {"username": "Alison Dutton", "comment_text": "We bought ours at a shop in the Piazza Navona but some of the newsagents stands sell them."}, {"username": "Grace Pascua-Escobar", "comment_text": "Klook"}, {"username": "Ashlee Ann", "comment_text": "Can I ask is this worth doing? Where do they visit?"}, {"username": "Emma Butcher", "comment_text": "Don't bother. Most stops are still a good 10mins walk from anybody the tourist spots. And you spend so much time waiting at each stop."}, {"username": "Roxanne Franquelli", "comment_text": "On Expedia."}, {"username": "Ibbu Mohd", "comment_text": "At roma termini (train station) or Purchase online.\n\nBigbustours.com\n/en/rome/\nrome-tour-ticket\ns-and-passes/\nrome-bus-tours"}, {"username": "Tracy Foss", "comment_text": "Viator sells them on line"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207595709639507", "text": "Questions about VAT taxes. Do locals have to pay VAT taxes on purchases they make? If someone from Italy comes to the US and pays sales tax for purchases do they get to claim it a get a percentage back? Just curious 🤔", "link": "facebook.com/groups/1373361046396315/permalink/2207595709639507/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "There’s no VAT in the USA."}, {"username": "Carmine Castiglia Jr", "comment_text": "VAT is rolled into the purchase price of all items where it is applicable (that is, most everything), so yes, locals do pay VAT pretty much on everything that they buy. In fact, this is one of the primary ways that European governments tax their citizens.\n\nThere is no refund mechanism for return of sales taxes when international tourists shop in the US. No doubt partly because sales taxes are imposed by state and local governments. There really is no federal level sales tax except perhaps on motor fuel (gasoline/\ndiesel)."}, {"username": "Holly Hoenig", "comment_text": "I’m really curious about VAT too. We’re not flying out of Italy since we will be on a cruise. We fly out of Barcelona. Will I be able to get a reimbursement in Barcelona at the airport for items that I buy in other countries?"}]}, {"id": "2207592199639858", "text": "Bonjourno, we are looking at spending a day in Naples, but from what I’ve read/heard it can be a bit dodgy/unsafe. I’m sure there are beautiful places to see. Could you please recommend sites to see, places to go. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2207592199639858/", "likes": 12, "comments": [{"username": "Mike Ball", "comment_text": "Don’t believe the stories about it being dodgy and unsafe, it’s no more unsafe than any other big city ,\n\nWe’ve been twice and really enjoyed the experience, beautiful city with so much character and colour."}, {"username": "Anna O'Connor", "comment_text": "The hop on hop off bus coastal route for amazing views. . The Centro Storico is also fabulous. Via dei Sant Gregorio, Piazza Dante."}, {"username": "Paola Coppi", "comment_text": "The city center Is quite safe but you Will resemble tourists and do tourist stuff like taking pictures and stumbling here and there converting youself in the perfect pickpocket target: the least you seem to be a tourist the safest your wallet will be. In Naples it is useful to know exactly where to stop from wandering. Just a step out from the most iconic street 'Spaccanapoli' it begins the Forcella Block which you should avoid at any cost. I suggest you to wander through Spaccanapoli up to the graffiti masterpiece by Jorit Agoch known as \"San Gennaro\" in the square of Via Vicaria Vecchia and to come back then because from there on Forcella begins. Another block to partially avoid is Quartieri Spagnoli which has been \"restructured\" and it is quite tourist-friendl\ny: now it is famous for the Murales depicting Diego Armando Maradona the footballer. In Naples people are kind and communicative, they will call you from the shops or barrooms to invite you to buy they don't get surprised if you go on and politely refuse, so don't feel obliged to drink or try on stuff. They are really helpful, so better ask to a shop owner or a Tobacco shopping assistant if you have doubts of any kind."}, {"username": "Sonia Scotto Lubrano", "comment_text": "It’s not what it use to be\nNaples is safe.\n\nRome is wayyyyy worse at the moment"}, {"username": "Megan Leigh", "comment_text": "From what I've seen, most people saying that it's not safe haven't actually stayed there but just traveled from the airport to the train station. I can't wait to go. It sounds like such a unique and authentic city."}, {"username": "Marissa Wilson", "comment_text": "Here is the list I made before we went. Didn't end up doing all but did most. Never felt unsafe.\n\nVia San Gregorio Armeno\nSanta Chiara\nNaples Cathedral\nVia dei Tribunali - Gino e Toto Sorbillo (pizza)\nNaples Underground tour\nVia Toledo\nSpanish Quarter\nGalleria Umberto\nPiazza del Plebescito\nOvo Castle"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "It is not unsafe. I was just there with my daughter and never did we feel unsafe. We went and did the underground tour."}, {"username": "Laura Uribe", "comment_text": "Naples is a beautiful place! We loved it! It’s a typical gritty large city. Marissa Wilson gave you a great list of places although you probably won’t hit all of them in a day. Tourists tend to be distracted, so hang on to your cross body purse or backpack. Don’t set them down on the ground or chair back when eating."}, {"username": "Tom Walsh", "comment_text": "We have been there several times and spending the New Years there this year. So much to see, and the people are great."}, {"username": "Joseline F R Simonsson", "comment_text": "Pls stop listening to negative posts about Naples, just be aware of your surroundings and dont wear your rolex and jewelleries. Its an interesting city, helpful people and good food, full of grafitti and trash as in all, love it or hate it."}, {"username": "Nissa Nolan Foster", "comment_text": "Wouldn’t worry if you were only going to be there for a day anyway."}, {"username": "Andrew Scivoli", "comment_text": "Andrew Scivoli"}, {"username": "David Pye", "comment_text": "We went twice and stayed over, not to our taste, we won't be going back"}, {"username": "Shirley Lewis", "comment_text": "Archaeological museum"}, {"username": "Anna Sanday", "comment_text": "We just spent 3 nights in Naples and loved it. Single mom travelling with two daughters, didn’t feel any more unsafe than we did in Rome. We spent a whole day just exploring & wondering the streets & it was our favourite day in Italy so far"}, {"username": "Don Bentivoglio", "comment_text": "Naples is a lot safer than Portland, Seattle or Chicago. Go and enjoy yourself"}, {"username": "Chelsey Scalese", "comment_text": "Buongiorno**"}, {"username": "Carol DelMonte DiDonato", "comment_text": "Spent a week there with no problems."}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s nothing dangerous than any other European cities!\nNational Archeological Museum in Napoli is a must see.\nSan Lorenzo Maggiore’s basement is actually very well-preserved 2000 year-old Roman streets.\nCatacombe di San Gaudioso houses some of the very unique ways to celebrate some of their wealthy departed.\nMuseo cappella Sansevero houses the very unique marble sculptures “Vailed Christ”. Don’t miss other sculptures on the wall…especially\n“Illusion”. The fishing nets are actually curved entirely on marble!\nAnd PIZZA. Pretty much anywhere in Napoli, the quality of pizza is top notch. Once you have it, you’ll never see the pizza like way you used to look"}, {"username": "Senan Haugh", "comment_text": "Amazing city.."}, {"username": "Paul N Marietta Dodson", "comment_text": "The National Archeological Museum has a significant amount of original artifacts from Pompeii and Herculaneum. The mosaic floors are beautiful. We missed seeing Santa Chiara, not enough time in our one day. And don't forget to wander Spancanoppli. The food, the shops, quintessential Italy."}, {"username": "Brian Osman", "comment_text": "Brian Osman"}, {"username": "Valerie Collanton", "comment_text": "Seriously ?"}, {"username": "Denise Townes Giacobba", "comment_text": "Stay close to the water, you’ll be fine"}, {"username": "Claudio M Proserpio", "comment_text": "Stadium Diego Armando Maradona…must see it!"}, {"username": "Anna Barrett", "comment_text": "We spent two days recently it was great good food great atmosphere i loved the hop on hop of bus Takes you all around the coast well worth it"}, {"username": "Ted Cabot", "comment_text": "The old Greek town is magic"}, {"username": "Alison DelFosse", "comment_text": "Shannon Rosenhan"}, {"username": "Lisa Adams Robertson", "comment_text": "Archeological Museum, Sansevero Chapel!"}, {"username": "Karen Anglin", "comment_text": "Does anyone have suggestions on hotels for Naples that are in walking distance of most restaurants, etc? Thanks"}, {"username": "Lauren Vassallo Beattie", "comment_text": "It is not, it is amazing. Just stay away from the train station and scampia. Go to Vomero also underground naples tour, castle tour, stay near central Napoli or near the waterfront."}, {"username": "Diana Morgan", "comment_text": "Watch everything on you keep it secure and hidden if you can. Yes there are beautiful places to see, just be very careful and aware and like Lauren said stay away from the tubes and trains it's a hot spot for thieves."}, {"username": "K M Uí Fhionnaláin", "comment_text": "Walk down the vibrant Via dei Tribunali,have some street food,Via dei San Gregorio just off that street where artisans create beautiful intricate wooden figurines and scenes.Be mindful of your belongings just as you would in any city.Enjoy this marvellous ancient city."}, {"username": "Giovanni Pianigiani", "comment_text": "il y a plein d'endroits merveilleux à voir. (Why the greeting in French with a funny \"no\" at the end though?)😅🙄"}, {"username": "Iliana Zlatareva", "comment_text": "Napoli is beautiful and safe, unique place, do not skip it."}, {"username": "Skye Birch", "comment_text": "it isn't unsafe.. People need to stop listening to what others are saying..\n\nit's a beautiful rustic place, obviously you'll get the good and bad in every city.\n\ntake a long walk doen tbe city centre very busy and great places to eat..\n\nTry thr catacombs if you get a chance the ticket will get you entry into 2 of them :) have fun and stay safe"}, {"username": "Kathleen Roll", "comment_text": "https://\nwww.museosanseve\nro.it/\nla-cappella-e-il\n-cristo-velato/\nil-cristo-velato"}, {"username": "Kathleen Roll", "comment_text": "https://\nnaplespompeii.co\nm/\nthings-to-do-in-\nnaples.html?gad\n=1&gclid=Cj0KCQ\njwib2mBhDWARIsA\nPZUn_m4KoJGkxy5\nQeVK_AWWiYQODJH\n-ykS8Y2P1J-xt0T\nkkJSRDK4sWRm0aA\njFFEALw_wcB\n\nI have only been to a few but there’s always another trip 😂"}, {"username": "Kathleen Roll", "comment_text": "Go to Cafe Gambrinus next to the Piazza del Plebiscito and have a cocktail or a shakerato."}]}, {"id": "2207603289638749", "text": "Hi! Heading to Rome in early October! What is the best tour of the Vatican? We have heard that the nighttime tour is paticularly beautiful!", "link": "facebook.com/groups/1373361046396315/permalink/2207603289638749/", "likes": 4, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nVatican-VIP-Expe\nrience-Exclusiv\ne-Breakfast-at-\nthe-Vatican-wit\nh-Early-Access-\nto-Vatican-Muse\num-and-Sistine-\nChapel/\nd511-3731VATICAN\nBREAKFAST?pid=P\n00070587&mcid=4\n2383&medium=lin\nk&medium_versio\nn=selector"}, {"username": "Arlene Jadin Gambol", "comment_text": "Arlene Jadin Gambol"}, {"username": "Suzanne Sullivan", "comment_text": "For me, it was less about when vs. who. We had an amazing Vatican tour guide that was super funny and quirky and very knowledgeable- she kept us entertained and offered several times for people to leave but no one wanted to. We’ve been on so many tours with boring guides that we couldn’t wait to get away from lol"}]}, {"id": "2207615712970840", "text": "Venice and its islands", "link": "facebook.com/groups/1373361046396315/permalink/2207615712970840/", "likes": 375, "comments": [{"username": "Angela Choe", "comment_text": "Beautiful 😍"}, {"username": "Lori Cutter", "comment_text": "Amazing, I can hardly wait to see in person. We have 2 week italy vacation in September."}, {"username": "Monica Colontonio Macho", "comment_text": "Beautiful! Thank you for the pictures"}, {"username": "Sabrina Tjoelker", "comment_text": "Thanks for posting!!! I cannot wait. Lots of pinch me moments for sure"}, {"username": "Kerry McNamar", "comment_text": "Best pictures of Venice and environs I’ve seen in a while. Thank you for sharing."}, {"username": "Linda Shanks", "comment_text": "Love it. Going in Sept"}, {"username": "Viv Frost", "comment_text": "Beautiful! Did you have to book for the Florian cafe?"}, {"username": "Mona Sidhu Samrari", "comment_text": "Beautiful 😍"}, {"username": "Annick Vissers-Christiaens", "comment_text": "We enjoyed the trip today! Venice , Murano and Burano! A lot of colourful pictures! Three Islands that you must see!"}, {"username": "Elizabeth Hartzell", "comment_text": "So beautiful! Heading there in September. May I ask how long you stayed in each? Any advice or recommendations\n?"}, {"username": "Hannah Maleski", "comment_text": "Riley Grieveson"}, {"username": "Clayton Webb", "comment_text": "Nicole Webb"}, {"username": "Chelo Darrow", "comment_text": "I like to have more information Of Venice"}, {"username": "Michelle Creed", "comment_text": "Have been there once , but definitely hoping to go there again . A true diamond in the rough"}, {"username": "Enolita Castillo", "comment_text": "I miss being there...so beautiful as always."}, {"username": "Nicole Nellkym", "comment_text": "Robert Skinner"}, {"username": "Rolland VA", "comment_text": "Mesmerizing! I've gone through it, visiting around that places!"}, {"username": "Alexandra Georgiana", "comment_text": "Which one would you choose? Murano or Burano? I am interested in the lovely scenery. Thanks!"}, {"username": "Kelly Peagler Myers", "comment_text": "Shawnna Chance"}, {"username": "Tadz Donsky", "comment_text": "♥️ Venice"}, {"username": "Sania Junejo", "comment_text": "Sania Junejo"}]}, {"id": "2206948786370866", "text": "Had great experience at Cascate del Molino, Saturnia", "link": "facebook.com/groups/1373361046396315/permalink/2206948786370866/", "likes": 10, "comments": [{"username": "Wanda Moratelli", "comment_text": "This looks wonderful!!"}]}, {"id": "2207684462963965", "text": "Rebirth of Pompeii 2", "link": "facebook.com/groups/1373361046396315/permalink/2207684462963965/", "likes": 34, "comments": [{"username": "Pat Klimtschuck", "comment_text": "I'm loved the history had a great trip there I will do it again"}, {"username": "Sabrina Tjoelker", "comment_text": "This is what I am looking forward to most. Pompeii has been on my bucket list since I was a teenager"}]}, {"id": "2207749556290789", "text": "ROME - we are a group of 7 staying in Rome for two nights, mid-September. Will we need to book restaurants, or will we be able to find a large enough table without a booking? I would prefer to ‘go with the flow’, but also understand fitting a larger group may be more difficult. Thoughts please 😊", "link": "facebook.com/groups/1373361046396315/permalink/2207749556290789/", "likes": 0, "comments": [{"username": "Brian Osman", "comment_text": "We had no problem with a group of ten, we just wandered around till we found a place"}, {"username": "Paola Zirpola", "comment_text": "We just came back and it was 7 of us. Never did we have a problem. We did make reservations for one place and they got the amount of people wrong. They were still able to accommodate us."}, {"username": "Linda San Paolo", "comment_text": "We just returned home in June there were 7 of us, they go beyond to accommodate!!"}, {"username": "Stacy Prestigiacomo", "comment_text": "Try to go to el faciolaro it was delicious, close to trevi fountain"}]}, {"id": "2207764112956000", "text": "Another FYI post. The Pantheon! I pre-bought tickets which I thought were from the official site. $50 for 2 adults 3 kids. Turns out they were a third party site and even though they were ‘timed’ for 10:00…theyआणखी did not include admission, JUST the audio guide. We were able to stand in line and pay the $10 admission fee for the 5 of us thankfully….but what could have cost us 10 cost $60! Just a heads up for anyone else who might just want to pop in and not spend a ton of time there!!", "link": "facebook.com/groups/1373361046396315/permalink/2207764112956000/", "likes": 196, "comments": [{"username": "Shannon Uebelhor Fuhs", "comment_text": "We were there on Sat July 1 and walked right in. They must have started charging a fee after that day."}, {"username": "Miriam Griffin Woods", "comment_text": "Another money grab"}, {"username": "Carol Taylor Tisdale", "comment_text": "Fab photo!!!"}, {"username": "Sheila Phillips", "comment_text": "Oh no. Also there is a free audio guide you can download on your phone that describes everything."}, {"username": "Penny Bouchard", "comment_text": "Cute picture!"}, {"username": "Carla Barker", "comment_text": "Great picture! My daughters & I walked in about 30 minutes before closing & admission was free. (End of June, 2023)"}, {"username": "Kim Geary Keidel", "comment_text": "Same thing happened to us. But we enjoyed the audio guide so it was worth it."}, {"username": "Patricia Turner", "comment_text": "I love this and post like this. Great info and love the smiles on your faces! What a sweet family!"}, {"username": "Pamela Weber Voges", "comment_text": "Thank you for sharing! We will be staying right across the street. Can’t we just pay and go in?"}, {"username": "Lynette Leone Watkins", "comment_text": "Great photo and info!!! Thanks"}, {"username": "Lisa Hartert", "comment_text": "Best photo!"}, {"username": "Jacqueline Anderson", "comment_text": "What an amazing family photo… love it!"}, {"username": "Renee Brezovsky", "comment_text": "I did the same thing. Purchased the audio tour before realizing it didn’t include admission. Tricky since the audio tour site says it’s strictly for Pantheon. I have my admission tickets now, though, ready for mid-September."}, {"username": "Coti Thurman", "comment_text": "Today (Sunday) we went there. Free admission.\nNice picture! I tried to do the same but it didn’t come out as good as yours."}, {"username": "Lisa Adams Robertson", "comment_text": "Great picture!"}, {"username": "Kathryn Quinlan", "comment_text": "Sandra Szoke !"}, {"username": "Mitzi Monday", "comment_text": "Cool pic!!!"}, {"username": "Mary Heller", "comment_text": "Oops!"}, {"username": "Deborah Patchett", "comment_text": "GREAT pic!!!"}, {"username": "Lisa Weathers", "comment_text": "2021 with my boys ♥️"}, {"username": "DeAnna Pulliam Like", "comment_text": "Love this photo!"}, {"username": "Chris Bold", "comment_text": "Lindy Mitchell"}, {"username": "Tricia Brittingham Neff", "comment_text": "Thanks everyone!! Live and learn!!"}, {"username": "Frank Hunt", "comment_text": "Used to get in free, ah well……"}, {"username": "Anne Mc Namara", "comment_text": "We were there in December and it was free"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Great family photo ! In 2019 we just walked in ! Was just in Rome this past June and the lines were horrendous."}, {"username": "Gabi Thomas Chaplin", "comment_text": "i did the audio tour here and it’s awesome !! less than 30 minutes. highly recommend !!"}, {"username": "Kim Lehman Johnson", "comment_text": "Great pic!"}, {"username": "Hanna Solano", "comment_text": "Crooks are everywhere, don’t let them affect your vacation experience. God bless your beautiful family"}, {"username": "Eva Salas", "comment_text": "We bought a tour of the Castl and it included a free admittance to Pantheon, good tour, we were in there a whole 15 minutes."}, {"username": "Emma-Jane Garbutt", "comment_text": "Thanks! Did you have to wait in line for long?"}, {"username": "Bill Elias", "comment_text": "It’s a shame that it costs anything. It used to be fun to just pop in for a while when out and about on a whim.\n\nIs it not still used as a Church? I’ve been there before just after some type of service."}, {"username": "Valentina Saltarelli", "comment_text": "Fyi\nyou can pre-buy tickets from official site\nwww.musei italiani.it"}, {"username": "Amy Antonini Wilson", "comment_text": "When we visited in July we had prepurchased a small group tour with a guide from a third party site. The other family in the group had pre-purchased theirs prior to admission being charged (prior to July 1) so they had to pay the additional entrance fee on site. Since we had purchased ours from the third party site AFTER July 1 admission fee was included and we didn’t have to pay at the site. Thought this could help others based on when they pre purchased their Pantheon tickets."}, {"username": "Therese Goulding Louk", "comment_text": "Great photo."}, {"username": "Cathy Saultzman", "comment_text": "Great pic!"}, {"username": "Sheila La", "comment_text": "When did they start charging? I went maybe 5 years ago in November. No tix, no waiting. Just a small, steady stream of people moving in and out. Is it because I was there off-season?"}, {"username": "Vijay Almeida", "comment_text": "Thankfully this was shared on this group in the past. So, we did not fall for this. We were there last Sunday and official website for buying tickets is:\n\nhttps://\nportale.museiita\nliani.it/b2c/\n#en/\nbuyTicketless"}, {"username": "Anita Clayton", "comment_text": "Great family photo"}, {"username": "Tara Roed", "comment_text": "It’s very confusing! We went in early July a few days after they started charging and no one knew what to do. Hopefully they work out the kinks soon. The website to buy the tickets was extremely confusing too. We ended up waiting about 30 minutes as well and we had just showed up that day not knowing they had started the pay to enter that week"}, {"username": "Lisa Mac", "comment_text": "Thank you for sharing and that is an awesome picture of you & your family!!!"}]}, {"id": "2207807869618291", "text": "This group always provides a lot of valuable information!", "link": "facebook.com/groups/1373361046396315/permalink/2207807869618291/", "likes": 3, "comments": []}, {"id": "2207803222952089", "text": "Woke up to a hot air balloon outside of our bedroom window on our last morning on Florence! Magical❤️", "link": "facebook.com/groups/1373361046396315/permalink/2207803222952089/", "likes": 69, "comments": [{"username": "Syed Faiq Yazdani", "comment_text": "new"}, {"username": "Monica Colontonio Macho", "comment_text": "Very nice!!!"}, {"username": "Molly Graban", "comment_text": "So pretty 💕"}, {"username": "Molly Graban", "comment_text": "Dylan Graban"}, {"username": "Ghada Chalghoumi", "comment_text": "Wow"}, {"username": "Nancy Royer", "comment_text": "I hope we get to see this in September! My brother saw them last summer!"}, {"username": "Fiona Tanner", "comment_text": "Melissa Powderly"}]}, {"id": "2207523222980089", "text": "Be careful out there. Be cautious of who you hire for a tour. The boat operator has test positive for alcohol.", "link": "facebook.com/groups/1373361046396315/permalink/2207523222980089/", "likes": 5, "comments": [{"username": "Paula Bennett", "comment_text": "Omg how incredibly tragic! What a waste! Quit with the drugs and alcohol already! I’m tired of it! This poor family! Prayers for them! What a thing for those children to witness and remember. For what??? Hopefully Italian law will do more than a slap on the wrist!"}, {"username": "Laura Miller Bailey", "comment_text": "Horrific tragedy. Praying for her children and husband 💔"}, {"username": "Rachel Castleberry", "comment_text": "What a tragedy. Praying for her husband and children."}, {"username": "Lily Nasery", "comment_text": "Horrific!!"}, {"username": "黃寶萱", "comment_text": "Prayers to the family. So sorry"}, {"username": "CiCi LeCanard", "comment_text": "😭yes this was a friend of a friend 😭"}]}, {"id": "2207502302982181", "text": "Recommendations please for best restaurants in Florence serving Bistecca alla Fiorentina; a meal I absolutely love!", "link": "facebook.com/groups/1373361046396315/permalink/2207502302982181/", "likes": 1, "comments": [{"username": "Brenno Bianchi", "comment_text": "For the locals the top is Buca Lapi"}, {"username": "Sue Gelardi", "comment_text": "Perseus"}, {"username": "Vinny Gogluicci", "comment_text": "https://\nmaps.app.goo.gl/\nXqpHy6KXjxtN5v8q\n7"}, {"username": "Raymond Capkin", "comment_text": "Only 1....\nBuca Mario..oldest steakhouse in Firenze"}, {"username": "Maria Delaney", "comment_text": "Buca Mario or 4 Lione"}, {"username": "Elena Innocenti", "comment_text": "Buca Mario"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "As an Italian I'm 100% sure steak is better in the US. I wouldn't bother."}, {"username": "Miyuki Kanno Paul", "comment_text": "I hope that you understand that Bistecca alla Fiorentina is served pretty much rare"}]}, {"id": "2207226519676426", "text": "Looking for a rooftop bar/restaurant that we can book for lunch/drinks with a bit of a view in Rome. Doesn't have to be spectacular (but bonus points if it is 🤣). It's for November so preferably something withआणखी cover in case it's wet .\nWe're doing a self guided walking tour to a few areas we missed last trip so we are flexible with location in the purple area?", "link": "facebook.com/groups/1373361046396315/permalink/2207226519676426/", "likes": 5, "comments": [{"username": "Jeanne Eliason", "comment_text": "Where are you in Italy? November is a little late in the year for being served outdoors."}, {"username": "Haven Houllis Chrysakis", "comment_text": "We just left Rome about three days ago and we stayed at the Hotel Splendide and they had an amazing I mean amazing rooftop restaurant/bar"}, {"username": "Emad Massoudi Amo", "comment_text": "https://\nwww.terrazzalese\ntoiles.com/\nristorante/"}, {"username": "Dee Dee", "comment_text": "https://\nterrazzaborromin\ni.com/"}, {"username": "Linda Somerville", "comment_text": "Luca Seidenari...\nCould you assist my friend here please?"}, {"username": "Karen Blackmore", "comment_text": "https://\nwww.hotelartemid\ne.it/it/\nristorante-ambro\nsia?utm_source=\nGMBlisting&utm_\nmedium=organic we went here for cocktails last September. Very friendly, made us feel special, and a nice view. Sure you can get better views but we loved the fab service and not so outrageous price. Restaurant looked great too."}]}, {"id": "2207508166314928", "text": "Hi everyone, I have tickets for the main attractions in Rome this week but tomorrow have an open day pretty much. Any recommendations of things to do and places to explore? We are a family of 5, youngest is 11आणखी but she is very mature. Picture for attention of where we had an amazing dinner tonight. I highly recommend this place, worth the line.", "link": "facebook.com/groups/1373361046396315/permalink/2207508166314928/", "likes": 6, "comments": [{"username": "Angie Callejas", "comment_text": "Love this place.."}, {"username": "Donna Palazzolo Bourgoin", "comment_text": "Name is cut off. Can you tell me the name of this place? Thanks"}, {"username": "Roland Trego", "comment_text": "It looks like Osteria da Fortunata. It's a fun place, but on our last visit the food wasn't up to par and not inexpensive for what we got, either. Maybe it's because they've opened up several restaurants. ... Actually, the bowl on the table has the name on it."}, {"username": "Gina Rovello Keenan", "comment_text": "Just wander the streets. Spanish steps, Trevi fountain."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Catacombs, Villa Borghese (museum + park)"}]}, {"id": "2207513189647759", "text": "Hi! Looking for recommendations for a half day boat excursion that leaves directly from Capri to visit the Blue Grotto and potentially the other grottos as well? We will be staying in Capri and many of the tours are organized from other areas like Sorrento. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2207513189647759/", "likes": 0, "comments": [{"username": "Maria Delaney", "comment_text": "Check with your hotel for local recommendations\n."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Capri/\nCapri-and-Anacap\nri-Group-Tour-w\nith-Villa-San-M\nichele-Blue-Gro\ntto-and-Charili\nft/\nd4223-201768P13?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2207514399647638", "text": "I'm trying to find a boat tour from Sorrento that does Capri and Positano that also includes sunset. I'm on viator but having trouble finding exactly what I want. Thoughts or suggestions? ￼", "link": "facebook.com/groups/1373361046396315/permalink/2207514399647638/", "likes": 4, "comments": [{"username": "S Christian Everett", "comment_text": "Lordsboat.it"}, {"username": "Devon Chaiken", "comment_text": "I booked via YachtingandCo. The founder is a broker and she was able to accommodate where we wanted to visit and times. Worth reaching out."}, {"username": "Michelle Pratt", "comment_text": "Nautical Sic Sic"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nCapri-Blue-Grott\no-and-Positano-\nin-a-Day-Tour-f\nrom-Sorrento/\nd947-131843P12?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2207515932980818", "text": "Would anyone here be able to let me know the better place to stay at in La Spezia:\n\nVia Claudio Monteverdi\n\nOr\n\nTowards the end of Via Firenze (near Via Torino)\n\nThanks ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2207515932980818/", "likes": 0, "comments": []}, {"id": "2207522192980192", "text": "I know this is Italy\nBut San Marino is joined to Italy.\nWe are going both places next year.\nCan you put photos on here for San Marino\nIf not that's OK.", "link": "facebook.com/groups/1373361046396315/permalink/2207522192980192/", "likes": 20, "comments": [{"username": "Donna Holt", "comment_text": "We're going in September!"}, {"username": "Elaine Eitzer", "comment_text": "San Marino, a beautiful place."}, {"username": "Tara Dix", "comment_text": "Effectively it's a country within a country. It's fabulous, highly recommend."}, {"username": "Lucy Wong", "comment_text": "It’s a stunning magical place 🩷🩷🩷"}, {"username": "Lisa Abrams Argento", "comment_text": "Lisa Abrams Argento"}, {"username": "Carol Scime-Raiford", "comment_text": "Vatican City is independent of Italy as well"}, {"username": "Janet Lugar Miller", "comment_text": "Hey.. we are heading there late Sept!!"}, {"username": "Ted Niescier", "comment_text": "Go. Well worth it - spectacular views. Nothing like it."}, {"username": "Greg Saba", "comment_text": "Great spot for a day trip."}, {"username": "Tracy Brown", "comment_text": "Tracy Brown"}, {"username": "Tracy Brown", "comment_text": "Tracy Brown"}, {"username": "Nydia Bryan", "comment_text": "Love San Marinó"}, {"username": "Laura Abbott", "comment_text": "Laura Abbott"}, {"username": "Maria Villanueva", "comment_text": "Loved San Marino!♥️ We took a day trip from Rimini. Known for its medieval walled old town, and cobblestone narrow streets.😊"}, {"username": "Antonio Aloè", "comment_text": "Just google S.Marino images.I have been there 2-3 hiurs are enough..."}, {"username": "Jessica Thompson", "comment_text": "We loved making the trip. I was driving …and it was cool winding around and driving to the tippy top!!!"}, {"username": "Daisy BC", "comment_text": "Daisy BC"}, {"username": "Diana Subkova", "comment_text": "It's a beautiful place so it worth going."}, {"username": "Philip Curnow", "comment_text": "If you like crossbows and underground parking, this is the place for you. As for the Republic, they prefer cash."}, {"username": "Ville Lignell", "comment_text": "Italy has 12 officially recognised minority languages spoken within its territory. Two foreign states inside its borders aren't a big deal either."}, {"username": "Joe Guzzi", "comment_text": "Itbis not joined, it is within."}, {"username": "Tom O'Hara", "comment_text": "Meanwhile, Campione d'Italia is an Italian town 100% within Switzerland! 😱 I drive past it twice daily on my commute to/from work.\n\nhttps://\nwww.google.com/\nmaps/place/\nCampione+d'Itali\na,+Province+of+\nComo/\n@45.9685987,8.96\n49506,13.83z/\ndata=!4m6!3m5!1s\n0x47842e81bfd8b\nb5d:0x6e8f3afa9\ne05d1b1!8m2!3d4\n5.9703889!4d8.9\n710399!16zL20vM\nDFfemxn?entry=t\ntu"}, {"username": "Tamara Nopo", "comment_text": "Tamara Nopo"}, {"username": "Silvana Villella", "comment_text": "Silvana Villella"}, {"username": "Carmen Hoggar", "comment_text": "You can also google San Marino then hit images"}, {"username": "Jens Cn", "comment_text": "We made a visit there nearly 50 years ago when my parents took me to Milano Marittima for holiday, I way like 4 years old and very excited to visit a state within a state"}, {"username": "Mekea Bartlett", "comment_text": "We loved our day trip here!"}, {"username": "Sandra Maldonado", "comment_text": "Can always google San Marino and click on images"}, {"username": "Deborah Coram", "comment_text": "It’s absolutely beautiful and one of our favourite places. We stayed the night in an incredible place with to die for views. Was really quite magical. Thoroughly recommended! In fact the face photo I took of my son all holiday was in San Marino."}, {"username": "Deborah Coram", "comment_text": "We stayed in a gorgeous apartment where even the toilet had views!!!\n\nLink is here:\n\nhttp://\nbooking.com/\n?checkin=2023-08\n-09&checkout=20\n23-08-09&group_\nadults=1&aid=19\n46399&app_hotel\n_id&label=refer\n-UmFuZG9tSVYkc2\nRlIyh9YQ3vjaigq\nqmKPaND6NwDQNd2\ng63ccPde8JclFBq\nlyh2Q6bsKihD27F\nAkNltymfXtdQ&fr\nom_sn=ios"}, {"username": "Brenno Bianchi", "comment_text": "San Marino is a very nice day trip"}, {"username": "Frances McDonagh", "comment_text": "I was there 3 weeks ago its lovely"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Ken Lerch", "comment_text": "Ken Lerch"}, {"username": "Ken Lerch", "comment_text": "Ken Lerch"}, {"username": "Jessica Stewart", "comment_text": "My husband has family in San Marino we won’t be going this time but definitely next year. It’s beautiful I hear"}, {"username": "Ken Lerch", "comment_text": "Ken Lerch"}, {"username": "Laura Bolzic", "comment_text": "Of course you can, they are Italian speaking! San Marino and Vatican City are states within Italy."}]}, {"id": "2207525699646508", "text": "Cortina dampezzo", "link": "facebook.com/groups/1373361046396315/permalink/2207525699646508/", "likes": 21, "comments": []}, {"id": "2207499612982450", "text": "Anyone got any recommendations for staying in La Spezia? Preferably appartment with kitchen or b and b, for 2 people.", "link": "facebook.com/groups/1373361046396315/permalink/2207499612982450/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FVacationRen\ntalReview-g1878\n24-d4418178-Sta\ny_Under_the_Lig\nurian_Sun-La_Sp\nezia_Province_o\nf_La_Spezia_Lig\nuria.html"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207499642982447", "text": "What’s your favorite travel guide book for Italy ?", "link": "facebook.com/groups/1373361046396315/permalink/2207499642982447/", "likes": 3, "comments": [{"username": "Michael Broadwater", "comment_text": "Rick Steves"}, {"username": "Courtney Brown", "comment_text": "Rick Steves"}, {"username": "Sephora Cutajar", "comment_text": "Lonely planet"}, {"username": "Andrea Dawn Kidd Cook", "comment_text": "Rick Steve's Italy 🇮🇹"}, {"username": "Patrice Larry Stevens", "comment_text": "so disappointed that Rick Steves doesn't cover the Marches nor Southern Italy."}, {"username": "Dan Carr", "comment_text": "Dorling Kindersley\n\nhttps://\nwww.dk.com/us/\ncategory/travel/"}, {"username": "Shawn Hibbard", "comment_text": "Rick Steves\nYou can also learn a lot from his videos on Youtube. Download his app which offers audio tours of the different sites you visit. ￼"}, {"username": "Ken Vecchia", "comment_text": "Steves"}, {"username": "Karen Smart", "comment_text": "Rick Steves"}, {"username": "Kirsten Abrams", "comment_text": "Wandering"}, {"username": "Enrico Lecce", "comment_text": "There is only one road that heads to all locations of Italy 🇮🇹"}, {"username": "Phyllis Waring", "comment_text": "Rick Steves"}, {"username": "Shelley Perelmuth Sperling", "comment_text": "Thank you all"}]}, {"id": "2207485866317158", "text": "I made this itinerary for a 2-week trip.\n\nOpen for comments and suggestions!\nWe're traveling with a 5-yo and we're not into hiking.\n\nAlso, I have considered just using a 4-day Swiss Travel Pass for days 2-5.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2207485866317158/", "likes": 2, "comments": []}, {"id": "2207406579658420", "text": "Hello everyone!\n\nI am going to Italy in September and was wondering everyone’s recommendations for wineries or specific tours in Tuscany. We only have two full days there so would prefer to not drive long distances. Staying in Bagno Vignoni. We really would like to see Montalcino and Montepulciano. Thanks in advance and have really enjoyed reading everyone’s thoughts in this group!", "link": "facebook.com/groups/1373361046396315/permalink/2207406579658420/", "likes": 3, "comments": [{"username": "Dr-Jon Warnecke", "comment_text": "San Gimignano and Siena are must see cities there!"}, {"username": "Donna Brown Oliphint", "comment_text": "We’ll be in the Piedmont area in September."}, {"username": "Karrie LeBlanc", "comment_text": "We just did the tour at Frescobaldi Nippozzano that was the tour and Tuscan snack. Loved it. Your facility and Food and wine tasting was lovely in their original dining room. 2 hours long. Pre-book online only."}, {"username": "Valerie Collanton", "comment_text": "Poliziano in Montepulciano was wonderful."}, {"username": "Maria Delaney", "comment_text": "Torciano winery Estate, San Gimignano (Sienna). Not only our their wine good but the oils are phenomenal. We stay at the winery, do wine tasting, have a great lunch and enjoy the property."}, {"username": "Carolina Lamb", "comment_text": "Il-Cellese winery was fantastic!!!"}, {"username": "Kimberley Gray", "comment_text": "We went to Tuscan Soul Winery last September and it was great!!!"}, {"username": "Sue Levy Avinir", "comment_text": "Both towns are amazing. Try to also stop in Pienza. We liked that even better. Honestly there are wineries everywhere. Both Podere Le Ripi and Capanna were recommended to us."}, {"username": "Jennifer Erdman", "comment_text": "Following"}, {"username": "Jennifer Erdman", "comment_text": "I would love some recommendations\nfor Brunello Di Montalcino wineries."}, {"username": "Leigh Ann McCoy", "comment_text": "Thank you for everyone’s recommendations\n!"}, {"username": "Chiara Codecá", "comment_text": "Bagno Vignoni is a very smart choice, it's unique even among Tuscan villages, and geographically advantageous to visit the area. While you move around see if you can fit in the Abbey of Sant'Antimo, there's nothing like it. It's a very short trip from Bagno Vignoni and Montepulciano."}, {"username": "Donna Leigh Carlton Aguilar", "comment_text": "Enjoy your trip"}]}, {"id": "2207470739652004", "text": "Hi I'm going to spend 3 nights in Milan and a day in Bellagio and varrena I wonder about the schedule of the last train from Varrena to Milan and if I have to take the tickets in advance because I have to go back to my hotel in Milan to sleep and what are the best times to go and return", "link": "facebook.com/groups/1373361046396315/permalink/2207470739652004/", "likes": 2, "comments": [{"username": "निनावी सहभागी", "comment_text": "Up"}, {"username": "निनावी सहभागी", "comment_text": "Up"}, {"username": "Rita Levi Montalbano", "comment_text": "Use trenitalia.com and check by yourself"}, {"username": "Brenno Bianchi", "comment_text": "That train line is served only by regionale trains, it not necessary to buy the ticket in advance.\nThe last train from Varenna to Milan Central Station departs at 21,35 and arrives at 22,40."}]}, {"id": "2207494599649618", "text": "We visited Italy last year for 11 nights and it was beautiful! We are planning another trip next fall to try to hit some areas that we missed. We plan to stay a few nights in Venice and then we would like to see the Dolomites from there before heading to Florence. Any advice on the best way to get to the Dolomites and where to stay? I usually use trains but would be fine with renting a car if that is the best way.", "link": "facebook.com/groups/1373361046396315/permalink/2207494599649618/", "likes": 0, "comments": [{"username": "Amanda Kierans", "comment_text": "We rented a car and drove to ortisei which is beautiful. A train will only take you to Bolzano. I highly recommend Ortisei as a base"}, {"username": "Stephen Henn", "comment_text": "A car will definitely be the better option to experience the Dolomites. If you’re not comfortable driving a manual shift on steep hills with sharp curves be sure to rent an automatic. The Dolomites are breathtaking."}]}, {"id": "2207488776316867", "text": "Has anyone ever traveled to\nSala consilina campania Itlay?\nLooking for restaurants in the area.", "link": "facebook.com/groups/1373361046396315/permalink/2207488776316867/", "likes": 1, "comments": [{"username": "Amy Leadford", "comment_text": "That's the town where grandma's family was from. Go to the church and look up Rosa and Carmine Rusciano records. Priceless"}]}, {"id": "2207489126316832", "text": "My husband and I are going on a cruise on May 3rd for 10 days. We leave from Venice. My husband is an avid motorcyclist and would like to rent a motorcycle and tour for a few days. Questions are 1. Would it be best before or after the cruise? 2. Best places to tour? 3. recommendations on reputable companies to rent from? Thanks in advance for any positive feedback offered.", "link": "facebook.com/groups/1373361046396315/permalink/2207489126316832/", "likes": 1, "comments": []}, {"id": "2207489239650154", "text": "Word on the street is there is going to be a national general strike for public and private sectors on October 20th. The website mentions strikes for motorways and railways. Right now we need to get from Siena to Rome on that day. Should I just change my travel day? Or are there other options? What would you guys recommend? Bus? Private driver? Any advice would be greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2207489239650154/", "likes": 2, "comments": [{"username": "James-Kathy Dickerson", "comment_text": "Us too in Venice need to take the train...please share thanks"}, {"username": "Louis Des Forges", "comment_text": "Flixbus has several coaches per day between Rome and Siena."}, {"username": "Maria Delaney", "comment_text": "I would suggest getting to where you need to be the day before or hire a private driver."}, {"username": "Khushi Khanna", "comment_text": "Is this strike happening in Sicily as well ? We are supposed to travel from Ragusa to Palermo"}, {"username": "Alessandro Iannelli", "comment_text": "Not just \"word on the street\", it's in the calendar of strikes of the government's website: http://\nscioperi.mit.gov\n.it/mit2/\npublic/scioperi. It's a national strike, both air strike and train strike. Could it be cancelled? Possible, but not likely. Could it be moved to another day? I definitely don't think so. Will Italo workers go on strike as well? Probably."}, {"username": "Khushi Khanna", "comment_text": "Is the strike on Oct 20 or Oct 22? Am seeing different reports ."}]}, {"id": "2207490839649994", "text": "Any tips for doing a DIY Cinque de Terre day tour from Florence?\n\nTraveling with a 4-yo, w/ a travel stroller\n\nThank you in advanced", "link": "facebook.com/groups/1373361046396315/permalink/2207490839649994/", "likes": 2, "comments": [{"username": "Jessica Olivero", "comment_text": "I have no advice just that we went to Italy with our four year old last summer + had such a blast with him! Praying for a lovely time for your family!!"}, {"username": "Jerry Kiger", "comment_text": "Think some earlier post said Florence area easier to visit Tuscany region Vs CT which is 90-120 min away. Sure can be done just have the travel both ways"}, {"username": "Susan Vogel", "comment_text": "Viator has a day tour"}, {"username": "Laura Cardinale", "comment_text": "I suggest not to use The stroller, in None of The Cinque Terre is easy to use.\nIf you want to do a DYI look for Cinque Terre Express, it leaves from La Spezia. Ti reach La Spezia a train from Florence is enough."}, {"username": "Wendy Wallin", "comment_text": "With all the steps & hills a stroller will be a pain. Day trip - i know people do it but a few days would be preferable"}, {"username": "Kate Laidlaw", "comment_text": "Currently staying in Cinque Terre, having caught the train from Florence to La Spezia and onto Cinque Terre. It is doable in one day, but not all 5 towns.\n\nWould advise not to visit Corniglia, as this town in particular has A LOT of stairs up from the train station. The others are more manageable.\n\nEveryone with a stroller seems to have the dad carrying the stroller and mum carrying the kid… wouldn’t bother"}]}, {"id": "2207490969649981", "text": "Recommendations\non a reasonably priced driver from Praiano to Naples International Airport?", "link": "facebook.com/groups/1373361046396315/permalink/2207490969649981/", "likes": 2, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers"}, {"username": "S Christian Everett", "comment_text": "Dry mydaytrip.com\n\nCustomize times , location , car type etc.\n\nTens of thousands of 5 star reviews"}, {"username": "Christine Golia Brigida", "comment_text": "Amalfidrive4you"}, {"username": "Maria Delaney", "comment_text": "Taxi Mister Cab Driver-Naples & Amalfi coast- would highly recommend them."}, {"username": "Ornella Silvaggio", "comment_text": "Positano Tonytaxi"}]}, {"id": "2207492992983112", "text": "We will be driving down from Pisa to Viterbo and stopping a week there before driving back to Florence for a few days any suggestions for somewhere to stop on the way down that’s nice also things to see and do around Viterbo we do have a car for the duration TIA", "link": "facebook.com/groups/1373361046396315/permalink/2207492992983112/", "likes": 0, "comments": []}, {"id": "2207493169649761", "text": "We have several nights to dine on our own in Siena, Viterbo and La Storta. I would like to see our cook/chef prepare our meal. Sometimes called Chef counter, Chef table or cooking observation. I don’t want a cooking class just want to observe and of course experience the restaurant food. Any suggestions for these cities?", "link": "facebook.com/groups/1373361046396315/permalink/2207493169649761/", "likes": 1, "comments": [{"username": "Maria Delaney", "comment_text": "This restaurant was highly recommended and we are trying it, Restaurant Particolare di Siena, at the Chefs table"}]}, {"id": "2207494359649642", "text": "We visited Italy last year for 11 nights and it was beautiful! We are planning another trip next fall to try to hit some areas that we missed. We plan to stay a few nights in Venice and then we would like to see the Dolomites from there before heading to Florence. Any advice on the best way to get to the Dolomites and where to stay? I usually use trains but would be fine with renting a car if that is the best way.", "link": "facebook.com/groups/1373361046396315/permalink/2207494359649642/", "likes": 0, "comments": [{"username": "Heidi Littman Meiers", "comment_text": "we are flying into venice staying on the island a few days then getting a car, heading to Dolomites and then Tuscany where we will return the car , Ortisei, Selva valGardena or Cortina are good bases"}]}, {"id": "2207494486316296", "text": "Someone suggested to download the Wise App to cut down on bank transfer fees when travelling ?", "link": "facebook.com/groups/1373361046396315/permalink/2207494486316296/", "likes": 3, "comments": [{"username": "Sue Cornish", "comment_text": "Jules get an up account it’s better"}, {"username": "Allison Mir", "comment_text": "Or a Revolut card"}, {"username": "Eric Parks", "comment_text": "I've been using Wise a little over a year now. There are other options as well."}, {"username": "Mia Catalano", "comment_text": "We’ve just come back from Europe. We used our wise card everywhere. We downloaded the wise app and added money as we needed. The exchange rate was better through wise!"}, {"username": "Amanda Jayne", "comment_text": "If you are with HSBC, they do a global account, which can be used in any country. We used it in Canada no problems and the market rate of exchange is live."}, {"username": "Jude Finch", "comment_text": "Very happy with Wise card. No problems at all in Europe and UK and good exchange rate."}]}, {"id": "2207495352982876", "text": "Wanted to post about how good it was to sit at La Biga drinking a draft pint after a very hot day on a tour. I saw a similar post weeks ago and went here because of this page. 10 euro average pizza was worth this view in the shade!", "link": "facebook.com/groups/1373361046396315/permalink/2207495352982876/", "likes": 770, "comments": [{"username": "Julie Owens", "comment_text": "One of my favorite places to sit, sip vino, and people watch.\nA bonus…great food!\nIf there when cooler we had some of the best hot chocolate!"}, {"username": "Cindy Gorman", "comment_text": "Has anyone stayed at Torino hotel in Rome? If so thoughts and comments would be much appreciated"}, {"username": "Kevin Kappel", "comment_text": "Diana Kappel add this to the list"}, {"username": "Tanya Cja", "comment_text": "Jane Watson I love your post! Great picture!❤️"}, {"username": "Frank Hunt", "comment_text": "It’s not a pint but it is a beer!🍺"}, {"username": "Jenny Fitz", "comment_text": "What an awesome view."}, {"username": "Lily Nasery", "comment_text": "I heard the service is awful there! Is that true?"}, {"username": "Manuela Teves", "comment_text": "Looks delicious"}, {"username": "David Horgen", "comment_text": "I was just there yesterday"}, {"username": "Haylee Jeffery", "comment_text": "Robynne Douglass Matthew Douglass Courtney Jeffery Denzel Power lunch spot"}, {"username": "Selina Dionne", "comment_text": "Stuart Shaw"}, {"username": "Sally Warren", "comment_text": "Stayed around the corner with a view of Coliseo."}, {"username": "Emma Holmes", "comment_text": "Kevin Holmes"}, {"username": "Sharon Wilton", "comment_text": "Jennifer Rhodes"}, {"username": "Lynette Williams", "comment_text": "Darren Williams"}, {"username": "Anne Contini", "comment_text": "One of my fav."}, {"username": "Jane Watson", "comment_text": "Thanks for all the likes and nice comments. Feel free to follow my food blog on Instagram @Foodie_gla as I'll be doing Rome posts later this week"}, {"username": "Helen Lott Wanke", "comment_text": "Will be there in 3 weeks, can’t wait. I’ve never had a bad pizza in Italy!!"}, {"username": "Leyany Feijoo", "comment_text": "😍"}, {"username": "Lucie Thibodeau Davis", "comment_text": "I did the same!"}, {"username": "Amanda Walker", "comment_text": "Janet Wilkes looks like a nice place to go"}, {"username": "Phyllis Snyder", "comment_text": "Now that’s doing it right!"}, {"username": "Vai Anna", "comment_text": "Une ville remplie d'histoire ... un musée à ciel ouvert"}, {"username": "Gaby Devyll", "comment_text": "Gaby Devyll"}, {"username": "Ben G Caporella", "comment_text": "Great coffee their."}, {"username": "David Presta", "comment_text": "Marcia Presta"}, {"username": "Lisa Andria", "comment_text": "YUM!"}, {"username": "Rhona Veisfeld Modugno", "comment_text": "Doesn't get any better 😉"}, {"username": "Kim Glenn", "comment_text": "I sat right there!"}, {"username": "Sophie Arbrile", "comment_text": "Hope Df"}, {"username": "Luca Lookone Ferrentino", "comment_text": "As a Neapolitan I'd say that pizza is well below average. Looks frozen to me"}, {"username": "Lucie Archambault", "comment_text": "Spectacular! 😋"}, {"username": "Jeff McLellan", "comment_text": "I love that so few people know about that raised area as it provided an amazing backdrop for photos."}, {"username": "Shelby Dean Mayorga", "comment_text": "How’s the beer?"}, {"username": "Rachel Cox", "comment_text": "Anywhere that close to a main attraction is bound to have disappointing food. You pay for the view."}, {"username": "Shirley Zeki", "comment_text": "Shirley Zeki"}, {"username": "Terry Checketts", "comment_text": "Carolyn White Sabine Gill - @ Paul and Mikes Ciggy shop 🤣"}, {"username": "Linda Lloyd Bowles", "comment_text": "Priceless view!"}, {"username": "Olga Plitt", "comment_text": "That pizza doesn't good. Its in a tourist spot."}, {"username": "Cheryl Tomkinson-Hunter", "comment_text": "What a great picture!! Enjoy your pizza and 🍺"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Yum …. Thick crust !!!"}, {"username": "Brooke Chapman", "comment_text": "Mitch Corn"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "Love! Thanks for the recommendation!"}, {"username": "Cindy Breneman Hattrich", "comment_text": "I will be there the end of august and this is my go to"}, {"username": "Roger W Ilsley", "comment_text": "Great pic"}, {"username": "Mark Moylan", "comment_text": "Louise Moylan Got to do this."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "Looks good"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "I want to be there!"}, {"username": "Michael Westlake", "comment_text": "We spent an afternoon in that same spot. Watched the sun go down on the colosseum. Great way to spend a day. And the pizza was great!"}, {"username": "Rainha Jane", "comment_text": "Daryl Clark"}, {"username": "Jason Businaro", "comment_text": "Nice company"}, {"username": "Dawn Reau", "comment_text": "Yum"}, {"username": "Elsa Borrego Contreras", "comment_text": "Mario Contreras"}]}, {"id": "2207479822984429", "text": "Travelling to Milan between 19th and 24th September.\n\nAny suggestions with regards to what to pack in terms of clothing for that time of the year vis-a-vis the fact that it's at the north of Italy?\n\nWill also be going for a day to Lake Como and another to Lake Garda and possibly a day to Turin. Any advice for clothing for those areas too during those same dates?\n\nFinally...any tips for a solo traveller?\n\nGrazie 🙏🏻 😊", "link": "facebook.com/groups/1373361046396315/permalink/2207479822984429/", "likes": 1, "comments": [{"username": "Paola Coppi", "comment_text": "In September It begins tò Rain and to cool down a bit. Consider to wear different layers of clothes. Solo travelers don't suffer particular issues."}, {"username": "Rita Levi Montalbano", "comment_text": "A jumper or a hoodie is fine, maybe long trousers but not heavy ones"}]}, {"id": "2207416156324129", "text": "If you were going to choose four locations to use as epicenters for different regions, where would they be?", "link": "facebook.com/groups/1373361046396315/permalink/2207416156324129/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "I would have Bari as one. Lovely area and not overrun with tourists 🙄"}, {"username": "Jerry Kiger", "comment_text": "Most of the “home\nBase” ideas seem to be … Rome, Sorrento, Florence/\nTuscany, Amalfi Coast, Cinque Terre, Venice .. some type combo depend want city vs rural vs coast"}, {"username": "Gillian O'Callaghan", "comment_text": "Turin/Milan, Bologna, Florence, Rome, Bari, Puglia."}, {"username": "Paola Coppi", "comment_text": "Palermo for city center/ Palazzina Cinese/ Cefalú town- Naples for city center/Pompei/\nAmalfi coastiera- Rome for city center/roman Castle area- Trieste for sea atmosphere- Miramare Castle- old ghetto houses- James Joyce legacy- Nazi's concentration Camp of Resiera di San Sabba"}]}, {"id": "2207419139657164", "text": "Hi!\nI will be bringing two kids (2&4) at the end of March. Which would work better: a wagon or a stroller. I have a veer wagon which is a bit more compact than other wagons.\n\nPlanning on going to Rome, Tuscany and Amalfi Coast.", "link": "facebook.com/groups/1373361046396315/permalink/2207419139657164/", "likes": 2, "comments": [{"username": "Joe Gelardi", "comment_text": "All of Europe is somewhat challenging for walking"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Honestly? Neither will be ideal. Hills, steps and cobblestones will hinder you everywhere."}, {"username": "Daniela Parhar", "comment_text": "Only if it’s absolutely necessary I’d bring either of those because it’ll be very hard to move around with the crowds and the type of streets there. Having said this, I brought a very light and easy to fold stroller when I took my then 3 YO to Florence, Rome and some Cinque Terre. It did help with the fact that they’re long days and kids get tired of walking but my husband had to carry it up and down many, many, many stairs, hop on hop off buses, trains, etc. But don’t let this stress you out, you and your family will love it!"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Bring a nanny !"}, {"username": "Paula Rosati", "comment_text": "Not a double wide. Streets are narrow, crowded and paved in cobblestone."}, {"username": "Jamie Weston", "comment_text": "I bought a Cybex stroller with suspension wheels just for our trip and am so glad I did. So many uneven surfaces and steps."}, {"username": "Andrea Shelton", "comment_text": "No veer wagon. You need something like a Joovy sit and stand or tandem seating. Something that doesn’t take up an entire sidewalk and can fold up quickly to get out of the way."}, {"username": "Victoria Brkić Amodio", "comment_text": "We just got back earlier this week and we brought a compact wagon for our trip for our two kids. Honestly we didn’t use it much outside of airports because the streets are really hard with a stroller or wagon. So many packed, narrow and uneven sidewalks that made it too hard. Maybe a small umbrella stroller could work, but anything else will feel too big."}, {"username": "Christina Tassinari", "comment_text": "It’s tough with both to be honest"}, {"username": "Dr-Jon Warnecke", "comment_text": "Whatever you take, make sure it has large wheels to maneuver the ruts in the cobblestones"}, {"username": "Anna Gambino", "comment_text": "I have only seen strollers. Can you bring two umbrella strollers instead of a stroller that holds both of them? I have seen people with larger strollers struggling."}, {"username": "Debbi Mayfield", "comment_text": "A bottle of wine in each hand 🤣sorry couldn’t resist"}, {"username": "Rachel Tillman Cornish", "comment_text": "Strider bikes and/or a hiking backpack are also great options. Otherwise an umbrella stroller."}, {"username": "Kelly Barfield Burchill", "comment_text": "Yikes. I kinda feel you’ll be miserable with either. So many stairs on Amalfi coast. Rome I think I’d rather have mine in a stroller so that they are in front of me and I can keep an eye on them. Tuscany doesn’t matter… either or. Be prepared for a stairs and crowds."}, {"username": "Lisette Sangsari", "comment_text": "We had a compact single stroller with a 2 and 5 year old in May and though we were thankful to have it in some places esp to carry bags, realistically there were many times where my kids just walked or we ditched the stroller at the bottom (of a lot of stairs). More frequently it was easier for them to walk than deal with the stroller and crowds/stairs/\ncobblestone/\nlimited space.\n\nWhichever you go with, I wouldn’t recommend a really expensive unit in case you need to leave it outside/at the bottom of steps etc. I feel like a wagon would be more difficult to navigate than a stroller, plus the Veer is more expensive than other units and I would have had a harder time leaving something of value."}, {"username": "Carley Cole", "comment_text": "4 year old walks and wear the 2 year old this is what we did In Mexico when we went with kids that age"}, {"username": "Jackie Macleod", "comment_text": "What's a wagon?"}, {"username": "Jill Medrano Casey", "comment_text": "Something narrow and light weight. You need to be able to fit it on the narrow sidewalks as well as be able to carry it up stairs."}, {"username": "Kate O'Connor", "comment_text": "Carriers might work better give the rough surfaces?"}, {"username": "Amanda Gregson", "comment_text": "We’re just about to fly out of rome and we went rome,Florence,O\nmegna, Zermatt, Venice and took the mountain buggy nano. Only place it would be inconvenient is Venice.\nCould you take two compact strollers and have one each? I did see a couple of families using the snap duo… I’d recommend two compact strollers tho personally!"}, {"username": "Rhona OConnor", "comment_text": "You might be better picking more kiddy places that are not so busy. Some of the other cities are flat and easure to get around. Still have lots of interesting places to visit."}, {"username": "Jay Parekh", "comment_text": "Saw so many parents struggling with these. They end up carrying up and down stairs all the time. Elevators in boutique hotels are super small too."}, {"username": "Irene Oda", "comment_text": "Wagoner would be too cumbersome for you. A stroller would be better. Hopefully you will not be alone. When we traveled with our 2 year old we had to lift the stroller over many places. The wheels on our stroller were small, that didn't help at all. Italian strollers have bug wheels and a good suspension."}, {"username": "Brittney LePore", "comment_text": "I’m taking my 4 and 2 year old in early April (to the same locations as well)!! So I appreciated learning from your post 🙂. I definitely will not be “leaving the kids home”, even if it is difficult, so I hope that gives you some encouragement. I’d also never considered bringing their strider bikes… but now am wondering 🤔 haha. Also now considering doing a grocery pickup and ordering one or two small Italian brand strollers to get upon arrival. Will have to do some thinking!\nHope you guys have an amazing trip!!"}, {"username": "Danielle Wood", "comment_text": "We took our 1 year old to Rome in a stroller with absolutely no problem what so ever. There are lots of cobbles but also lots of flat areas so we were fine"}, {"username": "Danielle Wood", "comment_text": "Please don’t be put off by the people who haven’t took their toddlers with them, who are just assuming it will be difficult. We ventured everywhere by foot with the stroller, all the way from the colosseum to the Vatican and beyond"}, {"username": "Tania Badilla", "comment_text": "I used strollers (2 gb pockit+all terrain) for my kids. We got back 3 weeks ago and we were in Spain and Italy for 4 wks. My strollers saved my life 😂"}, {"username": "Monica Roman-Fazio", "comment_text": "I would definitely say a stroller. There are stairs everywhere, Hills and cobblestone streets. I would think it would be easier I saw many people with strollers."}, {"username": "Courtney Hyson", "comment_text": "I couldn’t see you using a wagon at all. I do see a-lot of people using the back packs that carry their small children. Maybe for the 2 year old you could use that and stroller for the 4 year old. Either way, it’s going to be rough in Rome. Very crowded in most popular spots."}, {"username": "Renee Rundle Stoneham", "comment_text": "Cobblestones, narrow sidewalks, hills, stairs….\n\nA backpack for the 2 year old.\nA very small compact stroller for the older one.\n\nAmalfi is lots of hills to climb and steps…"}, {"username": "Carmela Noble", "comment_text": "Either is gonna be tough but id go with the veer wagon because it’s a bit more rugged. I’ve never been to Tuscany so can’t touch on that but Rome and amalfi are all cobblestone. Depends what you’re planning on doing and where in amalfi coast. Certain towns are just cobblestone and thousands of steps."}]}, {"id": "2207428649656213", "text": "Has anyone taken the train from Rome to Sicily?", "link": "facebook.com/groups/1373361046396315/permalink/2207428649656213/", "likes": 1, "comments": [{"username": "Meami Craig", "comment_text": "F"}, {"username": "Ken Lerch", "comment_text": "I flew."}, {"username": "Isabelle Scicluna", "comment_text": "I did a long time ago though.. it is a slower train, that embarks directly on the ferry...so you have to make sure you get on the right coach...as the train is divide in 2...once you cross the channel, the part the goes to Palermo is hitched to one train whilst the other part thst goes to Syracuse is attached to another."}, {"username": "Janet Lowndes", "comment_text": "We’re going in October and have decided to fly, the train looks interesting but takes a long time."}, {"username": "Brenno Bianchi", "comment_text": "Right now only for train enthusiasts that want to see the train travelling the sea in the ferry.\nThe experience otherwise is quite dreadful at the moment. But the situation will improve in the next few years, in example Trenitalia has signed few days ago a 750milion euro contract to buy new modern cars for night trains. At the moment are still in use the same of the 1970s, revamped but still. And this is the smallest issue."}, {"username": "Larry Reinier", "comment_text": "Easier to fly for 45 minutes"}, {"username": "Amy LaBrecque", "comment_text": "We just did in June. It was very easy; we took the high speed Frecciargento from Termini at 7:30 to Villa San Giovanni at 12:30 (just about 5 hours). Took the short ferry to Messina (this part was a little unpleasant, the ferry was HOT and crowded, but thankfully it was very short). We then hopped on the local train to get to the Taormina area and we were pool side at the hotel by about 3 pm. Happy to answer any questions."}, {"username": "BatEl Kogman", "comment_text": "I would fly"}, {"username": "Linda Hill", "comment_text": "Yes did it 3 years ago.. the overnight train to Messina rhen Palermo….and had a sleeper bunk… was comfortable and train went on ferry."}, {"username": "Miyuki Kanno Paul", "comment_text": "We took an overnight ferry from Napoli to Palermo. Fabulous"}]}, {"id": "2207445669654511", "text": "Did the golf cart tour by Wheel Tours with passionate tour guide Antonella this morning, great experience to learn about the historical attractions of Rome! Highly recommended!!!", "link": "facebook.com/groups/1373361046396315/permalink/2207445669654511/", "likes": 3, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207469969652081", "text": "Headed to Italy for five days in September. Hubby wants to go to Venice, I’d like to see Cinque Terre but what’s realistic and where should we absolutely see in five days? We don’t want to cram and are ok with two or three places but want it to be meaningful.", "link": "facebook.com/groups/1373361046396315/permalink/2207469969652081/", "likes": 12, "comments": [{"username": "Diana Wilson", "comment_text": "Venice is unique"}, {"username": "Bellafab Fabrizio", "comment_text": "Cinque Terre cannot be done in a day. Venice can. Venice is magical you can do venice in a day. Go to cinqueterre when you have more time so you can swim, do the hikes and enjoy the local food"}, {"username": "Sandi Luna", "comment_text": "Venice. Five days. Murano. Burano."}, {"username": "Etienne Jean", "comment_text": "If you think doing both is too much, stay in Venice and do daytrips to Verona and Bologna. My favorite was Verona; the City if Romeo and Juliette. It's a beautiful City to spend a day. Have a great trip. Wherever you go in Italy, you will enjoy it's uniqueness."}, {"username": "Debbie Milne Jenkins", "comment_text": "I like at least one overnight in Venice, so a day and a half? When the day trippers leave Venice is so much more enjoyable - St. Mark’s Square is great in the evening. We took a train from Venice to Cinque Terre - if you have 3 full days there it gives you time to do one of the walks between villages, visit Portovenere and take the train between villages to take your time in each. We stayed in Montorosa once north of the train station once south of it. Both areas are great choices!"}, {"username": "Ken Lerch", "comment_text": "‘Not certain what you’re asking about, but here goes. With 5 days, picking two walking venues on opposite sides of the country doesn’t quite fit with “don’t want to cram.” Sure, do 2 days in each with a travel day between. But “meaningful” would be one location with maybe a day trip nearby."}, {"username": "Kate Laidlaw", "comment_text": "We’re currently staying 4 nights in Cinque Terre. You can certainly cram a lot into a day but we’re very much enjoying relaxing, drinking wine on our balcony, swimming, we did some hiking etc. it has been the best stop of our Europe trip so far."}, {"username": "Mieke De Cnodder", "comment_text": "You really dont need 5 days for venice. 1 or 2 days is enough"}, {"username": "Deborah Schroeder", "comment_text": "Asking a lot. If you are feeling adventuresome from Venice-look at the catamaran to Istria, Croatia for the day. I briefly looked at it but didn't look in detail."}, {"username": "Gillian O'Callaghan", "comment_text": "Presume 6 nights so 2 in Venice (1 full day) then head to Cinque Terre. Depends too where you're flying out from."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Do Venice right. Five days is good. Magical place!"}, {"username": "Maria Antidormi Corica", "comment_text": "This is my opinion. I went to Venice in 2016. I have just left there and I can say I didn’t enjoy it as much. Was it it because I’d already seen it? Not sure. Very underwhelming this time"}, {"username": "Alicia Cox", "comment_text": "I agree with the ones that are saying 3 in cinque terre & 2 in Venice - but one of those days would do Murano & burano half day each."}, {"username": "Susana Stubbs", "comment_text": "If both Venice and Cinque Terre are a must on this trip then I’d do 1 day in Venice, 2 days in Cinque Terre and 1 day in Florence. 1 day to accommodate for travel between places and a pit stop in Pisa en-route to Florence (from Cinque Terre). Or 2 days in Venice, 1 day in Verona and 2 days in Cinque Terre. The latter being less of a cram."}, {"username": "Jenny Kendrick", "comment_text": "Venice is lovely we did a Viator tour Venice in a day included gondola ride"}, {"username": "Maria Delaney", "comment_text": "We stayed in Venice about 3 days about 3 years ago and still didn’t seen everything. We are going back for 5 days and doing the islands for two days including going to the winery, and visiting the neighborhoods and site that we didn’t see. You can also go to Padua which is a 30 minute train ride. Good luck and have fun."}, {"username": "Vanessa Durkin", "comment_text": "Defo 2 days in venice then cinque terra rest of time"}, {"username": "Lucrezia Folger", "comment_text": "Well if you want to go to Cinque Terra and him Venice and you only have 5 days, then that's where you should go. 3 days in one place, 2 days in the other. Coin toss and see which place gets the extra day. Definitely not 3 places."}, {"username": "Kylie Tonkin", "comment_text": "We spent 3.5 days in Venice and could easily have spent more. Depends if you want to explore and experience a city, or just tick off the big ticket attractions. I prefer to experience. One day we bought a 24 hour water bus pass, spent half the day in Burano then just went from water bus to water bus lapping the island and canal. It was a fantastic day!"}, {"username": "Dawn Falsinotti", "comment_text": "One day in Venice? Ridiculous!"}, {"username": "Nadia Nadia", "comment_text": "3 days CT 2 days Venice ( that what I am doing"}, {"username": "Linnea Kay Wammack", "comment_text": "We spent 9 days in Italy several years ago. When I go back those are the two places we’ll stay. Three days in Cinque Terre to see the towns and two in Venice might work. It’s a three hour drive between the two."}, {"username": "Christine Aird Craig", "comment_text": "I would stay the whole time in Venice\nYou could to cinque terra in a day. Take the train from la spezia and visit each one in turn either walking or getting the train from one to the other. But it’s too far from Venice for the day"}, {"username": "Krissy DaRusso", "comment_text": "2 days Venice, 3 in CT"}, {"username": "Jean Bean", "comment_text": "Michelle Janke this is the FB group I mentioned"}, {"username": "Miyuki Kanno Paul", "comment_text": "Do you have 5 nights or 4 nights?"}]}, {"id": "2207470202985391", "text": "Has anyone used viaseeamalficoast.com? My invoice has a down payment amount that I can pay online, and the rest to be paid in cash at the end of tour. Does this sound legit? I don’t mind that, but how can I know that I will be picked up and that this isn’t a scam?", "link": "facebook.com/groups/1373361046396315/permalink/2207470202985391/", "likes": 0, "comments": [{"username": "Maria Delaney", "comment_text": "There nothing wrong with what they are asking but I would strongly suggest using Taxi Mister Cab Driver-Naples & Amalfi coast- who is absolutely fantastic. One of the best tours ever."}]}, {"id": "2207471416318603", "text": "🇮🇹 Ciao, fellow travelers! 🇮🇹\nI just had the most incredible time exploring the beautiful city of Bologna, and I couldn't wait to share my experiences and some helpful tips with all of you.\nBologna is truly a hidden gem with its rich history, vibrant culture, and delicious food scene. 🍝 During my stay, I discovered some fantastic spots that I believe every traveler should check out. Here are a few tips to make the most of your time in Bologna:\n🏰 Don't miss the majestic Piazza Maggiore, the heart of the city! The stunning architecture and lively atmosphere will leave you in awe.\n🍦 Treat yourself to the world-famous gelato at Gelateria Gianni – you won't regret it! Their unique flavors are a taste of heaven. 🍨\n🍽️ For an authentic culinary experience, head to Osteria dell'Orsa, where you'll find mouthwatering pasta dishes that are sure to delight your taste buds.\n🚶‍♀️ Take a leisurely stroll through the charming streets of the Quadrilatero district, filled with local shops and markets. It's a shopper's paradise!\n🏡 If any of you are planning a trip to Bologna and need a great place to stay, you can check out this apartment https://rb.gy/08oxm.\nPlease feel free to ask any questions you might have!", "link": "facebook.com/groups/1373361046396315/permalink/2207471416318603/", "likes": 5, "comments": [{"username": "Maria Delaney", "comment_text": "Could you please provide the link to the place as this one isn’t working. Thanks"}, {"username": "Simone Pfenninger", "comment_text": "I loved Bologna and regret, that I didn't spend more than a day there."}]}, {"id": "2207477389651339", "text": "Is there an easy way to get from Civita di Bagnoregio directly to Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2207477389651339/", "likes": 7, "comments": [{"username": "Petra Keen", "comment_text": "We were there in June and were staying in Orvieto. Train from orvieto to Rome then take high speed train from Rome to Naples which took us 1 hr 10 min."}, {"username": "Mike Ball", "comment_text": "Train to Orvieto via Rome is the best way, you are looking at a 3 hour train journey then a bus from Orvieto unless you hire a car ."}]}, {"id": "2207481619650916", "text": "Has anyone used a transfer service from Bari airport?", "link": "facebook.com/groups/1373361046396315/permalink/2207481619650916/", "likes": 0, "comments": []}, {"id": "2206844813047930", "text": "EDIT: thank you all for the wonderful suggestions, I found a super cheap one in Trieste! Will do me until I’m home. Thanks again!!\n\nHello, does anyone know of where I can find any cheap suitcase in Trieste or Venezia? I am looking online for stores but I don’t see anything that looks inexpensive. Doesn’t need to be the best quality I just need an extra suitcase to get home.", "link": "facebook.com/groups/1373361046396315/permalink/2206844813047930/", "likes": 4, "comments": [{"username": "Candy Cooper Martin", "comment_text": "If you can’t find a suitcase buy a duffle bag and put all your clothes and shoes in it! We had to do that on a couple trips. This time we are taking our duffle bag rolled up in my carry on to have it ready for the return trip!"}, {"username": "Jenny Payne", "comment_text": "Can’t you ask someone at your hotel or airb&b? Do they not have an OVS store?"}, {"username": "Erica Senes Tombesi", "comment_text": "In Trieste looking in the shops around via ( street) Roma. This shop sells clothing but also suitcase, very cheap normaly"}, {"username": "Anna O'Connor", "comment_text": "In Venice when you get off the train and turn left, there are heaps of street stalls selling suitcase."}, {"username": "Carmine Castiglia Jr", "comment_text": "You can often find them at weekend street markets."}]}, {"id": "2207233986342346", "text": "Sylvester Stallone goes way back.", "link": "facebook.com/groups/1373361046396315/permalink/2207233986342346/", "likes": 261, "comments": [{"username": "Doris Sarmiento", "comment_text": "Igualito"}, {"username": "Annette Giovia", "comment_text": "OMG it does look like Sly! It's the Italian nose. Lol!!"}, {"username": "Shannon Packard", "comment_text": "🤣 Well played!"}, {"username": "Kristi Jack-Rodgers", "comment_text": "James Rodgers lol"}, {"username": "Teresa Shawn Lane", "comment_text": "I found a statue in Florence that looked like Will Ferrell!"}, {"username": "Lynn Clemens", "comment_text": "Mark Clemens"}, {"username": "Deborah Bern Bedgood", "comment_text": "I found Salvador Dali at the Vatican!"}, {"username": "Carlos Arotinco", "comment_text": "Where is this exactly Lmaoo?"}, {"username": "Judy Carey", "comment_text": "Nicely played."}, {"username": "Jonna Rohrbaugh", "comment_text": "Tim Rohrbaugh"}, {"username": "Lisa Wylin", "comment_text": "Thanks for the laugh!😂"}, {"username": "Vladimir Boskovic Serrudo", "comment_text": "I like how shady they all look"}, {"username": "MyTrinh Tammy Nugen", "comment_text": "Hahaha...."}, {"username": "Julie Emr", "comment_text": "Best post of the day!😂"}, {"username": "Adele Thomas", "comment_text": "Chrissy Thomas 😂"}, {"username": "Terri Orf", "comment_text": "Omgeeeee!!!"}, {"username": "Jackie Jay", "comment_text": "Where's arnold?"}, {"username": "Curtis N Lucia", "comment_text": "Lussi Mei"}, {"username": "Malwina Maliniak", "comment_text": "Italian Sly 😁"}, {"username": "Ron Ashplant", "comment_text": "Chris Ashplant"}, {"username": "Ans de Vries", "comment_text": "haahaa!"}, {"username": "Marie Malone", "comment_text": "Cloning over the centuries."}, {"username": "Irina Sheynin", "comment_text": "This is hilarious 😂"}, {"username": "Crystal Hodges", "comment_text": "Cody Dylan 😂"}, {"username": "Teresa Shawn Lane", "comment_text": "Rocky Richardson check out the comments too. I put the one we found in there too!"}, {"username": "D.N. Virgo", "comment_text": "Good eye!!! That is great!!!"}, {"username": "Vivian Scarpino", "comment_text": "Happiness pandemic 😂😂😂"}, {"username": "Suzanne Sullivan", "comment_text": "I just saw him myself! Lol"}, {"username": "Carol Withey", "comment_text": "Hahahaha"}, {"username": "Jon Ciccarelli", "comment_text": "Time Traveling Rambo!"}, {"username": "Alessandro Iannelli", "comment_text": "ahah uncanny."}, {"username": "Heather Sechrist", "comment_text": "I raise you nekkid Santa catching a piggyback."}, {"username": "Teresa Brewer Harkins", "comment_text": "Teresa Brewer Harkins"}, {"username": "Debbie Potter", "comment_text": "I wonder if he knows that's there?"}, {"username": "Andrea Bledsoe", "comment_text": "What a spitting image of him 😀"}, {"username": "Bern Louna Proctor", "comment_text": "Bee Jane lol Our Tulsa King!"}, {"username": "Christine Pelosi", "comment_text": "Karen Soldani, remember Dr Rocky pointed this out in one of his webinars?😂"}, {"username": "Christine Pelosi", "comment_text": "Karen Soldani, remember Dr Rocky pointed this out in one of his webinars?😂"}, {"username": "Gregory Hawkins", "comment_text": "So have Woody and Sam…"}, {"username": "Mona Sidhu Samrari", "comment_text": "Oh yea lol"}, {"username": "Deborah Jones", "comment_text": "That is hilarious!"}, {"username": "Linda Robertson", "comment_text": "Linda Robertson"}]}, {"id": "2207235453008866", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207235453008866/", "likes": 3, "comments": [{"username": "Simeon Georgiev", "comment_text": "Simeon Georgiev"}]}, {"id": "2207236883008723", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207236883008723/", "likes": 1, "comments": [{"username": "Peter Barron", "comment_text": "Can’t wait to visit here. Any tips Jon?"}]}, {"id": "2207270499672028", "text": "Are the plug outlets in Italy as in the US or is a converter/adapter needed?", "link": "facebook.com/groups/1373361046396315/permalink/2207270499672028/", "likes": 8, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Adapter is for the shape of the plug Converter changes the voltage"}, {"username": "Enrico Lecce", "comment_text": "Converter needed also the high frequency would benefit your charging quicker than usa..."}, {"username": "Alessandro Iannelli", "comment_text": "Volt and shape of the outlet are two different things. Some appliances are dual voltage, but you will still need the adapter. Some appliances are not dual voltage so you will need an adapter AND a converter (a good one)."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/47lv2sV"}, {"username": "Ian Beyer", "comment_text": "Italy has three types you’re likely to find:\n\nThe first is the old-school “Type L”, which is 3 pins in a row, and the outer pins are annoyingly incompatible with the newer EU standard type C (ungrounded) or Type F (grounded). Most newer outlets will be the Type F commonly known as “schuko” that is now standard throughout most of Europe.\n\nItaly is 230V/50Hz. As long as your equipment can handle that (most electronics can), you just need to adapt."}, {"username": "Marty Harte", "comment_text": "Amazon comes in 2 packs. This was perfect for us."}, {"username": "Bijoy Krishnan", "comment_text": "Converter not required, but adapter"}, {"username": "Brice Blosser", "comment_text": "Converter. This is the one we have and I used when stationed in Europe. https://\nwww.amazon.com/\nBESTEK-Converter\n-3-Outlet-Trans\nformer-Adapters\n/dp/\nB076S2WGYL?pd_rd\n_w=eTBUv&conten\nt-id=amzn1.sym.\nd6de0d9a-b966-4\ne97-9c0f-b9688b\n6db068&pf_rd_p=\nd6de0d9a-b966-4\ne97-9c0f-b9688b\n6db068&pf_rd_r=\nM5CD3CSAXCWZSS7\nNVNS4&pd_rd_wg=\n0rgJJ&pd_rd_r=f\ndcafa31-65f5-4f\nc7-9e9d-d2984aa\n2659b&pd_rd_i=B\n076S2WGYL&psc=1\n&ref_=pd_bap_m_\ngrid_dv_rp_0_69\n_nped_t"}, {"username": "Lalita PosBa", "comment_text": "Converter needed. I got mines at Aldi store"}, {"username": "Maria Lucio", "comment_text": "Send a friend request to Mrs Rosalinde Joubert Erasmus tutulungan ka niya, nagpagawa ako ng sarili kong bahay at meron din akong grocery store through his company, legit siya at mapagkakatiwala\nan.\npadalhan mo muna siya ng friend request\n👇👇👇👇👇👇👇👇\np.m\nhttps://\nwww.facebook.com\n/\nRosalindeJoubert\nErasmusFx"}, {"username": "Paul Anderson", "comment_text": "Buy adapters at the grocery stores in Italy. They are cheap and easy to find."}, {"username": "Larry Dash", "comment_text": "Universal adapters can be bought cheaply on Amazon. I’ve used it for Europe, UK and Africa"}, {"username": "Angie Callejas", "comment_text": "Where have you been?"}, {"username": "Sara Smile", "comment_text": "Why are these people laughing? If someone has never been told and never traveled, how would they know? I thought this was the place to ask questions? 🤷🏻‍♀️"}, {"username": "David King", "comment_text": "Our hotels in Venice as well as our Airbnb, had Type F and Type C.\nI would plan to arrive in Venice with those two adapters already on hand— Venice is the last place in Italy I’d want to try to hunt for sundries…"}, {"username": "Larry Reinier", "comment_text": "What everyone else said"}, {"username": "Dixie Kotylak", "comment_text": "Need a converter"}, {"username": "Heather Weiss", "comment_text": "You need a converter"}, {"username": "Lisa Flanders", "comment_text": "We used this. Adapted to UK, Greece, Italy, Switzerland, and France.\nIt was in the luggage section of my local Walmart. Or go to Walmart.com\nAlso has 3 usb and a light on it."}, {"username": "Monica Roman-Fazio", "comment_text": "Amazon has the adapters"}, {"username": "Lynda A. Lavin", "comment_text": "Always buy a converter in the country you need it for."}, {"username": "Antonio Aloè", "comment_text": "You need an adapter not a converter,buy a multiple plug adapter in Amazon"}, {"username": "Vanessa Garces", "comment_text": "You need an adapter, however all hotels and most airbnbs have them available. You need to check with them"}, {"username": "Bonnie Rodgers Henderson", "comment_text": "I always travel with a converter and adapter."}, {"username": "Terri Lenz", "comment_text": "I just purchased this one for our upcoming trip to Positano"}, {"username": "Andrea Shelton", "comment_text": "Please learn the difference between an adapter and a converter before plugging in any 110 hair appliances."}, {"username": "Rosanna Hardeman", "comment_text": "They’re different and you will need an adapter."}, {"username": "Debbie Marvin", "comment_text": "I am traveling to Greece and Italy. Will my adapter work in both countries or do I need different ones?"}, {"username": "Sue Ellen Thomas", "comment_text": "Purchase dual voltage hair appliances along with adapters!"}, {"username": "Mike McClane", "comment_text": "Why are you asking?"}, {"username": "Sandy Radican Shikaly", "comment_text": "You need an adapter for the plug... a converter changes voltage. Phones are dual voltage so only an adapter is needed.. Appliances need to be dual voltage or use a converter.. but even with a converter your appliance might burn up"}]}, {"id": "2207313799667698", "text": "Hi!! I want to book a 12h Cinque Terre excursion. Would you recommand the one with or without lunch included?? Thanks in advance🤗", "link": "facebook.com/groups/1373361046396315/permalink/2207313799667698/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCinque-Terre-Hik\ning-Day-Trip-fr\nom-Florence/\nd519-5070CINQUE?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Maria Delaney", "comment_text": "I usually would rather do lunch on our own because we are foodies and will research the town for them."}, {"username": "Rebecca Yeoh", "comment_text": "With! I did this tour and the food was amazing👌🏼"}]}, {"id": "2207395669659511", "text": "I know Rome had storage for holding bags but do they have lockers so we can lock up our things. He doesn’t trust leaving our bags in an open room.", "link": "facebook.com/groups/1373361046396315/permalink/2207395669659511/", "likes": 1, "comments": [{"username": "Karen Landini", "comment_text": "I've seen good reviews of this locker service...https://\nwww.stowyourbags\n.com/en/shop/\nrome/\nluggage-storage-\ntermini-train-s\ntation-rome/"}]}, {"id": "2207396839659394", "text": "What is the best way to travel from Florence to Verenna?", "link": "facebook.com/groups/1373361046396315/permalink/2207396839659394/", "likes": 0, "comments": [{"username": "Carolyn Chambers Rosamilia", "comment_text": "Carolyn Chambers Rosamilia"}, {"username": "Julchen Zamora", "comment_text": "Train"}, {"username": "Giessica Bormio", "comment_text": "Only the way Is by train or by car"}]}, {"id": "2207398569659221", "text": "Opera singers of 3 Tenors ?", "link": "facebook.com/groups/1373361046396315/permalink/2207398569659221/", "likes": 0, "comments": [{"username": "Ville Lignell", "comment_text": "You mean Il Volo? They are not opera singers..."}, {"username": "Julia Ruby", "comment_text": "Pavarotti/\nDomingo/Carreras\n\nPavarotti is no longer living so the trio is no more.\nThere may be copycats, but they were the OG."}, {"username": "Jayne Parker", "comment_text": "I guess tribute 3 tenors in rome. Ang good\nAnd opera singers in at Paul’s"}, {"username": "Miyuki Kanno Paul", "comment_text": "What about them? Please define your question"}, {"username": "Marcus Cove", "comment_text": "https://\nimages.app.goo.g\nl/\nEQjdABuWBuoPzxhU\n9"}]}, {"id": "2207399542992457", "text": "Everyone, please give me the address host/homestay/ hotel on the night of September 28 in Milan and September 29 in Venice for 5 people. I need a reasonably priced place. Thank you everyone.", "link": "facebook.com/groups/1373361046396315/permalink/2207399542992457/", "likes": 3, "comments": [{"username": "Châu Giangg", "comment_text": "Trần HiềnNguyễn Kim AnhQuỳnh NgaMinh Ngọc"}, {"username": "Minh Ngọc", "comment_text": "."}, {"username": "Helen Ladkin", "comment_text": "Maybe try putting your dates and requirements into booking, com and then reserving directly."}, {"username": "Quỳnh Nga", "comment_text": "."}]}, {"id": "2207406372991774", "text": "Hey fellow travelers! Has anyone stayed at the Hilton in Venice? Suppose to be the largest hotel there and was an old flour mill. It looks beautiful on YouTube 😁", "link": "facebook.com/groups/1373361046396315/permalink/2207406372991774/", "likes": 0, "comments": [{"username": "Jackie Macleod", "comment_text": "It's not in Venice, it's on the island of Giudecca"}]}, {"id": "2207407136325031", "text": "Another good place to visit! There are three options, available here, inside, under and on top of theCathedral. Lastly, you can visit the museum as well.", "link": "facebook.com/groups/1373361046396315/permalink/2207407136325031/", "likes": 0, "comments": []}, {"id": "2207409669658111", "text": "In Florence currently; suggestions on where to get pasta in a cheese wheel. Not sure the Italian name for it", "link": "facebook.com/groups/1373361046396315/permalink/2207409669658111/", "likes": 36, "comments": [{"username": "Pietro Adami", "comment_text": "Probably talking of Cacio e pepe pasta?"}, {"username": "Ken Vecchia", "comment_text": "Not sure in Florence but seen here plenty saw the other night at Olive Garden"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Ugh! Please no!"}, {"username": "Camille Meigneux", "comment_text": "Camille Meigneux"}, {"username": "Sandy Radican Shikaly", "comment_text": "Sandy Radican Shikaly"}, {"username": "Carole Garron", "comment_text": "I’ve only seen that in rome"}, {"username": "Sandy Radican Shikaly", "comment_text": "Sandy Radican Shikaly"}, {"username": "Jamie Bly", "comment_text": "Get Florentine steak!!!!!\nGo to Da Lino…. You share the steak as its 1 kilo and order sides to share. Have an amazing glass of Chianti wine. You won’t be disappointed"}, {"username": "Valerie Collanton", "comment_text": "Never heard of such a thing."}, {"username": "Elena Ciraulo", "comment_text": "Maybe you mean pasta nella forma… I don’t think this typical, but you can find it here: https://\nwww.osteriapaste\nlla.it/"}, {"username": "Kathi Keefauver Thompson", "comment_text": "Saw them serving it at La Buchetta Thursday night"}, {"username": "Giessica Bormio", "comment_text": "Do you mean cacio e pepe??????"}, {"username": "Andrea Hirsch", "comment_text": "We never saw it done until we went to Bellagio in Lake Como"}, {"username": "Giessica Bormio", "comment_text": "Anyway cacio e pepe Is not a Florence dish"}, {"username": "Jill Tingley", "comment_text": "Now doing at Italian restaurant in Cabo. But would rather have in Italy"}, {"username": "Ramona Galea", "comment_text": "I took that at Osterio pastella. It was amazing"}, {"username": "Rita Gnida", "comment_text": "Get some tagliatelle with truffle - so good!"}, {"username": "Patrizia D'Arcangelo", "comment_text": "I am Italian. It doesn't seem like a traditional Italian dish to me. It's probably a dish they offer to tourists, so I don't know the name"}, {"username": "Brenda Bass", "comment_text": "La Buchetta!"}, {"username": "Lauren Velleno", "comment_text": "La Buchetta has it. Great restaurant! You will need a reservation."}, {"username": "H Raymond Fasano", "comment_text": "That’s not a Florentine dish. That’s Massapequa, NY."}, {"username": "Vanessa Jimenez", "comment_text": "Osteria Pastella! We’re going at the end of the month and I booked our reservation! The reviews in general at this restaurant were amazing so can’t wait to try it!!"}, {"username": "Carol Bayley", "comment_text": "Bellagio. 😂 pasta in cheese wheel looks fantastic. So cool the waiters do at the table."}, {"username": "Lisa Burek", "comment_text": "Cacio e pepe ! Yum"}, {"username": "Bellafab Fabrizio", "comment_text": "Not sure but if you want the best foccacia sandwich you have ever eaten go to All'Antico Vinaio"}, {"username": "Brooke Barron", "comment_text": "Osteria Pastella. I was just there last month. I HIGHLY recommend making a reservation. They were packed from the moment they opened at noon."}, {"username": "Bonnie Manter", "comment_text": "Cacio pepi"}, {"username": "Jessica Beghtel", "comment_text": "Lucky for me, my family and I are indeed tourists. This is one thing on my 9 year olds list to do while here. Thank you everyone for the helpful comments."}, {"username": "Phyllis Flowers", "comment_text": "In Brooklyn NY 😂"}, {"username": "Dianne Loucks", "comment_text": "Had that in London"}]}, {"id": "2207412126324532", "text": "Planning to go to Italy next May we are going to Rome,Florence and Amalfi Coast. I am a bit unsure on where to go in Amalfi. I heard Sorrento is nice I love the lemons and i would like to see Capri. Any suggestions where to visit in the Amalfi for our first trip to Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2207412126324532/", "likes": 4, "comments": [{"username": "Stacy Prestigiacomo", "comment_text": "Stay in amalfi very easy to access Capri , positano by ferry"}, {"username": "Danielle Marilyn", "comment_text": "I would stay in Positano! Positano was my favorite place I visited on the Amalfi coast and I stayed in Amalfi and Sorrento. Positano was truly magical, you have to stay there and not take a day trip."}, {"username": "Catherine Lanphier", "comment_text": "F"}, {"username": "Marie Ring", "comment_text": "We loved Positano!! We stayed two nights in Sorento, (did a day trip to Capri while staying there) and then went to Positano for two nights. We can’t wait to go back!"}, {"username": "Raf Gervasio", "comment_text": "Ischia is lovely too"}, {"username": "Karen Schmidt", "comment_text": "We are doing almost the same. I decided on Ischia instead as May is almost high season apparently, and didn’t want to risk big crowds in Positano"}, {"username": "Natalie Farrow", "comment_text": "We’re considering the same itinerary and have decided on Positano. What cities are you flying in/out of?"}]}, {"id": "2207416946324050", "text": "Headed to Verona for a few days.\nWhat are top/must to see & do? Any food recommendations are also welcome. ☺️ Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2207416946324050/", "likes": 1, "comments": [{"username": "Pietro Adami", "comment_text": "If you use the search function in the group, the lens, and digit Verona as key, you should find several suggestions including a few reccomdndations\nfor lunch / dinner from me and other members"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207417449657333", "text": "Hi, spending money question. We are planning on taking a few hundred euros in cash then taking bank cards to spend on. Do most places accept visa debit cards. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2207417449657333/", "likes": 3, "comments": [{"username": "Lucrezia Folger", "comment_text": "Yes. Use you Visa card."}, {"username": "Paola Zirpola", "comment_text": "Yes"}, {"username": "Anna Gambino", "comment_text": "I use my visa when needed. Never use my debit card even in the US. Too much fraud. Credit card companies will dispute. Banks will be a headache and your cash is gone."}, {"username": "Bianca Hillier", "comment_text": "Have been using visa debit for the last 3 weeks I’ve been in Italy! Have had no issues, only taken out cash when I have needed to. Little trick I was taught when taking out cash is to wriggle the slot you insert your card in at arms - if it is wobbly at all, do not use it!"}, {"username": "Lori Wroblewski", "comment_text": "I only used euro when trying to make deals with the vendors of the souvenir stands"}, {"username": "Wendy Spano Bracco", "comment_text": "Check if your debit card charges transaction fees. If this is how you plan on charging items. Mine does and years ago was a big surprise. I since got a Chase Sapphire card with no foreign transaction fees. Also due to fraud, debit not really recommended."}, {"username": "Rhona OConnor", "comment_text": "Good plan. Use a card with no cross border fees for converting to Euro 💶"}, {"username": "Patricia Hardiker", "comment_text": "Thanks for the info."}, {"username": "Eileen Muro", "comment_text": "Yrs. We had no issues. We took 500 Euros and our cards. We were there for 10 days and in the last day we still had 300 left. Most places took card so we rarely used cash."}, {"username": "Madeline Caporale", "comment_text": "Visa and Mastercard are widely accepted. Use your ATM/debit card only at bank affiliated ATMs should you need to withdraw additional euros."}, {"username": "Laura Uribe", "comment_text": "We only use a debit card for cash withdrawals from bank ATM’s, even in your home country. If your card is spoofed, they have access to all of your money. It’s a nightmare to resolve."}, {"username": "Laurel Waggoner Archey", "comment_text": "Use a credit (not debit) card with no international transaction fees; it offers insurance against fraud - most debit card transactions have limited protection. Plus, credit cards offer additional travel insurance that may be useful."}, {"username": "Vanessa Durkin", "comment_text": "Yes revolut csrd is a great one can use your phone to pay or use credit cards some places dont take cash so found it very easy only having to really protect my phone"}, {"username": "Miyuki Kanno Paul", "comment_text": "Use debit card only at ATM. Everything else with a plastic card, you should use regular credit card such as VISA or MasterCard"}, {"username": "Costero Home", "comment_text": "Yes"}]}, {"id": "2207430002989411", "text": "If you liked your Airbnb or VRBO in sorrento (and didn’t have a car rented) let me know which one and the positives and negatives please! My hubs and I (2 ppl) are looking for May end/early June of ‘24. Pointers much appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2207430002989411/", "likes": 5, "comments": [{"username": "Margie West", "comment_text": "https://\nwww.villaelisaso\nrrento.com/\nmobile/\n\nGreat location with wonderful owners."}, {"username": "Michelle McNeil", "comment_text": "We used booking.com for our past trip in May of 2023."}, {"username": "Cat Furness", "comment_text": "I stayed for 9 days at Sorrento Experience. Was such a great place and amazing hosts. Walking distance to everything but away from the main Corso. Definitely recommend."}, {"username": "Jackie Holden", "comment_text": "We absolutely loved our stay booked through Airbnb at Casa Ela in Sorrento. It was very central, immaculate, and the host was really sweet. Would highly recommend it!"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Caruso 5"}]}, {"id": "2207432426322502", "text": "Ravello❤️✨❤️", "link": "facebook.com/groups/1373361046396315/permalink/2207432426322502/", "likes": 3, "comments": []}, {"id": "2207437292988682", "text": "Has anyone been to cool stores in rome , florence or milano? Original artisian products maybe?\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2207437292988682/", "likes": 1, "comments": [{"username": "Stacy Derouin", "comment_text": "A couple beautiful shops in Florence that we LOVED-a beautiful handmade paper shop, and a gorgeous perfume shop that sold handmade perfumes, soaps, bath salts.\n\nAquaFlor\n+39 055 234 3471\n\nhttps://g.co/\nkgs/usqNS3\n\nhttps://\nwww.osservatorio\nmestieridarte.i\nt/\neredi-paperone-f\nirenze/"}, {"username": "Laura Cardinale", "comment_text": "In Milan I love Le Nom, customized bags and leather goods. There’s plenty of similar places around the city, ie Porselli ballerinas store!"}, {"username": "Karrie LeBlanc", "comment_text": "Not artisan but in Florence is the most amazing perfume and soap store that has been in business since 1221. It is lovely.\n\nhttps://\nwww.google.com/\nsearch?q=santa+m\naria+perfume+fl\norence&rlz=1CDG\nOYI_enCA1042CA1\n042&oq=santa+ma\nria+perf&aqs=ch\nrome.2.69i57j0i\n512l7j0i22i30j0\ni15i22i30.8253j\n0j9&hl=en-US&so\nurceid=chrome-m\nobile&ie=UTF-8#\ntrex=m_t:lcl_ak\np,rc_f:rln,rc_l\nudocids:8871207\n580538567546,ru\n_gwp:0%252C7,ru\n_lqi:ChxzYW50YS\nBtYXJpYSBwZXJmd\nW1lIGZsb3JlbmNl\nSPbX_pWUr4CACFo\nqEAAQARACGAAYAR\ngDIhxzYW50YSBtY\nXJpYSBwZXJmdW1l\nIGZsb3JlbmNlkgE\nPY29zbWV0aWNzX3\nN0b3JlmgEkQ2hkR\nFNVaE5NRzluUzBW\nSlEwRm5TVU40Y1d\nONVVYWlJSUkFCqg\nFrCgsvZy8xMjJka\n3RoZxABKhciE3Nh\nbnRhIG1hcmlhIHB\nlcmZ1bWUoADIfEA\nEiG_FqHAmS72ghc\nz1xgGMd9AvHbtbM\nNlS--2D0ezIgEAI\niHHNhbnRhIG1hcm\nlhIHBlcmZ1bWUgZ\nmxvcmVuY2U,ru_p\nhdesc:oySZqajVr\nfI,trex_id:Kjjz\nsb"}]}, {"id": "2207437956321949", "text": "Hey, I was wondering if anyone has had lunch at maestro’s (villa treville) in positano? I've got a reservation however I've seen very mixed reviews and I'm worried it's not worth the hype and price tag... Would love honest opinions. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2207437956321949/", "likes": 0, "comments": []}, {"id": "2207438839655194", "text": "My husband wants to visit Greci while we are there to explore family heritage does anyone have any information on travel to that area. It is east of Naples.", "link": "facebook.com/groups/1373361046396315/permalink/2207438839655194/", "likes": 0, "comments": [{"username": "Isabelle Scicluna", "comment_text": "Do you mean Torre del Greco?"}, {"username": "Stephen Henn", "comment_text": "Greci is about an hour and 35 minute drive from Naples. You could rent a car or hire a private driver. Rome2Rio didn’t show any public transport directly to Greci. You can get to Scalo di Savignano E Greci by bus (2hrs 35 min) but would then need to find transport to Greci."}]}, {"id": "2207453922987019", "text": "Hi! Is there a neighborhood or section of Rome that is similar to Covent Garden in London in terms of being in a central location and having lots of restaurants? Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2207453922987019/", "likes": 0, "comments": [{"username": "Anna O'Connor", "comment_text": "Trastevere"}, {"username": "Rebecca Yeoh", "comment_text": "I stayed near Largo di Torre Argentina and thought the location was brilliant. It is near Pantheon / Piazza Navona / Campo de’ Fiori. Easily walk to major sights of the city. Plenty of restaurants too."}]}, {"id": "2207461439652934", "text": "I am planning a trip for 2024 and would love to buy some gold coins or gold by the weight (not designer jewelry) - has anyone purchased such and what would be your recommendations ? I am thinking about 2-5 thousand euros for a wedding gift.", "link": "facebook.com/groups/1373361046396315/permalink/2207461439652934/", "likes": 2, "comments": [{"username": "Gill Martini", "comment_text": "Buy Krugerrand coins"}, {"username": "Rhona OConnor", "comment_text": "Be very very careful - you could be conned or robbed so easily. Buy from a dealer you trust at home!!"}, {"username": "निनावी सहभागी", "comment_text": "Just to add I am not usually this generous-this is for my child’s wedding. I don’t plan to buy off the street but a reputable place/jewelry store etc. looking to buy a gift as an investment etc"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Credit Suisse gold bars"}, {"username": "Bev Symes", "comment_text": "Rather buy at home. No customs no worry about security. These coins are brought and sold in same currencies/ gold price and price controlled."}, {"username": "Kerri Bevilacqua", "comment_text": "That will be a nightmare to carry home due to the weight and trying to keep it secure"}, {"username": "Laura Irmina", "comment_text": "Remember that gold must be declared to the customs while leaving the Schengen area"}]}, {"id": "2207464676319277", "text": "The rebirth of Pompeii.", "link": "facebook.com/groups/1373361046396315/permalink/2207464676319277/", "likes": 53, "comments": [{"username": "Paweł Falkowski", "comment_text": "December'21 👌🇮🇹🇵🇱"}, {"username": "Bill Elias", "comment_text": "Don’t miss Herculaneum. Equally as interesting."}, {"username": "Geoff Plus Jann Mains", "comment_text": "Thank you ❤️❤️❤️was there 16 yrs ago\nJann New Zealand"}]}, {"id": "2207466206319124", "text": "My first question! We have booked our trip to Italy starting in mid October. First leg is Rome for 4 full days. We booked the 7:30 am early morning tour of the Vatican Museum and Sistine Chapel from recommendations by members of this group. What is the best way to see St Peter's Basilica? Should we just enter with free access / no tour, pay for a guided tour access ticket, try to see the Basilica on the same day that we are at the Vatican Museum, or see it on a different day? We are not interested in waiting on long lines.", "link": "facebook.com/groups/1373361046396315/permalink/2207466206319124/", "likes": 0, "comments": [{"username": "Jill Edgington", "comment_text": "You can get to the Basillica through the sistene chapel"}, {"username": "Tricia Brittingham Neff", "comment_text": "Here’s my experience!!! We did the 7:30am tour with breakfast. After breakfast my husband and son wanted to go back in and tour some of the exhibits…there is a ‘secret entrance’ to the Basilica from the Sistene Chapel. My daughter, son, and I did not feel like going back in, so we went out of the Vatican, and walked to the Basilica. By the time we got there I’m going to estimate there was 10,000 people in line, it was all the way through the cattle shoot lines and all the way around the square. We decided not to wait and left. My husband and older son had to make their way through the museum, which was not easy because a lot of the entranceways were blocked off and it was very crowded by this point. It took them about an hour and a half (including touring Egyptian wing) just to get to the Sistine chapel, but then they were able to walk right into the Basilica, and climb the dome, and walk down and go to the graves. ￼\n\nSeven conclusion, if I were you, I would wait for another day as long as your hotel was close by and go right to the Basilica in the morning. Hope this helps."}, {"username": "Karen Blackmore", "comment_text": "We did the two on separate days. Did an early morning Tiquets tour of St Peter's Basilica dome climb one day. Then a happy hour evening Vatican tour (via Vatican website)"}]}, {"id": "2207401032992308", "text": "Join our virtual walking tour and let yourself be guided back through the centuries to discover its medieval glory. Our local guide Patrizia will tell you the fascinating history of San Gimignano pilgrims,आणखी merchants and travelers. It will be an exciting leap into the Middle Ages, an event you can not miss!\nJoin us: https://nextstop-italy.com/virtual-tours/san-gimignano/\n\n#italygram #history #virtualworld #italyiloveyou #italytrip #vacationmood #art #italytravel #VirtualTour #florenceitaly #tuscany #medievalart #tuscanytrail #renaissanceart #medieval #medievalart #medievaltimes #medievalworld #medievalcastle #medievalhistory #medievalarchitecture #sangimignano #sangimignanoitaly #sangimignanotuscany #sangimmy #tuscanygram #tuscanyexperience", "link": "facebook.com/groups/1373361046396315/permalink/2207401032992308/", "likes": 2, "comments": []}, {"id": "2207233989675679", "text": "Our current plan is to stay 3 nights Rome, 5 nights Florence, & 3 nights Venice. While in Florence we are going to a few day trips out - one day we would like to take a wine tour and the other we would like to go to Cinque Terre. I see a lot of different options for day tours/trips. Has anybody just done it themselves? Taking the train fromआणखी Florence? Considering doing that so that we can move at our own speed. Or has anyone done any of the semi or private tour options? I would like to be able to get on one of the ferries between the cities so that we can see everything from the water as well. I’d like to have some beach time for my kids (teens) and of course time to explore the villages themselves. Thank you for any information you can share from your experiences! We are excited!", "link": "facebook.com/groups/1373361046396315/permalink/2207233989675679/", "likes": 6, "comments": [{"username": "Edoardo Casolo", "comment_text": "From Florence to cinque terre?"}, {"username": "Karen Schmidt", "comment_text": "We did a day tour from Florence visiting Siena, San Gimignano and Pisa in one day. It was fabulous. We followed our 4 night Florence stay with 3 nights in Cinque Terre. I wouldn’t do that as a day trip. I personally didn’t really care for Florence ( too crowded) and am going back to stay in Siena instead. Cinque Terre was also packed and very touristy. I’m skipping that all together and will pick somewhere lesser known/less touristy this time"}, {"username": "Laura DeCicco", "comment_text": "Cinque Terre is not a day trip. Siena, Bologna, Fiesole are good options"}, {"username": "Michael Broadwater", "comment_text": "Cinque Terre is very hard to do in just a day trip, not enough time"}, {"username": "Rhona OConnor", "comment_text": "You can do a trip to anywhere your self. Read up about it so you know what you are looking at.... Then go have fun at your pace. Be realistic about travel times and distance. Use Google maps to plan a route."}, {"username": "Valerie Collanton", "comment_text": "We did a private wine tour from Florence that included two wineries (one with lunch) and San Gimignano. It was great. We used Florence Limousine Service. You can contact them at\ninfo@florenceli\nmousineservice.\ncom"}, {"username": "Andrea Hirsch", "comment_text": "We LOVED our day trip to Tuscany with Lorenzo who owns allaroundtuscan\ny.it"}, {"username": "Lynn Luken", "comment_text": "Loved our winery and lunch tour in Florence with Grape Tours. It's a small group"}, {"username": "Laura Uribe", "comment_text": "San Gimignano, Montelpuciano and Siena are good day trips. If you want to go to Cinque Terre, you really should spend at least 1 night. It’s 5 towns, all with their own unique style."}, {"username": "D'Anna Hohe", "comment_text": "There are a number of day trips that you can do by train from Florence - Siena, Lucca, Pisa.\nFor San Gimignano and most wineries, you would need a car, take a bus or use a tour company.\nLucca is a walled city - the wall is basically a park with a walking/biking trail."}, {"username": "Pegi Fuller", "comment_text": "We took a boat from La Spezzia to each of the villages of Cinque Terre, disembarked in. Monterosso and went to the beach and found a hotel room, then took the train back to La Spezzia. Unfortunately we could not do any of the hikes because rain had closed the trails. The ferries and trains run on a regular schedule to Cinque Terre and back"}, {"username": "Trisha MK", "comment_text": "Did you do a wine tour with your teens? How does that work- like are they full cost as the adult? I don’t doubt sampling happens, if they are welcome?"}]}, {"id": "2207338176331927", "text": "Update: I think Sirolo is top of the list. Love to hear more about this area. Especially if you have been at the end of December. TIA!\n\nHello! This is a follow up to my first post. Previously I asked about ourआणखी booked activities in Rome. I did not get much response, so I assume it is a good plan 😆 We are staying in Spoleto Dec 23-29th. A couple of insightful notes I am looking for: 1) will most businesses and restaurants be closed 24-26th? if so, recommendations please-should we just plan on grocery shopping upon arrival and hole up in our Vrbo? With two teen boys, I was hoping to get out and explore. 2) We have obtained car rental for the 26th- Assisi seems the obvious choice for a visit, but I wonder about the East coastline. What is it like in December in the pictured map image? Which area within 90 mins drive is a iconic beauty and good area to stay overnight? Note: Sorry for posting anonymously, but since I am sharing specific dates, I prefer not so share my identity for safety reasons. Thank you for understanding!", "link": "facebook.com/groups/1373361046396315/permalink/2207338176331927/", "likes": 3, "comments": [{"username": "निनावी सहभागी", "comment_text": "This area seems most intriguing to me. What is it like in December, places to stay?"}, {"username": "Pietro Adami", "comment_text": "If you like Tod’s, Hogan or Fay …. worth a visit"}, {"username": "Alessandro D'Agostino", "comment_text": "Campo Imperatore - L'Aquila, there will be snow for sure, but try to get there. You'll never forget it"}, {"username": "Paola Coppi", "comment_text": "seaside towns in Winter May be deserted and vacant because they work only in Summertime. Why don't you consider to visit Volterra and San Gimignano in Tuscany. Assisi May be connected ti Spoleto by buses and trains"}, {"username": "Paola Coppi", "comment_text": "Well, San Gimignano and Volterra are iconic beauties just like Orvieto's Cathedral is. You should do this if you prefer to stay closer to Spoleto and visit three iconic places. Leaving from Spoleto go first to Orvieto to visit mainly its Cathedral, then drive to Civita di Bagnoregio (also known as the 'disappearing village' because of an extreme erosion that is destroying its margins) and last drive to the Monster Park in Bomarzo (this is an historical and artistic park built by a visionary architect during the 16th century with the precise goal to shock and surprise his guests). If you and your family are interested in art, architecture and history you will love this tour. Check the places on google and remember especially Place 2 and 3 are out of the beaten tracks and known in Europe only by those that studied them on history/ art books"}, {"username": "Tara Dix", "comment_text": "There are some lovely hillside towns over towards the east coast. We stayed in Petritoli a few years ago which was lovely. There is a great winery about 30 mins south of there called Tenuta Cocci Griffoni where we had the most fabulous lunch paired with wine, with stunning view. No idea if they are open in December?"}]}, {"id": "2207237333008678", "text": "This is where Julius Caesar was assassinated.", "link": "facebook.com/groups/1373361046396315/permalink/2207237333008678/", "likes": 599, "comments": [{"username": "Elise Wall", "comment_text": "Troy Wall need this on map"}, {"username": "Andy Lucas", "comment_text": "That’s a bit rash! Have you got any evidence?"}, {"username": "Stephanie Earl Peterson", "comment_text": "Our hotel was right around the corner from this. 🙂"}, {"username": "Larry Dash", "comment_text": "And a bunch of kitties live!"}, {"username": "Judy L Jones-York", "comment_text": "Found this by accident one day when I was exploring. Just got off the bus and there it was. Started taking pics and found the signs of what it was. Love all the cats there too."}, {"username": "Marco Brambilla", "comment_text": "It’s the same place where the Caesarean section and Caesar salad were invented."}, {"username": "Linda Gevaerts", "comment_text": "The Site of Caesar’s Assassination in Rome, Until Recently Only Visited by a Colony of Stray Cats, Is Now Open to Human Tourists Too"}, {"username": "Rebecca Yeoh", "comment_text": "I stayed right around the corner. This was such a great area of Rome to stay in 👌🏼"}, {"username": "Kevin Kappel", "comment_text": "Anyone tell me what the name is? I'll be there next week"}, {"username": "Carmine Napolitano", "comment_text": "our hotel, smeraldo was by there.\ngood location"}, {"username": "Casarine Temple", "comment_text": "I believe it’s also close to the Pantheon."}, {"username": "Markella Papamihalakis Wilson", "comment_text": "Jake Wilson I wanna gooo"}, {"username": "Rhonda Russell", "comment_text": "Staying across the street from here, arriving on Tuesday."}, {"username": "Kim Butler Oam", "comment_text": "I have a photo like this of those steps, fascinating, I just came upon this on one of my walks."}, {"username": "Christine Malota- Kendall", "comment_text": "Book tickets for a tour of Domus Aurea (live archeological point for Nero’s Palace). Impressive and the tour guides are very knowledgeable."}, {"username": "Fabrizio Benedetti", "comment_text": "Largo Argentina this is the Square"}, {"username": "Anne Marie Skeen Johnson", "comment_text": "That’s a cat sanctuary."}, {"username": "Goran Gogic", "comment_text": "A knife 🔪 in the back."}, {"username": "Ramzey Khaldi", "comment_text": "I recommend reading the book the assination of Julias ceaser by Michael Parenti"}, {"username": "Eileen Henkel", "comment_text": "Where Ceasar once ruled, cats now reign. 😺😼😸😽😻😹💞"}, {"username": "Casarine Temple", "comment_text": "Casarine Temple"}, {"username": "Joan Romiti", "comment_text": "Pompey has dogs"}, {"username": "Ana Kast", "comment_text": "I stayed right across the street from this- my room overlooked it. Neat place!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Yup"}, {"username": "Todd Fenk", "comment_text": "Todd Fenk"}, {"username": "Carolyn Barbierato", "comment_text": "Dave Barbierato"}, {"username": "Deb Irvine", "comment_text": "I’m visiting Rome in September and I’d love to have a better understanding of the history. Any suggestions for either historical novels or very readable nonfiction?"}, {"username": "Jim Finney", "comment_text": "We walked around this last year… very cool."}, {"username": "Lisa Alexander Blake", "comment_text": "Here is one we saw yesterday 🐱"}, {"username": "Greg Mills", "comment_text": "Surely there was CCTV footage?"}, {"username": "Heath Conn", "comment_text": "Debbie Conn"}, {"username": "Albert Campagna", "comment_text": "He wasn’t actually assassinated- it was fake news - he actually joined a traveling band called the Centorians"}, {"username": "Kim Ashford", "comment_text": "Piazza Argentina"}, {"username": "Joe Reams III", "comment_text": "Kathy Holden Reams"}, {"username": "Pamela Weber Voges", "comment_text": "Wasn’t it behind a theatre?"}, {"username": "Laura DeCicco", "comment_text": "Cat sanctuary is right there"}, {"username": "Ralph Squire Martuscello", "comment_text": "Where he’s buried"}, {"username": "Larry Trent", "comment_text": "Love that site.\nFYI on the opposite end is a little pizza 🍕 place with the word Florida in it.\nIt's in this picture..the place lit up on the right.\nDelicious.."}, {"username": "Jennifer Walp Rydholm", "comment_text": "Where exactly is this? I know when I was young and travelled to Rome with my Latin club we may have visited, but that was a long time ago. I would love to see this up close."}, {"username": "S Christian Everett", "comment_text": "Stay woke 👀"}, {"username": "Jay Cabrera", "comment_text": "Et Tu, Brute?"}, {"username": "Simon Kidney", "comment_text": "I've stood there! 👣"}, {"username": "Gianna Onesi", "comment_text": "I want to get to this do you need tickets?"}, {"username": "Stephen Clarke", "comment_text": "infamy, infamy. They’ve all got it in for me."}, {"username": "Angelique Edl", "comment_text": "Our pretty airbnb was adjacent!"}, {"username": "SD Allen", "comment_text": "The Forum.....just one of the thousands of spectacular places to visit in Roma!. Stupendo Roma! ❤"}, {"username": "Bob Gordon", "comment_text": "This place was full of cats. We stayed near this a couple of years ago. Really neat feel to the place"}, {"username": "Sondra Knap", "comment_text": "We stayed in a hotel directly across the street! And yes...many cats live there, cared for by a cat group."}, {"username": "Julia Jacobie", "comment_text": "Gatti di Roma - Roman Cats cat sanctuary is under the street to the south end of the ruins. If you love cats definitely worth a visit!"}, {"username": "Rob MacFarland", "comment_text": "'Et tu Brute! Then fall Caesar!"}, {"username": "Chris Darcy", "comment_text": "Ahhhh the cat sanctuary!!!!\n🐈 🐈‍⬛"}, {"username": "Maeve Deady", "comment_text": "Cats enjoying the sun."}, {"username": "John O'Campo", "comment_text": "Anna Treviño O'Campo"}, {"username": "Clint Foster", "comment_text": "Rome?"}]}, {"id": "2207391782993233", "text": "Has anyone stayed at either Charme Spagna Boutique Hotel or Colonna Palace I am trying to decide which one. Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2207391782993233/", "likes": 1, "comments": [{"username": "Carine Brys", "comment_text": "We stayed at the Colonna Palace this March. We opted for an Economy room. I was worried we'd have a view of a wall, but no. Nice view of the Piazza Colonna and the Italian Parliament. Breakfast was included and plentiful (including scrambled eggs). It allowed us to have a big breakfast, a light lunch and a nice dinner at a restaurant. The rooftop bar was enjoyable, too bad they we couldn't order appetizers, just drinks. It was 5 minutes from the Pantheon and centrally located. I'd go there again. Oh yes, the rooms were very clean and included a safe."}, {"username": "Melissa Hunt", "comment_text": "We are staying at Charme Spagna first week of September. I can report back if you PM me."}]}, {"id": "2207392499659828", "text": "How do I book the Pantheon tickets without a guide - audio guide keeps coming up for €10 but says this does not include tickets", "link": "facebook.com/groups/1373361046396315/permalink/2207392499659828/", "likes": 1, "comments": []}, {"id": "2207392979659780", "text": "Just booked a trip to Italy for my daughter's 25th birthday. It's a mother and daughter trip. Looking for affordable accommodations, we are going to Rome, Venice, the Cinque Terre, and Tuscany. Any suggestions would be great for accommodations ￼", "link": "facebook.com/groups/1373361046396315/permalink/2207392979659780/", "likes": 5, "comments": [{"username": "Elena Eckley", "comment_text": "The Marriott is absolutely lovely in Venice with its free valporetto"}, {"username": "Elena Eckley", "comment_text": "Happy birthday 🎈🎁🎉🎊🎂"}, {"username": "Jerry Kiger", "comment_text": "Following … interested sim spots. Sorry no info,\nWill be fun b-day trip"}, {"username": "Shelby Symons", "comment_text": "Currently on a trip with my mum for my 30th birthday and we have done 5 weeks so we were making sure accom was affordable and convenient. Venice we stayed at Hotel Bonvecchiati, for cinque Terre we based ourselves in Manarola so it was quieter and then just caught the train to visit the other towns. We stayed in an airbnb which was great, will attach photo below and Rome we are staying at Diana Roof Garden, my mum has stayed here before previously and liked it."}, {"username": "Heather Stokes", "comment_text": "Just spent 2 nights in Vernazza,Cinque\nTerra.Stayed at Gianni Franzi and it was fantastic.Lots of steps but so.... worth it when you got there.Very close to the harbour with amazing views from The Deck where they serve breakfast and drinks in the afternoon.Highl\ny recommend."}, {"username": "Paola Coppi", "comment_text": "In Italy we book with booking.com for house and B&B bookings."}, {"username": "Jennifer Ravai", "comment_text": "Thank you so far for all the great comments I will look into your suggestions 😊👍"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "What do you consider affordable? Check a booking site to see prices for the month you want to travel to get an idea of prices, location and availability."}, {"username": "Diane Walker", "comment_text": "Sounds wonderful!"}, {"username": "Melissa Jane Brown", "comment_text": "How wonderful. My oldest daughter & I've just returned from a mother-daughter\ntrip to celebrate her 21st and we had such a wonderful time."}, {"username": "Dave Colleen", "comment_text": "Venice, Hotel Moresco. On the canal, easy walk to trian station, breakfast included, as well as happy hour food (beverages separate cost) nice size rooms and nice bathrooms. Fluffy bathrobe and slippers. We were given a bottle of Prosecco, and a welcome bag, along with a welcome drink. Love this place and will stay here again."}, {"username": "Suzanne Mills", "comment_text": "Air bnb"}, {"username": "Costero Home", "comment_text": "Airbnb or VRBO, depending on length of stay."}]}, {"id": "2207365576329187", "text": "Looking for help from the group members. I am trying to book a train to Pompeii from Rome. The system won't give me ticket options for the time I selected (even though I can see my selections on the top leftआणखी corner of the screen). And the system gives me the option of a return ticket the following day. What am I doing wrong? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2207365576329187/", "likes": 3, "comments": [{"username": "Emily Frazzetta", "comment_text": "Hi! I’m not sure I can help you but you select round trip instead of just one way, did you mean to do that?"}, {"username": "James-Kathy Dickerson", "comment_text": "Maybe to early when r u going"}, {"username": "Michele Levesque Semosky", "comment_text": "I wonder if it is because you will need to transfer in Naples to a different train. Not sure about returning the next day. I use Omio and it showed be both options on the same day."}, {"username": "Brenno Bianchi", "comment_text": "Pompei Excavation is not a railway station part of the national railway network and it is not served by Trenitalia, in fact if a see correctly your screenshot the last leg of the proposed jorney is a bus."}, {"username": "Federico Permutti", "comment_text": "I’m not really sure what’s going on there, I just tried to book the same trip on Trenitalia (both website and app) and it shows all ticket options for a morning outbound and an afternoon return trip."}, {"username": "Philip Curnow", "comment_text": "It is a service offered by Italo and not Trenitalia"}, {"username": "Chris N Lynn", "comment_text": "Choose 0:00. It’s funky I know but it will give you the morning."}, {"username": "Chris N Lynn", "comment_text": "Chris N Lynn"}, {"username": "Tracey Fairbrother", "comment_text": "Use trainline app so much easier"}, {"username": "Isabelle Scicluna", "comment_text": "The reason why it will not allow you to book is because it is a 3 sector ticket. The highlighted ticket states you have to pick first a fast train, then change in naples and go one floor down to pick the metro..then once you get to the destination indicated for the metro (try clicking on the info) you have to pick a bus.... ps: check out also Italo train website.. it is trenitalia's direct competitor...an\nd there is option where you can buy fast train + direct bus to pompei, and many times it is cheaper! :)"}, {"username": "Fiona Cameron", "comment_text": "You could get a train to Naples then get the Circumvencuvian\na from Naples Garibaldi there’s an underground link between the two stations. There is a specific stop for Pompeii site, not the main Pompeii stn ( from memory) the line from Naples to pompeii is not run by Trenitalia its Etna something… try Rome to Rio for the route but Im pretty sure you can book both through Trenitalia. May be faster than bus 🤷🏻‍♀️"}]}, {"id": "2207375562994855", "text": "For those that went to La Giostra and La Bucheta in Florence…are most men wearing pants or did you see a mix of pants/shorts?", "link": "facebook.com/groups/1373361046396315/permalink/2207375562994855/", "likes": 0, "comments": [{"username": "Stacey Cohen Sturner", "comment_text": "We were at La Giostra last night and many men wore shorts (including my husband). A few had baseball hats, too. Not super fancy."}]}, {"id": "2207353482997063", "text": "My husband and I will be in Catania on Tuesday. What is a good restaurant to have dinner at there?During the day we will be in Taormina. Lunch suggestions welcomed!", "link": "facebook.com/groups/1373361046396315/permalink/2207353482997063/", "likes": 0, "comments": [{"username": "Kay Jenkins", "comment_text": "Street 54 also la pentalatte were superb"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207377956327949", "text": "I would love to learn where I can find secret bakeries in Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2207377956327949/", "likes": 4, "comments": [{"username": "Shelagh Kosinski", "comment_text": "Wander the streets. Talk to the locals"}, {"username": "Jeanne Eliason", "comment_text": "No secret. Just look in the windows. Oh my. So yummy."}, {"username": "Shell Therese", "comment_text": "If we told you they wouldn't be secret..."}, {"username": "Susan Rathke", "comment_text": "Follow your nose, it always knows…"}, {"username": "Sandra Maldonado", "comment_text": "Wish I could tell you, but it’s a secret. I don’t think it’s possible to go to a bad place. Look for what is a Florence specialty, then search for where to find the best of what caught your eyes."}, {"username": "Hal Shaw", "comment_text": "https://\nwww.firenzemadei\nntuscany.com/\nen/best-of/\npastries-not-to-\nbe-missed-in-fl\norence/\n#:~:text=There%2\n0you%20can%20fi\nnd%20Sacher,%2C\n%20chocolates%2\nC%20biscuits%2C\n%20torrone%20("}, {"username": "Karrie LeBlanc", "comment_text": "At the end of our street in Florence in Santo Spirito neighborhood was a lovely bakery that also seemed to be the spot many restaurants came each morning to pick up orders for the day. Forno Pintucci on via delle Caldaie. They had bread, pastries, Marcona almonds by the scoop, cookies and more. We enjoyed treats from their each day."}, {"username": "Catalina Daniel", "comment_text": "In pompeii next to the back entrance was a DELICIOUS bakery!!! Im not one for repeats but yumm I had to go back! Cant remember the name tho… Sorry… Just saw you asked for Florence but, ill leave this just in case anyone else might take the suggestion"}, {"username": "Trish Ayers", "comment_text": "Now I’m ready to be in Florence! Thank you everyone!"}]}, {"id": "2207378956327849", "text": "I will be staying in Hotel Mistral Termoli for a week, then off to Barletta, Trani and Bisceglie for day trips. Which of the 3 should be my new base, from which I can take trains to other great cities? Trani? Or any other you might suggest?", "link": "facebook.com/groups/1373361046396315/permalink/2207378956327849/", "likes": 0, "comments": [{"username": "Rosa Guerra", "comment_text": "Trani is lovely!!!"}]}, {"id": "2206999416365803", "text": "Is it allowed to carry a wine bottle back from Italy to the USA in the flights? I don’t drink alcohol that much at all, hence not aware of the guidelines. However, I would like to carry back a bottle of wine from Italy if it is legal and allowed.", "link": "facebook.com/groups/1373361046396315/permalink/2206999416365803/", "likes": 12, "comments": [{"username": "Susan Orr", "comment_text": "Daughter brought 3 back from her wine tour in Tuscany. 2 in suitcase and one in carry on that she was goi g to check. Last minute decided to keep carry on and forget about wine. They co fiscated that one"}, {"username": "Vaishnavi Pattabiraman", "comment_text": "Thanks everyone. If I was to buy duty free at the airport, can I carry it in my carry on through a layover in Turkey en route to the US?"}, {"username": "Sigrid Cormier", "comment_text": "1) if we’ll wrapped (bubble Wray)in your checked bag\nOr 2)\nPurchased at the airport duty free. They seal the bag, you get the receipt and you can carry on board with your personal bag and carry on.\n3) check your US Customs site to see how much alcohol your allowed to bring back."}, {"username": "Ruth Ashby", "comment_text": "It's legal, but only in checked luggage as people have said. I travel frequently, but still somehow forgot I had a bottle of wine in my carryon bag, and had to give it up at security"}, {"username": "Rita Pantaleo", "comment_text": "If you get through duty free your allowed to take it on the airplane if not you have to check it in"}, {"username": "Pietro Adami", "comment_text": "Why don’t you get it (or better, a small case of them) shipped directly to your home by the shop ?"}, {"username": "Cindy Morgan Schmoe", "comment_text": "You can buy wine anywhere and just put it in your checked bag. We just got back from Italy and everything made it through safe and sound."}, {"username": "Sherlynn YD", "comment_text": "After went through security in Rome and bought 3 bottles and carried on, no problem"}, {"username": "Matthew Livio Conti", "comment_text": "You might consider something you can’t get abroad. There’s 50 types of limoncello at my local liquor store, tons of Italian wines… Look for something you can only find in Italy."}, {"username": "Susan Rathke", "comment_text": "Only if you are flying into your final destination can you carry on from duty free. I have a connecting flight once I clear customs so my alcohol must be in checked baggage."}, {"username": "Lisa Minichini-Dowty", "comment_text": "Not in a carryon must be checked.. I would recommend getting it at duty free shop at airport"}, {"username": "Gillian O'Callaghan", "comment_text": "If you buy it before you get ti the airport it has to go in your checked luggage. If you are only doing carryon you'll have to buy wine in the airport at duty free."}, {"username": "Roxanne Boccardi", "comment_text": "You can have it sent to you . They do ship wine to the U.S. ."}, {"username": "Anna Gambino", "comment_text": "You can put in your checked luggage. Have brought back many over the years. Always makes it home. Wrap in the middle of suitcase in between clothes"}, {"username": "Karen Cooper", "comment_text": "Karen Cooper"}, {"username": "Andrea Robinson", "comment_text": "Reading this I’m counting our blessings that we are allowed to take done back to the Uk 🇬🇧driving with our caravan."}, {"username": "Larry Dash", "comment_text": "Buy it here. The duty free doesn’t make much of a difference now"}, {"username": "Brian Yonks", "comment_text": "Ship it"}, {"username": "Evie Slavic", "comment_text": "Key is wrap it in bubble wrap, then a towel or dirty clothes, and MOST IMPORTANT bring a giant thick zip lock bag. Ive traveled back multiple times from Europe with connecting flights but started using the bag when a friend had a bottle of red wine break in her suitcase."}, {"username": "Jeannie Morris Wierman", "comment_text": "You can buy Italian wine back in the USA."}, {"username": "Robert Sullivan", "comment_text": "Don't buy wine you can purchase in the states to save 2.00 per bottle. If you are buying wine know what you are getting"}, {"username": "Doreen Burbeck Engel", "comment_text": "We bought Wine Angels on Amazon and packed in our checked bags...worked like a charm!"}, {"username": "David Davey", "comment_text": "You will find majority high grade wines are sold in US."}, {"username": "Tracey Fairbrother", "comment_text": "You won't get it through security in carry on. It's fine in a checked bag"}, {"username": "Mike Guluk", "comment_text": "Not in a carryon but yes in a suitcase, I think you can actually bring a small wood case 6 bottles"}, {"username": "Tiziana Martinello", "comment_text": "Yes for personal use a few bottles is possible"}, {"username": "Julie Michele Allen", "comment_text": "It’s best to go to a place that has an agent in your country so you don’t have to carry it. Just order a case and bingo it’ll arrive at home with no carrying"}, {"username": "Miyuki Kanno Paul", "comment_text": "Purchasing at Duty Free AFTER going through the security, yes. If you have a domestic connection after landing into the first port of entry into the States, you have to place the bottle in your checked luggage and recheck it at the connection counter.\nOtherwise, your precious bottle will be confiscated at the security checkpoint because you are violating the liquid rule"}, {"username": "Irene Oda", "comment_text": "Check in bag only. Not in carry on"}, {"username": "Renee Rundle Stoneham", "comment_text": "You can not carry on wine unless you buy it at duty free in the airport.\n\nYou can put bottles in your checked baggage just fine. We’ve done this frequently."}, {"username": "Cece Francis", "comment_text": "Yes. I took back 3 bottles of limoncello"}, {"username": "Sue Ellen Thomas", "comment_text": "Has to be packed and checked in suitcase and have to claim at customs"}, {"username": "Angie Boutzis-Luis", "comment_text": "Liquids not permitted in carry on"}, {"username": "Aubree Greenspun", "comment_text": "Yes, as long as it is packed in your checked luggage."}, {"username": "Rose Man", "comment_text": "Must be packed and checked unless you purchase duty free in airport."}, {"username": "Donna Hartsell", "comment_text": "In checked yes-or, if you buy it in duty free, BUT if you buy it in duty free you must have a direct flight-if you have a connecting flight and have to go out of security you cannot take it back through in your carry on. Found this out the hard way and had to shove Grappa and Limoncello into my checked for the next flight!🤣"}, {"username": "Caterina Liquori-Culhane", "comment_text": "I found it easier to just buy the alcohol And other items li at The duty free shop. The prices were reasonable they seal the bag with the receipt in it. No issues. I just brought on on the plane in my bag"}]}, {"id": "2206854286380316", "text": "We are planning a trip to Italy next summer. Best month to go?", "link": "facebook.com/groups/1373361046396315/permalink/2206854286380316/", "likes": 33, "comments": [{"username": "Dorota Maćkowiak", "comment_text": "May or September😊😊"}, {"username": "Sharon Joseph", "comment_text": "May….Was there last year for a month. Weather was great."}, {"username": "Esther Wildenberg", "comment_text": "June Or September"}, {"username": "Dot McArdle", "comment_text": "April into May"}, {"username": "Peter Ingargiola", "comment_text": "May September October"}, {"username": "Kadie Mcgugan", "comment_text": "I’m here just now and it’s so so busy"}, {"username": "Laura Iafrate", "comment_text": "August."}, {"username": "Charmaine Rehg", "comment_text": "I'm planning to go towards the end of June to mid July because that's when there is the least chance of rain. I want to do some hiking and to visit some botanical gardens, so I prefer sunny weather.☀️"}, {"username": "Junko Osaki", "comment_text": "In my opinion spring (late April-May) and fall (September) are the best months to visit"}, {"username": "Monica Kassatly", "comment_text": "April, May or September"}, {"username": "Elaine Marie Harvey", "comment_text": "Does anyone know if November is a good time to travel to Italy?"}, {"username": "Lynn Scott-Gregory", "comment_text": "May or Sept/Oct"}, {"username": "Flávia Isabel", "comment_text": "November was amazing! Did Rome, Saturnia, Tuscany, Lake Garda and Venice"}, {"username": "Nancy Cicinelli", "comment_text": "MAY /JUNE is my favorite TIME... OR Sept."}, {"username": "Nadia Mckenna", "comment_text": "Tricky question 🤔You did say summer. So that’s June, July , August"}, {"username": "Renee Rundle Stoneham", "comment_text": "May or September/\nOctober\n\nIf you can only go in summer…. Early June. Just starting to get hot and crowded."}, {"username": "Brooke Barron", "comment_text": "NOT July"}, {"username": "Bill Dest", "comment_text": "September or early October. Less crowded and a little cooler."}, {"username": "Clarence Giordano", "comment_text": "July or August"}, {"username": "Sue Valatkevicz- Kiefer", "comment_text": "I was just there in July and will NEVER do that again- unbearable ☀️🔥"}, {"username": "Angie Hoff-Hess", "comment_text": "I am going back again next year. April was too warm and crowded. I will do March."}, {"username": "Martini Sovrene", "comment_text": "September, October, December"}, {"username": "Theresa Manna Williams", "comment_text": "September is beautiful!"}, {"username": "Lheah Bilgera Gearon", "comment_text": "Mark Fern"}, {"username": "Heidi Charlton", "comment_text": "May or September/ October"}, {"username": "Loretta Fabbro", "comment_text": "September"}, {"username": "Kendall Postema", "comment_text": "We went the last week of March and it was pretty perfect weather wise."}, {"username": "Miyuki Kanno Paul", "comment_text": "Summer is the worst time to go"}, {"username": "Marina Novikova", "comment_text": "Depends which weather is more suitable for you. Summer months are usually super hot in Italy."}, {"username": "Martin Gilchrist", "comment_text": "October"}, {"username": "Sandra Nurzia Rogers", "comment_text": "April, May, October and November"}, {"username": "Monica Marzari-Hailey", "comment_text": "June/\nearly July or early September…..NOT AUGUST!"}, {"username": "Joseph Ferragina", "comment_text": "April or late September"}, {"username": "Melisa Manganelli", "comment_text": "Not in the summer"}, {"username": "Bonnie Rodgers Henderson", "comment_text": "My favorite time is late September thru end of April."}, {"username": "Zak Kosto", "comment_text": "When it’s not stinking hot. Euro summers no go in future"}, {"username": "Tammy Biasi", "comment_text": "To 🥵 hot and crowded in the summer. We do December. It’s off season and weather is wonderful"}, {"username": "Cristina Alfonso", "comment_text": "April or beginning of May"}, {"username": "Aimee Simoneaux", "comment_text": "We’re going next September for 3 weeks! I would never go during peak season."}, {"username": "Troy Downey", "comment_text": "September"}, {"username": "Susan Clark", "comment_text": "End of September into early October\nNo heat and less tourists"}, {"username": "Angela Padavano", "comment_text": "October"}, {"username": "Vania Sandt", "comment_text": "Don’t go June, July or august. Super hot, no AC, super crowded"}, {"username": "Susan Argall", "comment_text": "October"}, {"username": "Daniela Parhar", "comment_text": "September"}, {"username": "Leo Sklabbo", "comment_text": "Better off going to Greece"}, {"username": "Justine Lockamy", "comment_text": "I always send my clients September October! Sometimes May! Depends on where you want to go honestly"}, {"username": "Phyllis Flowers", "comment_text": "Mid September, October, April, May"}, {"username": "Efren Matos", "comment_text": "Winter!"}, {"username": "Sakshi Mittal", "comment_text": "Is December a good month to visit Italy ? Early December ?"}, {"username": "Christine Van Fossen", "comment_text": "October"}, {"username": "Urszula Tompsett", "comment_text": "April/May"}, {"username": "Ela Cyniak", "comment_text": "Cinque Terre is a must 😃 after or before the peak season"}, {"username": "Jess Tipton", "comment_text": "December"}, {"username": "Frank Hunt", "comment_text": "June through to June"}, {"username": "Mirosław Feister", "comment_text": "When in Love every month is perfect."}, {"username": "Cory Siegenthaler", "comment_text": "June or september"}, {"username": "Bettina Maria", "comment_text": "April through July, September and October."}, {"username": "Karen Haney Logan", "comment_text": "Are you able to go during a different time of the year? Summer heat in Italy is brutal. No AC in even better quality hotels."}, {"username": "James Carr", "comment_text": "We went in July and august… hottest and most crowded. We had a good time but if I could go back, I would have schedule May as soon as kids got out of school."}, {"username": "John Bruckman", "comment_text": "Not July or August… May, June or September."}, {"username": "Wyketta Gibson", "comment_text": "May or September"}, {"username": "Tania Vella", "comment_text": "September"}, {"username": "Lisa Lynn", "comment_text": "Late September or October perfect weather can still go swimming- ￼ crowds are gone!"}, {"username": "Heather Finlay", "comment_text": "Early June"}, {"username": "Sandra Shoffner", "comment_text": "I like going g first or second week of June."}, {"username": "Amanda Kamel", "comment_text": "May or October"}, {"username": "Anna Ciolino Di Bennardo", "comment_text": "June or September"}, {"username": "Karen Lenthe Redett", "comment_text": "When it’s not hot"}, {"username": "Kiran Sajid", "comment_text": "September or October"}, {"username": "Jocelyne Voss", "comment_text": "Too hot in summer"}, {"username": "Antonio Gonzalez", "comment_text": "September, October, summer, winter,,,,when ????"}, {"username": "Robert DiLella", "comment_text": "Just got back will only go in October or November in the future ."}, {"username": "MaryBeth Reed", "comment_text": "September"}, {"username": "Jim Gallo", "comment_text": "September"}, {"username": "Margorie Madrid", "comment_text": "May!"}, {"username": "Joanne Atkin", "comment_text": "Mid September to October"}, {"username": "Denise Rocha", "comment_text": "It’s very hot starting in June till September"}, {"username": "Pam Hartsoch", "comment_text": "We’ve always gone in early Sept. last summer, however, was miserable—temps\n90+ for a week in Florence then much better for a week in Varenna/Lake Como. We started going then to get a paid holiday while we were gone. Now it’s just habit."}, {"username": "Kit Nader", "comment_text": "Any but not June July August"}, {"username": "Robyn Green", "comment_text": "May"}, {"username": "Martinez Martin", "comment_text": "We went during Christmas last year and still loved it."}, {"username": "Tracy Amin", "comment_text": "October"}, {"username": "Paul Fielding", "comment_text": "Not June July or august!"}, {"username": "Sarah Longman", "comment_text": "May. The flowers are in full bloom, lower number of tourists. The weather is fantastic."}, {"username": "Monica Rameriz", "comment_text": "We went in May. Wasn't too hot."}, {"username": "Margaret Jeanne", "comment_text": "Not june,july, and August."}, {"username": "Carmen Higham", "comment_text": "April"}, {"username": "Roland Trego", "comment_text": "End of May, September, or early October. Less heat and fewer crowds."}, {"username": "Charlotte Lowe", "comment_text": "March"}, {"username": "Michele Sica Selesky", "comment_text": "The heat is unbearable in July and August."}, {"username": "Pam Armenia O'Brien", "comment_text": "I love mid September into early October."}, {"username": "Rosanna Hardeman", "comment_text": "Spring or Fall."}, {"username": "Natalie J DeRasmi Saeger", "comment_text": "Went on a trip late October/early November. If you like turtlenecks and jeans, no crowds, plenty of sunshine and no humidity, I highly advise!!!"}, {"username": "Peggy Nicholson", "comment_text": "October"}, {"username": "Rachel Collins", "comment_text": "May or September"}, {"username": "Debbie Drummond", "comment_text": "June"}, {"username": "Julie Casteel", "comment_text": "May for sure!!!!"}, {"username": "Fredia Locklear Lanham", "comment_text": "End of April had great weather!!"}, {"username": "Al Farinacci", "comment_text": "September/\nOctober."}, {"username": "Samantha Crawford", "comment_text": "Depends on where you want to go and what vibe you want!\n\nWe did end of September in positano and Rome! The crowds weren’t bad at all, it was still hot to swim, the food and wine was amazing. Such an amazing experience!"}, {"username": "Behindthelens Skeeter", "comment_text": "Early October"}, {"username": "Debra Burroughs Disario", "comment_text": "April May September\nI have gone in June and z July very hot"}, {"username": "Dawn Etkin", "comment_text": "We are going in May"}, {"username": "Victor Viquez Arias", "comment_text": "Pao Mora"}, {"username": "Janet J. Hansen-Warren", "comment_text": "We are looking for recommendations\nfor a tour company for an Italy trip next September October 2024 for a group of 8 to 1￼0 people does not need to be high end, thank you"}, {"username": "Morgan Cosentino", "comment_text": "It depends what your looking to do. If you want to be by the beach then june-august. If your looking to go sight seeing then mid September is amazing weather starting to feel like fall and not as crowded. Flights are also cheaper too"}, {"username": "Tina Thibodeaux", "comment_text": "October"}, {"username": "Gail Dial Harris", "comment_text": "May, late September or October"}, {"username": "Amy Sue Carcio", "comment_text": "may was perfect"}, {"username": "Erin Kilroy Brauer", "comment_text": "September/ early October"}, {"username": "Debora A. Diaz", "comment_text": "May or September"}, {"username": "Leisa Powell", "comment_text": "May or October"}, {"username": "Annette Giovia", "comment_text": "I went in June of 2017 for 2 weeks. Didn't find the weather to be terribly hot. Enjoy!!"}, {"username": "Maxine Righi", "comment_text": "May or April"}, {"username": "Paul Thompson", "comment_text": "June and mid September on"}, {"username": "Carol Bayley", "comment_text": "September."}, {"username": "Michelle Thorpe", "comment_text": "November"}, {"username": "David Perillo", "comment_text": "Definitely not august"}, {"username": "Rumana Rahim", "comment_text": "P"}]}]