[{"id": "2208133879585690", "text": "In Venice, what are the things that are worth it to pay to enter? and what are worth it to just see it for free/wait in line/no audio tour?\n\nInterested in seeing museums/cathedrals/the islands", "link": "facebook.com/groups/1373361046396315/permalink/2208133879585690/", "likes": 4, "comments": [{"username": "Nariman Dergam", "comment_text": "Interested"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208135582918853", "text": "Is there a Vietri China factory with a store/outlet open to the public? Where? Anyone with experience shopping there? Any other Italian potteries who sell pieces at good prices. I prefer going to the source vs. purchasing from touristy gift shops.", "link": "facebook.com/groups/1373361046396315/permalink/2208135582918853/", "likes": 3, "comments": [{"username": "Gina Van Antwerp", "comment_text": "Great question. I love Vietri."}, {"username": "Karen Ries", "comment_text": "Vietri is a lovely town on the amalfi coast"}, {"username": "Judy Jamieson Pisano", "comment_text": "In Vietri-sul-Mare\n, the first town on the Amalfi coast, there is a row of small stores where they make and hand paint the pieces. We have had things shipped to the US and everything goes smoothly. The store we generally use has a website Vietri store.com. If you are having things shipped, they will paint the items the way you want them. Here are some of the items from them"}, {"username": "Gina Romano Peralta", "comment_text": "Romeo Romeo Vietri"}, {"username": "Romeo Vietri", "comment_text": "We are ceramist located on Vietri sul Mare."}, {"username": "Carin Corriero Volpe", "comment_text": "Will be there next month, so looking forward to spending time there."}, {"username": "Angelie Karako", "comment_text": "Ceramica Artistica Solimene? Please update when you go, I really want to stop by on my upcoming trip. Would appreciate hearing about your experience there."}]}, {"id": "2208136929585385", "text": "In need of some ideas please. Our last day in Sorrento we have a private driver for 8 hours. We will have to get to rome to spend the night before our flight out the following morning. Need ideas of things to see between Sorrento and Rome please. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208136929585385/", "likes": 1, "comments": [{"username": "Nicole Bedree", "comment_text": "Following"}, {"username": "Karen Landry", "comment_text": "Pompeii"}, {"username": "Kendall Wolff", "comment_text": "Adam Kenner"}]}, {"id": "2208145169584561", "text": "Just returned from a. 10 day trip.\n\nNaples - stayed fairly local in town. Was very happy to see the local flair. Easy to get around by foot or metro. Streets were a little dirty but whatever - it’s a city and I’m from NYC.\n\nTook a day trip booked through hotel to Positano and spent 3 hours on beach then off to Sorrento for an hour.\n\nBooked ferry through direct ferries to Capri. Spend the day walking around and sitting on beach. Very touristy area. High end shops. Reminded me of Rodeo Drive and 5th avenue. Did NOT go to other side where grotto kids were fine not seeing this.\n\nDay trip to Pompeii and Mt Vesuvius for small group guided tour. Was amazing. Our tour guide was fabulous. Learned so much.\n\nthe FOOD IN NAPLES WAS THE ABSOLUTE BEST. And reasonably priced.\n\nEuro rail to Rome\nPantheon - amazing but quick\nColosseum and Vatican small group guided tours. FANTASTIC. Took metro here as well. LOTS of walking.\nRode bikes through Villa Borghese\nTook bus to walk around Trastavere\n\nEuro rail to Venice. So charming and quaint.\nMore expensive and sisnt find the food outstanding and yet being in Naples and Rome. Was able to see everything in 1.5 days\n\nMy kids wore Birks. They were fine. I wore hey dudes and I was fine.\n\nRely on your front desk staff. They are very helpful and speak English. Walk randomly to local spots.\n\nMetro was safe during day.\nBus was easy accepts Apple Pay", "link": "facebook.com/groups/1373361046396315/permalink/2208145169584561/", "likes": 21, "comments": [{"username": "Donna Parrish", "comment_text": "What tour company did you use in Pompei and how long did it last? Also how long did you spend in Rome? And what tour companies did you use there?Thanks!"}, {"username": "Tracy Foss", "comment_text": "Thanks"}, {"username": "Tom Walsh", "comment_text": "Napoli, love it 😊"}, {"username": "Darleen Jones Ellisor", "comment_text": "Quirky question…Hey Dudes with or without socks?"}, {"username": "Angelie Karako", "comment_text": "Napoli restaurants/\nstreet food vendors/bakery favorites??? Other than pizza please 🙂"}]}, {"id": "2208145549584523", "text": "Does anyone know of a private driver or a private or small group wine tour (cost too) we could do to go to some wineries for a day in Tuscany? We will be staying in San Vincenzo so might be a bit of drive to some of them. Also, if anyone has any recommendation of wineries, that would be near or within maybe 1.5 hours from San Vincenzo. Any advice would be appreciated. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2208145549584523/", "likes": 0, "comments": []}, {"id": "2208147459584332", "text": "I suffer from severe claustrophobia and am hesitant to buy tix to rooftop of Duomo because of the stairs walking down. I can’t even think about the elevator right now….\nCan someone tell me if the space is super tight. One way? Others coming up?\nAny other sufferers out there who have done it and can attest?", "link": "facebook.com/groups/1373361046396315/permalink/2208147459584332/", "likes": 1, "comments": [{"username": "Anna O'Connor", "comment_text": "In that case don’t do it. It is very claustrophobic,\nthe stairs are very narrow and winding. I lasted until half way up before I bailed out. Admire from the ground. 👀"}, {"username": "Trace Barron", "comment_text": "It's quite tight..I can't do it."}, {"username": "Fiona Ferrar", "comment_text": "I'm not claustrophobic at all and I found the space a bit disconcerting. So I would suggest you dont really."}, {"username": "Ken Lerch", "comment_text": "Severe? Bail."}, {"username": "Caroline Davidson", "comment_text": "I didn't like it at all. Couldn't wait to get down. Like following sheep 🐑"}, {"username": "Jenny McEvoy Sterpin", "comment_text": "The elevator up was perfect. It was only the three of us. The stairs down was awful. I had a panic attack about 20 stairs from the bottom. You have no idea where you are. It just keeps going and going."}, {"username": "Erin Mitchell", "comment_text": "If your speaking of Duomo in Milan. The elevator going up only holds 6 people at a time and they filled it up.\nThe roof itself is open, however there are narrow stairs going to the very top and descending to the church again. There is no passing space….."}, {"username": "G.Y. Harvey", "comment_text": "they do not let using elevator down at all? what about elderly?"}]}, {"id": "2208145876251157", "text": "Question about SIM cards. If I purchase a sim card in Paris will it work in Italy? Or will I need to purchase one in both countries. Sim sees more advantageous then my phone plan.", "link": "facebook.com/groups/1373361046396315/permalink/2208145876251157/", "likes": 4, "comments": [{"username": "Beth Ann", "comment_text": "No, you will need a different one for Italy"}, {"username": "Bella Z. Veksler", "comment_text": "U can get esim card that works in all of Europe, we used Nomad (data only)"}, {"username": "Hussein Karout", "comment_text": "You can buy an esim from flyesim app"}, {"username": "Michael Widjaja", "comment_text": "Some works in other EU countries,some don’t\n\nI bought lycamobile in Portugal…it worked in Spain and France but didn’t work in Belgium…it works but no data in Germany…"}, {"username": "Hussein Karout", "comment_text": "Get an esim from flyesim app"}, {"username": "Jocelyn Reyes Midghall", "comment_text": "Use Airalo and buy a regional plan. It should work in all of Europe."}, {"username": "Heather Kearney", "comment_text": "Orange SIM will work in both"}, {"username": "Kelly Cannon", "comment_text": "I've always only bought one SIM while traveling in Europe and never once had any issues moving from country to country. From Paris, use Orange. Find a store and go inside and they will get you going. Make sure you have your passport ready, they may ask for it. If you have a newer phone like the IPHONE 14, they'll install an ESIM if it's an older phone, they will install a SIM. Both work. I once used orange in 5 countries on the same trip. Including Russia."}, {"username": "Tiziana Martinello", "comment_text": "In EU countries there are no more roaming"}, {"username": "Paul Anderson", "comment_text": "A SIM card from France will work in Italy. We found orange to be the best for us."}, {"username": "Jose Velez", "comment_text": "esim is better"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "Orange SIM Card works in Spain, France, Italy, Austria and Germany"}, {"username": "Eva Johnson", "comment_text": "WhatsApp!!!!!\nCall, text, FaceTime. No charge."}, {"username": "Jerry Kiger", "comment_text": "Is buying a “throw away” phone a good idea? Read prior postings of just buying 2 cells for Italy and toss when leaving … maybe under $50 or so? I have ATT"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "European sim cards work all over Europe. You could just encounter some limitations on amount of data traffic you have available when you go abroad of the country where you bought the SIM.\n\nFor example I have my Italian SIM that has 50GB included, but when I travel in Europe I can use just 7GB. I don't know how is with french SIMs\n\nSo if you use lots of data traffic consider buying another SIM card in Italy, there are cheap companies like Iliad that work smooth and are less than 10 euros for a month with plenty of data traffic included"}, {"username": "Marisa Brombal D'Emilio", "comment_text": "I purchased mine on Amazon from Three UK, from Canada. I put the SIM card in as soon as we touched down in Frankfurt. It’s been great! Had service within about 5 minutes."}, {"username": "Lauren Vassallo Beattie", "comment_text": "If u get a Euro one. I got one that worked in Germany, Italy and Greece"}, {"username": "Rachelle Elle Anderson", "comment_text": "Orange works very well in every country we have traveled too including Bulgaria and Romania\nHave fun!"}, {"username": "IMr Mughal", "comment_text": "I have a Vodafone Italy SIM card, can I use it in Portugal?"}, {"username": "Maria Brozou", "comment_text": "All EU cards will work in any EU country the same."}, {"username": "Rolland VA", "comment_text": "Yes it will!"}, {"username": "Angela Gilmore", "comment_text": "Here in EU we can use the same SIM, zero problems, zero issues."}, {"username": "Renee Rundle Stoneham", "comment_text": "Majority of SIMs that are for visitors ie pay as you go. Good for a month or so are Good for ALL of EU.\nI’ve never had not that wasn’t."}, {"username": "Darcy Jessen", "comment_text": "Airalo regional card works throughout France and Italy"}]}, {"id": "2208148382917573", "text": "Trevi fountain at 8:20pm on a Sunday 😧", "link": "facebook.com/groups/1373361046396315/permalink/2208148382917573/", "likes": 60, "comments": [{"username": "Manoj Thakur", "comment_text": "Manoj Thakur"}, {"username": "Atif Aslam Alvi", "comment_text": "Enjoy"}, {"username": "Mary Lou Gillen", "comment_text": "Sooo crowded!"}, {"username": "Fei Dadulla Miranda", "comment_text": "Fei Dadulla Miranda"}, {"username": "Aida Sanchez", "comment_text": "Too crowded"}, {"username": "Joanne Diaz", "comment_text": "Crazy"}, {"username": "Donna Parrish", "comment_text": "No thanks! I hear early mornings are best!"}, {"username": "Claudine Marie", "comment_text": "This would not bring me joy. Definitely need to choose a different time of year."}, {"username": "Antonio Aloè", "comment_text": "WTF🤔"}, {"username": "Ursula Kenny", "comment_text": "Hopefully One month from now I will be ok 😳"}, {"username": "Lorie Sturm Marcyk", "comment_text": "We were there last september.. same."}, {"username": "Denise Beaudoin", "comment_text": "Pardon the photo…I took this in 2012…was coded the too!"}, {"username": "Nicola Campbell - Penrose", "comment_text": "Scott Campbell 😳"}, {"username": "Brachi Rosenberg", "comment_text": "Gali Zini Leibovich"}, {"username": "Debbie Brown", "comment_text": "Lucy Young xx"}, {"username": "Larry Dash", "comment_text": "Yuck"}, {"username": "Leonard Elia", "comment_text": "Crazy stay home !"}]}, {"id": "2208154119583666", "text": "I have a day in Milan. What are my best options of seeing the country side? Or best things I need to do?\nI like out the ways things, get enmeshed in the culture.", "link": "facebook.com/groups/1373361046396315/permalink/2208154119583666/", "likes": 2, "comments": [{"username": "Tonsia Keytel", "comment_text": "Look at yours on Viator. Hop on hop off bus is also great, it has 3 different loops of the city."}, {"username": "Miyuki Kanno Paul", "comment_text": "Milano is a huge city. Take a train to visit one of the Lake regions for a day"}, {"username": "Ann Lombardi-Perkins", "comment_text": "Milano is a huge city. Have you seen the last supper? The Duomo? The szofretto castle? There are many choices of transportation to explore some of the city. I recommend you take a day or so to peek around Milano."}, {"username": "Rebecca Yeoh", "comment_text": "Going up to the terrace (rooftop) of the Milano Duomo was one of the highlights of my trip. Absolutely incredible 👌🏼"}, {"username": "Bellafab Fabrizio", "comment_text": "Do the roof of il duomo its amazing then la galleria"}, {"username": "Mohor Chakraborty", "comment_text": "Hop on hop off bus"}, {"username": "Sande Ricci", "comment_text": "If you want to see the Last Supper you must buy your tickets directly and way ahead of time. It's amazing."}, {"username": "Debbie Milne Jenkins", "comment_text": "You might like the Navigli area of Milan."}]}, {"id": "2208149402917471", "text": "if you had one day and night to spend some time in Lake Como, where would you choose to spend it??", "link": "facebook.com/groups/1373361046396315/permalink/2208149402917471/", "likes": 5, "comments": [{"username": "Tonsia Keytel", "comment_text": "Bellagio, a quick ferry ride to Varenna and Mennagio too."}, {"username": "Carol Nagle", "comment_text": "My sister and fam are there now in a great rental home - gorgeous!"}, {"username": "Steve Grossman", "comment_text": "Bellagio. But it will be very crowded in july."}, {"username": "Iwona Dygas", "comment_text": "Varenna"}, {"username": "Annette Giovia", "comment_text": "I heard George Clooney lives there. At his place. LOL!!"}, {"username": "Tricia Lanieri Forchetti", "comment_text": "Varenna"}, {"username": "Elizabeth May La Duca", "comment_text": "Tremezzo: Villa Carlotta and Villa del Balbianello, dinner at L’Aglio"}, {"username": "Billie Frances Swanda", "comment_text": "??"}, {"username": "Glenn Todd Webb", "comment_text": "Villa Balbianello and Villa Carlotta in Tremezzo."}, {"username": "Claire Dowson", "comment_text": "Varenna is gorgeous and easy to get to by train. Can visit Bellagio by boat from there."}, {"username": "Jill Wolder", "comment_text": "Villa d’este on lake como. Concierge will plan the day for you and hit the highlights and capture the essence of your visit."}, {"username": "Simone Pfenninger", "comment_text": "Varenna"}, {"username": "Nariman Dergam", "comment_text": "Interested"}, {"username": "Sharyn Wright", "comment_text": "Bellagio"}, {"username": "Maria LoSurdo", "comment_text": "Definitely Bellagio! ❤️"}, {"username": "Suzanne O'Connor", "comment_text": "Bellagio 💕"}, {"username": "Alice Engstrom", "comment_text": "Varenna !"}, {"username": "Julia Muller", "comment_text": "Bellagio 🥰"}, {"username": "A Marie Ta", "comment_text": "Matt Zaki"}, {"username": "Meral Kalkan", "comment_text": "Bellagio💙"}, {"username": "Roe Gallo Saks", "comment_text": "Bellagio."}, {"username": "Lauren Neely", "comment_text": "Hiking monte Grona. Touring Menaggio, Bellagio, and Varenna"}]}, {"id": "2208161982916213", "text": "How do I get from Marco Polo Airport to this address please?...\nDoes a bus run close to here? If so, which one?.. How do I know where to get off?.. Any walking involved after the last bus stop...\nThank you..", "link": "facebook.com/groups/1373361046396315/permalink/2208161982916213/", "likes": 2, "comments": [{"username": "Beth Ann", "comment_text": "One thing I do is run all addresses into Google or Apple Maps and ask for directions and choose the Transit option. It will show what the public transit options are for the route"}, {"username": "Jill Edgington", "comment_text": "Use the app rome2rio. It maps out all the possibilities"}, {"username": "Karen Schmidt", "comment_text": "Rome2rio…"}, {"username": "Susi Menazza", "comment_text": "I’m from the area. There are no good connections by public transportation.\nHowever, it’s less than 15 min by car, so my suggestion is to get a taxi from the airport."}]}, {"id": "2208166352915776", "text": "Is there a universal SIM card for Portugal, Spain n Italy? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2208166352915776/", "likes": 2, "comments": [{"username": "Hussein Karout", "comment_text": "Yes you can use flyesim app"}, {"username": "Vilma Noronha", "comment_text": "Thank you!"}, {"username": "Muhammad Arslan", "comment_text": "lyca"}, {"username": "Jose Velez", "comment_text": "esim"}, {"username": "IMr Mughal", "comment_text": "I bugged Vodafone IT sim, can I use it in Portugal? ￼"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "Any SIM card can be used in other European Union countries. You'll have less data tho"}, {"username": "Roger Almanza", "comment_text": "Currently using Airalo e-sim card and hitting up all those countries. Works great."}]}, {"id": "2208166986249046", "text": "Herculaneum or catacombs?", "link": "facebook.com/groups/1373361046396315/permalink/2208166986249046/", "likes": 1, "comments": [{"username": "Daisy Yoo", "comment_text": "To me Herculaneum"}, {"username": "Miyuki Kanno Paul", "comment_text": "No need to compare an apple to an orange. Just visit Herculaneum. Probably it’s way older than catacombe you want to visit"}]}, {"id": "2208167696248975", "text": "It was our family’s first time travelling to Rome and this group has helped us a lot in planning, so I am coming back in this group with recommendation.\n\nWe had jet lag so we woke up pretty early, rented two lime scooters from Uber and planned a route around few of the major attractions just to take pictures. We started around 7:30am and endedआणखी around 9am. Most of these sites had no one around or very little people, it was awesome to avoid the crowds.\n\nSome of the attractions we got to see not in order:\nPonte Sisto\nArea Sacra Di Largo Argentina\nMonument to Victor Emmanuel II\nRoman Forum\nTabularium\nColiseum\nFontana Di Trevi (this was the busiest site but even then we were able to find a good spot and get a good shot with not many people around)\nSpanish steps\nRiver Tiber\nCorte Suprema di Cassazione\nCastes Sant’Angelo\n\nI’d says early morning with the scooter is much better since the streets are quite empty too and we were able to whiz around safely. I’d say from 8:30 we started to see some people and streets are busier with cars and buses.", "link": "facebook.com/groups/1373361046396315/permalink/2208167696248975/", "likes": 10, "comments": [{"username": "Mariya Anosova", "comment_text": "Did you book your coliseum tickets via coopculture? Also - any restaurant recommendations\nand where did you rent your scooters?"}, {"username": "Pooja Patel", "comment_text": "Amazing! Were you able to go inside the Corte suprema di cassozione?"}]}, {"id": "2208172516248493", "text": "I recently read a post about Golf Cart tour of Rome. I can't find the post. If anyone has any info, please reply. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2208172516248493/", "likes": 2, "comments": [{"username": "Celeste Marflak", "comment_text": "We did our golf cart tours of Rome thru Viator the first week of May 2023. We did 2. One out first night in town & one later in week. The guides were very knowledgeable & fun."}, {"username": "Susan Goldman Glasser", "comment_text": "Thank you so much! ❤"}, {"username": "Sunny Lang Fan", "comment_text": "You can search within the group and all post related to golf cart tour should popped up"}, {"username": "Mindy Marshall Lavin", "comment_text": "i’m doing one in a few weeks with Liv tours. I learned about them here. they do other tours as well and people had greAt things to say about them"}]}, {"id": "2208177002914711", "text": "In two weeks, we are traveling to Lake Garda with our 3-year old, staying in Limone Sul Garda 🍋 We have found plenty of “adult” stuff to do, but are looking for some activities that our daughter would love and enjoy?\nTIA! 🤗", "link": "facebook.com/groups/1373361046396315/permalink/2208177002914711/", "likes": 1, "comments": [{"username": "Maureen Rebello Hagerty", "comment_text": "Omg I loved Limoné. I’m so jealous!"}, {"username": "Helena O'Neill", "comment_text": "Boats on the lake to the different towns, cable car to top of Mount Baldo (Malcesine) and you can get gelato in disney character containers in the square when you get off the boat, Gardaland (theme park) maybe. When we were there a few years ago Riva del Garda (close to Limone) has a lovely walk along the lake, pedallos and an area with trampolines. You'll have such a good time!"}, {"username": "Claire Dowson", "comment_text": "Paddle in the lake with the ducks."}, {"username": "Kerry Jacobsen", "comment_text": "We’re going there in September. We’ve booked electric bikes. Apparently the bike tracks around Limone are fantastic. You might be able to hire a bike with a child seat?"}, {"username": "Kristina Ruk", "comment_text": "You can visit aqarium. There is amusement park gardaland, but she will be little to ride, just few rides only for little ones. Aquarium is next to Gardaland"}]}, {"id": "2208179229581155", "text": "I Navigli di Milano", "link": "facebook.com/groups/1373361046396315/permalink/2208179229581155/", "likes": 14, "comments": [{"username": "Viraf NZ", "comment_text": "Nice pic 😊"}]}, {"id": "2208181546247590", "text": "Heading to Messiina ( Sicily) as a port stop on a cruise in Sept We have approximately 5 hours anyone have a good local tour company to suggest?", "link": "facebook.com/groups/1373361046396315/permalink/2208181546247590/", "likes": 1, "comments": []}, {"id": "2208182649580813", "text": "Is it better to stay in hotels or air bnb’s for two people in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2208182649580813/", "likes": 5, "comments": [{"username": "Bella Cassandra", "comment_text": "Either"}, {"username": "Deborah Jones", "comment_text": "I prefer Airbnb’s for a couple reasons. I like that they have kitchens and I always get one with a washer machine so that I can do Landry especially for the longer length trips. I also like the local experience of living like a local. You can find some really charming airbnbs and really get a feel of what it would be like if you lived there."}, {"username": "Brittany Pardue", "comment_text": "The only downside we dont like about AirBnBs if ur doing like 2-3 day stays in different places, is they usually have a 3-6pm checkin with no where to store your bags and then a 10am check out. Compared to hotels where they are more accommodating."}, {"username": "Pam Wilson", "comment_text": "Yes! All of the above 🥰"}, {"username": "Maureen King", "comment_text": "I like airbnb but for this trip I need to stay at a hotel to be able to ask the front desk questions lol"}, {"username": "Sherri Leis Dillavou", "comment_text": "I loved the three airbnbs I used"}, {"username": "Pao Magnoler", "comment_text": "Airbnbs 100%!"}, {"username": "Jennifer Gustafson", "comment_text": "We loved our airbnbs and Vrbos"}, {"username": "Miyuki Kanno Paul", "comment_text": "Depending on the travel conditions. Longer stay in one location more than a week, I consider an apartment rental."}, {"username": "Jon Hotter", "comment_text": "Hotels"}, {"username": "Sierra Behrens Tibbetts", "comment_text": "We are going next summer. We are going on a cruise from Barcelona to Rome, and then staying in Praiano for 7 nights. We rented VRBOs in all three places. Took a lot of time reading reviews. We wanted washer/dryer and good AC. We have learned to like Airbnb/VRBO because we like having a little living area to relax in an drink our coffee too. This will be our first time in Europe, so I hope the experiences in these rentals are as good as places we have traveled in the states. So far the hosts seem even more accommodating!"}, {"username": "Antonio Aloè", "comment_text": "In Italy?Italy is over 1.200 km long and 500 km wide.\nBe more specific..🤔"}, {"username": "Em Vaws", "comment_text": "I like to do a mix"}, {"username": "Cate Neil", "comment_text": "What Airbnb’s would you recommend for Florence- 2 bedroom & happy to have a 30 minute walk to the centre?"}, {"username": "Carol Taylor Tisdale", "comment_text": "Benefits to both. Personal preference. We generally use both."}, {"username": "Mark Spielman", "comment_text": "Some people like hamburgers, some like hotdogs, it's YOUR choice."}, {"username": "Kristina Ruk", "comment_text": "Well we are familly of 5 and we find better way offers for hotels with breakfast included and besides there is less cleaning in hotels, sometimes we arrive late so bigger hotels are more available at nights..so I prefer hotels"}, {"username": "Chloe McDougall", "comment_text": "Depends on your needs, I’ve just done both in Italy - hotels great for easy check in / luggage storage / city centre - more convenient for short stays. Air bnb good for keeping cost down if you want to do any self catering and / or chill out a bit."}, {"username": "Sally Warren", "comment_text": "Airbnb because you can live like a local. Shop, cook and do washing. Stayed in amazing places throughout Italy which made our trip so memorable."}, {"username": "Lauren Vassallo Beattie", "comment_text": "I did both"}, {"username": "Mary Lou Gillen", "comment_text": "That depends on what you feel most comfortable in. Personally we like hotels. When on vacation I don’t want to bother doing anything as far as needing a kitchen. We like a nice room, house keeping and a place to wake up have breakfast waiting for us and take off for a full day of sightseeing. Return late afternoon to a clean room , rest and go out to dinner. Sleep wake up and repeat. Everyone is different. Depends on your way of traveling."}, {"username": "Pam Hartsoch", "comment_text": "We’ve done both. For your first trip, I’d do a hotel so you have front desk or concierge staff to ask questions. For longer trips, Airbnb is nice to do laundry."}, {"username": "Maria Brozou", "comment_text": "For just 2 people hotels are the best choice."}, {"username": "John Wilson", "comment_text": "AirBnB allows their vendors to cancel your reservation on short notice. So, some will give you the reservation at one price so they know they won’t be stuck with an empty place, then hunt a better offer sometime closer to the date. That’s when you get cancelled .That’s one main reason I prefer hotels ."}, {"username": "Lynda Petralia", "comment_text": "It’s a personal choice. We prefer a nice hotel with amenities and a nice buffet breakfast and good dinner options is great if you are tired and don’t feel like going out."}, {"username": "Mary Anderla", "comment_text": "We did several bed and breakfast, they were delightful! Homemade breakfast and pastries and they made a Togo lunch for us.. great experience.."}, {"username": "Denyse Sexton", "comment_text": "The downside of Air BnB is when you don't meet the host 😔 🙂"}, {"username": "Gloria Chesbro", "comment_text": "Air B and B is our go to. We’ve had nothing but great experiences. In Venice especially, we stayed in Arsenal, few tourists. So great to be with the locals."}, {"username": "Pamella Hardy", "comment_text": "We are doing 21 days in Italy next month & we chose Airbnb (with washer) + Hotels !"}, {"username": "Kevin Andrews", "comment_text": "If you travel alone hotels. In Italy you are charged by the number of people in a room. Not like US where rooms are a flat rate. A room for 2 will cost almost double the price for a single."}, {"username": "Starla Dawn", "comment_text": "I did both"}, {"username": "Dana Green", "comment_text": "Hmm. I guess that depends on how you’d prefer your stay to be. I see pros and cons in both. I prefer airbnbs as I like more privacy and a unique experience."}, {"username": "Stacy Derouin", "comment_text": "I prefer hotels."}, {"username": "Colleen Church", "comment_text": "VRBOs"}, {"username": "Vivien Paulik", "comment_text": "I like apartments more, because I feel more independent than in a hotel.\nI never used airbnb. But always seach for aparment, aperthotel, private flat on sites"}, {"username": "Mandy Pusateri", "comment_text": "I literally just booked my Airbnb today in Rome for a stay next month. It's pretty overwhelming trying to find a place to stay in my price range. Now I am also looking for a place to stay in Venice. I chose an Airbnb because I wanted a little bigger place and the price was comparable to a hotel. I haven't decided what we are going to do in Venice yet."}, {"username": "Daisy Yoo", "comment_text": "I will always do Airbnb bc I can cook and do laundry but if u prefer to eat out for every meal hotel will work Best. U can just room in a home for Airbnb as well"}, {"username": "Jill Brothers", "comment_text": "We like agritourismo with kichens so we can market shop and eat dinner in while drinking copious amounts of lovely local vino."}, {"username": "Ruth Simmons", "comment_text": "My husband and I prefer hotels because we’re gone all day sightseeing and really only use it to sleep and store luggage!"}, {"username": "Enrico Lecce", "comment_text": "It's a preference...."}, {"username": "Lisa Macaluso McCready", "comment_text": "Airbnb"}, {"username": "Donna Arbec", "comment_text": "I’ve done both. Never was disappointed with our air b&b’s"}, {"username": "Karen Schmidt", "comment_text": "We always do a combo. This allows some days of more space, groceries and laundry…and some days of breakfast served and ease of use."}, {"username": "Gina Rovello Keenan", "comment_text": "It depends. Are you looking at 2 nights or 10 nights? For 2 nights I would prefer a hotel but for 10 you might want down time and laundry access."}, {"username": "Heather Bonetti", "comment_text": "Hotels"}, {"username": "Tara Roed", "comment_text": "We did a combo. In the south hotels with pools. I’m Rome an Airbnb so we could spread out. I travelled with my two 18 year olds so it was nice to each have a bedroom to ourselves there. I love a fancy hotel but the Airbnb made me feel like I was really soaking in life in Rome."}, {"username": "Ruth Hackert", "comment_text": "I like an Airbnb for a full apartment living….kitchen\n& laundry"}, {"username": "Ho YC", "comment_text": "I would go for whichever that offers good location and price. The other factor to consider would be the check in and out times. Some Airbnb can be a bit inconvenient for deposit of luggage before or after the stay."}, {"username": "Nancy Cicinelli", "comment_text": "Most hotels include breakfast at the same time make a sandwich there for lunch it's light and always go to town for a nice dinner out! That's what I do always and stay in a hotel central then daily trips"}, {"username": "Marlene Bertino Randolph", "comment_text": "My husband and I prefer hotels."}, {"username": "Kristine Larsen", "comment_text": "Can anyone recommend hotels in Venice by the cruise port? Trieste terminal"}]}, {"id": "2208185342913877", "text": "Looking for recommendations on food/restaurants in Venice please", "link": "facebook.com/groups/1373361046396315/permalink/2208185342913877/", "likes": 2, "comments": [{"username": "Carolyn Chambers Rosamilia", "comment_text": "Osteria Mocenigo"}, {"username": "Angela Trippe Tursi", "comment_text": "Following"}, {"username": "Brian Osman", "comment_text": "Just wander around and find you a spot, all where great 👍"}, {"username": "Jennifer Smith", "comment_text": "Following"}, {"username": "Anne Gee", "comment_text": "Usually, if you see/hear italians enjoying a meal in a restaurant, it's decent."}, {"username": "Courtney Rey", "comment_text": "We took the ferry from the train station to San Marco square and walked back to the train to take it all in\nLiterally anyplace you go there are places to eat drink etc don’t make a plan just get lost\nDef stop at Harry’s bar for a Bellini !!"}, {"username": "Dave Colleen", "comment_text": "Dolfin Ristorante"}, {"username": "Maria NoBa", "comment_text": "https://\nwww.ristorantesa\nntrovaso.it/"}, {"username": "Maria NoBa", "comment_text": "Great ice cream\nhttps://\nwww.gelaterianic\no.com/"}, {"username": "Pong Ac Ai", "comment_text": "Leone di oro"}, {"username": "Sarah Campise Hallier", "comment_text": "Al gondoliere . Delicious. Make a reservation."}, {"username": "Elisabeth HA", "comment_text": "Very Good. (and yes it is)"}, {"username": "Josephine Spallina", "comment_text": "Florence is beautiful, was there yesterday. I agree just wonder around. When I’m Florence make sure you have the Florentine steak. Sides streets are the best. Good luck."}]}, {"id": "2208187269580351", "text": "Does anyone know where in Italy Brighton Sandals are made? They say made in Italy right on them so I’m wondering if they have a store in Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2208187269580351/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "That's a good question for Google"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208191956246549", "text": "Is there a luggage storage inside Napoli Centrale train station? If so, how is it?", "link": "facebook.com/groups/1373361046396315/permalink/2208191956246549/", "likes": 0, "comments": [{"username": "Cynthia McDonald", "comment_text": "Yes there is. It works very well. It's on platform 2 and 3 near the McDonalds."}]}, {"id": "2208192182913193", "text": "Wanting to holiday in Italy next year, have priced flights into Milan beginning of July for 9 nights. Will be staying in Northern italy and really want to visit lake como and lake garda, will do Milan last couple nights as my teenage kids want to visit the football stadium. Where would people recommend we stay for good areas to explore? We will be travelling via train, but trying to keep costs down as much as possible.", "link": "facebook.com/groups/1373361046396315/permalink/2208192182913193/", "likes": 0, "comments": [{"username": "Steve Grossman", "comment_text": "Principe Savoia Milan"}, {"username": "Claire Dowson", "comment_text": "We’ve just done this, but ended in Venice… we stayed in a lovely AirB&B in Lierna. It’s a train stop down from Varenna with boats to Bellagio. We stayed both in Riva and Desenzano on Garda. If you need any details, happy to help."}, {"username": "Kristina Ruk", "comment_text": "I use booking com, there on a map you can find the covenient places and can see prices. I use it and sometimes write directly to the place to book, as hosts pay fee for the platform. Have a nice trip"}]}, {"id": "2208194866246258", "text": "I've just booked for a mid week break at Lake Maggiore. Staying in Verbiana. Is the trip to the islands worth it 😊", "link": "facebook.com/groups/1373361046396315/permalink/2208194866246258/", "likes": 4, "comments": [{"username": "Sheila Grant", "comment_text": "Yes !"}, {"username": "Ali Everson", "comment_text": "Absolutely!"}, {"username": "Glenn Todd Webb", "comment_text": "Yes. One top 5 in all Italy."}, {"username": "Stefano Bressanelli", "comment_text": "Absolutely yes!!!!! You will love It."}, {"username": "Antonio Aloè", "comment_text": "Verbania dude...🤭"}, {"username": "Lyn Evans", "comment_text": "I loved Isola Pescatori.. went over for lunch twice whilst staying in Stresa.. gorgeous! Definitely worth visiting them. Probably our highlight."}, {"username": "Rosa Butta D'Astolto", "comment_text": "Absolutely yes!! I’ve been there and it’s beautiful!!"}, {"username": "Antonio Aloè", "comment_text": "\"Verbiana \"might be like the famous Italian song \"l'isola non trovata\"-The island not found-\nYou remember the \"is the economy stupid\"?\nWell \"is the geography stupid\"..🤭"}, {"username": "Debi Lubiani DeLoney", "comment_text": "I remember seeing Lake Maggiore on my trip to Italy! It’s was breathtaking!! Very memorable!!"}, {"username": "Helen Ladkin", "comment_text": "I stayed in Baveno and visited Isola Bella. A wonderful experience."}, {"username": "Paola Coppi", "comment_text": "Yes of course! I suggest you also to visit Angera Castle (Rocca di Angera) and the Eremo di Santa Caterina del Sasso. There must be a ferry ticket covering all these places! By train you can also visit Valle Vigezzo: there's a train called Vigezzina leaving from Domodossola and getting to Locarno (Switzerland) that passes through a wonderful mountain valley. Also visit Mergozzo Lake, my hometown, and taste Fugascina, a typical butter biscuit!"}, {"username": "Gloria Maledi", "comment_text": "yes"}]}, {"id": "2208196726246072", "text": "We have to leave our luggage at the Milan Central train station for several hours - it looks like there are independent sites that offer luggage storage (Bounce, Stasher, Luggage Hero, etc). Does anyone have experience and/or recommendations with any of these companies?", "link": "facebook.com/groups/1373361046396315/permalink/2208196726246072/", "likes": 0, "comments": [{"username": "Pedro Ramos", "comment_text": "I haven’t used Bounce abroad, although I’m assuming it works the same! left luggage in NYC on the way here with bounce and it was affordable and had no issues."}, {"username": "Khushi Khanna", "comment_text": "I have used Bounce in Bologna last year. Left our big suitcases for a week . No problem ."}, {"username": "Brenno Bianchi", "comment_text": "There is also the luggage storage at the train station at Kipoint"}]}, {"id": "2208198156245929", "text": "Hi, My husband and I are planning a three week vacation in Italy. We will spend our first week in Tavernelle Val Di Pesa as à base and from there by car we wish to visit the surrounding villages in Tuscany. We are familiar with this area but have not been there for quite some time. Does anyone have suggestions for charming villages and quaint restaurants to explore. Thank you for any references", "link": "facebook.com/groups/1373361046396315/permalink/2208198156245929/", "likes": 0, "comments": []}, {"id": "2208199466245798", "text": "Traveling from Florence to Montecatini Terme via a rental car and looking for a nice winery with lunch along the way. Suggestions? Most of what I've seen recommended are south of Florence", "link": "facebook.com/groups/1373361046396315/permalink/2208199466245798/", "likes": 0, "comments": [{"username": "Monica Sucato", "comment_text": "Most wineries aré between Florence AND Siena..."}, {"username": "Brenno Bianchi", "comment_text": "Check the area of production of the wine Carmignano DOCG and places like Tenuta di Capezzana, Tenuta di Artimino and Fattoria di Bacchereto"}]}, {"id": "2208200459579032", "text": "Does anyone have info on private drivers from Cinque Terre/Monterosso to Naples for 4 people and luggage, trying to compare to train. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208200459579032/", "likes": 0, "comments": []}, {"id": "2208206909578387", "text": "Looking for advice on the train from Ventimiglia to Cinque Terre. I’m currently in the French Riviera and the regional trains are VERY busy! Crowded, pushing and shoving…very unpleasant! I’ll be travelling with my family and rolling suitcase tomorrow and am worried we’ll have difficulty. Does anyone have any recent experience on this route? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208206909578387/", "likes": 0, "comments": [{"username": "Tony Gesmundo", "comment_text": "Watch out for pick pockets. Everyone pushes to get in and the person next to me had his wallett stolen and they also undone my shorts pocket but luckily didn’t take anything. We only realised about 30 minutes later."}]}, {"id": "2208207926244952", "text": "I’m sorry if this sounds silly..\nBut has anyone been to Florence but not super keen on visiting museums? (I know right.. then it’s like, why go to hometown of Sandra/Leonardo/Michelangelo etc etc).\n\nDid anyone prefer other sites over museums?", "link": "facebook.com/groups/1373361046396315/permalink/2208207926244952/", "likes": 266, "comments": [{"username": "Raymond Owens", "comment_text": "My favorite Florence memory was climbing up to the top of that dome, and looking out the little windows at the top.\n\nDon’t get me wrong, David was awesome, and I’ll go see David again one day, but the little tiny window that I was looking out of made me think about the fact that I was the only person on earth that had that exact view at that exact moment. I think it was one of those little holes near the top of the dome that you can see in this photo.\n\n￼ I find stuff Like that as inspiring as some of the things I see in museums. Although I do love both. Another one of my favorite things to do in any city is to just walk around randomly. No maps, just walking down the street turning right or left. Just following whatever looks interesting."}, {"username": "Patrick Evans", "comment_text": "We made it a point to see all three David's, which provided for different excursions. One to just wander the streets. One to hike up to Piazzale Michaelangelo and take in the views. And one to go to a museum and have an early start to the day. The first and last could be coupled, but wandering through the streets with the only goal being to get to dinner the first evening and happening upon Piazza della Signoria as it started the transition to night was a great start to our visit."}, {"username": "Lilian Villarreal", "comment_text": "Boboli garden!"}, {"username": "Kasey Jackson", "comment_text": "Ya I didn’t go to any museums there except I ran in to the Accademia to see the david. Saw the duomo and walked around the squares then spent a lot of time shopping lol"}, {"username": "Nadia Waugh", "comment_text": "This September will be my 3rd or 4th visit to Florence, and I've finally decided to visit the Uffizi...it's such a beautiful city to explore that I've never bothered before, always thinking \"maybe next time\". Go at your own pace, don't feel pressured to do those things if you find other things you'd like to do instead, I reckon!"}, {"username": "Elana Zlatkin", "comment_text": "Not a big fan of memuseums or churches, they all star to look the same soon. Enjoy wondering the streets, getting lost, have coffee, gelato breaks"}, {"username": "Lucia Stefakova", "comment_text": "Anybody walked there with a dog ? 😊🙃"}, {"username": "Anthony Bosco", "comment_text": "Pizza"}, {"username": "Anthony Bosco", "comment_text": "If you like steak, this city has some of the best. Look for them in the windows. I had one of the best steaks of my life last week!!!"}, {"username": "Katharine McCoy", "comment_text": "My favorite thing that we did was take a vespas tour on the vineyards outside of Florence ending with wine tasting and winery tour. This felt like my dream Italy vacation experience. Also did an electric bike tour that we loved."}, {"username": "Sara Burrow", "comment_text": "I always loved the museums & galleries & visited them, including the churches. But, there is plenty of fun to be had in Florence too.... Try the motorbikes tour of the local vineyards & wineries, so much fun! Also, the day tours of Tuscany to Siena & San Gimengano & Olive Oil presses, shopping etc."}, {"username": "Kathy Mansk-Billehus", "comment_text": "Bike tour, food tour, shopping, eating and drinking and just enjoying the Italian culture, that’s what we did!"}, {"username": "Teri Haskins", "comment_text": "We went to zero museums in Florence and had a fabulous time … it is the birthplace of the Renaissance … there is historical value around every corner !!!!"}, {"username": "Laura Lezic", "comment_text": "Yes, bars and restaurants😂"}, {"username": "Claire Madden", "comment_text": "We had kids with us so just went to see David. We were only there for 2 nights. On our first day we did Florence: The Medici Conspiracy Quest. You download the Questo App and follow the instructions. It takes about 90 mins or you can take your time. But you get clues and have to look for clues in certain places and buildings (of interest) around the city. It makes it interesting for kids and Adults."}, {"username": "Marti Krauss", "comment_text": "Boboli gardens"}, {"username": "Jennifer Wernert", "comment_text": "Last month, when our family went to Florence, we did no museums there. My family was museumed out!! We did a Vespa tour and that was their favorite activity on the whole Italy trip. It was amazing and so much fun!"}, {"username": "Kristine McIntyre", "comment_text": "The pharmacy was very interesting to me."}, {"username": "Alexandra A Welker", "comment_text": "You don't have to go to the museums to enjoy the city. There are other things to do, explore the market, go across the river to watch the sunset, shop, people watch while having a drink/food."}, {"username": "Leslie Goodland", "comment_text": "Yes. Cathedrals/\nchurches, walking around/\nwandering, Rialto Bridge, Arno River and the Boboli Gardens."}, {"username": "Jacqui Bridges", "comment_text": "It’s all about wandering the streets and squares, enjoying the view from Piazza Michelangelo, and eating the fabulous food while you people-watch."}, {"username": "Michael Imbelli", "comment_text": "Folks can be overwhelmed by large museums. Wandering around the beautiful streets and discovering great restaurants is a wonderful experience. Big museums can have long wait times. The Bargelo and Museo del Duomo are smaller and more manageable. You can also see great art in churches where you can pop in. Enjoy 🙌"}, {"username": "Julie Ciriano", "comment_text": "I was not too into museums when I was there last year."}, {"username": "Sandra Stewart-Kadlick", "comment_text": "Any gluten free pizza or pasta? Thanks"}, {"username": "Donna Harrison", "comment_text": "Best Gelato ever tasted 🍦"}, {"username": "Kim Perkins Schoppa", "comment_text": "We tour the city & skipped the museums since we were going to Rome. Only regrets was we did not go to the Medici estate."}, {"username": "Valerie Rippey", "comment_text": "The gardens!"}, {"username": "Lea Lenderman Shappell", "comment_text": "The food"}, {"username": "Christy Arneson", "comment_text": "I loved Florence and didn't go in the museums."}, {"username": "Enne Natalya Irish", "comment_text": "I’m not a big fan of museums but I do have to say that David is a thing of beauty and absolutely worth seeing! Loved just wondering around Florence, visiting churches and checking out the architecture. Stopping at every cafe and people watching"}, {"username": "Sam Cupp", "comment_text": "We only went the see the David statue and that took all of an hour. Then we just wandered around the city. It was amazing. We walked up to the Michelangelo park (don’t remember exactly what it’s called) to get a view of the city and that was awesome."}, {"username": "Maureen McCall Bradley", "comment_text": "We did a great pizza and gelato tour along with an amazing city tour."}, {"username": "Diana Wilson", "comment_text": "Yes looked at shops went to leather\nshop.Couldnt go to art museum not\nenough time huge queues"}, {"username": "Chloe Gallagher", "comment_text": "Have a go on the carousel, go to the leather market, rub the boars nose, go to the little church & see an opera performance, people watch at the duomo while having coffee & a fresh canolli, take a pasta class & meet new people!"}, {"username": "Anna Maria Gatt", "comment_text": "You can just walk around. Florence is art in itself plus a culinary delight"}, {"username": "Susana Stubbs", "comment_text": "Besides culinary classes and day tours to wineries etc. taking a Segway tour is fun and a great way to see the whole city and then go back and spend more time in the parts you like the most."}, {"username": "Fiona Cameron", "comment_text": "Ive been to Florence many times. Went to see David the first time and the only other museum Ive been in was the one that’s near the Duomo -Opera del Duomo museum… it’s definitely worth a visit!!"}, {"username": "Sue Levy Avinir", "comment_text": "Visit the wine windows. A great way to explore the city."}, {"username": "Jeanette Grima Falzon", "comment_text": "Kindly .... kindly, can I ask where is the Davide di Donatello right now PLS?"}, {"username": "Jeanette Grima Falzon", "comment_text": "Hailey Jones"}, {"username": "Danilo Piaggesi", "comment_text": "Sorry, I do not know any artist that goes by the name of Sandra"}, {"username": "Stacey Adams White", "comment_text": "Not sure if you’re a street art fan? Florence really is alive with it 🖤"}, {"username": "Kathy Reilly", "comment_text": "Flourence felt like home! It was my favorite city!"}, {"username": "Linda Barba", "comment_text": "Following"}, {"username": "Slavka Borislavova", "comment_text": "We went to Piazzale Michelangelo and Forte di Belvedere - the best panoramic view of Florence We also went to The Santa Maria Novella Pharmacy - probably the oldest pharmacy in the world."}, {"username": "Wendy Harrison", "comment_text": "How about churches? Lots of them, some containing art. Loved walking around the Oltrarno. There's also a hill to the south with apparently great views (didn't make it there.)"}, {"username": "Carrie Paradis", "comment_text": "Sheila Hedges great post here too if we decide to go to Florence ♥️"}, {"username": "Jenn Lackey", "comment_text": "🙋‍♀️🙋‍♀️🙋‍♀️ im going to accademia just to see david. I watched medici on netflix so im going to the palace and chapels. Im going to the duomo as well but not climbing it."}, {"username": "Denise DeSha-Soberanis", "comment_text": "Personally, I really enjoy having an afternoon aperitivo at the rooftop bar of the Excelsior Hotel. The view, the cocktail and the “snackies” are a great way to wind down your day!"}, {"username": "Randy Aull", "comment_text": "My wife and I are not so keen on museums, churches, or even shopping. We felt like terrible tourists. We barely saw any of the \"must see\" things. But, we ate amazing food, met wonderful people, discovered need little corners of the city. There is a lot to love in Florence."}, {"username": "Cindy Giuliani Buda", "comment_text": "Both but time constraints have us making choices."}, {"username": "Koo Rosh", "comment_text": "We didn’t go to the museums. Took a bus and traveled outside the city and went exploring… you’ll see so much in Italy in terms of history that you’ll be super satisfied. Unless you have a specific desire to see something, I’d say you’ll be fine without it 🙂"}, {"username": "Fran Fitzpatrick", "comment_text": "Ponte Vecchio,Michael\nangelo Gardens Piazza Vecchio and Republica plus train access to Luca, Pisa,etc.."}, {"username": "Barbara Kistler Wilhelm", "comment_text": "We did pasta and gelato making in florence which was pretty cool. I am not a big museum person either"}, {"username": "Marcus Hiesler", "comment_text": "We staying in Tuscany and doing say trips. Although we have a car, maybe different."}, {"username": "Toni Quatrini Bannister", "comment_text": "The stature of David was my favorite of all the things I saw in Rome, Florence and Venice! It took my breath away it’s amazing don’t skip it!"}, {"username": "Denise Tenn", "comment_text": "We had a lovely time just exploring the streets, bridges, cafes & local shops plus we experienced a beautiful wine tasting on a boat along river with a fabulous sommelier & local historian. We did see David & also a highlight was walking up the steps to see the sunset/views from Piazzale Michaeangelo - great atmosphere with the crowd & the buskers playing romantic music up there & you can buy wine/drinks from a Little kiosk up the top & relax at a table or sit on the steps. Go a bit early to get a good spot! So worth the steps. We do love art but only had a couple of days there. Will go back another time to see the art for sure! Enjoy Florence - one of the highlights of our entire inter ailing tour of 2 1/2 months in Europe ❤️"}, {"username": "Kathy Banning Morse", "comment_text": "I’m not a museum fan either.\nFollowing"}, {"username": "Lisa Lynn", "comment_text": "￼￼ We did a bike tour, through Florence one morning\n￼ Walk the steps to the top of the demo\n￼ Winetasting at Antinori\n￼"}, {"username": "Frank Buscemi", "comment_text": "Churches, in Italy are fabulous"}, {"username": "Sharon Morey", "comment_text": "Oooh I feel the same way! Not a museum gal. We are going in September."}, {"username": "Miriam McNally", "comment_text": "Florence is beautiful. We did a lovely hike in the hills above Florence, got a bus up to Fiesole then the hike. There's a v good restaurant somewhere up there that can only be reached by walking. We didn't go there but it has a v good reputation!"}, {"username": "Anita Lawrence Mundy", "comment_text": "Go to the coast"}, {"username": "Debi McGrath", "comment_text": "I'm literally only spending one night in Florence, arriving on train from Cinque Terre spending the night and picking up a car to explore Tuscany for a week. So many people think I'm nuts for not spending more time here."}, {"username": "Erin Vizza", "comment_text": "We were only there for two days and only visited the Academia for a brief time. After touring several other cities in Italy Florence was still my favorite! Just walking and exploring."}, {"username": "Charleen Siegler Schuss", "comment_text": "Skip Florence, spend your time in Siena. Lucca, hill towns in Tuscany"}, {"username": "Meg Johnson Ignacio", "comment_text": "We went to the Central Market, duomo and David. Having a guided tour of David was amazing! We also did the Tuscany trip one day using Walk About Florence. Absolutely loved Siena!\n\nhttps://\nwww.walkaboutflo\nrence.com/"}, {"username": "Cathy Mammarella Melvin", "comment_text": "We were lucky enough to have a relative, who lived in Florence, meet us and take us places that we probably would not have gone. We did not go to museums. She did take us to Piazzale Michelangeo (there is a David statue there although not the original) to watch the sunset and then we went with her friends to eat pizza and drink wine (of course) at 10pm! She also took us to All'Antico Vinaio for lunch. We found the market on our own. It was a great couple of days."}, {"username": "Lisa Rizzo Ozmon", "comment_text": "Well that’s me so looking for suggestions"}, {"username": "Melanie Sartuche", "comment_text": "Try at least one museum. I didn't know I liked the art and especially the sculptures until I saw it"}, {"username": "Giovanni Palma", "comment_text": "Firenze is beautiful. You can take a day trip to Tuscany, Pisa, Luca, Cinque Terre all from Firenze, plus getting to know Firenze and do some shopping and walking getting to know the history of it."}, {"username": "Rebecca Carroll", "comment_text": "Here I’ll be helpful instead of telling you to go to another country. Lots of great restaurants. Take a walk over the bridge. Take. Pasta making class. Lots of wineries nearby climb the tower. Overlook the city."}, {"username": "Claudette Franco", "comment_text": "I just went to Florencia last year, I do not love museums, and it resulted my favorite city in all Italy. OMG the food, the wine, the aperol spritz, walking around the city is amazing and beautiful. I took day tours to cinqueterre and La Toscana, there are a lot of things to do besides museums. Enjoy!"}, {"username": "Wendy Palmer", "comment_text": "We didn’t do any museums & had a blast!!!!!! There is so much to see & do & we weren’t interested in spending our time waiting in lines & we aren’t big art fans anyway."}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "There was recently a post about a mother and daughter who traveled to Italy and had a wonderful time not going to churches and museums. She was attacked originally for saying they weren’t into that and then posted about the amazing time they had doing other things. There is so much to do."}, {"username": "Tutti Burkett", "comment_text": "We have a pottery class scheduled and a silver jewelry class scheduled"}, {"username": "Samantha Carlo Pessotto", "comment_text": "Florence is one of my favourite places but not overly interested in art or museums but just love it, we are heading back there for five days soon and have no museums/art in our itinerary 😜"}, {"username": "Cheryl Swiatko", "comment_text": "We just explored and had a blast!! The sights are wonderful ,the food that we ate was out of this world, did a cooking class, visited the leather market and spent a fortune. LOL!!"}, {"username": "Evangeline Favis", "comment_text": "F"}, {"username": "Kyle Kevin", "comment_text": "Lisa Jo"}, {"username": "Emily Rossi-Snook", "comment_text": "You’re fine… I don’t prefer the Uffitzi over the churches that house the art that artists created for: Santa Maria Novella, Santa Croce to start"}, {"username": "Betty Becker", "comment_text": "Boboli gardens and others, beautiful!!"}, {"username": "Pam Simpson Wilson", "comment_text": "Day trip to Murano/Burano by water taxi Murano for glass Burano for lace and the colorful buildings"}, {"username": "Dayna Scinto", "comment_text": "I definitely loved the designer shops !!! 👛👝🎒🕶️👙👗"}, {"username": "Hollis H McGuire", "comment_text": "Yep. Me. I’d rather walk all day people/\nbuildings/\nmarket-watching.\nI know her history well and we’ve been there at all times of year, so I also know it’s ALWAYS crowded, too much for me to actually enjoy."}, {"username": "David Perillo", "comment_text": "Just wandering the street is experience enough in that beautiful city"}, {"username": "Sanjay Bhavnani", "comment_text": "It’s a great walking city . I feel that’s the best part of the city. The area to walk is around the duomo , uffizi gallery ( the squares just before the uffizi has street artists performing and it’s very lively ) and ending at the ponte vechhio bridge . It’s all very close and easily walkable . Enjoy 😊."}, {"username": "Patty Omodt", "comment_text": "Leather markets, shopping , the bridge, and more!"}, {"username": "Fiorenza Bruni", "comment_text": "We have family just outside Firenze, so on my first trip as a 9-year-old, we visited Leonardo’s birthplace in Anchiano, about a km from Vinci. Granted in those days (1960) it was just an ancient farmhouse at the top of a dirt road. (It’s quite built up now.) But in Vinci there is a Leonardo museum displaying models of his many inventions, which could appeal to a 9-year-old. A bit of history would be helpful, but Leonardo was such a visionary in many areas that a kid could pick any number of topics and write about him in school. I’m 72 now and I never miss a chance to visit Anchiano or Vinci. 🙂\nLeonardo was cool beans."}, {"username": "Nicole Conzatti", "comment_text": "One of my favorite things I did in Florence was a bicycle tour. Loved getting the lay of the land and choosing to go back to see what I wanted after."}, {"username": "Rbk Allor", "comment_text": "Following for recs. I think by the time we visit florence I’ll be a little burn out of museums and churches"}, {"username": "Ashley Martins", "comment_text": "We have been to Florence twice, first time we saw David, took us all of an hour as we aren’t “museum people”. 2nd time we went with our 17 year olds and skipped all museums. We love just walking the river, eating (their market/food court is amazing) & using it as a base for day trip to wineries, Pisa, etc."}, {"username": "Chris ORiordan Dean", "comment_text": "I’m not a formal museum person. I love being in the real places. I recommend going into the churches for the paintings and the architecture. The baptismal is an incredible place as well. We are returning in a month and just walking the streets and taking it all in. And yes the food. We are planning on going up on the hill for sunset and having time to enjoy ponte vecchio."}, {"username": "Sara Butcher", "comment_text": "Don’t worry if you don’t want to go to museums - I’m the same! I’m happy to view from the outside. I love just wandering around and soaking up the atmosphere. If something grabs my attention and I want to go in, I do ❤️🇮🇹🇦🇺"}, {"username": "Nancy Tamburino Cuomo", "comment_text": "I was not so keen on Florence it looked dingy ￼with graffiti all over the walls. It rained that day so that didn’t help, sorry better places then Florence"}, {"username": "Danielle Gervais", "comment_text": "I am keen on visiting museum but the market near the train station and the gardens of Boboli are beautiful"}, {"username": "Deborah Schroeder", "comment_text": "I am not a museum person-I get bored really quick-and I am not into the Renaissance. I was actually dreading Florence. Was I wrong. I went to more museums than I think I have ever gone to in the past 40 years. I did David only because I felt I should. Could have missed it. I did the Uffizi, but it is small and went quick. Loved the Bargello and Palazzo Vecchio, especially the climb up the tower. Got the Duomo pass and did all that but the best part was the Duomo Museum. Then, just walking around. Let's just say, I am heading back to Rome next year and doing a day trip back to Florence."}, {"username": "Jill Rosenfeld", "comment_text": "I have been to Florence four times and never been to Ufizzi. In fact, after my first trip, we were so embarrassed we just laughed and told people we went to see the masters! I am not crazy about museums. There is plenty to do like experience the culture, the architecture, the food, etc. don’t be embarrassed. If I went tomorrow, I still wouldn’t go. Lol! I live near the MET and 10 blocks from MOMA and I have only been to special exhibits that appeal to me. For years, I never told anybody, including about Florence! Not being interested in museums doesn’t make you any less than somebody else. And, by the way, it is your vacation! Personally, I preferred spending the day in the piazzas, having espresso and shopping! I must admit, though I have seen the David every time. I do think that is incredible and you only have to be there a very short time to appreciate it!"}, {"username": "Sarah Pierce", "comment_text": "Same! We plan to see the Davis and Uffizi, but that’s probably as much museum as I can handle.\n\nAnyone have suggestions for city tours that aren’t so museum focused? Maybe architecture, or food!"}, {"username": "Migual McElroy", "comment_text": "It was great !!!!"}, {"username": "Maria Delaney", "comment_text": "I am not a museum buff but Florence has sooooo much more to offer. We are staying for a couple of months using it as a home base. But we love the gardens, the duomo, meandering the streets. The Mercato Centrale, & the food tours."}, {"username": "D'Anna Sullivan", "comment_text": "Just went for scenic photos and silly souvenirs the first time. I plan to go back though."}, {"username": "Eva McLean", "comment_text": "It’s YOUR vacation. Do what makes YOU happy. You don’t need to justify yourself to anyone or ask anyone’s advice/\npermission."}, {"username": "Tania Duval", "comment_text": "Not silly at all. Some people go for the atmosphere , food, culture,wine and first the lovely people."}, {"username": "Pat Cray", "comment_text": "Florence is so beautiful. You will love it!"}, {"username": "Cheryl Zimmerman", "comment_text": "I did a pasta- making class with Laurence. It was fabulous! I'm still making pasta! I'm happy to share the link. It was very reasonable."}, {"username": "Diana Granado", "comment_text": "I’ve seen a balloon flying over Florence, maybe you can book it and see it from the air"}, {"username": "Jeanne Eliason", "comment_text": "Cimitero delle Porte Sante or Sacred Door Cemetery. The graveyard is filled with beautiful funerary art and boosts breathtaking views of Florence. It is tucked behind the 1000 year old church of San Miniato al Monte. It is a strange thing to suggest a cemetary however I doubt few tourists have seen this. It is a sight to behold. Some of the statues actually took my breath away."}, {"username": "Nola Bostridge", "comment_text": "There is so much more to Florence than just the museums. You will love it. Also easy day trips in and around. Lots of beautiful little places to stroll around. Enjoy 🙂"}, {"username": "Terry Pisano", "comment_text": "Uffizi because I have to see Botticellis Birth of Venus. This post has me so excited for our Florence days now! Wonderful post (except the one rude comment... but isn't there always that one?"}, {"username": "Carolyn Adams Brown", "comment_text": "Florence is a beautiful vibrant city. We loved the museums, but the city is so lovely. We preferred walking rather than taking a cab. We loved Boboli Gardens, the river, tbe bridges, the market, the food, and especially the street musicians."}, {"username": "KB Sweat", "comment_text": "While the Uffizi and Academea tour we did was lovely, I really wish we didn’t do it. I would have much rather walked the streets of Florence with the time we had. Our best times in all the places we visited in Italy were when we had no agenda. You do what you want and have a blast!"}, {"username": "Fizz Hayes", "comment_text": "Florence is amazing to walk around with or without museums."}, {"username": "Julie Dunleavy-Corcoran", "comment_text": "I’m not a big fan of museums, churches etc but I did go look with husband first time I went.. I don’t think it’s a silly question at all"}, {"username": "Christine Philomena", "comment_text": "We went and did not go in one museum in May. We just walked to all the sites and appreciated the architecture! We had an amazing time! Enjoy"}, {"username": "Lee-Anne Coleman", "comment_text": "Not a silly question! 😘 I go to Italy for the wine, limoncello, coffee, cannoli, gnocchi, cobbled lanes, architecture, and to people watch! Enjoy 😉"}, {"username": "Monica Sucato", "comment_text": "You can just walk around...visit churches if you want, otherwise just look around...there aré beautiful buildings, amazing hidden córners everywhere...go\nto Boboli Gardens, Fiesole...just keep your eyes wide open AND you will see beautiful things all around you"}, {"username": "Lynnie Silverman", "comment_text": "I was an art teacher but I really prefer contemporary art(Tate Modern in London) so we will focus on food, landscapes, cooking, biking, meeting people in tiny towns. Italy has something for everyone."}, {"username": "Jenny Lane", "comment_text": "I didn’t visit a single museum in Florence. Perhaps I will in the future, but I just wandered and it was lovely."}, {"username": "Regina Gonzalez", "comment_text": "I love museums, but I love everything else too 😍 The food in Florence is amazing. The blueberry steak at Acqua Al 2 is *chef's kiss*. Do a sunset river cruise. Florence is known for its gold, silver, and leather. I have a purse and ring that I absolutely cherish from my trip to Florence. Do a wine tour; it's beautiful and fun, even if you don't drink."}]}, {"id": "2208204306245314", "text": "Hello\nHas anyone been to the Accademia hotel in Rome?\nHow are the standard rooms? I understand that they are not renovated and the wi-fi doesn't work either?\nHow are the business rooms?\nCan men wear shorts and a T-shirt at the Vatican?\nThank you !", "link": "facebook.com/groups/1373361046396315/permalink/2208204306245314/", "likes": 0, "comments": []}, {"id": "2208117449587333", "text": "Wanting to do the arena floor tour of the Colosseum but can’t figure out which one to purchase!! I’ve looked on their website, but I am only finding 2nd floor and 3rd. HELP!!", "link": "facebook.com/groups/1373361046396315/permalink/2208117449587333/", "likes": 1, "comments": [{"username": "Michelle Bergman Davis", "comment_text": "We booked ours through Get Your Guide. It was amazing!"}, {"username": "Emma Jones", "comment_text": "Me too!! I’m totally confused as to who to book with 😐"}, {"username": "Monique Gonzales", "comment_text": "I booked a first floor tour though Viator. It’s called gladiators gate."}, {"username": "Shen Min Chue", "comment_text": "The 3rd level of the Colosseum have been closed to the public since Covid management times. If your travel date is more than 30 days away, give the official Coopculture site a try-out for tickets which will cannot be cancelled."}, {"username": "Amy French Baillie", "comment_text": "Coopculture is the official site for tickets.."}, {"username": "Katy Kennelly Olds", "comment_text": "I did the behind-the-scen\nes tour, including the floor of the Colosseum and some of the upper levels, through GetYourGuide.￼"}, {"username": "Nicola Campbell - Penrose", "comment_text": "I was so confused, so many different websites, so many different options and different prices. It drove me crazy looking. Someone at work recommended get your guide. I’ve winged what I have booked on there but go on Monday afternoon so hopefully booked a good one ! X"}, {"username": "Gena Kona-Mancini", "comment_text": "You want this one on co-op culture"}, {"username": "Gena Kona-Mancini", "comment_text": "Coopculture.it is the only official site. The others are much more expensive and have the risk of canceling last minute. But Coopculture.it is hard to book. They start selling 30 days in advance exactly at the exact time. I refreshed for 45 mins before getting mine. But zero line to get in, full experience and we were the only 2 on half the guided tour!"}]}, {"id": "2208092469589831", "text": "Our trip is in six weeks and I'm trying not to worry but the trains on the first day are keeping me awake! I have booked other trains for during the trip but the day we arrive at the airport we need to take three well timed trains.\nOur plane is supposed to land at 745am and then we have to get through airport/passport control etc\nFCO-Roma termini (open tickets purchased)\nRoma Termini to napoli centrale (we intend on the Frecciarossa)\nNapoli Garibaldi to pompei (yes we are staying there, not a day trip) and intended on the Campania Express. (but it only leaves at 1126am or 226pm\nWhat are the chances we can get an available business class seat on Frecciarrosa if I purchase that day?\nI know some people say just to get regional train from naples to pompei but with backpacks and luggage im nervous about that particular train and keeping everything safe when its so crowded\n\n\nshould i purchase a freccciarrosa ticket now and wing it from there?\nAny kind advice is most welcome. Im not stubborn about what we do, i just want to get to the hotel (with our carryon, and we are carrying all our things passports etc) in one piece.\nIt seems too difficult to purchase tickets in advance relying on everything to fall into place.", "link": "facebook.com/groups/1373361046396315/permalink/2208092469589831/", "likes": 6, "comments": [{"username": "Lauren-Jade Roberts", "comment_text": "I’m not sure why everyone would asume the regional train would be more pick pocket risk that a tourist train. But also assume tourists are the main target for pick pockets.\n\nWe got both - didn’t see pickpockets on either but the Campania express is more modern and quicker"}, {"username": "Brian McGraw", "comment_text": "I’d book your train tickets at 2:26.\nTake the Leonardo Express to Roma Termini.\n\nStore your bag at Stow Your Bags for a few hours.\n\nhttps://\nwww.stowyourbags\n.com/en/shop/\nrome/\nluggage-storage-\ntermini-train-s\ntation-via-mars\nala/\nHOW TO ARRIVE:\nAt Termini train station take the exit on the right toward Via Marsala. Go right for a few steps, than turn left onto Via Milazzo. You will find us at number 20A on the left side.\nKEY INFO: FROM 1,99€ PER LOCKER | 100% SAFE AND INSURED | 1 MINUTE FROM TERMINI STATION\n\nGo get some lunch and a gelato and walk around rome for a couple hours.\nThen go back to the train station, get your bags, and catch your train to Naples."}, {"username": "Kadie Mcgugan", "comment_text": "I’ve been here for 3/5 days have just kept a hold of my bag and been fine !"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "Why would you go for a business class on frecciarossa?"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "I would say yes because around 15th of September tourist season is ending. But time seem a bit stretched to me. Roma Napoli is around 2 hours if I remember correctly"}, {"username": "Shelley Frise", "comment_text": "I would hirer a driver from Naples to Pompei. We only paid 100 euros from sorrento to Naples and it was well worth it. Depending on the amount of luggage you have the regional or local trains do t have a lot of room."}, {"username": "Kyna Martin Autrey", "comment_text": "We did good seats on the fast train from Rome to Naples because there was a family pack that was cheap. I booked that in advance. I wish we could have done that everywhere !!!\nI didn’t see a nice fast train to Pompeii from Naples so went downstairs to the train that runs from Naples to Sorrento and it ran pretty frequently. Just bought the tickets at the station for this one. It’s definitely more crowded and difficult to find seats together and deal with luggage but it was doable. We DID see a guy pickpocketed on this train on the way back another day - it’s so crowded you just have to protect your things really well."}, {"username": "Anna O'Connor", "comment_text": "We got the local train Naples to Pompeii with luggage and had no problems."}, {"username": "Vanessa Durkin", "comment_text": "Think the 'hysteria' about pickpockets is blown out of all proportion I have travelled on trains alone in my 70s and i havent had any incidents just make sure you are aware at all times im loving it! so easy to book trains here and train from pisa to florence had ample room for everyones bags really geared to tourists easy to buy tickets too at station"}, {"username": "Pirkko Storer", "comment_text": "There is a new train connection from FCO to Napoli!!!!!"}, {"username": "Yvette Pavone", "comment_text": "Look at rome2rio.com, there are tons of options. There are also tons of trains. If it were me, and I was that concerned, I would hire a driver from Staples to Palmbay. You can use sun transfers.com."}, {"username": "Yvette Pavone", "comment_text": "You’re also making yourself crazy over some thing you have no control over. The time it takes to get through customs could be 40 minutes or three hours depending on how many planes came in and how efficient the transportation people are at that time. The train ride from Rome to Naples is under two hours, so just get the first available train and be done with it."}, {"username": "Rebecca Yeoh", "comment_text": "Would you consider a private driver taking you from Napoli Centrale to your hotel in Pompeii? You can get the Leonardo Express from airport to Roma Centrale. I pre-booked mine with a time but the time doesn’t print on the ticket, you just jump on the next available train. I would pre book the Frecciarossa via Trenitalia before you go. Just give yourself plenty of time, even if you need to wait a bit at Roma Centrale. They have an upper level with cafes and restaurants where you can wait. Re: business…do it!! I upgraded a few train trips to Business and I thought it was great, and obviously better. You get snacks and drinks too. There was much more room for luggage making it easier to keep it near you even if you had big bags. If you want to get a driver from Naples, I recommend Rainbow Limos. I found them online via many good reviews, and they lived up to them. Exceptional service and communicators. They will meet you on the platform with your name on a sign. I know a car service will obvs be more expensive than a driver but you will be thanking yourself after a flight + trains!! https://\nwww.rainbowlimos\n.com/"}, {"username": "Sarah Nichols Hogue", "comment_text": "We did this - except went all the way to Sorrento. FCO at that time (7:30 am) on our arrival day was very empty, and we walked right through passport control. Termini was no problem either. Napoli Centrale to Campagna Express - we had to run! I knew it was downstairs and just kept following signs for Circumvesuvania\n. I did not find it well marked for Campagna Express. We finally asked someone who worked there, and they were helpful. The good thing is on Campagna Express they check your tickets before you get on, so as long as you are in that line it won’t leave without you."}, {"username": "Michelle Smith", "comment_text": "First class was really was comfortable\nBooked in advance"}, {"username": "Renee Rundle Stoneham", "comment_text": "If you miss the 2nd Campania Express.\nThen just take the Circumvesuviana\n. It’s fine, we did it with carryons and backpacks to Sorrento. Yes, it was crowded, we chose to stand at the back of the car we were out of the way etc and no one moving behind us.\n\nWe were going to take the Campania Express but it would have been a 2 hour wait, so just took the Circumvesuviana\n."}, {"username": "Graham Sherlock", "comment_text": "Worry less, just enjoy, whatever train you get will be fine."}, {"username": "Janine Emma Lucas", "comment_text": "I’d take a cab, honestly after an overnight trip, three more transfers will be exhausting"}, {"username": "Cheryl Zimmerman", "comment_text": "The trains aren't your problem... they run on time. It's making your connecting flight, delays, flight cancelations, etc."}, {"username": "Ivette Lugo", "comment_text": "Wait. I’m going in 6 weeks too but to Napoli to Sorrento, do we have to buy train tickets in advance?\nSame question regarding taking the Ferry from Napoli to Sorrento?"}, {"username": "Isabelle Scicluna", "comment_text": "If you havent booked them yet, the other high speee train company offers a full service. Italotreno. They do Rome termin- Napoli Afragola by train then they have a bus service directly to pompei..."}, {"username": "Janine Benedict", "comment_text": "I just did this from Rome to Sorrento. I didn’t pre book anything because I didn’t know how long it would take to get through customs (which took 5 minutes!). Just went to the train station and bought a ticket to the fast train and I was able to get business class. Then when I got to Naples I bought a ticket to Sorrento on circumvesuviana\n. It was relatively easier than people made it sound. I was traveling with my 17 year old son. In the end I was glad I saved $140 euros from having to hire a private driver to go from Naples to Sorrento. On the way back, I did something completely different because I was traveling back on a Sunday and the earliest train out of Sorrento to Naples was 10:20. I got this advice from two Australian women that were seasoned travelers that I met while I was in Sorrento. I took a “shuttle bus” from Sorrento (picks you up a train station) and drops you off at Naples airport. Then I took a shared taxi (5 euro/piece) from airport to Naples train station. Easy and cheap. Shuttle is $10 euro/\npp and it’s a nice,comfortable air conditioned bus. ☺️"}, {"username": "Bill Gillespie", "comment_text": "Rent a car from airport, drive to Naples AP drop it off, take taxi to Pompeii, my friend Salvatore Fossa will be glad to pick you up from the car rental lot in Naples, 1 block from the AP."}, {"username": "Annette Bertram", "comment_text": "In the FCO airport… where is the train station? After we go through customs, where do we go next?? We will be taking a train to Naples.\n\nAlso, since I don’t know if the flight will be on time, can I reserve a train ticket for any time, or does it have to be at a specific time?? ￼"}, {"username": "Flavia Di Bello", "comment_text": "The pickpockets concerns make me equally chuckle and sigh of despair 😩 but trains in Italy can be notoriously a pain so ,if you are carrying a lot of luggage and have a hard stop with the last train not running past a certain time, I would definitely want to avoid the risk of being stuck without plan B. I don’t have details of a private driver, but since the tariffs of taxis in Napoli are fixed for certain routes including Pompeii, you can always jump on a cab if you arrive at the station after the last regional train has left (it’s not cheap though, something like €100).\nHaving said this, you have plenty of time for all connections and Frecciarossa trains tend to run on time and are fast, so you should be ok. The regional train is less reliable…"}]}, {"id": "2208103216255423", "text": "(From US) Do you Need to have an international drivers license to drive a Vespa? We booked a Vespa tour in Rome, and the paperwork online only says must have a drivers license.\n\n* through a guided tour booked with the company “get your guide”", "link": "facebook.com/groups/1373361046396315/permalink/2208103216255423/", "likes": 2, "comments": [{"username": "Robin Burkholz Shaham", "comment_text": "I believe you need an international driver’s license."}, {"username": "Vivien Paulik", "comment_text": "Yep"}, {"username": "Angie Martin", "comment_text": "Do you need a motorcycle endorsement?"}, {"username": "Melanie Matthews Stuprich", "comment_text": "We didn’t need one for a 4wheeler tour on etna but we weren’t really riding in streets except for a short distance. I would assume for Vespa tour it would be in your best interest to have one just in case!"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "Yes."}, {"username": "Cee Esperance", "comment_text": "Yes, it couldn't hurt to have an international driver's license anyway. The cost to get one is minimal."}, {"username": "Tad Hashimoto", "comment_text": "Yes, you need an IDP to ride a Vespa (as the driver). Above 150cc (iirc), you also need a motorcycle endorsement on the IDP.\n\nMost rental sites don't require you to have the IDP for the rental, but the law requires you to have one on you while riding."}, {"username": "Shannon Merkel", "comment_text": "I believe you do. My husband went to AAA and he said it took maybe 10 minutes. Super easy"}, {"username": "Jenny Payne", "comment_text": "Make sure your insurance covers you for this ride🌻"}, {"username": "Michele Liggett", "comment_text": "We're renting a vespa in Lake Como and got the international driving permit from AAA for $20."}]}, {"id": "2208121519586926", "text": "Looking to do a day trip from naples to pompeii and Sorrento Has anyone done this and can you recommend a tour company or a private driver? I know this may be a very long day but we're happy with that.", "link": "facebook.com/groups/1373361046396315/permalink/2208121519586926/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nAmalfi-coast-Sor\nrento-and-Pompe\nii-in-one-day-F\nrom-Naples/\nd508-386337P4?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Rachael Richardson", "comment_text": "Train is easier! But I’m not sure how much of sorrento you’ll see in an afternoon"}, {"username": "Genevieve Bastien", "comment_text": "We took the train\nWhile it was crowded\nIt was really convenient and frequent departures"}, {"username": "Bev Madill", "comment_text": "Transferelax are great."}, {"username": "BatEl Kogman", "comment_text": "Dragonfly tours Italy\nAsk for Francesca Romana Rinaldi you won’t be disappointed!!!\n!"}, {"username": "Marcia Slivka", "comment_text": "Amalfidrive4you"}, {"username": "Amy French Baillie", "comment_text": "Campagna express train super easy"}, {"username": "John Bruckman", "comment_text": "Not sure you can do both in a day…."}]}, {"id": "2208121732920238", "text": "I’ll be in Italy right before Christmas, does anyone have any suggestions? Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2208121732920238/", "likes": 2, "comments": [{"username": "Stjepan Kujadin", "comment_text": "lol, suggestions for what?"}, {"username": "Alessandro Iannelli", "comment_text": "in many italian cities over the christmas period you can find ice rings for ice skating (they usually have reasonable fees which include the ice skates), if that's something you think you could enjoy."}, {"username": "Dr-Jon Warnecke", "comment_text": "The world's largest Christmas tree is made in lights on the side of the mountain over Gubbio, in Umbria!"}, {"username": "Gianna Onesi", "comment_text": "Depends where? Every city at Christmas in Italy is beautiful..lots\nto do. Do a search tourism"}]}, {"id": "2208123596253385", "text": "Is it possible to do a day trip from Rome to Amalfi or Positano? We’d like to see these places or a place similar without staying the night. Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2208123596253385/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "yes https://\nwww.viator.com/\ntours/Rome/\nPompeii-Amalfi-C\noast-and-Posita\nno-Guided-Small\n-Group-Day-Trip\n-from-Rome/\nd511-3731P159?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Gena Diaco Penland", "comment_text": "We did one through Viator."}, {"username": "Marty Harte", "comment_text": "We did it last week booked through Viator. 7am bus pick up to Salerno then ferry to Positano few hours then ferry to Amalfi for few. Then ferry back to Salerno/bus. About a 14+ hour day. Long day but if you just want a taste of the coast I would recommend. Patricia and Chiara our guides through City Wonders were great."}, {"username": "Nicola Campbell - Penrose", "comment_text": "Scott Campbell xx"}, {"username": "Rose Borg", "comment_text": "There is another provider Get Your Guide- does Amalfi and Positano - doesn’t do Pompeii\nVery long day but worth doing if you are short on time"}]}, {"id": "2208113479587730", "text": "Is it ever possible to find tickets to inside the Colosseum on the same day? Like if a big tour cancels some tickets at the last minute? We’d like to go on Tuesday, afternoon or evening.", "link": "facebook.com/groups/1373361046396315/permalink/2208113479587730/", "likes": 2, "comments": [{"username": "Kadie Mcgugan", "comment_text": "Following !!"}]}, {"id": "2208101329588945", "text": "Attending a wedding at Lake Garda. If I fly into MXP how easy is it to take the train there. We are novice international travelers. Any advice is welcome!TYIA", "link": "facebook.com/groups/1373361046396315/permalink/2208101329588945/", "likes": 4, "comments": [{"username": "Nicola Bradley", "comment_text": "Where in Lake Garda are you heading for? I use google maps so put in MXP and then your destination, date and time you plan to travel and it will give you trains etc"}, {"username": "Andrea Bainbridge", "comment_text": "Spent a month in May traveling Italy by train. Very easy and excellent. Download Trenitalia App."}, {"username": "Claudia Marcon", "comment_text": "Hi there, from MXP take the Malpensa Express down to Milan Centrale train station . From there take the train Milan/Venice and get off in Desenzano. and then it depends on which part of the lake you are headed to but there are several bus connection on both sides of the lake. Enjoy!"}, {"username": "Peggy Lark Berger", "comment_text": "Also depending on where you are going on the Lake, you can take a ferry from Desenzano to many of the towns. Enjoy Italy … we spent a week on Lake Garda during my first trip to Italy and I loved every minute of it."}, {"username": "Fred Doar", "comment_text": "Or you could rent a Maserati and let Mark drive. 🥺😜"}]}, {"id": "2208093806256364", "text": "We'll be visiting Italy for about 9 days and then up to Germany for 20 days. Our schedule is flexible. My current plan is to fly into Rome April 25, and then leave Venice to head to Munich around May 4. I would have preferred to visit Germany first and end in Italy, but my thoughts are that the weather will be better in Germany if we wait a littleआणखी longer, and that the crowds in Italy may be a little less if we go a little earlier. Is this correct, or is there even much difference in crowds at end of April/first week of May?\nIt's been 20 years since I was there and my family has never been so we'll be visiting the usual places this trip. Rome, Cinque Terre, Florence, Venice, and Tuscany. I wish I could do an off the beaten path itinerary to avoid crowds but that's not in the cards this time. Anyone that has visited these areas at this time, is this a good time to go or should I adjust our dates/plan? I definitely do NOT want to go in summer.", "link": "facebook.com/groups/1373361046396315/permalink/2208093806256364/", "likes": 1, "comments": [{"username": "Sonita Sandhu", "comment_text": "You definitely are going during low season. It will be a bit chilly then. Sounds like a wonderful family trip!"}, {"username": "Brenno Bianchi", "comment_text": "The 25th of April is national holiday as well as the first of May, in between there is a weekend. Likely a lot of people will be moving around."}, {"username": "Karen Schmidt", "comment_text": "I’m almost doing the same, Italy first and Germany second but a couple of weeks later. I like to do Germany second so I can fill my suitcase full of treats to take home!! I might have a black Licorice addiction 😉."}, {"username": "Greg Saba", "comment_text": "This spring in Italy, it was cool and rainy right into June. A different story in 2022. We were in Rome May 19 for a tennis tournament, and we couldn't believe how crowded the usual spots were. Fortunately, we have been to them all, so we found a few new distractions. Probably safer to go a little earlier and take your chances on the weather."}, {"username": "Giovanni Pianigiani", "comment_text": "As someone already reported, Italy will be experiencing an overall vacation week between April 25 and May 1st. Don't expect to find shops/museums closed, just hige crowds everywhere.\nOn the contrary, Germany has Whitsun later in May (which is not observed in Italy)"}]}, {"id": "2208093876256357", "text": "Best Matera hotel in 150 to 250 euro range? Best location to stay in Matera?", "link": "facebook.com/groups/1373361046396315/permalink/2208093876256357/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187772-d3780\n993-Reviews-Tor\nretta_ai_Sassi-\nMatera_Province\n_of_Matera_Basi\nlicata.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187772-d8702\n849-Reviews-Le_\nDimore_dell_Idr\nis-Matera_Provi\nnce_of_Matera_B\nasilicata.html"}, {"username": "Antonio Aloè", "comment_text": "Expedia..."}, {"username": "Marisa Brombal D'Emilio", "comment_text": "We were just there and stayed at Il Dimore di Idris! It was beautiful"}, {"username": "Miyuki Kanno Paul", "comment_text": "Sasso Barisano is better than Sasso Caveoso."}, {"username": "Maria Grazia Rizza Costanzo", "comment_text": "Not accommodation but we ate extremely well at Il Casino del Diavolo. Don’t go before 8. Its closed till then. We left it up to the waiter and honestly we were rolling out of there. The food kept coming and we had to say please stop. No more. To which they replied but what about the fruit and desert. It was amazing. Family style restaurant"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208099456255799", "text": "Considering staying in Naples for a few days in September, first choice was Sorrento/amalfi but finding accommodation there is like gold dust or very expensive.\nCan anyone recommend somewhere to stay in Naples , want to be central but also close to the beach/sea.\nAlso is it possible to take day trips to Sorrento/Amalfi coast from Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2208099456255799/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187785-d2046\n21-Reviews-B_B_\nHotel_Napoli-Na\nples_Province_o\nf_Naples_Campan\nia.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nPositano-on-the-\nAmalfi-Coast-So\nrrento-and-Pomp\neii-Shared-Tour\n/\nd508-7746P37?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Fran Philip", "comment_text": "Maiori is fantastic"}, {"username": "Tam Wong", "comment_text": "Salerno"}, {"username": "Donna Austin Jones", "comment_text": "Check out staying in Minori or Maiori. They are beautiful little seaside villages just past Amalfi town. They both have ferries that run between all the coastal villages. I loved staying in Minori!"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Lee Greaves", "comment_text": "We're just back. Ditched naples altogether and stayed in Sorrento. Small hotel called Hotel Eden. Pretty basic but just been recently refurbished, but it's about 2 mins walk from the centre of town, 5 mins to the train station and has parking and a pool too."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Did you try hotel La Badia im Sorrento. I was there in June and it was reasonable"}, {"username": "Laura Jane Morton", "comment_text": "Hotel Michaelangelo in Sorrento i am there now"}, {"username": "Valerie Collanton", "comment_text": "I stayed here in Naples last October. Great location. Very nice rooms.\n\nhttps://\nwww.matildehotel\n.com/"}, {"username": "Carol Malthouse", "comment_text": "Try looking at Saleron, fab ferry rides close by and train station"}, {"username": "Robert Kosta Sr.", "comment_text": "In napoli stay at the rex lifestyle awesome clean n cool"}, {"username": "Scott Loprete", "comment_text": "Any comments about\nMERCURE ROMA CORSO TRIESTE in Via Gradisca 31\n00198 ROMA - ITALY?"}, {"username": "Raf Gervasio", "comment_text": "We stay in apartments in the city centre close to the train station and port giving easy access to Sorrento Capri Ischia Positano etc"}, {"username": "Jaime Wilson", "comment_text": "We are currently staying at Al Centro suites in Sorrento, checking out tomorrow. It has been great very good location and good price 👍🏼"}, {"username": "Carine Boon", "comment_text": "In Naples, Mercure Napoli Centro Angioino, near the metro Municipio. There are not so many beaches in Naples."}, {"username": "Scott Perry", "comment_text": "I stayed in the Chiaia neighborhood next to the Piazza Amedeo station a few weeks ago. Loved it!"}, {"username": "Samina Jassani", "comment_text": "Don’t know what’s your budget. I also had the same issue. Didn’t wanted to pay too much. Everything was super expensive. Found this. We will be staying there in end of September. So far communication via email is Greer. They have arranged pick up also for us from train station.\nOther option to look for Airbnb."}, {"username": "Pam Kimak", "comment_text": "We stayed in Maiori last month and loved it..nice hotel with rooftop breakfast. Across from ocean and cobblestone boardwalk, one half block from main street with wonderful restaurants and shops."}, {"username": "Venessa Menzagopian", "comment_text": "Sorrento is so beautiful I would definitely stay there, we didn't stay in the heart of the city but the hotel we stayed at was 10mins out and they offered shuttle buses, check out Hotel La Vue d'or"}, {"username": "Sam Burt", "comment_text": "We spent 3 nights here before moving to Sant’Agnelo (next to Sorrento) on quite a strict budget - location was perfect and comfortable for a couple https://\nwww.cloisterinn.\nit/en-GB/\nNever felt unsafe in Naples, really enjoyed it."}]}, {"id": "2208100072922404", "text": "Probably been answered but here we go.... looking for a private tour of the Vatican and Colosseum where we can actually go inside. Not just a drive by. Looking for recommendations for two gals. Coming in May.", "link": "facebook.com/groups/1373361046396315/permalink/2208100072922404/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nVIP-Tour-of-Rome\n-Colosseum-and-\nVatican-Museums\n-Driver-and-Pri\nvate-Tour-Guide\n-with-Skip-the-\nLIne-Tickets/\nd511-26786P6?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Barbara Zanetto", "comment_text": "You can book early morning tours with breakfast through the Vatican direct. I believe you meet around 7:30/8 before the museums are open to the public."}, {"username": "Karrie LeBlanc", "comment_text": "My husband and daughter just did the early morning small group tour that included breakfast. They loved it. Booked direct in Vatican site. With this tour one of the benefits is that going into Sistine chapel before 9am allows the tour guide to talk and explain. After 9am no talking in chapel is allowed by guides. It was not busy and they loved how much they could see without the crowds. Group was about 25 people."}]}, {"id": "2208101162922295", "text": "Need your expertise and assistance. We are 5 ladies traveling together. Arriving in Rome on September 5th. We would like to rent a villa in the Puglia region for one week. Any recommendations for a villa close to the sea and town? We will have a car. Thank you..", "link": "facebook.com/groups/1373361046396315/permalink/2208101162922295/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "have a look here https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FVacationRen\ntalReview-g6520\n03-d25898898-Ho\nliday_home_Casa\n_Kennedy_near_t\nhe_beach_with_b\nalcony_WiFi-Mon\nopoli_Province_\nof_Bari_.html"}, {"username": "Miyuki Kanno Paul", "comment_text": "Consider staying at a Masseria"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Check on vrbo and airbnb, there are many!"}]}, {"id": "2208106402921771", "text": "Located on a plateau overlooking the gorges of river Nera, Narni is one of the most beautiful villages in central Italy and it is highly worth visiting for its historic medieval towns and fortresses, itsआणखी surprising underground and deliciuos food.\nJoin our NEW virtual experience: https://nextstop-italy.com/virtual-tours/narni/\n\n#virtualworld #artlovers #art #vacationmood #history #italyiloveyou #italygram #italytravel #italytrip #medieval #medievalhistory #medievalart #medievalcastle #medievaltimes #medievalarchitecture #narni #narnia #chroniclesofnarnia #chroniclesofnarnia #hiddengems #hiddenplaces #magicalplaces #MagicalAtmosphere #umbria #umbriagram #umbrialovers #umbriatourism", "link": "facebook.com/groups/1373361046396315/permalink/2208106402921771/", "likes": 24, "comments": [{"username": "Alyssa Ann", "comment_text": "Cathy Hasslinger Marilee Susan"}]}, {"id": "2208081836257561", "text": "Beaches in Sicily??? Cost??", "link": "facebook.com/groups/1373361046396315/permalink/2208081836257561/", "likes": 0, "comments": [{"username": "Don Bentivoglio", "comment_text": "Yes. There are beaches in Sicily. Prices vary."}]}, {"id": "2208091322923279", "text": "Travelling to Venice from Ravenna post-cruise.\n\n1. Would you recommend the Frecciarossa train over the second option?\n\n2. We are planning to get a hotel near the airport as we fly out early the next day. Wouldआणखी we be better off taking the train into Mestre and getting then getting to our hotel from there, or taking the train into the Santa Lucia station and backtracking to the airport? Can we take a train from there to the airport?\n\n3. I noticed on the Trainline app I can book business class but I couldn’t on the Omio app, it only showed 2nd class for the same trip. I couldn’t get the Trenitalia website to work at all. Any idea why this would be? Leaning towards using Trainline to book business class.\n\nThanks! ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2208091322923279/", "likes": 0, "comments": [{"username": "Leslie Quasius", "comment_text": "We used Trainline quite a bit and it was great!"}, {"username": "Katie Hooker Thomas", "comment_text": "I would go to Mestre and drop your luggage off at your hotel. Venice is not somewhere you want to try and lug around any luggage. Then go back to mestre and take the train to Santa Lucia.\n\nFor the day of your flight you can take the public bus. There may be one close to your hotel but one runs to and from mestre multiple times a day. Your hotel should be able to help you figure out which bus to take."}, {"username": "Ibbu Mohd", "comment_text": "Book italo trains, privately owned and better."}, {"username": "Manuela Bassetti", "comment_text": "Both options are not the best, seeing the time it’s probably the option Ravenna-Bologna\n-Venezia, it’s faster and cheaper do Ravenna-Ferrara\n-Bologna. The train from Ravenna to Bologna and from Ravenna to Ferrara are regional, and there is only second class, that may be the reason why you can’t book business class for the entire trip. Also, Italo has no trains going through the station in Ravenna, your only option from there is Trenitalia"}, {"username": "Miyuki Kanno Paul", "comment_text": "Use Trenitalia’s official app or website.\nFrecciarossa is the fastest high speed train available. It will save you precious time"}, {"username": "Jasmyn N. Callies", "comment_text": "Following because I’m struggling with the Trenitalia app/website"}, {"username": "Fabio Clemente", "comment_text": "Get the cheaper one"}, {"username": "Pao Magnoler", "comment_text": "Frecciarossa is a fast train, they make stops in the main train stations, for example Santa Maria Novella in Florence and Regionale and interegionale thet stop in each main little town, and sometimes they don't get to the main stations, that would make their last stop in the second main station, and then you would have to take another train. That's how they work."}, {"username": "Rhona OConnor", "comment_text": "They both take the same length of time.... So why would you get the more expensive one? 🤔. There is very little difference between Class 1 and Class 2 in the trains - Its not like a flight. You get a little more room, little more luggage space, less tourists."}]}, {"id": "2207545022977909", "text": "Hello\nWe are planning to go next year for 12 days and visit these cities, where should we stay? Or is it better to stay at each city we go to?\nThank you so much, i appreciate any tip.", "link": "facebook.com/groups/1373361046396315/permalink/2207545022977909/", "likes": 111, "comments": [{"username": "Casarine Temple", "comment_text": "America Hernandez I think it’s to many places for that amount of time . But that’s just my opinion. We’re going to Italy for 12 days not including travel days to Rome, Florence and Venice. We’re staying in each of those cities . Flying into Rome and out of Venice."}, {"username": "Glenn Todd Webb", "comment_text": "Please don’t visit/\nstay in 8 cities in 12 days. You will spend too much of your trip traveling between cities, checking in and out, packing and waiting on transportation. 3 cities at the most. Rome, Florence, Venice would be nice. Verona and Pisa are just day trips from Venice and Florence."}, {"username": "Charles Broussard", "comment_text": "Depends on you. Think of it as a land cruise. See all the places, and come back and stay at your favorites."}, {"username": "Shaun Fagan", "comment_text": "Deborah Fagan"}, {"username": "Linnea Kay Wammack", "comment_text": "Too much travel for me. I’d stay in 3 cities."}, {"username": "Brad Nelsen", "comment_text": "Trying to see too much IMO. Perhaps drop Naples and Milan."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Way too much for 12 days. You will spend most of your time traveling between cities and checking in and out of hotels."}, {"username": "Emma Olsen", "comment_text": "Verona Saccardi hotel and spa. Absolutely great hotel. Bologna i stayed in Hotel Atlantic. Close to train station, old town and everything you need to see, eat and shop. Charming old small hotel with the best service and ok breakfast to a good prize."}, {"username": "Toula Vasileiou Evageliadou", "comment_text": "We did it this July by our own car from Athens. The same cities except of Milan . It is some Kms out of our way . We did it in 12 days . We stayed 2 nights in every city . It was a bit tiring due to the heat waves but we made it through.\nAlso the fact that we had our own can made us insecure. We were afraid of being stolen or had an unpredictable incident . Everything went fine but next time we may rend a car instead. It’s better ."}, {"username": "Irene Oda", "comment_text": "Are you the type of person who needs to be on the go everyday? If yes, then it's great for you. You won't even need to unpack. You are probably just bringing a carry on an a backpack. If you are not the type of traveler then this is a very tough schedule."}, {"username": "Carmine Napolitano", "comment_text": "eh...skip milan unless you like $150 shirts and getting dirty looks from fashionistas...\nhad a cool china town"}, {"username": "Colleen Earnshaw", "comment_text": "We are in Como now and its beautiful and amazing"}, {"username": "Esther Newcombe Mahon", "comment_text": "It's alot for 12 days. Last year we done 4 stays 9 nights.\nFlorence,la speiza, montorosso, SML and pisa\n\nThis year we are doing naples, cassino, salerno, sorrento 13 nights"}, {"username": "Val Kilgallon", "comment_text": "3 places, 4 max! You want time to look around and enjoy what each city has to offer, not be constantly repacking and running to the train station or getting right on the road!"}, {"username": "Attila Wido", "comment_text": "12 days its a joke :)"}, {"username": "Cory L Anderson", "comment_text": "We went for 12 days and did Rome, Assisi, the Amalfi coast, and flew to Malta. Spent about three days everywhere.\n\nAnd I felt like it was ambitious."}, {"username": "Eliza Hatzivassiliadou", "comment_text": "3 in Rome\n3 in Florence\nDay tour to Pisa from Florence\n1 in Venice\n2 in Naples\n1 Verona\n1 Bologna\n\ni would skip Milan (or even Pisa and add it to Verona or Bologna)"}, {"username": "Katia Taam", "comment_text": "Doesn't matter. You will be so tired you will not even notice. 10 cities in 12 days is not travel its selfies marathon."}, {"username": "Rose Turdo", "comment_text": "Fly into Milan, Fly out of Rome\nAre you driving ?\n1st night Milan\n2nd Night Venice\nDrive through Tuscany to Pisa. Move on to Florence\n3rd & 4th night\n5th night Bolsena Lake\n6th in Naples\nAlmafi .. to Sorrento\n7th 8th\nTake the drive across to Alberobello, it's a must see\n9th .. Back to Rome\n10th 11th\nand\nARRIVADERCI"}, {"username": "Leslie Goodland", "comment_text": "Stay in those cities, use Booking dot com and book ASAP. Plan to spend at least three(four is better) nights in each. Travel to the next city is an entire day. I was in Italy in April/\nbeginning of May."}, {"username": "Michelle Campbell", "comment_text": "Absolutely do not try for 8 cities in only 12 days. The train rides themselves could take hours each day. Hubby and I attempted to do several spots in the french riviera and were absolutely exhausted by the travel part. Rome was my absolutely favorite spot to stay a couple days."}, {"username": "Caitrin Bennett", "comment_text": "I am going in October for 12 days. We are doing just Florence, Venice and Rome with a day trip out of Florence to Sienna/ San G/ vineyard. I am barely finding time to do everything I want just in those cities, so I highly suggest doing less. I chose sienna etc over Pisa based on feedback in this group, but there are plenty of Pisa day trip options if you still prefer that. I have also read that Verona is highly overrated, but can also be just a couple hour train stop on your way to Venice.\nYou need more time in Florence and Rome than in Venice, if those end up as your big 3, which I suggest though biased. Naples and the south could be a whole other trip one day.\nI saw you also asking about Vatican earlier. Too early to grab regular tickets- they’re not sold out. One way to get tickets earlier than others, though, is to book a special tour like breakfast one or bus through gardens. More expensive but available earlier and people seem to love these. We are doing bus.\nHappy to answer more questions!"}, {"username": "Melissa Amico Bagnall", "comment_text": "That's alot for 12 days. We did Naples, Almalfi, Rome and Venice with kids for 10 days and wasn't enough. (Did 3 days also in Paris before that). Few days in each city is just to little time from my experience unless you like the actual traveling place to place and rushing to see main sights just to say you've seen it and get a picture. I always cram vacations and when I do I always wish I had chill time to just roam & explore. Choose main base towns and take day trips is much easier as well as flying in and out of different airports. We flew in Naples and worked our way north by train flew out of Venice to avoid back track."}, {"username": "Atet GC", "comment_text": "10 days? I will do 3 nights Rome, 3 Nights Florence and 3 Nights Venice."}, {"username": "Zita Hampton", "comment_text": "The cities you plan to visit are not so close to each other as you would think from the map.. Choose less cities, see and enjoy more! Otherwise you will spend your time on road and packing.. Have a nice trip!!"}, {"username": "Gina C Barbara", "comment_text": "How much does 12 days in Italy cost? Approximately"}, {"username": "Naina Morar", "comment_text": "We are going next month.starting in Rome x 4nights, taking a train to Naples to Sorrento for 3 nights. We will do day trips from sorrento to Capri and the Amalfi coast .Sorrento to Florence for 3 nights. Will do a day trip to Pisa by train. You can even do Venice from Florence.From Florence to Como for 3 nights. Doing the Bernina express into Switzerland from Como and day trips to Bellagio. Then 2 nights in Milan. This gives you enough time to see everything and have some relaxing time. Good luck🙏😊"}, {"username": "Linda Tibbles", "comment_text": "Limit your stays to 2 or 3 places.definate\nly Florence and Rome, and maybe Verona. From Verona you can do day trips to Milan and Venice, if desired."}, {"username": "Andrea Ferretti- Kearney", "comment_text": "We were there for 3 weeks and it wasn’t nearly enough time. I would do 2 days in Verona and 1 in Naples and skip Milan"}, {"username": "Pamala Capps", "comment_text": "What about sicily and calabria region"}, {"username": "Michaela Hlaváčková", "comment_text": "I think your choice Is very good...each of these city is beautiful, it depends of your preferences...f\nor me Is the most beautiful Florence and Venecia 🙂"}, {"username": "Elena Mattei Ruiz", "comment_text": "Great itinerary! I don’t like to pack and unpack so I would stay in Bologna and Rome as hubs to travel to the other cities. Enjoy! ❤️🇮🇹"}, {"username": "Jukka Huhtala", "comment_text": "Visit Senior Hotel Cattolica Italy. You will like it."}, {"username": "Tina Wheeler Verstrate", "comment_text": "We've stayed all over when visiting Italy, but the one that sticks in my mind is in Bologna because we've stayed there several times. The NH De La Gare was the perfect place for us when we traveled alone and with our teen/adult children. We loved that it was just around the block from the train station, still central to everything, and they had a great breakfast to start the day. Also, you are in the perfect area if you love prosecco! That area makes Pignoletto, which is smaller bubbles and oh SO GOOD! I'm sad that I can't get it here in Florida 😢"}, {"username": "Steven Clarke", "comment_text": "For Milan I would suggest staying in lake como and do a day trip to Milan. Como is much more beautiful and only 1hr by train."}, {"username": "Stacey Cohen Sturner", "comment_text": "8 cities in 10 days is about 5 cities too many or 12+ days too few."}, {"username": "Lucrezia Folger", "comment_text": "Did I read this right? 8 places in 10 days? Arriving and departing are not part of this, I hope. For 10 days, I’d suggest 3 max places."}, {"username": "Joci Gillan", "comment_text": "Stay at each place. The best time of the day is early morning or late at night when all the tourists have gone and the streets are quiet. This is when you feel the soul of the city."}, {"username": "Deborah Schroeder", "comment_text": "Please let us know the number of days you have and if this includes travel days."}, {"username": "Bogdan Monac", "comment_text": "Just go...you will find the best answer yourself:)!"}, {"username": "Shelly Kentner Lehman", "comment_text": "If you can stay in Sorrento I highly recommend it. Loved walking the main area at night so fun and a beautiful place"}, {"username": "Paola Coppi", "comment_text": "You should land in Milan, then stay one night in Milan to visit at least the Duomo Square and Galleria Vittorio Emanuele with Teatro La Scala. If you like art you can choose between Palazzo Reale or Museo del Novecento exhibitions, they are amazing. The other day you can move by train to Verona, which is famous for Arena and for Juliet's house (idealized) (one day trip)- next by train Venezia, at least two days, one to wander around and the other to get into Basilica di San Marco and Palazzo Ducale. Check if you like Murano glass working and Burano village because are spectacular but are off the beaten tracks and you should spend another day there. Then you want to move to Bologna by train, ok. Bologna is a relaxing little city, count a dinner and a lunch in different typical restaurants. Choose on TripAdvisor restaurants with several top reviews by italians (when I travel I prefer the places chosen only by the natives). After lunch leave for Florence and dedicate to this city at least two days: Duomo square, Palazzo Vecchio out and in, Academia for the David, Palazzo del Bargello and of course a picture of and from Ponte Vecchio!! For Dinner Fiorentina steak with Chianti wine, no vegetarians (sorry). Pisa I would jump it to leave a bit of time to see Rome: at least the center with the most important attractions and the Roman Ruins, count again a lunch and dinner at a local trattoria. There is a famous one that I'd like to visit myself, known as the Sora Lella's after a famous Italian comic actress that owned it herself. Now it should be her nephew's. In Naples remember to eat Pizza Margherita or Marinara everywhere (it is amazing in every single pizzeria) and don't wait in line for the most famous because it's a pity to lose time in a city where pizza art is everywhere. Naples: I'd visit the Museo of San Gennaro Treasure, the Cristo Vela to, the Theatre and Maschio Angioino wandering here and there in the meantime. remember Babbá al Rum and Sfogliatella."}, {"username": "Bill Elias", "comment_text": "Too many cities for such a short stay. Pick two bases. Do day trips.\n\nVenice, Florence, Rome if you must pick three. Assume you will be back - that’s Rick Steves’ advice."}, {"username": "Daisy Yoo", "comment_text": "I\nAm going for 14 days that I am not even counting the travel days and I only have 3 bases and no Milan and no south , I personally would not do all these in 12 days , u do not really see much or enjoy a lot , Rome is definitely deserve at least 3-4 days , then u can base in Florence and spend 2 days there then u can visit Pisa and even add Lucca as a day trip , then u can base in Bologna and go to Venice and Verona and leave from Bologna or just have 2 base and do Venice Bologna Verona All\nFrom Florence as the base"}, {"username": "Angelita Reyes Lara", "comment_text": "Add all that cities to Google maps and you will see the distance, you going to spent a lot of your time walking to the train station and walking to hotels. Even if you rent a car is going to be a long drive."}, {"username": "Courtney Rey", "comment_text": "We just came back\nI highly recommend hotel indigo Milan in Milan\nBeautiful hotel staff amazing 7 min walk to the duomo and center just close enough away to not be in the middle of the chaos ￼but walkable to everything"}, {"username": "Laura DeCicco", "comment_text": "10 days and 8 cities….. not a great idea. Choose 3 at most and explore those."}, {"username": "Nathalie Bourdy Rinella", "comment_text": "Just came back from Italy and south of France. Speaking from experience, all you need is 1 day in Milan. Venice and Lake Como each need 2 days."}, {"username": "Susan Hulsey Watkins", "comment_text": "Siena can be a home base for Rome, Pisa, and Florence, and is a destination in itself. Don’t forget about Assisi, too!"}]}, {"id": "2208102772922134", "text": "Looking for a jeweler recommendation to buy a diamond band in either lake como, Venice, Florence or Milan.\n\nAlso going to be in Nice France so I’m not sure where’s best to buy.", "link": "facebook.com/groups/1373361046396315/permalink/2208102772922134/", "likes": 0, "comments": []}, {"id": "2207916192940792", "text": "Places to stay in Tuscany", "link": "facebook.com/groups/1373361046396315/permalink/2207916192940792/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g608934-d1015\n571-Reviews-Lup\naia-Torrita_di_\nSiena_Tuscany.h\ntml"}, {"username": "Michael Broadwater", "comment_text": "That's a pretty broad question, Tuscany is a large region with a lot of cities, do you know what places you want to visit specifically? Tuscany includes places like Pisa, Florence, Volterra, San Gimignano, Siena, and more"}, {"username": "Jill Halleman Timmermann", "comment_text": "Castello delle Serre! Wonderful people run it and it’s beautiful!"}, {"username": "Ken Lerch", "comment_text": "Too broad without setting some criteria. Tuscany is too varied."}, {"username": "Jerome Burdi", "comment_text": "Going to Tuscany this September. Specifically, the Chianti region. Been there about 4 years back and had a great time. We stay in Radda, about half way between Siena And Florence. Car rental gets us around the most beautiful countryside you can imagine. Spending our days at many small towns."}, {"username": "Felicia LoCascio Whitney", "comment_text": "IL Borgetto villas and apartments San Gemigango"}, {"username": "Deb Eastwood", "comment_text": "Pienza"}, {"username": "Renae Larcus", "comment_text": "La Lucciolaia Agriturismo - San Gimignano"}, {"username": "Enrico Lecce", "comment_text": "Stay anywhere in Tuscany is beautiful you may want to stay on top of a hill in between villas most precious and charming scenery..."}, {"username": "Mary LoCascio Stoll", "comment_text": "Laconda Dell’Amorosa"}, {"username": "Felicia LoCascio Whitney", "comment_text": "IL Borghetto Villas San Gemignano"}]}, {"id": "2207904979608580", "text": "I want to book a hotel 🏨 in Orvieto, I need it to be in a central location, since I won't have a car.\nIf it has a pool, even better!! Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2207904979608580/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194843-d2380\n86-Reviews-Hote\nl_Villa_Ciconia\n-Orvieto_Provin\nce_of_Terni_Umb\nria.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194843-d5745\n90-Reviews-Alta\nrocca_Wine_Reso\nrt-Orvieto_Prov\nince_of_Terni_U\nmbria.html"}]}, {"id": "2207921932940218", "text": "Air b and b advice? Naples.", "link": "facebook.com/groups/1373361046396315/permalink/2207921932940218/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187785-d1226\n0320-Reviews-To\nledo_Loft-Naple\ns_Province_of_N\naples_Campania.\nhtml"}, {"username": "Navreen Mandair", "comment_text": "I’ve booked Zia Bi bed and breakfast in Naples. Reviews look great"}, {"username": "Jill Wolder", "comment_text": "Stay in the historic city center. Within walking distance of restaurants and popular attractions."}, {"username": "Sanja Opalic", "comment_text": "Hotel is better , my husband booked airnb and as I arrived it was closed. So I was in the party’s all night long cause I couldn’t come in"}, {"username": "Corina Cristea", "comment_text": "Piazza Bovio 22"}, {"username": "Genevieve Bastien", "comment_text": "Not an Airbnb but we like Daily Napoli Lungomare"}, {"username": "Swl Erra", "comment_text": "Swl Erra"}, {"username": "Christine Calleja", "comment_text": "Not air b&b but these two are my faves Bed and Breakfast Piazza Dante Napoli Hotel NapoliMia great location, amazing hosts, clean and beautiful!"}, {"username": "Wesley Reeves", "comment_text": "Don’t bother go somewhere else"}]}, {"id": "2207966969602381", "text": "Our honeymoon trip is coming up fast and I’m getting so overwhelmed!\nPlease share any experiences for the following cities- we are looking forward to all the food and good restaurants, museums, fun activities like cooking classes, wineries, shopping\nOur itinerary:\n4 days Florence\n5 days Chianti\n5 days Praiano\n3 days Rome\nWe will be going in September", "link": "facebook.com/groups/1373361046396315/permalink/2207966969602381/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.viator.com/\ntours/Florence/\nPastamania-Pasta\n-making-class/\nd519-125387P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nHorseback-Riding\n-in-Tuscany/\nd519-70927P4?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Positano/\nDay-Trip-to-Capr\ni/\nd33602-29823P1?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nThe-Colosseum-Un\ndergrounds-Aren\na-Belvedere-Upp\ner-Levels-and-R\noman-Forums-tou\nr/\nd511-55341P7?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Cindi Lachney", "comment_text": "Kelly you and your husband must do aperitivo at Oro Bistrot in Rome. It has an amazing rooftop with wonderful views and the drinks are spectacular . You will need to make a reservation in advance just go to their website"}]}, {"id": "2207961412936270", "text": "Hello, are there any tours from Rome to the Amalfi coast? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2207961412936270/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Rome/\nPompeii-Amalfi-C\noast-and-Posita\nno-Guided-Small\n-Group-Day-Trip\n-from-Rome/\nd511-3731P159?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "BatEl Kogman", "comment_text": "Dragonfly tours Italy 🇮🇹\nRoberto Maria Rinaldi"}, {"username": "John Bruckman", "comment_text": "Definitely Dragonfly Tours Italy… ask for Francesca."}, {"username": "Jay Parekh", "comment_text": "Yes but you’re looking at a 13 hour day trip"}]}, {"id": "2207980139601064", "text": "I am visiting bologna with my teenage son in 4 weeks and wanted to see Lamborghini ans Maserati factories but no tickets available.\nAny tricks/tips fro get those tickets ?", "link": "facebook.com/groups/1373361046396315/permalink/2207980139601064/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Modena/\nLAMBORGHINI-MUSE\nO-AND-FACTORY-T\nOUR/\nd25818-123886P35\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}]}, {"id": "2207998696265875", "text": "I will be in Praiano, Bologna & Florence with day trips planned from each in early September. I’m 67 with back & hip issues. Looking for the best supportive, yet cute shoes. I tried Hoka but they are a little too clunky for my short & a little overweight body. Other suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2207998696265875/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/3YmLTYu"}, {"username": "Melba Lima Gorza", "comment_text": "Adidas has very comfy options"}]}, {"id": "2207997486265996", "text": "Hi there, after some quick help. Where can you get money from ATM without being charged a 13% fee? I am Australian and my card has no international transaction fees (ING), but every atm I have been to in Rome has a huge fee and a poor conversation rate. Any help in advance would be great, thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2207997486265996/", "likes": 2, "comments": [{"username": "Tami Sue", "comment_text": "Bank atm."}, {"username": "Li Ane", "comment_text": "Only use the ones at banks wherever in Europe."}, {"username": "Aberdeen Juliet", "comment_text": "I'm with ING as well, make sure you select \"don't accept conversion\" or something along those lines when the conversion is displayed. This means that ING will do the conversion and decide how much money comes out of your account for the selected amount of euro, not the ATM. ING has a very good conversion rate, it part of the reason I'm with them"}, {"username": "Claire Dowson", "comment_text": "Go to a bank atm, there should be no fees"}, {"username": "Marie Nicholson", "comment_text": "Get a Revolut card"}, {"username": "Robin Burkholz Shaham", "comment_text": "Go inside the bank."}, {"username": "Sue Sherwood", "comment_text": "I noticed the conversion option for the 1st time at every atm when i was there in the spring. I don't remember ever seeing it in the past. Regardless, just decline the conversion and let your bank do the math... you will save big $."}, {"username": "Giovanni Pianigiani", "comment_text": "There's an increasing number of ATMs not linked to banks: those are simply \"selling\" you money at their own service fee, without applying the intra-bank conversion fee agreed by your bank with other players of the bank circuit"}, {"username": "Domenica Calvene", "comment_text": "Must be a bank ATM and select \"don't accept conversion\"!!"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Get travellex card no withdrawal fees, not that's any help now. Unfortunately not any way around it, especially Au to Euro conversion it's eye watering."}, {"username": "Rabun Wiley Neves", "comment_text": "Google bancomat near me"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Bancomats charge no fees by law."}]}, {"id": "2208003792932032", "text": "I'm looking for your suggestions!\nMy daughter is leaving at the end of this month to study in Rome for fall semester at American University. I bought her a mother lode junior backpack because of all of the great reviews, however, it is huge on her (she's very petite) I have also read that you want to have a backpack that you can flip around andआणखी wear it in the front if needed on trains or buses, and this particular backpack is too big to do that. With all of this said, I'm looking for your suggestions on the best backpack for my daughter to take and be able to use throughout Europe (front and back and not too big).\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208003792932032/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/3OqEZN3"}, {"username": "Susan McCallister Ignatowski", "comment_text": "My daughter used the osprey 40 liter with the optional second clip on pack. It was the biggest size allowed to still carryon for most international flights. She’s been backpacking across Europe. She’s 5’ 4”. A few small planes required to check due to weight restrictions."}, {"username": "Lavon Brooks", "comment_text": "Fjällräven seems to be a popular backpack with high school and college age there - I’ve seen a lot of them when I’ve been there. I haven’t tried, but I’ve read the guy who started the company did research to make backpacks more comfortable."}, {"username": "Rabun Wiley Neves", "comment_text": "My daughter 5’2” 110lbs took a Patagonia 40L backhole pack with her for the summer. She had packing cubes in there to keep her sane."}, {"username": "Debbie Keller", "comment_text": "Tumi brand"}, {"username": "Lauran Cantwell", "comment_text": "Several factors could determine the answer. Price, size, weight, intended use, etc.\nI'd recommend going to a specialty store and trying a few out for size, fit and versatility. Then once she finds what works for her, either purchase there or browse online for one that fits her size and other requirements.\nHope she e joys her time there. Very lucky girl!!"}, {"username": "Lisa Roth", "comment_text": "Just don’t keep anything valuable in this backpack. Use a crossbody handbag or a belt bag instead for that stuff.\n\nI just spent a month abroad with the non-junior size mother lode and it’s a fantastic bag. Don’t throw the baby out with the bath water when a separate handbag/belt bag is the answer here."}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Tell her to buy one there. It will be better quality, less expensive and on trend."}, {"username": "Bea Kuckens", "comment_text": "Is the backpack all the luggage she is taking?"}, {"username": "Gemma Augustina Luminarias-Leyba", "comment_text": "Am 5 ft tall and I like the Osprey backpack for hiking. You can go to a specialty store as it is good for your daughter to try on different back packs - it’s like wearing shoes, it has to be a good fit as well; especially for back support and good balance. Important to note that she cannot put valuables in her backpack.\n\nTravelling to Europe, we have invested in anti-theft bags for the whole family - backpacks and cross body bags. They are now our go-to bags when travelling.\n\nTravelon and Pacsafe are good brands. They have safety locks, anti-slash, with RFID compartments, etc. I would still recommend she tries them out so that it fits her properly."}, {"username": "Ida Sfo", "comment_text": "If she has a 28\" suitcase for the bulk of her belongs at the dorm, a large college backpack should be fine for 3-4 nights. Plus she can use the backpack for daily college classes. The Mother Load jr seems overkill for long weekend getaways. If she sticks with the ML jr, would she also have a second pack for daily classes...? Many use the ML jr as their sole travel suitcase/\nluggage."}, {"username": "Carla Giordano", "comment_text": "My 5’ daughter got a Baboon to the Moon pack for weekend excursions while in Italy. Not sure if you can wear it frontwards, but it seems like a good size to hold things but also not too large for her petite frame. Definitely too big for a day bag to class though."}, {"username": "Mindy Marshall Lavin", "comment_text": "That post was for Jill Clary Hilder"}, {"username": "Lean Ni Chleirigh", "comment_text": "Can you bring her to a shop? I’m small and it’s good to get a fitting, not just height but shoulders etc.\nI’d also suggest that she bring two bags with her to Rome and use only one for her European travel."}, {"username": "Kimi Speranza", "comment_text": "There is the “junior” version of the motherlode backpack"}]}, {"id": "2208013359597742", "text": "Any recommendations for a Murano glass tour?", "link": "facebook.com/groups/1373361046396315/permalink/2208013359597742/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nMurano-Glass-Fac\ntory-Experience\n-Factory-Tour-a\nnd-Workshop/\nd522-9555P1?pid=\nP00070587&mcid=\n42383&medium=li\nnk&medium_versi\non=selector"}, {"username": "Sandra Rodrigues", "comment_text": "This one is really good. Murano is stunning. https://\nwww.getyourguide\n.com/\nvenice-l35/\nblow-of-glass-t4\n55998/\n?partner_id=RRX2\nS3W&utm_medium=\nonline_publishe\nr"}, {"username": "Carole Tarlap", "comment_text": "Tour? We just walked in looked around then went to the back sat down and watched the men doing the glass blowing. Then shopping in their store..... this is what I bought 14-15\" tall and 14k gold inside 💕💕💕. AND they shipped it for me."}, {"username": "Carol Taylor Tisdale", "comment_text": "We had the loveliest experience here - quite unique! It's called the Glass Cathedral https://\nwww.santachiaram\nurano.com/\ndemonstrations.h\ntml"}, {"username": "Theresa Ferrari", "comment_text": "Myhotel arranged the tour. I bought a beautiful elephant and they shipped it to me. They even made a new one for me as I wanted a color they did not have. It is probably about 20\" tall and I love it after 23 years."}, {"username": "Brian Osman", "comment_text": "I loved the factory tour and was going to buy a chandelier for 1800 euro but I wasn't aloud to take a picture of it, so it's still there"}, {"username": "Jonelle Bindl Gilden", "comment_text": "Air Bnb experiences—Wav\ne Glass Tour"}, {"username": "Sara Butcher", "comment_text": "You don’t need to do a tour. Catch the vaparetto to Murano (buy day pass). The boat will be met by people who will direct you to the glass blowing. Watch the display, check out the shop and you can move on when you want ❤️🇮🇹🇦🇺"}, {"username": "Mary Gregory", "comment_text": "I’d go to Burano instead. Have to have a reservation for Murano glass blowing demonstration"}, {"username": "Sandra Desmond", "comment_text": "They have gorgeous murano glass rings very cheap I bought loads of them different colours"}, {"username": "Christine Tipton", "comment_text": "I heard they have one where you can make your own piece to take home. Unfortunately, I found this out after I came home."}]}, {"id": "2207641259634952", "text": "We'd like the latter part of our trip to be a bit of a slower pace. Here's the first draft of our itinerary: Venice -> Rome -> Florence -> Cinque Terre (with some random day trips thrown in). I initially thought Venice was a get-in-get-out kind of stop so that's why I put it first, but the more I research, read your posts, watch videos, etc. Iआणखी think im going to fall in love with getting lost in that city and maybe I should switch up the order. What are your thoughts?\n\nMaybe instead we could do Rome -> Florence -> Venice -> Cinque Terre?? (Or Cinque Terre -> Venice)\n\nOur trip will probably be 14-16(ish) days.", "link": "facebook.com/groups/1373361046396315/permalink/2207641259634952/", "likes": 1, "comments": [{"username": "Jackie Flores", "comment_text": "We just did Milan, Cinque Terre, Florence, Rome, and ended up in Venice… this worked out great for us"}, {"username": "Karen Schmidt", "comment_text": "The order I did last October was Rome, Cinque Terre, Florence, and Venice. It went very easily with all the trains and none of our travel days were super long (The Rome to Cinque Terre ￼day was a bit longer, but totally manageable and fun. It was also nice to have a break after busy Rome.)"}, {"username": "Miyuki Kanno Paul", "comment_text": "It all depends on which airports you will be using. Fly into Venezia(VCE) and fly out from Roma(FCO) or the opposite way will be the most logistical"}, {"username": "Valerie Nicole", "comment_text": "We just went to Italy at the end of March and did the same itinerary 14 days. We started with Florence for 3 days, Venice for 3, Cinque Terre for 2 and Rome for 5. From Florence we took a day trip to Tuscany. Siena, and San Gimignano. Good luck and have a great time!"}, {"username": "Suzanne Shea-Simpson", "comment_text": "Our Italy trip we flew into Rome 3 nights, Florence 4 nights (stayed extra day so we could do day trip/tour to Cinque Terre) train to Venice for 2 nights before flying home. Fabulous trip."}]}, {"id": "2208016089597469", "text": "Hi! I’m planning to visit Venice in late September this year. What are your suggestions on best places to visit, cool activities to do, and the best places to eat at?\n\nWe are foodies and also enjoy any activities with water, history, art, shopping, etc.😊\n\nAlso we are thinking of visiting the islands outside of Venice. Is it worth it/any sugggestions on the best way to visit them?\n\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2208016089597469/", "likes": 4, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nMurano-Glass-Fac\ntory-Experience\n-Factory-Tour-a\nnd-Workshop/\nd522-9555P1?pid=\nP00070587&mcid=\n42383&medium=li\nnk&medium_versi\non=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nVenice-Street-Fo\nod-Tour-with-Lo\ncal-Guide-with-\nLocal-Food-Mark\net-Visit/\nd522-20455P75?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Rachael Richardson", "comment_text": "Burano/ murano definitely worth a visit"}, {"username": "Michelle Bergman Davis", "comment_text": "I highly recommend doing the after dark tour if the Doges Palace and St Marks, outstanding!\n\nWe also did a free walking tour which was great. And I highly recommend taking a water taxi/bus to Murano and Burano.\n\nRestaurants we loved were Osteria Da Carla, Osteria Enoteca San Marco and Guna."}, {"username": "Irene Oda", "comment_text": "Hotels all booked I take it?"}, {"username": "Eileen Muro", "comment_text": "Visit Verona!!"}, {"username": "Sara Butcher", "comment_text": "Get a day / multiple day pass for the vaparetto and use it to go to Burano and Murano. Great way to move around Venice. I spent a lot of time walking. Caught vaparetto to S.Elena and walked back. Make the effort to be out and about at 6am one day and you will see a very different Venice. Some of my favourite pics were on this morning. Venice with no one around is even more stunning ❤️🇮🇹🇦🇺"}, {"username": "Etschi Bruckner", "comment_text": "if you are familiar with kayaking and want something special www.venicekayak\n.com"}, {"username": "Etschi Bruckner", "comment_text": "the islands are great - apart from Murano, which is only interesting if you fancy being dragged into a glass-blowing place, a popular tourist-trap since I was there as a kid - and it´s got a couple of good authentic restaurants ( www.aquastanca.\nit or \"Lele il Rosso\") . Burano is lovely ( try to get there early!) and easy to reach by vaporetto - best to eat is www.venissa.it on Mazzorbo - connected with Burano by a bridge. Sant´Erasmo is the vegetable garden of Venezia , you can have a look at a wineyard, eat at a streetfood stand with local products ( www.myexperient\nia.it) near the jetty or rent bicycle to explore the island there. If you´ve got time and want to get away from the tourist craze - make a trip to Chioggia - vaporetto to the Lido and the bus. Enroute you can stop for lunch at one of the nice seafood restaurant right on the waterfront on Pellestrina Island . And even in Venezia you´ll find wonderful hidden gems ( but that´s another story!) - go for \"ombre e chicchetti\" ( pic) and have \"select\" in your spritz instead of aperol!"}, {"username": "Rhonda Russell", "comment_text": "Torcello is a lovely place to visit"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Take the vaporettos everywhere. Get a pass for the length of your stay. Stay in a hotel in one of the quieter neighborhoods and go to small restaurants nearby."}, {"username": "Judy Veltri-Viani", "comment_text": "Venice is not known for their food. We were disappointed, but knew that going in. We did a 2-day vaporetto pass which gives you unlimited rides and also includes the islands of Murano and Burano. Did a day trip to Verona as well, which I highly recommend. Enjoy!"}, {"username": "Lauren Neely", "comment_text": "We enjoyed our tour of the Doges palace, the apple streusel at La Lista, the chocolatier near the Marco Polo house, and of course, a gondola ride!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208018059597272", "text": "Please tell me your favorite winery tour from Florence that is a fun day! Why was it fun? Would like to limit the travel distance about 2 hours away from Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2208018059597272/", "likes": 1, "comments": []}, {"id": "2208019032930508", "text": "Hello!! We are headed to Rome and Venice in September (next month) and I am looking for some recommendations for places to stay next to the Termini station. Right now, the front runner is The Building Hotel, but other recommendations would be great! We want to stay near Termini Station because we will be taking the train to Venice for two days and then we are off to a Greek Isles cruise. So any recommendations for hotels in those two cities (that won't break the bank) would be wonderful!!\n\nThank You!", "link": "facebook.com/groups/1373361046396315/permalink/2208019032930508/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d8865\n999-Reviews-NH_\nCollection_Roma\n_Palazzo_Cinque\ncento-Rome_Lazi\no.html"}, {"username": "Sandy Radican Shikaly", "comment_text": "I love Rome.. and staying in the city center near the Spanish Steps, Pantheon and Trevi Fountain is very walkable.. as for the area by Termini.. yes great to catch the train but the area attracts transients and pickpockets.. not my favorite part of Rome"}]}, {"id": "2208016326264112", "text": "Has anyone used a translator app on their cellphones when in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2208016326264112/", "likes": 9, "comments": [{"username": "Annie Gerke", "comment_text": "Google translate is good or an app called “SayHi”"}, {"username": "Jay Parekh", "comment_text": "Google Translate"}, {"username": "Kay Malick", "comment_text": "Google translate works great..or if u want to go into detail,Reverso context is another option"}, {"username": "Judy Thomas", "comment_text": "I used google translate for everything. Signs and conversations."}, {"username": "Kim McCarthy", "comment_text": "I did in Prague it was a lifesaver"}, {"username": "David Baillie", "comment_text": "Google translate"}, {"username": "Dave Mazzei", "comment_text": "Yup google translator"}, {"username": "Jonathan Goetzel", "comment_text": "Download Google translate aheadof time. Lots of Duolingo ahead of time too!"}, {"username": "Eileen Muro", "comment_text": "Google translate worked fine for us"}, {"username": "Dana Green", "comment_text": "Google translate was awesome in Italy !"}, {"username": "Sherri Leis Dillavou", "comment_text": "Yes. Google translate. But truthfully almost everyone spoke english"}, {"username": "Dana Colantuono", "comment_text": "I only used it once when I was trying to buy a sim card from a Chinese store in San Marco in Venice. The lady only spoke Italian. Otherwise most people spoke English."}, {"username": "Gillian O'Callaghan", "comment_text": "Used Google Translate in Venice as I had not practised \"Please can I have some mosquito repellent?\" Worked perfectly (request and product) 👍"}, {"username": "April Calder", "comment_text": "Yes we did in Nice, France. It was great."}, {"username": "Enrico Lecce", "comment_text": "Yes"}, {"username": "Kathy Tobin", "comment_text": "Google translate is fabulous & you can screen shot a menu & it will translate"}, {"username": "Kathryn Pate Kelley", "comment_text": "SayHi is a great app."}, {"username": "Pam Simpson Wilson", "comment_text": "Google translate-camer\na function was great!"}, {"username": "Jan Grube Christiansen", "comment_text": "Say-Hi all the time for the more complicated 😉"}, {"username": "Jane Lilibet", "comment_text": "Google translate"}, {"username": "Shelley Frise", "comment_text": "We used Google translate and it worked great. I wished I had learned Italian before we went. It was my goal but a busy life got in the way."}]}, {"id": "2208041819594896", "text": "Hello, what car rental do you recommend in Bologna? Which insurance of rent car is the best? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208041819594896/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "have a look gere https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Miyuki Kanno Paul", "comment_text": "Where are you planning on picking up/dropping off the car? What type of fleet you are interested in renting? That is a huge factor."}, {"username": "Rita Scotto Epifanio", "comment_text": "Call your credit card company, they might offer insurance for\nRental cars at no extra cost to you."}]}, {"id": "2208015866264158", "text": "I need help. I screwed up. Lol. We arrive Aug 9th and my daughter wanted to do a pasta making class that night. I forgot to book it. I thought I had, but I didn't. Does anyone know of one that starts around 7 or later that has availability for one adult and one child?", "link": "facebook.com/groups/1373361046396315/permalink/2208015866264158/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "where?"}]}, {"id": "2208089302923481", "text": "Has anyone been to Cassino going in September for 2 nights and hoping to visit casalattio has anyone been ,and advice getting to the valley it wil be a Sunday we visit .thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2208089302923481/", "likes": 1, "comments": []}, {"id": "2208091226256622", "text": "Thank you everyone for the great comments and suggestions. I was using Expedia to book hotels in Rome, Venice and Florence. I like the cancellation policy, it’s easy, in Canadian dollars and I’ve had good luck with them. It looks like there can be problems and higher prices? Any recommendations for Air B & B or other ways would be appreciated. I’m in Canada and our dollar is not great. A lot of hotels suggested are up to $1200 Ca a night. Thank you so much 😊", "link": "facebook.com/groups/1373361046396315/permalink/2208091226256622/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1637\n009-Reviews-B_B\n_A_Picture_of_R\nome-Rome_Lazio.\nhtml"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d4976\n13-Reviews-Loca\nnda_ai_Bareteri\n_e_B_B_Allegri-\nVenice_Veneto.h\ntml"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d5300\n00-Reviews-Resi\ndenza_Fiorentin\na-Florence_Tusc\nany.html"}, {"username": "Greg Saba", "comment_text": "We use booking dot com for most lodging. Some hosts here suggest that they will assist in finding, and even paying the difference, in case of host cancellation. Of course, direct booking with hotels usually protects you in the case. And, many apartments, posted on airbnb and vrbo, are on booking, sometimes without the high airbnb fees. Be forewarned that airbnb and vrbo say they are only listing agencies and do virtually nothing for you if you are cancelled by the host, even minutes before your arrival. We had nice apartment, through booking, in May, just outside the Vatican walls, with a view of the top of St. Peters, for about $150(US). Summer probably higher."}, {"username": "Paula Brink", "comment_text": "I just made a lengthy post which is now Pending so I will ask this- what is your nightly budget for hotels? Maybe I can suggest some."}, {"username": "Paula Brink", "comment_text": "http://\nwww.hotelleduefo\nntaneflorence.c\nom/\nI know 2 different couples who stayed here at Hotel Le Due Fontane in Florence recently and liked it. Great location, clean, breakfast included. Not fancy but had what they needed at a decent price.\nHotel David is another one with decent prices but it’s out of the city centre- about a 25 to 30 min walk or there is a bus that stops right outside.\nI stayed there some years ago and it was good."}, {"username": "Teresa Vozza", "comment_text": "We use VRBO or Airbnb to book. You can add your parameters (AC, wifi, laundry, kitchen, price range, etc) and then you can see the places available for your dates. Make sure you read all recent reviews."}, {"username": "Maria Brozou", "comment_text": "try booking . com. Very reliable and easy to navigate with many filters to help find something suitable, in the right location & at desired rates. If you are looking at 5 stars hotels the rate seems normal. There are however many more choices for more affordable hotels in Italy."}, {"username": "Sue Flagel", "comment_text": "Have a wonderful trip!"}]}, {"id": "2208025146263230", "text": "Has anytime taken the bus to see the Tuscan countryside?\nAny cooking class recommendations in Siena?\nTraveling in November with two kids. We want to drive but worried about parking etc.\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208025146263230/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Siena/\nPrivate-cooking-\nclass-at-a-Cesa\nrinas-home-with\n-tasting-in-Sie\nna/\nd944-68460P34?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2208023192930092", "text": "Hi folks looking to go to Milan at Easter looking for a hotel close to the train station. Any suggestions? Also going for 7 nights and would like to visit other places. Any advice will be welcomed. Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2208023192930092/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1213\n0410-Reviews-NY\nX_Hotel_Milan-M\nilan_Lombardy.h\ntml"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lake-Como/\nLake-Como-Day-Tr\nip-from-Milan/\nd26113-2872ZV07?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Elena Innocenti", "comment_text": "NYX Hotel\nStarhotel Anderson - this one is very close to Milano Centrale, in front of taxi parking."}, {"username": "Colleen ClarkBurns", "comment_text": "Thank you for the information"}, {"username": "Anita Clayton", "comment_text": "IQ Milan opposite the station."}, {"username": "Tony Gesmundo", "comment_text": "IBIS Milano Centro only 15 mins walk and good value for money (a bit of Vibe about the place)."}, {"username": "Pop Cha", "comment_text": "Atlantic Hotel Milano\nAcross Milano Central 3mn walk.\nClosed to M train station to Duomo and all others places.\nPublic Parking (You can park only in the Blue Line). Convenient store and restaurants across street.\n\nhttps://\nmaps.app.goo.gl/\npvEcsekpwcJYXDyS\n7"}]}, {"id": "2208030386262706", "text": "Air B and B question?\nAny recommendation in Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2208030386262706/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187785-d1226\n0320-Reviews-To\nledo_Loft-Naple\ns_Province_of_N\naples_Campania.\nhtml"}]}, {"id": "2207640632968348", "text": "We are doing a tour of the best of Italy in early nov. Will long sleeve sweater dresses be warm enough? I will have a coat and boots also. Do you have other suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2207640632968348/", "likes": 0, "comments": [{"username": "Nancy Jones Bruscino", "comment_text": "It will be more than enough."}, {"username": "Sylvie Hogg Murphy", "comment_text": "Yep, should be fine. Early Nov you may even have some warm-ish weather, and it certainly won’t be *COLD* unless you are very far north."}, {"username": "Lindsey Brancher", "comment_text": "Italy can be wet and cold in November. A warm coat or raincoat and cashmere dress should be fine. November is lovely with all the autumn leaves. Enjoy !! 🍁🍂🍃"}, {"username": "Felicia LoCascio Whitney", "comment_text": "It can be very warm in November too. Bring at least on cool outfit."}]}, {"id": "2208041936261551", "text": "I am planning a 10-12 trip the end of November. My husband and I love to hike and will have a car. Can someone tell me if hikes are closed in Cinque Terre area or Almafi Coast? Also, if you have been in November, where would you recommend going?\nThank you so much for ANY advice! It’s our first time and we are VERY excited!!", "link": "facebook.com/groups/1373361046396315/permalink/2208041936261551/", "likes": 1, "comments": [{"username": "Stephen Henn", "comment_text": "Looks like Cinque Terre is open and no charge after Nov 6. We hiked Cinque Terre from Monterosso to Vernazza in early October. Trekking poles were an asset with the many stairs and sometimes rocky trail.\nhttps://\nwww.cinqueterre.\neu.com/en/\ncinque-terre-cur\nrent-situation"}]}, {"id": "2207937996271945", "text": "We will be flying into Naples Sunday morning and staying in Praiano for a week. We are going to Pompeii Thursday and I'm sure we'll venture to amalfi and Positano. We are from America, how hard is it to drive the windy roads? Anyone done it ok? We're in our 30s and drive in Boston and NYC from time to time- I feel like if you can navigate those roads you can do anything but I definitely could be wrong!", "link": "facebook.com/groups/1373361046396315/permalink/2207937996271945/", "likes": 2, "comments": [{"username": "Marissa Wilson", "comment_text": "You won't be driving on the opposite side. 🙂 The windy roads of Amalfi would scare me if a bus was coming the other way but probably doable for a confident driver. There is NO WAY I would ever drive in Naples. It seems like a free for all (but somehow without much road rage). I also drive in Boston, but that's nothing compared to what Naples looked like."}, {"username": "Tiffany Turner", "comment_text": "I feel I'm a really confident driver but would not drive the coast, way too crowded and narrow and you miss many views and being able to look around. It is not driving on opposite side as stated above. We hired a private driver and so glad we did. Also trying to find parking spot is very hard so he was just able to drop us off and come back to pick us up and watch our luggage in meantime. Enjoy, it's so beautiful on coast. Boat ride to Capri was our favorite day out of all our trio to Italy."}, {"username": "Angela Genduso", "comment_text": "Don't compare Manhatten and Boston to the Amalfi Coast. Take the ferry or a private driver from Naples to Sorrento. Then u can take ferries to Capri etc."}, {"username": "Miyuki Kanno Paul", "comment_text": "If you can navigate the Big Sur in CA, you can handle the most of the time. The roads are extremely narrow. Fold the passenger side mirror while navigating the Amalfi Coast"}, {"username": "Andrea Bainbridge", "comment_text": "I drove to Ravello 10 years ago and thought it was fun. Extremely narrow. We hired a driver this trip in May. It was much nicer to just focus on the view.\n\nwww.amalfilimou\nsinecarservice.\ncom"}, {"username": "Paula Brink", "comment_text": "You can find videos of driving the Amalfi on YouTube- watch a couple of those and see what youthink. Nothing like NYC or Boston.\nWe did it in 2012, myhusband is a very calm driver with great spatial judgement and we rented the smallest car possible. Parking is not easy to find and spots are small. I gasped in shock a lot every time we went somewhere.\nAnd as someone else said even if you decide to drive on the Amalfi coast do not drive in Naples- that was next level insanity."}, {"username": "Irene Oda", "comment_text": "Yeah, nope. Think more like Nascar/Formula 1 driving with everyone coming at you from different directions. My husband drives and is very comfortable doing it. But he's been driving these roads for years."}, {"username": "Mack Sperling", "comment_text": "Finding parking will be more difficult than the driving."}, {"username": "D'Anna Hohe", "comment_text": "Not a good idea. Driving in Italy is just different - with different expectations by other drivers, and the Amalfi coast is not the place to practice. Besides, the person driving would not be able to enjoy the view."}, {"username": "Brian Sturkie", "comment_text": "My time driving in Naples was limited to dropping off the car at the train station & it sucked. Sorrento is a different kind of chaos with scooters zipping around. I’ve driven 5 of the 6 countries we’ve visited over the last 8 weeks. I’ll pass in Naples & this area. Maybe rent a scooter if you want freedom to explore outside the city. Just get full coverage. 🤪"}, {"username": "Laurie Frainetti", "comment_text": "I was super scared after all I was reading but my husband insisted he would be fine driving and would rather drive here. We rented a car from Rome then stopped a few days in Latina area and made our way here yesterday. And to be honest; we got here yesterday and it was totally okay. It is a bit crazy but as long as you give way where you need, it wasn’t as awful as I thought it would be. Aside from my daughter throwing up in the car from the windy roads! Our airbnb set up parking for us, so we just drove into positano to a parking area and we won’t see our car for a few days. We don’t plan on driving around here but in and out, totally okay if you’re comfortable and confident. I will add that we tried to stop in Naples for pizza on the way here and we found that much more confusing and crazy…lol we ended up skipping the pizza!"}, {"username": "Mary McClintock", "comment_text": "No comparison. Hire someone else to drive who has experience with the area. Otherwise, you become a hazard to others. Plus, will miss some of the most beautiful, breathtaking views you will ever see (Positano).\nHave a wonderful vacation.\nWe are currently in Monterosso, Cinque Terre, and loving it."}, {"username": "Jennifer Gustafson", "comment_text": "I wouldn’t. Cars actually have to back up for buses around some of the corners. Way easier to take the ferry and get a driver from town to town."}, {"username": "Barbara Tabor", "comment_text": "watch the youtube videos of driving in the Amalfi Coast. Also there may be some restrictions, by even/odd license plates, on when you can drive those roads. Extremely crowded in the summer and/or weekends."}, {"username": "Ian Fawkner", "comment_text": "View from the bus from Amalfi to Salerno….."}, {"username": "April Calder", "comment_text": "Go on YouTube and look for driving the Amalfi coast. We took a bus in Sicily to Castelmola. Omg only room for one vehicle. No way would I want to drive. The busses make the cars back up."}, {"username": "Matthew Livio Conti", "comment_text": "I rent a car every time I've gone since 2001 - and love driving the winding roads. There's a big difference between Italy's roads vs. Boston/NYC - and the winding road also change in elevation, and they're narrower than roads in the US. You need both hands on the wheel at all times, and full attention on driving. A small car with a manual transmission will make it more enjoyable too, IMO. And for comparison: the mountain roads in rural Colombia make the driving/roads in Italy look and feel like an American Interstate highway."}, {"username": "Jenny Payne", "comment_text": "I wouldn’t it is crazy🌻"}, {"username": "Liva Klein", "comment_text": "Driving in Naples is a bit of experience. Almost like you have to close your eyes and hope for the best lol Almafi itself is fine but very narrow. If you're uncomfortable with heights I would suggest to take transfer or ferry. Parking is a big issue as you cannot park in the town unless your hotel has an option for parking"}, {"username": "Bill Gillespie", "comment_text": "I rent a car all the time but lived in Naples for 4 years. Will be there next April, where I'm staying in Ravello there is parking. I would say, for your first time stay in Maiori, from there you can take the ferry to Amalfi, Positano, Capri, Sorrento. If you want go to Ravello drive there early, be there no later than 8, you'll be able to park in the car park, go to Piazza Descivado, have a cappuccino and graffa, then walk the town, see Villa Ruffalo and don't miss Villa Cimbrone!!! Been going to Ravello for 40 years, have friends and great memories."}, {"username": "Janine Emma Lucas", "comment_text": "While we were on the roads in Amalfi vespas we’re passing between our van and the cliff or against the rocks. It was crazy! I’d be too afraid of hitting them or going over the cliff myself. Plus there’s zero parking in the cities your quoted that’s why taxis/\nminibuses/vans drove people off then leave until pick up"}, {"username": "Charleen Siegler Schuss", "comment_text": "Narrow roads, huge buses, daredevil locals, hairpin turns and scooters flying by don't make it a pleasant drive. Make sure you have no deductible, full coverage insurance."}, {"username": "Barbara Bastianini", "comment_text": "We’ve driven the Amalfi several times. It can be a challenge but it can be done. But please don’t make the mistake of thinking the Amalfi Coast is like driving in Boston or New York City. We drive there as well and there’s simply no comparison. The Amalfi is far worse. Congestion beyond your wildest expectations occurs every day.\n\nTo drive it with less stress we like to get up very early, eat breakfast and then be out and actually ON on the coast road before 8am. Since most of the tour buses and most drivers aren’t on the road until about 10am getting this early of a start helps to avoid the worst of the congestion. And since the actual distance between towns on the Amalfi is pretty small you can be in your destination early enough to find parking and explore the town befure the elbow to elbow hordes descend. We stay in that one town, exploring, enjoying a long, leisurely lunch, shopping , taking photos, or relaxing on the beach (whatever we feel like doing) until late afternoon when the tour buses leave. Then we drive to our next destination or back to our base town when the buses and the majority of drivers are gone fur the day. This strategy helps a lot! I’d recommend it. Not only will you have less congestion on the road itself but you will have a more enjoyable time in each town before and after the masses are out in full force.\n\nI believe there are some YouTube videos that show what driving on the Amalfi Coast is like. You might want to watch a few of those to get an idea of what to expect."}, {"username": "Jennifer Wright", "comment_text": "You have no idea. Better to pay drivers and take public transport. Parking is brutal."}, {"username": "Carrie Duffy VanderMolen", "comment_text": "Driving wasn't so bad. Of course my husband (who drove) does not agree and says NEVER AGAIN! Parking was a nightmare! This was in late September. I'm pretty sure you can ferry anywhere from Praiano. And nice choice of towns to stay in! It's beautiful! ENJOY!"}, {"username": "Alicia Cox", "comment_text": "I’ve been to Italy 3 times & driven all over. We stayed outside Amalfi & took the public bus in. I’m adventurous & it was terrifying, but kudos to the bus driver. It was really crowded & hot & we all about barfed bec of the windy roads. I would NEVER drive those roads as you will have to contend with HUGE buses on narrow curvy roads. I would either arrive by boat (but that would be from like Sorrento) or I would hire a driver. It is what I will do if I have the opportunity to go back to Amalfi. And Sorrento is awesome as well & I hear Capri is nice as well. Might be too late, but just my advice based on my experience. Also, BUY THE CAR INSURANCE 😱"}, {"username": "Russ Heinemann", "comment_text": "I have mixed thoughts. I drove from Pienza, through Naples to Praiano in September 2019. I was mainly concerned about parking. The hotel we were at had 5-6 spaces, that in the US would hold 2 maybe 3 cars. We parked for 3 nights. I didn't have a problem, but it is very narrow and you might have to back up for the buses."}]}, {"id": "2207992296266515", "text": "Do we need reservations for milano restaurant?? Which do you offer me?", "link": "facebook.com/groups/1373361046396315/permalink/2207992296266515/", "likes": 1, "comments": [{"username": "Jill Wolder", "comment_text": "4 seasons in Milano. Eat in zelo. Reservation needed."}]}, {"id": "2208013932931018", "text": "Does anyone have any tips for traveling in the Amalfi coast? We plan on staying in Praiano, and trying to figure out the best way to get from Naples to Praiano and then from Praiano to Florence. I have been looking at the bus schedule to get around the coast while we are there and I am confused. Any tips would be greatly appreciated. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208013932931018/", "likes": 0, "comments": [{"username": "Ibbu Mohd", "comment_text": "Use ferry from naples to praiano or all amalfi coast.\nFerryhopper -get this app\nthen back to naples port then train from napoli station to florence"}]}, {"id": "2208021296263615", "text": "Hello everyone, post if allowed. A random question, mostly for the girls. Does anyone have any recommendations for a reasonable price bikini wax in Rome? The ones I’ve seen are around 60 euro so not sure if that is the norm or targeting tourists! Ta!", "link": "facebook.com/groups/1373361046396315/permalink/2208021296263615/", "likes": 0, "comments": [{"username": "Elena Innocenti", "comment_text": "it depends on the brand. you can find them for 20/30 euros (in tezenis, intimissimi, calzedonia…) or more the 300/400 euros if they are particular brands."}]}, {"id": "2208035152928896", "text": "I'm visiting Tuscany the last week of September on a tour and wondering what to pack especially weather wise.But any suggestions will be appreciated. Would End of August still be considered Summer?", "link": "facebook.com/groups/1373361046396315/permalink/2208035152928896/", "likes": 2, "comments": [{"username": "Felicia LoCascio Whitney", "comment_text": "I am packing like it's still summer. Bring a sweater for cooler evenings"}, {"username": "Diane LoPriore Pryor", "comment_text": "All you need is a sweater or shawl at night. Very warm and humid still. Besides your in the best place to shop!"}, {"username": "Renae Larcus", "comment_text": "September weather is still pleasant. One of our fav times to go!"}, {"username": "Irene Oda", "comment_text": "Yes. Very warm still."}, {"username": "Martha Hughes", "comment_text": "Late September is still summer in Tuscany - can be hot."}]}, {"id": "2208035829595495", "text": "If you would recommend someone elder to spend a week in Italy in mid November that has never been to Italy before and probably it would be the first and last chance to see it, where would you recommend her to go? Please note that she loves good nature more than museums.", "link": "facebook.com/groups/1373361046396315/permalink/2208035829595495/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Sicily or Amalfi Coast"}, {"username": "Eleni Koi", "comment_text": "Sicily and more specifically Ortigia in Siracusa"}, {"username": "Corina Cristea", "comment_text": "Lake Como or Garda"}, {"username": "Lydia Springer", "comment_text": "Italian lake region (Iseo, Garda, Maggiore, Como) and Tuscany."}, {"username": "Lucy Wright", "comment_text": "Ortigia scopello segesta cefalu in Sicily"}, {"username": "Greg Saba", "comment_text": "November can be cold, maybe even frigid, in the northern areas. I agree with the recommendations\nof Sicily or the Amalfi coast."}, {"username": "Meredith Holloway Helbon", "comment_text": "The Dolomites might be a great option too. Not sure on how it is that time of year, though."}, {"username": "Gloria Maledi", "comment_text": "if she could go in October it would be better. November is ok too, just colder"}, {"username": "Hu Da", "comment_text": "To an Apennine Mountains cottage."}, {"username": "Jessica Stewart", "comment_text": "I will say my favorite country to spend outdoors was Germany and Switzerland haven’t been to Italy yet but will be there in a month and 17 days but who’s counting. Just my opinion at the moment."}, {"username": "Gina Rovello Keenan", "comment_text": "If it’s the one and only trip to Italy I would suggest Rome or Venice"}, {"username": "Miyuki Kanno Paul", "comment_text": "How fit is she?"}, {"username": "Rebecca Yeoh", "comment_text": "Definitely Florence. Easy to get to and navigate. The scenery is incredible and there are some great day tours in surrounding areas like Tuscany and Cinque Terre. I recommend checking out Walkabout Tours. I did 2 day tours with them and they were some of the highlights of my trip"}]}, {"id": "2208054382926973", "text": "I’m just beginning to research a trip in 2024. If we were there for two weeks, what would be the ideal itinerary and what would be the best time frame? I was thinking September-October?", "link": "facebook.com/groups/1373361046396315/permalink/2208054382926973/", "likes": 4, "comments": [{"username": "Sandra Ferrante-Kohn", "comment_text": "I just answered someone else with a similar question. This is a portion of my comment. I have been to Italy several times and will be returning in September. My personal suggestion is for you to spend 5-7 days in Florence which will allow time to explore beautiful Tuscany and even Cinque Terre. I would then head south to Sorrento for another 5-7 days where you could experience gorgeous Sorrento, the unbelievable Amalfi coast to include Capri, Ishia, Positano and Ravello and finally end up in Rome for 2 days before heading home. You can save a good deal of money with longer term stays at VRBOs and have the advantage of being able to do your laundry and eat simple meals like breakfast at home."}, {"username": "Michael Broadwater", "comment_text": "There is no \"ideal\" itinerary, it depends on the places you want to see. Don't try to squeeze everything in, you can always go back"}, {"username": "Donna Parrish", "comment_text": "Rick Steves’ Italy will provide you all the information you could ever\nneed!"}, {"username": "Gary W Anderson", "comment_text": "Personally if this is your first trip to Italy I’d fly into Venice for 2 days, take a train to Florence for 4 days this would allow a guided tour of Tuscany, take train to Rome for 4 days, train to Sorrento which gives easy access to Amalfi Coast, Pompeii and then fly out of Naples. Travel safe, eat well and enjoy gelato."}, {"username": "Melanie Matthews Stuprich", "comment_text": "It really depends on what you like to see (museums, ruins, beaches, cute small towns) there is no way to have an “ideal” vacation that fits anyone but I would say if it’s your first time hit Florence, Rome, Pompeii (even though I love Naples so much and even lived there 20 years ago I won’t recommend it since so many hate it). But seriously hard to narrow down for two weeks because there are so many amazing places in Italy. (I live in Sicily currently and love it but you need at least two weeks even here!"}, {"username": "Jo-Marie Villett", "comment_text": "So glad you asked this. I’m planning 2025 Sept or October"}]}, {"id": "2208050166260728", "text": "What is a reasonable amount of time for Rome, Florence, Lake District and Milan. Late April/early May 2024. I'm thinking 4 nights Rome, 6 nights Florence, 2 nights Lake District and 2 nights Milan?\n\nLooking at flying in/out of Rome and Milan. Train to all locations with day trips to Cinque Terre and Tuscany. I would love to spend the majority ofआणखी time in Tuscany but feel like our hands are tied wanting to stick with public transportation.\n\nWe did 2 weeks in UK this year and exhausted ourselves walking 25k average steps a day 6 days in London and another 16-25k steps a day 8 days in Scotland. I do NOT want to do that again.", "link": "facebook.com/groups/1373361046396315/permalink/2208050166260728/", "likes": 1, "comments": [{"username": "Andrea Bainbridge", "comment_text": "I love Florence and just was back for the 4th time in May but if you have only 2 weeks, I think 3 nights would be plenty. I’d skip the Lake District this trip. You need 3-4 nights minimum. Siena is wonderful. And close. The hill towns are great.\n\nOrvieto on your way to Florence from Rome is a great town, even if just for a stop for lunch."}, {"username": "Greg Saba", "comment_text": "Of course, we are all different. Some people really love Florence or not so much. Same with Milan. If you like Tuscany, as we do, you will love the lakes region and Cinque Terre, both accessible by rail. Again, we all have our differences, the last time we were in Florence, we were so put off with the crowds (even long \"skip the line\" lines) that we took a train one day to Siena. We have been to all the lakes, but our favorite one was Lake Como (Varenna as our base but Bellagio would have worked). Lake Garda a close second. Our Cinque Terre trip was based in Rapallo, with easy rail access from there to Genoa, Cinque Terre, Portavenere, Lerici, and Tellaro. And you can walk to Santa Margherita and stunning Portofino if you save a few of those steps."}, {"username": "Valerie Collanton", "comment_text": "I think your plan sounds good. I don’t like switching around a lot either. You can take a couple of day trips from Florence to see more of Tuscany."}, {"username": "Jenny Payne", "comment_text": "I can’t get enough of Florence, so much so I go every year and have also lived there , so in my eyes stay as long as you can , go out to the out skirts as it is a wall city 🌻"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "What do you mean with Tuscany? Florence is in Tuscany, you want a day trip in heading west (Pisa, Lucca), slightly south (Siena, San Gimignano, Volterra, Certaldo) or at the bottom south (Montalcino, Pitigliano, Montepulciano, Asciano, Pienza)? Not to mention east like Cortona or Arezzo.\nLake district you mean Lago di Como? Because there are also Garda, Iseo, Maggiore, Orta. If you want to just go to Como (city) and its surroundings two days is enough, but if want to explore the entire lake and all the little towns without rushing two days is not enough. Not to mention if you want to see the “district”, ie other lakes."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208055326260212", "text": "We are coming over Easter weekend and through the next week. Do kids over there have a “spring break” or holiday like we do in the US? Will it be super busy? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2208055326260212/", "likes": 1, "comments": [{"username": "Stephen Henn", "comment_text": "We were there over Easter break in 2022. The cities were more crowded than I thought they’d be at that time of year but still a lot fewer people than during summer."}, {"username": "Manuela Bassetti", "comment_text": "There’s a break of a week around Easter in school and university, so there are generally more people around"}]}, {"id": "2208057036260041", "text": "Is there anywhere in Naples to watch American football? And I don’t mean on a laptop . Sports bar or cafes are what I’m looking for . Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208057036260041/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "American hotels’ bars are your best bet. Possibly at Irish or British pubs"}, {"username": "Frank Dragna", "comment_text": "It’s preseason. Skip it. Ha."}, {"username": "Kally Trahearn", "comment_text": "Not likely to find American football showing on screens in a British pub - if there is even such a thing in Naples. Italians are likely to watch real football (soccer) as that is a big thing everywhere outside of USA."}]}, {"id": "2208058362926575", "text": "Do Catholic Churches in Italy have a Vigil Mass on Saturday evenings?", "link": "facebook.com/groups/1373361046396315/permalink/2208058362926575/", "likes": 0, "comments": [{"username": "Josef Mirna", "comment_text": "What location are you staying in? I’m glad that you are making the effort to go to Holy Mass. I’m willing to help you find a church that fits your schedule."}, {"username": "Maria C Sapien", "comment_text": "Yes"}, {"username": "Josef Mirna", "comment_text": "Great website for everyone traveling. Is MassTimes.org\n\nEvery Catholic church in the world. And Mass times listed.\n\nhttps://\nmasstimes.org/"}, {"username": "Phyllis Flowers", "comment_text": "Most do"}]}, {"id": "2208061319592946", "text": "Is cash still frequently accepted in Rome? In the process of figuring out how many euros to take and was wondering because many places in the UK have become card only since Covid.", "link": "facebook.com/groups/1373361046396315/permalink/2208061319592946/", "likes": 4, "comments": [{"username": "Michelle Prince", "comment_text": "we just used predominantly our revolute card and took 200 euro for tips etc"}, {"username": "James Carr", "comment_text": "Euros are accepted, but our cards were used the bulk of the time. Sometimes Amex, always visa\n\nA couple times I had cabs try to insist on euros, in which I insisted on the card and they put up little argument."}, {"username": "Elena Innocenti", "comment_text": "Everyone accepts cash."}, {"username": "Vivien Paulik", "comment_text": "There are no card only rule. You can use cash"}, {"username": "Melanie Matthews Stuprich", "comment_text": "I wouldn’t take a ton of cash besides tips and maybe some small tourist stalls if you want souvenirs. Most places take card now thankfully! And if a cab tried to argue with you, they are bs-ing. They are required to have working credit card machines!"}, {"username": "Melanie Matthews Stuprich", "comment_text": "But as a side note please don’t use a debit card if you are from US. Even in the US you should never use it for purchases because credit cards have easier ways to cancel charges if it’s stolen and it’s a lot more challenging when it’s your money in the bank that’s taken vs a credit card!!"}, {"username": "Joanne-Peter Hart", "comment_text": "I have used my iPhone nearly everywhere. If they don’t take card I go elsewhere. Far safer. Only have my phone on me (in fact left my wallet at home In Australia). My phone is attached to me with a metal wire tether and a cross body metal chain. Not carrying any bags, only my phone and a water bottle.\nYesterday it was raining at the Trevi Fountain and someone was there selling umbrellas. Someone got out their wallet to buy one, and a guy grabbed it and ran off. The Police were there and gave chase, but he was too quick and got away."}, {"username": "Vanessa Durkin", "comment_text": "Most places prefer visa or mastercard get revolut and pay in euros through the app very easy and safer than cash"}, {"username": "Gillian O'Callaghan", "comment_text": "Only used a few coins in Rome for toilet at train station. Totally up to you how you divide cash and credit card payments."}, {"username": "Daniele Zarka", "comment_text": "Been in Italy a month. I don’t think I spent more than 50€ in cash… all Apple pay for me."}, {"username": "Brian Osman", "comment_text": "I spent 1100 euro in 14 days, I don't like using my card over seas, cash is king everywhere"}, {"username": "Cynthia Marie", "comment_text": "Cash is king"}, {"username": "Grunt E Stin", "comment_text": "They liked cash wherever I went in Rome. Most took cards too."}, {"username": "Dann Hrusch", "comment_text": "Used a card for meals, admission, trains, hotels, etc. Pretty much only used cash for minor purchases."}]}, {"id": "2208061022926309", "text": "We just got to La Spezia from Florence ( pit stop in Pisa ) - kids don’t want to do much more today but we have 1 full day tomorrow before catching the train to Venice.\n\nWe are located 3 min. From La Spezia Centrale train station…ideas for tomorrow? They are also burnt out on Italian food- any Asian recommendations? 😬", "link": "facebook.com/groups/1373361046396315/permalink/2208061022926309/", "likes": 114, "comments": [{"username": "Alaa Zaher", "comment_text": "I love this picture ❤️"}, {"username": "Jay Parekh", "comment_text": "In Venice, there are few Chinese restaurants, saw one Indian, and a Mexican restaurant called Iguana"}, {"username": "Julie Van Berkel", "comment_text": "Boat tour to Cinque Terre"}, {"username": "Ray Haneski", "comment_text": "Take the train to Monterosso, explore there, take the train back and stop at other cinque Terre towns. The ferry is good too but you need to time your stays in each town so you don’t miss it. There are lots of steps/ walking either way. Lots of restaurants in La spezia on via Fiume near piazza st bon"}, {"username": "Iman Nazaran", "comment_text": "Funny pictures"}, {"username": "Marco Scacchi Fratini", "comment_text": "Perhaps you could take the bus that goes to Porto Venere and enjoy a gelato there. Then you could use the boat service that goes to the small Palmaria Island (it takes few minutes from Porto Venere) and could either do the loop hike of the island or stop at Punta Secco for a swim (or keep walking for a wilder but rocky beach)"}, {"username": "Elsa Borrego Contreras", "comment_text": "In Venice there’s an amazing Chinese restaurant, close to Piazza San Marco."}, {"username": "Pop Cha", "comment_text": "We had Asian Food in Venezia Mestre Train station ( Ramen Shop) and one in Milan (Chinese Food) and both of them were not so good but at least we got a taste of its Asian 😂\nTry it and let me know."}, {"username": "Anna Cichorek", "comment_text": "Anna Cichorek"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "In Florence there is an amazing Vietnamese restaurant: Com Saigon"}, {"username": "Meredith Holloway Helbon", "comment_text": "These are great lol."}, {"username": "Ashley Boileau", "comment_text": "How do you like la spezia? We are stopping there for the night on our way to Monte Carlo."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Cinque terre!"}, {"username": "Autumn Watson", "comment_text": "Cinque Terre. But don’t rely on the boats - they haven’t been running their regular service this weekend due to the high surf. Easily take train from Pisa to Monterosso to enjoy the beach - bring your suits! If you’re up for it, hike from Monterosso to Vernazza - about 2.5 miles - elevation gain of about 800 Ft but totally worth the view. Or can take the 3 min train there. Yummy poke place in tiny Vernazza believe it or not! Called Organic Poke. Then take the train back to Pisa. Would be an epic day!"}, {"username": "Autumn Watson", "comment_text": "Autumn Watson"}, {"username": "Mary Lou Gillen", "comment_text": "Lol! That a funny photo!!!"}, {"username": "Louise Faggioni", "comment_text": "Suzanne, where are you staying in LaSpezia? Sounds like it’s very central."}, {"username": "Joanna Priestley", "comment_text": "These are great pics!!"}, {"username": "Khushi Khanna", "comment_text": "Buy the train day ticket and visit as many of the CT villages as you like. We did 3 in a morning , had lunch then went back to LA Spezia to rest in the aft. And visited the the other 2 villages in the evening"}, {"username": "Sue Graham", "comment_text": "Cinque Terre is a must. Train between each village. Only 5min apart. Lucca is lovely also"}, {"username": "Lori Sanders", "comment_text": "Great photos"}, {"username": "Amalia Cristina", "comment_text": "You mean you’re in La Spezia and you’re not going to Cinque Terre?"}, {"username": "Ken Vecchia", "comment_text": "Different"}]}, {"id": "2208062406259504", "text": "I appreciate this group and have been trying not to add to the questions that seem to be repetitive. But here goes!\n\nWe (family of 4) will be in Italy Sept 4-9, starting in Naples and utilizing the trains to Pompeii then make our way to Venice. Because we only have so many days should I be booking our train in advance? I just don’t want to be stuckआणखी and find tickets are sold out. If they do go up in price for last minute, is it really a lot?\n\nWe prefer to wander some versus be on a tight schedule, just don’t want to be stuck with no seats on a train available and having to pay high priced taxis", "link": "facebook.com/groups/1373361046396315/permalink/2208062406259504/", "likes": 2, "comments": [{"username": "Karen Schmidt", "comment_text": "I would book the Venice train as it’s a high speed one and is cheaper the further out you book, but not Pompeii….it’s regional. Have you thought about using Rome as a base instead of Naples and then doing a day trip to Pompeii?"}, {"username": "Elena Innocenti", "comment_text": "it can also be much higher.\nFor example. If you find “supereconomy” rate (the cheaper) Napoli/venzia is around 60euro. “Base” (the higher) is 110euro."}, {"username": "Stacey Esposito", "comment_text": "Ok so the question is also if you have young kids they do a family 4 pack where 1 minor is free. I waited too long to book it and it was sold out and the prices had gotten more expensive with not too many choices a few days before I would have taken the train. It was florence to naples then local to sorrento. We just rented a car and it worked better for us. We drove to pompeii from sorrento which is where our hotel was"}, {"username": "Claire Dowson", "comment_text": "Get the Trainline app and you can book trains and store tickets."}, {"username": "Bea Kuckens", "comment_text": "Absolutely book in advance - September is still quite busy."}, {"username": "Tami Sue", "comment_text": "I never had problems buying my tickets the day of."}, {"username": "Silvia Arndt", "comment_text": "My husband and I are going the last 2 weeks of September. A few days ago we booked all our frecce passages with Trentitalia. We were able to secure Business class as I wanted to keep our bags closer and we were able to choose our seats. Prices vary very much on the time of day. We were able to secure some of the SuperEconomy fares too."}, {"username": "Regina-Rich Krett", "comment_text": "Venice is a long way from Naples and Pompeii and you only have 6 days. Even taking the fast trains it will take you the better part of one day to travel between the two. I would consider Rome instead of Venice due to the travel time on such a short trip."}, {"username": "Jenny Payne", "comment_text": "I wouldn’t as we got caught in Sorrento,the local train was cancelled ( no reason) so we missed our fast train from Naples to Florence & we only got 40% of our money back and guess what would only put it in a European bank account and we came from Australia so lost a lot of money + I go to Italy every year so I only buy my ticket on the platform or day before if I’m staying in that city🌻"}, {"username": "Agne Krause", "comment_text": "I'm just returning from Italy today, hight season, never had an issue buying 3 tickets day of travel. However, they are a lot more expensive than buying even a week out. Up to 3 times! But we needed fluid schedule so that was a trade off..."}, {"username": "Diane Rabinowitz", "comment_text": "I would not try to visit more than 2 cities in the short amount of time you have. More time commuting means less time exploring."}, {"username": "Rachael Richardson", "comment_text": "Local trains you don’t need to book, just buy on the day , we did this everywhere round there in July"}]}, {"id": "2208075046258240", "text": "Is sicily early/mid oct a good idea? Suggested itin for 5-6 days pls (easy pace to enjoy). Thx", "link": "facebook.com/groups/1373361046396315/permalink/2208075046258240/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "a wonderful idea!"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}]}, {"id": "2208064562925955", "text": "7 days in Italy.\n- Rome 3 days\n- Florence 2 days (include day trip to Cinque Terre)\n- Venice 2 days\n\nAny thoughts and any other tips? Going to travel by train.", "link": "facebook.com/groups/1373361046396315/permalink/2208064562925955/", "likes": 28, "comments": [{"username": "Rosh Elizabeth", "comment_text": "Loose a day in Rome and use it for Florence x\n\n2 days in Rome is plenty"}, {"username": "Laura DeCicco", "comment_text": "Skip CT, it’s not a day trip and you can spend that time in Florence, so much to see"}, {"username": "Daisy Yoo", "comment_text": "Florence itself deserve 2 days"}, {"username": "Denise Emming-Rolfs", "comment_text": "We are doing pretty much that trip right now. We landed in Rome and spent one night then in the morning took train to Venice and spent 2 nights there and are currently in Florence for 2 nights then heading to Rome for 2 nights then fly home 🙂 So far so good. Trains have been easy and our Airbnbs have been 15 minute walk from the train stations. Enjoy!!"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "Exclude cinque terre is my opinion. Rome, Florence and Venice in 7 days would be great."}, {"username": "Mark Mazzullo", "comment_text": "We spent 12 days in those 3 (without any day-trips) & wish we spent more. Min: 4 (Rome), 4 (Florence) & 3 (Venice)...as long as you travel early so as to not lose those days."}, {"username": "Erica Madrid", "comment_text": "This is close to my trip I’m currently on. Only change I would make is fly in Venice the out of Rome. It’s a great taste of the cities to decide if you want to come back. We didn’t day trip to Cinque Terre because Florence was amazing. We only had one night in Florence with most of the first day and we left late the second day to Rome. We wish we had another day at least in Florence. We did love Venice though; not sure what so many people dislike it. 2 days was perfect though in Venice, we didn’t feel we needed more than that."}, {"username": "FenNee Sim", "comment_text": "So many of you love Florence … can you please add on what u like, the key attractions. I must have missed these in my research."}, {"username": "Laura McLaughlin", "comment_text": "I’d skip Venice and spend the time in Florence"}, {"username": "Roxanne Franquelli", "comment_text": "Add a day to Florence. Visit Venice for the day."}, {"username": "Barbara Bastianini", "comment_text": "Everyone’s different but personally I’d skip the Cinque Terre to allow more time in your other three destinations"}, {"username": "Dunia Aldyni", "comment_text": "Rome 2 Venice 3 ,Venice more pretty 🤩 than Rome for me 😍😍"}, {"username": "Suzanne Shea-Simpson", "comment_text": "Couple years ago on our Italy trip we did 3 nights Rome train to Florence for 4 night (we stayed extra day so we could take day trip/tour to Cinque Terre) beautiful! Train to Venice for 2 nights."}, {"username": "Diane Hamilton", "comment_text": "We have the same itinerary.. going mid November 🇮🇹"}, {"username": "Nana Kutateladze", "comment_text": "I probably would split the seven days between Rome and Florence."}, {"username": "Sharon Teoh", "comment_text": "I think it’s up to u whether u want to do Rome, Florence or Venice.. but drop 1 city 🙂"}, {"username": "Jessica Beghtel", "comment_text": "Swap number of days with Rome and Florence."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "Unless the flights are so much cheaper that you NEED to fly in and out of Rome, you should consider flying to Venice so you don’t lose the day traveling by train.\n\nAll the cities are great in their own way. But if you can only do 7 days - I would do 2 days Rome, 3 days Florence, 2 days Venice.\n\nRemember that travel time really takes away from your day. So you really don’t have as much time as you think in each city.\n\nWhen I quickly looked up the train to cinque terre it looks like it was 2.5-3 hours each way. You want to make sure you get to see Florence while your there too.\n\nFlorence and Venice were my favorite stops in Italy. But to save travel time, transfers, lugging luggage, would you consider doing 2 nights Rome and 5 nights Florence. Then do a day trip to Cinque Terre and a day trip to Venice - maybe with a guide. That way you aren’t moving luggage, taking water taxis, checking into hotels. Etc. you get to see all the places on your list but you can do it from a home base? Just a thought."}, {"username": "Chris ORiordan Dean", "comment_text": "If this is your first trip don’t skip anything. You will get a taste of it and will return for a longer stay. We did cinque terre in one day driving from Modena and it was beautiful. However since you are taking the train you will lose a lot of time. But it is doable. Might as well get your plane tickets for next year because you will return. BTW. We were with friends and did a day trip to Venice. I would love to spend the night there. Saint Marks Square at sunset is very romantic. Loved it."}, {"username": "Sea Shore", "comment_text": "More Florence time infact spend all your time in Florence :-)"}, {"username": "Arianna Bellesolo", "comment_text": "Since you’re in Venice, take the train and in one hour you’re in Verona! My beautiful city"}, {"username": "Junko Osaki", "comment_text": "As an Italian myself, I’d cancel Venice and just dedicate more time to explore Rome and Florence instead"}, {"username": "Josephine Spallina", "comment_text": "In Milan now and went to Florence yesterday and it is beautiful! Milan is our hub, also have family here that visited, will be going to Sicily tomorrow for 5 days back to Milan for 6 days then going to Venice & Rome. I would do a day in Venice and swap the day elsewhere. The fast trains are awesome, your luggage’s will fit in the overhead compartments. Enjoy your trip!"}, {"username": "Honoka Miki", "comment_text": "Perfect! You can go to Via Pellicceria 3 (post office in Florence) and near there, there is a Mensa della Posta: so delicious local food restaurant."}, {"username": "Cynthia Peraza", "comment_text": "More time in Florence. Go to Siena too"}, {"username": "Kateryna Koriavko", "comment_text": "Just left Florence on my way to Venice. Florence is amazing, super clean, organised and safe. Rome’s landmarks are spectacular, but filthy streets are huge disappointment.\nDon’t regret having only one night there."}, {"username": "Gene Hamilton", "comment_text": "We just did the same trip but 2 in Florence 3 in Venice\nWalking food tour in Rome was wonderful lots of food and wine"}, {"username": "Jason Mladen", "comment_text": "You need more time!"}, {"username": "Aimee Murdock Ka", "comment_text": "We did this itinerary, except we didn’t go to the CT. I would skip one day of Rome and see the CT that day instead. 7 days is doable, but may feel a little rushed."}, {"username": "Sara Punis", "comment_text": "Venice 1 day Rome 4"}, {"username": "Jennifer Gustafson", "comment_text": "Pick only 2 of these. You will enjoy them more. We had 18 days and barely had time to see what we wanted. Traveling from place to place takes up time."}, {"username": "Kristine McIntyre", "comment_text": "Not enough time in Florence."}, {"username": "Gina Rovello Keenan", "comment_text": "I would only pick 2 places to base. Where are you flying in and out of?"}, {"username": "Mckoen Lujie", "comment_text": "I’m think of the same trip, but not decided between Cinque Terre and Positano."}, {"username": "Deborah Schroeder", "comment_text": "Cinque Terre deserves more than a quick visit and Florence deserves more than 1 day. Land in Venice, train to Florence, train to Rome and fly out from there or vis a versa. If you wish to see CT, get an early start and come back late at night."}, {"username": "Yara Karime Vazquez", "comment_text": "Perlita Cabrera"}, {"username": "Judy Carey", "comment_text": "Identify why you need to go from place to place in only 7 days and what you want to see in each. Not possible to give any tips when someone doesn't know your travel history, goals, etc. If you do get opinions, they are only for surface level comments."}, {"username": "Karen Schmidt", "comment_text": "This will give you a nice taste of Italy …perfect for wanting more! I’d skip Cinque Terre and just enjoy Florence. 2 days is really only 1.5 and that’s easy to fill in any city especially Florence 😊"}, {"username": "Vivien Paulik", "comment_text": "Florence ans Cinque Terre for two days it is not enough with the travelling too"}, {"username": "Dawn Falsinotti", "comment_text": "Lose one city and spend another day in Florence."}, {"username": "Candace Linda Solomon Cross", "comment_text": "Skip Florence. Venice is amazing."}, {"username": "Helen Pottle", "comment_text": "I would just do Rome and Florence"}, {"username": "Melissa De La Cruz", "comment_text": "We did this exact trip to fit as much in because we couldn't extend the trip. It was a busy trip but I'm so glad we got to see all three!"}, {"username": "Sanghamitra Sahu", "comment_text": "You need 4 days in Rome"}, {"username": "Kirsten Abrams", "comment_text": "YOU NEED MORE TIME IN FLORENCE"}, {"username": "Suzanne Joslin Oliveria", "comment_text": "I love CT. But don't leave Florence with that short of time."}, {"username": "Jennifer Cooper-Winters", "comment_text": "You can see Rome in 2 days! Try to school to Pisa or Naples!\nVenice honestly is very dirty and not what I expected! Amalfi Coast is to die for! I’d see that over Venice any day!!"}, {"username": "Donna Parrish", "comment_text": "I would flip Rome and Florence and take a day trip to Tuscany for the additional day!"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Cut a day out of Rome and add it to Florence."}, {"username": "Tam Wong", "comment_text": "Florence has more to offer them Venice . Rome is home so spend as much time as possible there💜🇮🇹"}, {"username": "Natassa Katsouli", "comment_text": "I had day trip from Rome to Florence. It was enough to see the top sightseeing. Take the fast train (1,5 h)"}, {"username": "Phyllis Snyder", "comment_text": "Factor in some travel time to your schedule."}]}, {"id": "2208072712925140", "text": "Does anyone have budget friendly Airbnb’s they can recommend for Naples, Italy for the later part of October through first week of November? Must be in a safe area and a clean place. Thanks in advance for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2208072712925140/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187785-d1226\n0320-Reviews-To\nledo_Loft-Naple\ns_Province_of_N\naples_Campania.\nhtml"}]}, {"id": "2208077222924689", "text": "Rome - hotel or Airbnb?\n\nFamily of 5 going to Rome for 5 nights in October 2024. Airbnbs seem significantly more affordable and while I’ve never had any issues with renting, it seems that the Airbnb experience has declined recently.\n\nHow was your Rome Airbnb experience? Can anyone link an Airbnb they trust or hotels priced roughly $200-$225 a night? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208077222924689/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FVacationRen\ntalReview-g1877\n91-d4343891-You\nr_Rhome_Holiday\n_apartment_A_sw\neet_city_break_\nin_Rome-Rome_La\nzio.html"}, {"username": "Kristina Ruk", "comment_text": "Try booking com they have apartments and hotels on their list. If you find ant try to reach directly so it can be cheaper as they pay booking ;)"}, {"username": "Gena Diaco Penland", "comment_text": "We stayed here and it was perfect!!!! 2 bedrooms and 2 bathrooms. Located close to train and bus stations and tons of restaurants/\nshops. Isabella was a great host!"}, {"username": "Karen Schmidt", "comment_text": "The one I stayed in only was for 2 people. But..last trip I only used Airbnb and everywhere was great. Just really read the reviews and make sure there’s a bunch of them too"}, {"username": "Megan Leigh", "comment_text": "I think we just hear more about the negative but for every negative there are hundreds of positives. Look for superhosts and lots of positive reviews. Is it a guarantee? No, but nothing is..."}, {"username": "Stacy Prestigiacomo", "comment_text": "We had no issues at all"}, {"username": "Sarah Louise", "comment_text": "I just got back from a two week trip rome, florence, and venice area and used airbnb for all of my stays.. I'd read a lot of reviews and communicate with the host prior to solidify that the unit has what the listing mentions (especially your must have's). We were there for the heatwave so their ac units had a difficult time keeping up (understandbly)\n, our host went and bought us a fan for the unit (game changer to have). Location was priority for us however we liked staying a bit off the beaten path and within a 30/40 minute walk from sites (we stayed in the trastevere area and loved our experience there however the unit was a studio style so would not recommend for your family).\nAirbnbs dont always have the same amenities (such as quality of toiletpaper, sheets, towels etc). However if you are able to compromise on these things its well worth the cost savings.\nHave a wonderful trip:)"}, {"username": "Maryanne Cristina", "comment_text": "Hi!! We were a family of 8. We stayed at this beautiful Airbnb in July. Great neighborhood (Monti) and location. Fifteen min walk to Colosseum and twenty minute walk to Trevi."}, {"username": "Diane Davis Lawyer", "comment_text": "We've stayed in many AirBnb's over the years, both in US and Europe. We've always had overall good experiences. We are only staying at AirBnbs for our trip next month, we are staying in four different ones. I feel pretty confident about our choices. Just make sure you read ALL of the reviews, recent and in the past. Try to figure out the general location (which is pretty easy to do, actually) and do a google street view of the area, gives you a better feel for where you'll be neighborhood-wi\nse. Look at their house rules and the amenities to be sure they match your needs. Good luck with whatever you choose."}]}, {"id": "2208080989590979", "text": "Heading to Italy in the spring Any suggestions of a body butter bar, or travel size body oil that is acceptable by the TSA? Or any that I can get my hands on pretty easily in Italy and if so where?", "link": "facebook.com/groups/1373361046396315/permalink/2208080989590979/", "likes": 0, "comments": [{"username": "Jeanne Eliason", "comment_text": "Anything under 100cc and in an acceptable packing cube or one quart see thru bag. I just buy my soaps and conditioner once I'm there and leave behind what I don't use."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/3rZE12U"}]}, {"id": "2208082049590873", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2208082049590873/", "likes": 8, "comments": [{"username": "Richard Tegnander", "comment_text": "I am 80 yrs old and looking into a northern tour of Italy. What’s the average age of the groups and how much walking is involved?."}]}, {"id": "2207548052977606", "text": "Need advice on a general area to stay in Venice.\nWe will be arriving by train (tickets not booked) but leaving by plane (Venice Treviso).\n\nWould appreciate it even more if you are able to recommend an Airbnb.\n\nTIA 😌", "link": "facebook.com/groups/1373361046396315/permalink/2207548052977606/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d4976\n13-Reviews-Loca\nnda_ai_Bareteri\n_e_B_B_Allegri-\nVenice_Veneto.h\ntml"}]}, {"id": "2207638129635265", "text": "Looking for cooking class recommendations for Florence, Tuscany or Rome. Tia :)", "link": "facebook.com/groups/1373361046396315/permalink/2207638129635265/", "likes": 24, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.viator.com/\ntours/Florence/\nSmall-Group-Ital\nian-Cooking-Cla\nss-in-Florence/\nd519-5049COOKING\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Rome https://\nwww.viator.com/\ntours/Rome/\nFettuccine-Pasta\n-Making-Cooking\n-Classes-in-Rom\ne-Piazza-Navona\n/\nd511-348924P2?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Cinzia Berletti", "comment_text": "Airbnb experiences.."}, {"username": "BatEl Kogman", "comment_text": "F"}, {"username": "Angela Huntenburg Russell", "comment_text": "We’re doing this next month…\n\nhttps://\nabnb.me/\nMbcdeE1Y2Bb"}, {"username": "Eric Lange", "comment_text": "Walkabout Tours - Tuscan countryside"}, {"username": "Kim Catania", "comment_text": "We took the best cooking class in Florence - Towns of Italy - Florencetown- Cooking class. We got to tour and shop the market and bakery, then cooked a fantastic meal- just amazing!"}, {"username": "Laura Austin", "comment_text": "Eat and Walk Italy Cooking Class in Rome is awesome!"}, {"username": "Stephanie Grote-Garcia", "comment_text": "The food market had classes"}, {"username": "Linda Williams", "comment_text": "Julie Franco Mellow"}, {"username": "Gaye Watkins", "comment_text": "Tenuta Torciano in Tuscany. We had a blast. And, they have an 11th century hotel…"}, {"username": "Bea Kuckens", "comment_text": "Rob-Laura Lytle"}, {"username": "Marian Van Soelen Hand", "comment_text": "Mama Florence cooking class! It was phenomenal! We booked a private lunch time class that start d at the market and then walked to the school and made panzanella, 2 kinds of pasta from scratch and gelato! Absolutely the highlight of the trip!"}, {"username": "Anne Rasmuson-Lemieux", "comment_text": "Following"}, {"username": "Rachel Alves", "comment_text": "And Siena?"}, {"username": "Maureen McCall Bradley", "comment_text": "Pizza and Gelato through www.walkaboutfl\norence.com"}, {"username": "Renee Rosolino", "comment_text": "F"}, {"username": "Regan Cooper McKenzie", "comment_text": "Vanessa Tandy this looks good !"}, {"username": "Olga Martinez", "comment_text": "Mama Florence cooking class"}, {"username": "Adriana Ibrido Rotili", "comment_text": "Natalie Rotili"}, {"username": "Kimberly Lampros", "comment_text": "When I stayed in Florence, I had an amazing Airbnb experience - Luca and Lorenzo, cooking in the Chianti hills. Loved the experience and the lunch!"}, {"username": "MaryBeth Reed", "comment_text": "Fantastic cooking class we took in Florence with https://\nwww.stepcook.it/! Highly recommend!"}, {"username": "Suzanne Mills", "comment_text": "There are many many options."}, {"username": "Deborah Buder Lee", "comment_text": "Following"}, {"username": "Susan Griffith Powell", "comment_text": "Following"}, {"username": "Gabby Lafleur", "comment_text": "Absolutely RomewithChef!! You can get your tickets on get your guide. They have dinner class options too:)"}, {"username": "Yvonne Lopez", "comment_text": "Loco Lopez"}, {"username": "Lori Vogt", "comment_text": "Just posted a pizza cooking one in Rome here European Cruises For Families"}, {"username": "Beth Erica", "comment_text": "Rhea Katz Kleeblatt"}]}]