[{"id": "2204404506625294", "text": "Hi everyone,\n\nMy daughter and I are going to be in London for a few weeks and are hoping to travel to Venice, Rome & Cinque Terre for 1 of those weeks. What’s the best way to travel we thought train but that’s looking quite complicated and a lot of train changes. What’s everyone’s thoughts? Should we just fly there and back to avoid losing those days traveling?\n\nThank you in advance ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2204404506625294/", "likes": 0, "comments": [{"username": "Michael Widjaja", "comment_text": "Is it possible to stay in Florence for few days? So you can easily travel by train to La Spezia (Cinque terre) and Venezia…usually\nthat’s what I do…"}]}, {"id": "2204407406625004", "text": "Looking for recommendations on a good waterproof ankle boot for Venice and Lake Como? Will be there the last week of October. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204407406625004/", "likes": 0, "comments": []}, {"id": "2204410416624703", "text": "We are going from Milan to Paris in trenitalia.6.5 hours train. Will there be food options inside the train. Pls advice", "link": "facebook.com/groups/1373361046396315/permalink/2204410416624703/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "There’s typically a bar car with food and drink options."}]}, {"id": "2204413256624419", "text": "Hi! Does anyone have any feedback re wine tastings/tours being teen friendly? I’d love to try a wine tasting but don’t want my teens to get overly bored. If feedback is “don’t bother,” that works as well, but just putting feelers out if we could make something work- thanks!! I’m looking for when we have ”downtime” in Cinque Terre…..", "link": "facebook.com/groups/1373361046396315/permalink/2204413256624419/", "likes": 0, "comments": []}, {"id": "2204419729957105", "text": "a day in San Gimignano, Tocasny, must place to visit, it was amazing!", "link": "facebook.com/groups/1373361046396315/permalink/2204419729957105/", "likes": 114, "comments": [{"username": "Pom-Eric Doland", "comment_text": "Thank you for sharing! Any recommendations\non how to get there from Siena? We will be in Siena for 3 days in November and SG is on our list!"}, {"username": "Tracy Foss", "comment_text": "Thanks for sharing! Was this a tour included with a winery lunch ?"}, {"username": "Theresa Wong", "comment_text": "One of my favorite medieval town in Tuscany. Have fun."}, {"username": "Brian Marcus", "comment_text": "It was. Did you have the REAL gelato??"}, {"username": "Laura St James", "comment_text": "I loved it there."}, {"username": "Lyn Pappas Dahm", "comment_text": "One of my favs!! Oh and loved Marronaia!! Bought the wine and the chili pepper olio! That stuff is amazing."}, {"username": "Gary Trignani", "comment_text": "Love San Gimignano. It is doable on the same day as Siena if needed. They say it has the best gelato in all of Tuscany.!"}, {"username": "Enolita Castillo", "comment_text": "Been there...love it"}, {"username": "Geoff Plus Jann Mains", "comment_text": "Hi how far is this from rome please and thank you 😊"}, {"username": "Joanne Battista", "comment_text": "One of my most favourite places. Loved it."}, {"username": "Tory Weaver", "comment_text": "Absolutely loved Italy!"}, {"username": "Judith Macfarlin", "comment_text": "Lovely place , just been"}, {"username": "Cristian Jimenez", "comment_text": "Karla 🤩❤️"}, {"username": "Toni Marie", "comment_text": "Love it there"}, {"username": "Denise Beaudoin", "comment_text": "Denise Beaudoin"}, {"username": "Debra Burroughs Disario", "comment_text": "My Favorite"}]}, {"id": "2204425683289843", "text": "Has anyone taking any cooking classes in Venice that they would highly recommend? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2204425683289843/", "likes": 1, "comments": []}, {"id": "2204430879955990", "text": "First time poster here, and first time traveler to Italy. My reason for posting is because I am becoming overwhelmed with the details in planning our itinerary, and I was hoping to get some help. We are spending 6 days flying into and out of Rome. We are not necessarily fixated on staying in Rome and are open to going to little villages and wouldआणखी love to see the Amalfi Coast (thinking a day trip) have some good Italian food and possibly a day trip up to Florence. We are not scared of trains, early mornings and long days… we do have 3 kids with us though so we have to be reasonable. Hoping for some suggestions on reasonably priced hotels and how you would split your time? Thanks in advance and I apologise for my absolute and complete Rookie-ness 😂", "link": "facebook.com/groups/1373361046396315/permalink/2204430879955990/", "likes": 2, "comments": [{"username": "Sara Beth", "comment_text": "You need more than a day in Florence and definitely Amalfi."}, {"username": "Gary W Anderson", "comment_text": "For 6 days pick two bases, my choice would be Florence and Rome because they are closer and can be walked. Amalfi is stunning but your driving around and I think the kids won’t appreciate being in the car."}, {"username": "Glenn Todd Webb", "comment_text": "Amalfi coast is too far. With 6 days I would just stay in Rome, do a day trip to tivoli and one to Orvieto."}, {"username": "Steve Grossman", "comment_text": "First off it's an eight hour round trip to amalfi. So I would not suggest a day trip. Rome is just south of tuscany and that's Where I recommend you go. At least two full days if not three. There is an abundance of things to see an abundance of towns. And great italian food."}, {"username": "Lisa Adams Robertson", "comment_text": "Skip Amalfi. It is not enjoyable as a day trip. Orvieto is a lovely day trip from Rome, and the kids would like the well and the catacombs."}, {"username": "Gina Rovello Keenan", "comment_text": "For 6 days I would base in 2 cities at the most. As others have said Amalfi is too far for a day trip. Perhaps 2 nights in Florence and 4 in Rome. You can day trip from there. https://\nwww.timeout.com/\nrome/\nthings-to-do/\nday-trips-from-r\nome"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Day trips are mostly worthless in my opinion. You are at your destination at the most crowded hottest part of the day. Stay in the Rome vicinity and soak it all in."}, {"username": "Candis Morgan", "comment_text": "Thank you so much everyone we are going to change our fly in airport and do 4 days in Amalfi and 2 in Rome I really appreciate all of the wise input, so kind!! 🙏"}]}, {"id": "2204433029955775", "text": "Hello! I’m wanting to book our Vatican tickets direct due to all of the cancellations with booking them third party. We are going mid October. Can anyone direct me on the best one to choose or at least pros andआणखी cons. I’m leaning towards this one or if we change the day to a Saturday they have the prime experience available. To those who have done the tours, do you wish you would have explored on your own or were the tours worth it? I love the idea of being in the Sistine chapel when there’s significantly less people after closing but that would mean no time to explore on our own. Another question is since I’m buying the tickets ahead of time do I have to wait in a long queue? I know it gets busier as the day goes on and I don’t want to miss my tour. Or would you recommend just buying our tickets and exploring on our own? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2204433029955775/", "likes": 2, "comments": [{"username": "Kim Bend Smolinski", "comment_text": "We are going in Sept, I booked with Viator. We have used them in the past in US and in Spain with no issues."}, {"username": "ארז בן טובים", "comment_text": "I have done the prime experience with breakfest at 7:30. Worth every Euro. No line to wait, and you are walking with a group almost alone in the different meuseum parts. ( other groups time share the different rooms). After the tour and breakfest you are free to re visit all places , where you now share the place with (too) many people. Really worth it!!!"}, {"username": "Liz Anne", "comment_text": "We booked early morning (7:30) through LivTours. They were great!"}, {"username": "Maggie LW", "comment_text": "how about the lunch experience - is it worth it"}, {"username": "Atet GC", "comment_text": "What is the difference by full rate and reduced rate? Reduced is it foe seniors? Kids? Students?"}, {"username": "Kate Laidlaw", "comment_text": "We just did the 7:30am tour with breakfast, booked directly. By far the best tour. Looped back through the gallery afterwards to do the dome climb and it was sardines"}, {"username": "Jennifer Smith", "comment_text": "I recommend early morning if at all possible. And I also recommend a guide. They can just get you around. I have booked with a couple of companies out side of Vatican and one directly with the Vatican. I book the evening tour at the Vatican but then the VMdecided to close early that day so it was an afternoon tour. The tour was great but the VM was packed. We were the last to leave the Sistine Chapel but the lighting was not great and we were rushed out because it was closing time. The morning is special! The night tour that stays late would be amazing but I just didn’t get to do it. But the VM did give me an option to still tour where with an outside source you might not get a choice."}, {"username": "Jennifer Smith", "comment_text": "I believe you can stay as long is you would like after the tour when booking through VM."}, {"username": "Stefan Sig", "comment_text": "Book using either viatour or dark rome websites ￼"}, {"username": "Jeff McLellan", "comment_text": "We booked the Prime VIP at 7:30AM with breakfast after for the four of us as the Prime was not available on the day that we needed. We enjoyed being able to move at our own pace with our amazing guide Donatella. We had ten minutes in the Sistine Chapel with no one else in there except our guide and the guards was a pretty surreal experience. It was an additional €320 for the private guide. This fee is the same whether there are two or ten of you in your group."}, {"username": "Fernando Leon", "comment_text": "October Is Good time . A few less people. Go whitout a group , because they run the visit and Do not leave liberty to Stay the time that you want, even into the sisitine chapel, the groups do not stay in the middle, they go to fast to the posterior zone."}, {"username": "Sue Levy Avinir", "comment_text": "Definitely a tour vs exploring on your own. Either do first thing in the am or last time of the day."}]}, {"id": "2204433456622399", "text": "2 part question: I want to visit Academia in Florence, but tickets are sold out. Can I purchase them at register?\nAlso, while bus from rome to florence takes 2-3 times longer, it's also so much cheaper last minute.... anyone did bus travel in Italy? Or should I just just go ahead and buy high speed train tickets?.... thanks for any tips!", "link": "facebook.com/groups/1373361046396315/permalink/2204433456622399/", "likes": 1, "comments": []}, {"id": "2204458329953245", "text": "Please recommend hotels in Sorrento\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2204458329953245/", "likes": 19, "comments": [{"username": "Wahab Sidharta", "comment_text": "AirBnB"}, {"username": "Cheryl Novis", "comment_text": "Hotel plaza - great position"}, {"username": "Renee Giordano Norton", "comment_text": "Renee Giordano Norton"}, {"username": "Sandy Conrad", "comment_text": "Hilton Sorrento Palace"}, {"username": "Pat Cray", "comment_text": "Imperial Hotel Tramontano Sorrento"}, {"username": "Lisa Pugliese", "comment_text": "Has anyone stayed here\n\nhttps://\nwww.googleadserv\nices.com/\npagead/\naclk?sa=L&ai=DCh\ncSEwjf1KPH1ryAA\nxUFjsgKHQ-dBNUY\nABABGgJxdQ&ae=2\n&ohost=www.goog\nle.com&cid=CAAS\nJuRonapRpOA2Dr_\nclCd6thqZ7ElNNb\nQVa3uICw-ZuHhly\n7QX8Pty&sig=AOD\n64_1dLYUCsXomFF\n0Ov6PWepem_cl58\nA&q&adurl&ved=2\nahUKEwiF_ZjH1ry\nAAxUoEFkFHYV-Ae\nIQ0Qx6BAgGEAE"}, {"username": "Donna Watson", "comment_text": "Michelangelo was great and perfect location"}, {"username": "Andrew Scivoli", "comment_text": "Hotel Ascott"}, {"username": "Susan Carney Ash", "comment_text": "We LOVED the Grand Hotel Ambasciatore. Fabulous service, location and rooms! (View from our room pictured below)"}, {"username": "Chanel Demanuele", "comment_text": "Hotel Sorrento City 😊"}, {"username": "Loly Hlade", "comment_text": "https://\ncocumella.com/\nen/"}, {"username": "Nancy Fricke Corsi", "comment_text": "Palazzo Jannuzzi Relais"}, {"username": "Roxanne Perrone", "comment_text": "Hotel Corallo"}, {"username": "Millie Hayes", "comment_text": "Hotel Bristol,, i go on Friday but it’s incredible!! Xx"}, {"username": "Kally Trahearn", "comment_text": "Hotel Plaza Sorrento - stayed there before and have booked to stay there again"}, {"username": "Kay Boxall", "comment_text": "Hotel Regina"}, {"username": "Jeff Stephens", "comment_text": "Any views on Hotel Continental"}, {"username": "Tina Orzolek Petrone", "comment_text": "Grand hotel capodimonte was so nice, great location etc\n\nhttps://\nwww.googleadserv\nices.com/\npagead/\naclk?sa=L&ai=DCh\ncSEwitrJzm_72AA\nxW1DEwKHVdFBroY\nABABGgJ5bQ&ae=2\n&ohost=www.goog\nle.com&cid=CAAS\nJORoZYY2qgiDqYl\nz_h89jtJ2tsE-9t\nBd1SU64wxQVt4sC\nUBCBA&sig=AOD64\n_1xUm5eVbFU9Z1d\nM6DrdsjGO3ZEEA&\nq&adurl&ved=2ah\nUKEwiuqZTm_72AA\nxVRkIkEHUIcC4gQ\n0Qx6BAgPEAE"}, {"username": "Chelsea Gudith", "comment_text": "Maison Lauren! Booked on booking.com.\nFABULOUS. Perfect location, exceptionally clean, best staff. Loved it."}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "We are currently at The Hotel Grand de La Ville - It’s lovely!"}, {"username": "Laura McGaughy Mims", "comment_text": "We loved the Imperial Hotel Tramontano!"}, {"username": "Christine Golia Brigida", "comment_text": "Hotel Mignon"}, {"username": "Barbara Fucci", "comment_text": "Imperial Hotel Tramantano or La Forita across the street Continental but we have only stayed at the Imperial Hotel Tramantano also Hotel Michael Angelo stayed here too"}, {"username": "Susan Urquhart", "comment_text": "Hotel Corallo was incredible x"}, {"username": "Lyndsey Ryan", "comment_text": "Grand Hotel Capodimonte perfect location and stunning view and pool area ❤️"}, {"username": "Amanda Petrie", "comment_text": "Stayed in hotel Rivage in June absolutely fantastic, plus it has a spa pool x"}, {"username": "Janice Pesavento", "comment_text": "Cesaer Augustus. Beautiful"}, {"username": "Cass Pantalone", "comment_text": "We are staying at hotel plaza at the end of this month"}, {"username": "Chelsea Gudith", "comment_text": "Maison Lauren!!!\n\nPERFECT Location.\nCLEAN. Spacious. Comfortable bed. Delicious breakfast. A/C. Beautiful view. Exceptional hotel manager/ host (Simona is her name 🫶🏻)."}, {"username": "Grace Rogers", "comment_text": "Following"}, {"username": "Kelly Kern", "comment_text": "Sorrento Flats"}, {"username": "Carl Thompson", "comment_text": "Grand president for us"}, {"username": "Kelly Roland Thompson", "comment_text": "Grand royal hotel"}, {"username": "Sheral Gillman Rowe", "comment_text": "Hotel Royal"}, {"username": "Rachel Bradfield", "comment_text": "The Grand Capodimonte 🇮🇹👍🏼"}, {"username": "Dana Talusani", "comment_text": "We loved La Favorita! Great rooftop pool, good restaurant, great location and FABULOUS breakfast."}, {"username": "Michele Ann Tomao Ruzzano", "comment_text": "We just left there on Saturday. We stayed at Villa Monica. Away from the tourist. The view was spectacular. Up on the mountains"}, {"username": "Anita Clayton", "comment_text": "We have stayed in 12 different hotels and various apartments and Antiche Mura definitely my fave."}, {"username": "Michele Ann Tomao Ruzzano", "comment_text": "Michele Ann Tomao Ruzzano"}, {"username": "Michele Ann Tomao Ruzzano", "comment_text": "Michele Ann Tomao Ruzzano"}, {"username": "Michele Ann Tomao Ruzzano", "comment_text": "Michele Ann Tomao Ruzzano"}, {"username": "Karen Digger While", "comment_text": "Bristol Hotel amazing place and great views"}, {"username": "Preet Kaur Childress", "comment_text": "La grand cocumella- amazing hotel and amazing food!"}, {"username": "Cecilia McDaid McCann", "comment_text": "Grand Hotel Excelsior Vittoria, Sorrento xx"}, {"username": "Clelia Marcantonio Vanasse", "comment_text": "Has anyone stayed at hotel Minerva Sorrento ?\nNo washers there … any suggestions other than laundry service ?"}, {"username": "Geoff Roush", "comment_text": "Imperial Hotel Tramontano Sorrento"}, {"username": "Christine Piche", "comment_text": "Hotel Rivage Sorrento"}, {"username": "Lisa Southerland", "comment_text": "We stayed at the Grand Hotel La Favorita and it was the best experience!! Highly recommend!"}, {"username": "Janice Maclean", "comment_text": "Hotel de la Ville"}, {"username": "Fiona McLaren", "comment_text": "The Grand Hotel due Golfi - we couldn’t fault it! Lovely rooms, excellent breakfast and free shuttle service. People couldn’t do enough for us - highly recommend!"}, {"username": "Judith Lamas", "comment_text": "I will travel recently, a typical Italian hotel, I recommend you make a reservation directly with the hotel, it has a shutter every 30 minutes to the Sorrento center, in addition to the airport that you coordinate directly when you make the reservation, you can also coordinate all the excursions from there."}, {"username": "Donna Mangone", "comment_text": "Stayed at the Hotel Michelangelo a couple of times."}, {"username": "Renee Giordano Norton", "comment_text": "Grand Hotel Capodimonte! ❤️❤️"}, {"username": "Susan Shaffar-Redding", "comment_text": "Hotel Settimo Cielo (I’m sure I misspelled that). We’ve stayed there twice. It’s older, but clean, friendly, family-run, and has gorgeous ocean/Vesuvius views. Both times we stayed there, there was a fireworks show over the water, and we watched from our balcony."}, {"username": "Lisa Hollerbach Steiner", "comment_text": "Conca park"}, {"username": "Patty Orr", "comment_text": "Hilton Sorrento Palace! Gorgeous and amazing staff!"}, {"username": "Clare Boxer", "comment_text": "Hotel Conca Park Sorrento"}, {"username": "Lisa DiSalvo Timmoneri", "comment_text": "Hotel mignon - we loved it!"}, {"username": "Marie Bryer", "comment_text": "Please recommend nice places to stay in Venice."}, {"username": "Czecie Reyes", "comment_text": "Hotel Leone"}, {"username": "Virgz Van Møøre", "comment_text": "Palazzo Montefusco"}, {"username": "Dan Trudi Flynn", "comment_text": "Hotel de la Ville"}, {"username": "Ewa Kolodziej", "comment_text": "Minerva 1000%"}, {"username": "Sasha Childs", "comment_text": "Nastro Azurro"}, {"username": "Lisa Gelsomino Hennessy", "comment_text": "Hotel Minerva"}, {"username": "Barbara Pellegrino", "comment_text": "Grand hotel la favorita…..amaz\ning hotel great size rooms with breakfast….amaz\ning!!!!"}, {"username": "Jodi Schrank", "comment_text": "Grand Hotel Ambasciatori"}, {"username": "Tara Roed", "comment_text": "I second grand hotel\nLa favorita. Great location and pool. Gorgeous place and nice staff. Our room for 3 was a great size too"}, {"username": "Sandy Radican Shikaly", "comment_text": "Grand Hotel La Favorita.. 5 star property.. stayed there twice!!!!!"}, {"username": "Julie Tran", "comment_text": "Hotel rivage"}, {"username": "Christine Sanci-Gentile", "comment_text": "Hotel Grand President"}, {"username": "Kim Seibert", "comment_text": "Grand hotel Ambasciatorri"}, {"username": "Frances Scannapieco", "comment_text": "I have been to Sorrento 4 times. Always stay at … Hotel Antiche Mura. Right in center of Sorrento. Fabulous hotel and staff."}, {"username": "Tanya Cini-Kirk", "comment_text": "Hotel Rivage!! Just stayed there in July and it was fantastic!"}, {"username": "Michael Greenhalgh", "comment_text": "Hotel Bristol\nSuperb. Attentive staff, great food and stunning views"}, {"username": "Jeana Farese Fama", "comment_text": "Lorelei londres - fabulous"}, {"username": "Jane Nuzzi Lopiparo", "comment_text": "La Favorita!!"}]}, {"id": "2204461536619591", "text": "Hi! I am traveling to Italy wife my wife for our honeymoon. We want to end our trip by going to the Milan Derby Inter Milan vs AC Milan. Does anyone know if the tickets are on sale yet? I cannot find any info anywhere and the Inter website isn’t very helpful. Any info would be very appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2204461536619591/", "likes": 0, "comments": [{"username": "Alessandro Battxi", "comment_text": "Here: https://\nwww.inter.it/it/\nbiglietti click on the match and buy the tickets"}, {"username": "Giovanni Pianigiani", "comment_text": "They typically start selling them to the general public only 3-4 weeks before the match. You can currently buy the ticket for the 9/3 match, but it's too early 9/16"}]}, {"id": "2204463253286086", "text": "We want to travel from Venice to The Dolomites for 3 days then head to Milan. Best place to stay in the Dolomites for easy/ moderate hikes?", "link": "facebook.com/groups/1373361046396315/permalink/2204463253286086/", "likes": 0, "comments": []}, {"id": "2204465696619175", "text": "Topic: Trains\n\nJust returned from Italy. For anyone traveling to more than one city, just keep in mind travel time and possible delays. Also keep in mind luggage.\n\nA few things:\n\nWe took 4 trains to different cities, 2 were delayed. Naples to Rome was delayed by an hour. Florence to Venice was delayed by 4 hours.\n\nAll the trains were a little different but I’m telling you it’s hard to travel with a lot of luggage. Florence to Venice there were sections at the end of the car we were able to put big luggage but it wasn’t very big. All the other trains we needed to put it on top- including large suit cases, so you will need to be able to lift it up over your head. There were a few spaces I could put in between the seats but many were taken by other passengers’ luggage.\n\nThe train station in Perugia was definitely hard with luggage - we had to carry it up and down stairs. Our other stations were major cities, but I imagine other stations that aren’t as major can be similar to this.\n\nIt’s been said in other posts, but they only add the train gate a little before it departs. My suggestion is to be waiting and looking at the screen and ready to go immediately when it’s posted.\n\nAnyway. I just wanted to post in case it helps anyone. Traveling without really knowing how it will be when you are there is stressful so I hope it helps a little.", "link": "facebook.com/groups/1373361046396315/permalink/2204465696619175/", "likes": 144, "comments": [{"username": "JeriLynne Clifford", "comment_text": "We will be taking trains this time too. I have purchased our tickets already. Curious what tickets you had for that experience. I purchased business class and chose seats but don’t know if they was the right thing to do."}, {"username": "Catherine Schembra Gaeta", "comment_text": "Travel light and rent a car, best way to travel; even to multiple countries."}, {"username": "Nina De Martino McDonough", "comment_text": "We are gonna travel from Genoa to Naples and Naples to Rome. I’m hoping that we will be able to figure it out."}, {"username": "Bob Cinquini", "comment_text": "Jackie Sapio"}, {"username": "Karen Lawrence Smith", "comment_text": "I suggest looking for YouTube videos of the trains you are taking. That is the best review you can get."}, {"username": "David King", "comment_text": "Well said; the potential/\nprobability of experiencing a train delay is very real!!\n\nWhen the train does arrive, you need to be on the platform, and alert."}, {"username": "Christa van der Merwe", "comment_text": "We experienced the same 2weeks ago.\nLuckily we traveled light.\nDelays yes boards and waiting fof gates... Yes"}, {"username": "Phillip Demarest", "comment_text": "I couldn't think of better places to be delayed in."}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson"}, {"username": "Robyn Cane", "comment_text": "Jessica Liston"}, {"username": "Darleen Jones Ellisor", "comment_text": "If you miss a connection because the first train was late, can you jump on the next one at no charge or do you need to book a whole new reservation?"}, {"username": "Lydia Springer", "comment_text": "Yes, I concluded early on that we would have carryon only for Italy because we will be taking trains."}, {"username": "Julie Innes", "comment_text": "Kane Innes"}, {"username": "Wendy Gauci", "comment_text": "Thanks for sharing, out of interest were these delays with Italo or Trenitalia?"}, {"username": "Sarah Azzato", "comment_text": "Anthony Azzato"}, {"username": "Judy Grayson", "comment_text": "Recommend to travel as light as possible, a small carry on (21\") on 360 wheels and a backpack... you can wash your clothes and ship any souviers back to your home, most shops will ship for you for a fee... travel light folks!!"}, {"username": "Marie Marsh", "comment_text": "We did our first trip around Europe by train and I agree never again it was terrible. But of course the end of day results were worth it."}, {"username": "Sarah Purcell Schen", "comment_text": "Sam Schen"}, {"username": "Robyn Gregory", "comment_text": "Following!"}, {"username": "Jenny Payne", "comment_text": "I never travel with lots of luggage, first you have to carry & secondly it’s hard work .🌻"}, {"username": "Janet Borrello Peppard", "comment_text": "Yes agree with the above. Make sure you can lift your luggage above your head! Get to the train station early and know the train number (not just your destination) so you can find the “binario” or platform as soon as it is posted. The Trenitalia app is helpful too….sometimes the platform gets posted there too. And know your carriage and seat number. You may want to take a screen shot or save your ticket to your apple wallet in case your WiFi isn’t working when the conductor comes around to check tickets.\nOnce we knew this we found the trains super easy!"}, {"username": "Michela Esse", "comment_text": "Travel to Italy with empty luggages and fill with fashion italian clothes/iconic bags and shoes..at the end go back with full luggages"}, {"username": "Sabrina Perry Zeidman", "comment_text": "Hayley Zeidman"}, {"username": "Desiree Elliot-Wilson von Dresselt", "comment_text": "Thank you for this"}, {"username": "Desiree Elliot-Wilson von Dresselt", "comment_text": "Can anyone summarise / suggest what a woman should pack for three weeks in Italy, September, travelling solo, this is the worst task! Jeans? Shoes?"}, {"username": "Desiree Elliot-Wilson von Dresselt", "comment_text": "Thank you for the advice"}, {"username": "Jennifer Herringer-Johnston", "comment_text": "Do hotels typically have laundry facilities? Or are people typically washing clothes in the hotel sink? Im heading to Italy at the end of August and definitely don’t want to over pack!"}, {"username": "Loretta Georgiadis", "comment_text": "That is such a big help! Thank you for this information."}, {"username": "Robyn Lawson", "comment_text": "Thanks Krissy. All helpful comments!"}, {"username": "Cathrine Marsh Cashwell", "comment_text": "Cathrine Cashwell Lowery Philip Clay Cashwell. I’m going to purchase a smaller suitcase."}, {"username": "Diane Davis Lawyer", "comment_text": "Which trains were the ones you had to stow your luggage away from you? Everything I read says to keep it as close as possible at all times, even on high speed trains. Ugh. Thanks!"}, {"username": "Pao Magnoler", "comment_text": "You have to keep it light when you travel to Europe, just take what you need. You have a lot of high hills, stairs, walking. That's a tip everybody should keep in mind. I know sometimes it's hard. Next time you go you will travel with lighter."}, {"username": "Sande Ricci", "comment_text": "We did carryon only. The train stations with broken or no escalators or elevators were hard even with those. I can't even imagine trying it with large suitcases."}, {"username": "Bambi Harris", "comment_text": "We have three trains in a row the day we arrive, this doesnt give me hope haha but thanks for the advice!"}, {"username": "Sam Mah", "comment_text": "Try to only pack a carry-on suitcase (with maybe 1 x bag that you can twist onto the handle when you're walking). It is very doable. We have been travelling for 3+ months with this set-up and there are still some clothes I haven't even worn."}, {"username": "Alyson Alai", "comment_text": "Helpful comments."}, {"username": "Dixie Kotylak", "comment_text": "Trains were a new experience for me! All tips are welcome, next time I go I will have better understanding 👌🏻👌🏻👌🏻"}]}, {"id": "2204471796618565", "text": "Can someone recommend houses that you have rented in Puglia closer to the beach if possible. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2204471796618565/", "likes": 0, "comments": [{"username": "JoLynn Waters", "comment_text": "B&B Lungomare Otranto is right across from the beach free an lido.\nSottovento Luxury Hotel - Torre Lapillo. Right on the beach"}]}, {"id": "2204472343285177", "text": "Does anyone have an email address for Coop Culture? I filled out their online form asking a question about a specific Colosseum tour but I’ve gotten no response. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204472343285177/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "This is the email addy that I corresponded with: info@coopcultur\ne.it"}]}, {"id": "2204473633285048", "text": "I'm flying into Rome, taking train to Florence and then to Venice, over 12 days at Christmas, 2023. We fly back to the US from Paris. I'm trying to figure out whether we should fly from Venice to Paris, to maximize our time in Paris, or is there some cool train ride through the Alps during winter, say Venice to Zurich, or Milan to Zurich, and we could fly to Paris from there? I'd love to see the Alps in winter. I've been looking for trains that might allow me to experience winter through a window but can't get the info.", "link": "facebook.com/groups/1373361046396315/permalink/2204473633285048/", "likes": 4, "comments": [{"username": "Deborah Schroeder", "comment_text": "Look at Rome2Rio website. It shows routes and that might help."}, {"username": "Elena Eckley", "comment_text": "We took the ORIENT EXPRESS from Paris to Venice. I am certain it goes the opposite way. It was an awesome trip but $$$"}, {"username": "Michael Widjaja", "comment_text": "There must be a train from Milan centrale to Zurich…\n\nFew years ago I took the Milan to Paris night train"}, {"username": "Brenno Bianchi", "comment_text": "There are daily trains between Venice/Milan and many different Swiss cities.\nThere are also some direct high speed train between Milan and Paris passing through the Alps.\nThe most spectacular and famous Alpine train though is the Bernina Express."}, {"username": "Karen Schmidt", "comment_text": "We flew ( also same time of year). One hour vs 18"}, {"username": "Michela Zanni", "comment_text": "From Milan to Paris there are some trains (French TGV or Italian Frecciarossa) with stops in Turin (IT), Modane (FR), Chambery (FR), Lyon (FR)"}, {"username": "Gary W Anderson", "comment_text": "There probably will be some restrictions on train travel in December. You can take a day trip into the Dolomites (Italian Alps) from Venice so to be safe fly Venice to Paris and watch as you fly over. You could risk the cheapest prices and get there and see the conditions before you decide."}, {"username": "Ishbel Raffle", "comment_text": "You can change trains in Milan and Zurich and reach Paris on the same day. I think I would spend an overnight in Zurich- I’m sure it would be lovely at Christmas"}]}, {"id": "2204481593284252", "text": "We leave for Rome the end of the month!! I'm so excited!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2204481593284252/", "likes": 60, "comments": [{"username": "Beatriz Davalos Moreno", "comment_text": "That's awesome! Congratulations\n!"}, {"username": "Patricia Ann Stuart", "comment_text": "Congratulations\n!!!❤️"}, {"username": "Marie Cuzzi", "comment_text": "Good for you!!! You’ll love it!!"}, {"username": "Susan Laspata Hoffman", "comment_text": "Susan Laspata Hoffman"}, {"username": "Wendy J. Calvin", "comment_text": "Have an amazing time!!!!"}, {"username": "George Haenisch", "comment_text": "Have fun\nRide public transit"}, {"username": "Laura Callahan", "comment_text": "You will love Rome! Be sure to visit The Vatican and the coliseum! Enjoy 😊❤️💃"}, {"username": "Vivienne Smith", "comment_text": "Use the hop on hop off bus. Worth every penny"}, {"username": "John Mazurek", "comment_text": "👍👍👍 one of my favorite cities in the world!"}, {"username": "Keri Davis Frady", "comment_text": "I am leaving September 27th! Sooooo excited! Have fun!!!!"}, {"username": "Toni Tucci Corsanico", "comment_text": "Me too!!"}, {"username": "Evy Fredy", "comment_text": "Have fun! Such a beautiful city 🌸🌸"}, {"username": "Manuela Teves", "comment_text": "Me too !"}, {"username": "Edith Mogrovejo", "comment_text": "Enjoy your trip!!!"}, {"username": "Eileen Muro", "comment_text": "So excited for you! You're going to love it. We juat came back."}, {"username": "Annette Reyes", "comment_text": "Have a wonderful time! We leave in 3 wks, so stoked!!! 🇮🇹🫶🏼🥰"}, {"username": "Joe Laricchia", "comment_text": "Have a great time"}, {"username": "Jack Giacomo Avondo", "comment_text": "Jack Giacomo Avondo"}, {"username": "Linda McShane Payne", "comment_text": "2 weeks for us!!"}, {"username": "Lorraine Hender-Dennert", "comment_text": "Awesome, we leave in 6 weeks. Cant wait!"}]}, {"id": "2204480789950999", "text": "Looking for transportation recommendations for party of 6. Arriving in Milan, then traveling to Lake Como, Monte Carlo, Portofino than back to Milan. Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2204480789950999/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "When?"}]}, {"id": "2204482533284158", "text": "Can someone explain the difference in these options. I want to book my transportation ahead of time. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204482533284158/", "likes": 5, "comments": [{"username": "Stephen Dawson", "comment_text": "if you hit the information button you will see the fare conditions essentially some are changeable and refundable and some are not"}, {"username": "Ashley Martins", "comment_text": "The refund and allowed changes are different for the various fares. They list each fare on their website where you can read difference.\n\nhttps://\nwww.trenitalia.c\nom/en/html/\ntrenitalia/\nInfo_Tariffe_en_\nLeFrecce.html"}, {"username": "Jim Bobrowski", "comment_text": "Special frecce is an early release ticket. If you book it you can make no changes and get no refunds if you miss or can't make it. Really cheap. We got special frecce for our trip, well worth it if it's business class. Also flip that toggle before you hit proceed to be able to pick seats. Costs 2 eu extra per seat"}, {"username": "Elena Innocenti", "comment_text": "Different kind of policy\nF.E. senior is for over 65years old (i think)\nFrecciayoung for young people\nMe&you if you buy 2 ticket\n\nSuper economy, economy and base have different refundable policy (or no refundable) and the cheeper do not allow exchanges date/time\n\nIf you click on (i) find the information about different offer"}, {"username": "Jacqui Hodge", "comment_text": "If you click on the little circle beside each one it will indicate changeable and refundable -either with a check mark or an X.\n\nDon’t forget you can choose your seats too. Usually shows at the bottom. Click on it to move it so you can choose seats."}, {"username": "Lauren-Jade Roberts", "comment_text": "You need to press the little I"}, {"username": "Debbie Potter", "comment_text": "Thank you for asking because I was wondering the same thing."}, {"username": "Kathy Tully Sexton", "comment_text": "I booked my son and his friend the “speciale frecce” which was even an upgraded class and it was less than half price for the two of them. Grab it while it’s available."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204491479949930", "text": "I want to share what I think may be helpful for a family travelling to Italy. My husband and I (in our 50's), along with our 2 sons (21 and 18) spent 11 very full days in Italy. We flew from Canada direct to Frankfurt, Germany then got on a train to Zermatt, Switzerland where we spent 1 night. It was a quaint little town with a cog train to take you to the Matterhorn! AMAZING!\nFrom there we traveled by fast train, trenitalia, through Italy. When booking our trip, I wanted hotels that were in the town centers so we could immerse ourselves in Italian culture and walk or hop on a bus, metro or cab to get around. We didn't want fancy or pools or anything like that. Just clean, authentic, air conditioned, great location. In Rome we stayed in a former monastery called Casa Cappuccini. It was VERY plain but clean, great location. We had a family room with 1 queen bed and 2 twin beds. AC worked great and it had an elevator, very friendly staff, no breakfast included but a restaurant right across the street. It was also steps away from a taxi stand, the metro train and the hop on hop off bus stop. And only a walk to lots of restaurants, trevi fountain. If you want fancy, this is not for you but for us it was perfect and we would stay again.\nNext, we went to Sorrento and stayed at Hotel del Corso. This hotel was in the center of town and a short walk from the train station, the town square, lots of shops and restaurants, and the marina where you can pay to go to a beach club or catch a ferry or boat to other destinations. This hotel was also very old but clean, had an elevator and AC. We loved the authentic Italian feel, the owners were super kind, helpful and friendly and buffet style breakfast was included. There was a washer and dryer on site as well that you could pay to use which I did as it was near the end of our trip! This hotel had a beautiful terrace overlooking the street and town Square. Bfast was served here. At this hotel we opted for 2 rooms, one with a queen bed and one with 2 twins. Both very clean. I hope this post will help someone looking for a similar experience. Our goal was to really experience Italy, the history, the food, the people, the charm and everything that makes it so different from modern North America.\nIf you are looking for modern or to spend a lot of time at your hotel, these options are probably not for you. I hope you love Italy as much as we did! 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2204491479949930/", "likes": 203, "comments": [{"username": "Dana Talusani", "comment_text": "Very helpful stuff! Thank you!"}, {"username": "Lisa Wylin", "comment_text": "Sounds excellent to me, I made note, thanks🥰"}, {"username": "Margo Desjardins", "comment_text": "Me to ,I love it and will check it out going in April. Thanks"}, {"username": "Holly Day", "comment_text": "Very helpful!!"}, {"username": "Khan S", "comment_text": "Thankyou!\nCould you please share the link/contact details of the place you stayed in Rome?"}, {"username": "Paula Scholz", "comment_text": "Sounds perfect! Great idea to keep it simple & great locations"}, {"username": "Pat Smale", "comment_text": "How was using bus and train?"}, {"username": "Norma Boily", "comment_text": "Your post is right on time for us … thank you so much for taking the time to share."}, {"username": "Bonnie Lawther Burman", "comment_text": "So helpful thank you. We also travel with our two young adult children so three beds are always needed."}, {"username": "Tamira Kothari Barnes", "comment_text": "Thanks for sharing ! Very helpful !"}, {"username": "Connie Anita Oppal", "comment_text": "Thanks for sharing 🤗"}, {"username": "Emily Biagioni Manucci", "comment_text": "Wow! Thank-you this is very helpful & exactly what my family & I are looking for. We also have two sons 19 & 22 and not looking for anything fancy."}, {"username": "Carla Epifani-Worthy", "comment_text": "Very helpful post. This is the type of travel that is not always mentioned or reviewed in this group. Thanks for sharing . I’ve been looking at monastery stays so it was good to hear that it worked well for you in Rome."}, {"username": "Alexandra P", "comment_text": "Thank you for sharing"}, {"username": "Yhele Apidga", "comment_text": "Thanks for sharing"}, {"username": "Josephine Rauch Rotunda", "comment_text": "Such a refreshing review of your time in Italy… Our travels are very similar. It’s nice to read about your experiences in seeing the country rather than reading about making reservations and what to wear for dinner and can you wear shorts etc. etc. etc. people worry too much about, the incidentals rather than focusing on experiencing the country."}, {"username": "Rainy Setiawaty", "comment_text": "Thank you for sharing. Exactly what we need for our Christmas 2023 trip."}, {"username": "Suzanne Spencer", "comment_text": "Thanks for sharing 😊"}, {"username": "Diana Radin", "comment_text": "Sounds like you had a wonderful time… great post… thanks for sharing"}, {"username": "RajShekhar Reddy", "comment_text": "How is the zermatt, Swiss. We are planning for it but is there any feasible best way to make it here from paris. We are 6 adults and 3 kids under 2 years. Which hotel is good to stay with kids"}, {"username": "Andisuari Dewi Sucahya", "comment_text": "Thanks for sharing.. this is me exactly.. so helpful."}, {"username": "Margaret Fullriede", "comment_text": "A great way to see Italy!"}, {"username": "Athena O'Connor", "comment_text": "Thank you for sharing. This was very helpful 😊"}, {"username": "Cyndi Riley", "comment_text": "Thanks we are going for 10 weeks next spring. We too are traveling that way to make our dollars stretch. Clean & A/C a must and great reviews. So exciting. We travel a lot and only use these places to sleep. Our time will be spent exploring."}]}, {"id": "2204496383282773", "text": "Any recommendation how to get from Lignano Sabbiadoro to Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2204496383282773/", "likes": 0, "comments": [{"username": "Vivien Paulik", "comment_text": "Train. From there to Venezia Santa Lucia Station"}, {"username": "Ingrid Zancoli", "comment_text": "Better taking a train. Look for trains stopping in Latisana (the closest train station) or San Giorgio di Nogaro and heading towards Venezia Santa Lucia."}, {"username": "Isidora Sadzakov", "comment_text": "Thanks for the info."}]}, {"id": "2204496916616053", "text": "When we do the Vatican etc on a morning is it better to do St Peter’s first or the Vatican.", "link": "facebook.com/groups/1373361046396315/permalink/2204496916616053/", "likes": 0, "comments": [{"username": "Liz Anne", "comment_text": "Vatican Museums first. Then you can enter St. Peter's right from there. Go as early as possible!"}, {"username": "ארז בן טובים", "comment_text": "The question is meaningless...s\nt. peter's basilica is in the Vatican. By \"the Vatican\" you probably mean \"the vatican meuseums\""}, {"username": "Claire Dowson", "comment_text": "I would do the museum first, then follow the walls around to St Peter’s square and join the queue to get inside St Peter’s. It is truly magnificent!"}, {"username": "Kelsey Larabie", "comment_text": "Any of the big sights are best first thing in the morning to avoid crowds. We did St Peters and the dome right at opening and it was amazing without tons of people."}, {"username": "Maddalena Rinaldi Stankevitch", "comment_text": "Do the Vatican Museums first thing in the am. Exit through Sistine Chapel to Basilica ."}, {"username": "Michelle Rigdon", "comment_text": "Personally I would’ve preferred doing St Peters and the Chapel first. Then deciding if I wanted to go through the museum. Unfortunately, I don’t know that there is a way to just do the chapel without the entire museum. You can see St Peters first though."}, {"username": "Evie Slavic", "comment_text": "Assuming you know about the no shoulders showing and the no knees as well? My friend had half her group turned away at the door."}]}, {"id": "2204499579949120", "text": "Hello! What's the uber situation in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2204499579949120/", "likes": 26, "comments": [{"username": "Jan Armstrong", "comment_text": "We found Uber was amazing in Rome - really reliable. SO great in the heatwave to be driven to and from in an air conned car. Worth every penny. We had a distraction scare on the metro where our wallet was taken but we realised . Shouted at the thief and they dropped the wallet - and the busses were packed so we either walked or got an Uber. Sometimes you may need to find the street they are picking you up from which will be close by- but check you can find the street before you accept the ride."}, {"username": "Tracy Hollar", "comment_text": "Can you get Uber in Naples"}, {"username": "Voula Ladas", "comment_text": "In Rome and Milan and it’s called Uber Black . Heard it’s alittle more expensive than regular taxis ."}, {"username": "Michelle White", "comment_text": "Uber is in Rome as is free now. Free now we had to do it a couple times for it to work. Usually they were €20 cheaper for us as a family of 5 than the Uber! Uber was faster at times when we tried free now and it told us no one was available several times."}, {"username": "Lydia Aceves", "comment_text": "Taxi please!!"}, {"username": "Jennifer Gustafson", "comment_text": "We averaged 8-12 miles a day walking. You can get a taxi/car service but it’s not as reliable and we only found them in Rome. We ordered private car service to visit Tuscany area."}, {"username": "Chelsea Gudith", "comment_text": "Very easy to get one on Rome."}, {"username": "Cecilia Sanzone Picone", "comment_text": "We used Uber in Rome just make sure you get charged the correct amount since last we ours was supposed to be 6euro instead was charged 81euro so I’m disputing it and I have a screenshot of our quote."}, {"username": "Michele Sica Selesky", "comment_text": "Not all of them in Rome speak English so that is definitely an obstacle."}, {"username": "Renato Grosso", "comment_text": "Freenow app the only way to go."}, {"username": "Rhonda Kurbis", "comment_text": "Not sure if they have Bolt, we used them in France & Spain. They were fabulous."}, {"username": "Sharon Grace", "comment_text": "I went to book a free now cab, from where I was 17 euro however before I committed I flagged down a white cab and it was only 9"}, {"username": "Lena Lai", "comment_text": "Not for Amalfi coast"}, {"username": "Tamta Meladze", "comment_text": "I used Uber several times in Rome, and was fine✅"}, {"username": "Vernell Carranza", "comment_text": "Never got one the entire 3weeks…tried but no luck ever. Taxi was the only way and that was tough in larger cities."}, {"username": "Luana Pellicano Maddalena", "comment_text": "FREENOW app worked great in Rome!"}, {"username": "Shannon Lopez", "comment_text": "What about Bolt??\n\nAre any of these options available in Venice?"}, {"username": "Debbie Thompson Rowland", "comment_text": "I used Uber in Florence and Rome in June 👍"}, {"username": "AnaLau Cavazos", "comment_text": "Currently in Italy.\nIt worked wonders in Rome\nNot available in Florence."}, {"username": "Carolyn Hall Raffo", "comment_text": "Absolutely great. I trust them more than the taxis."}, {"username": "Andrea Brown", "comment_text": "It’s Uber black only, Mercedes usually, so the nicer cars/ operates only in Milan, Rome and Bologna I believe at this time. Even so, it’s barely over the price of a taxi ( the app lets you compare ) and worked well."}, {"username": "Andrea Brown", "comment_text": "ITaxi and Freenoew are alternate apps but Uber also routes you to taxis if you opt out of Uber Black or it not available in the city you are in Italy"}, {"username": "Sandy Hookerman Kriger", "comment_text": "No uber￼￼in Florence, just Taxis"}, {"username": "Stacy Cotton", "comment_text": "My friend lives in Milan and her husband is originally from Rome. We went for their wedding in Rome then visited them in Milan after. They said FREENOW is most commonly used in Rome and itTaxi is most commonly used in Milan. We tried Uber and FREENOW to order a taxi in Milan and my friend’s husband had to order us one on itTaxi, it arrived within minutes and we were able to pay cash instead of through the app so he wasn’t charged.\n\nWe were able to get some Ubers in both cities but not consistently. Download and set up the apps before you go.\n\nWe didn’t even try in Florence, just walked everywhere. No cars available at Lake Como, we just walked and took boat transport to Bellagio. Taxi from the Taxi stand at the train station in Como wouldn’t even take us to anywhere else around the lake, only within Como. Venice, obviously, walk or public boat transport.\n\nMost cities also have bird and lime scooters/\nbikes. We did those several times in Rome and Florence. We also did the metro in Rome."}, {"username": "Paul N Marietta Dodson", "comment_text": "Walk and cabs at all train stations, much cheaper. Also, major cities have trains, busses, etc."}, {"username": "Tracy Jasas", "comment_text": "In my experience Uber only was able to be used in Rome. Everywhere else I used FreeNow App."}, {"username": "Christine Malota- Kendall", "comment_text": "The fares are pretty decent. If you reserve/book ahead it’s double in price because they are committed to picking you up. We’ve used Uber from pantheon to Vatican and cost $23 euro for 3. If we knew it was so inexpensive we would have used this earlier in Rome to help my 70 yr old mother get around the city."}, {"username": "Philip Curnow", "comment_text": "Uber will disappear from Italy shortly. Book a local and professional NCC driver for any personal trip. Failing that a taxi."}, {"username": "Eileen Thoma", "comment_text": "If you are using an Italian sim, make sure that while you are there, to update Uber app with your Italian phone number. So used to not doing that with other apps that it surprised me."}, {"username": "Oppa Ho", "comment_text": "Don't use it"}, {"username": "Gina Mingo Alfonso", "comment_text": "Used Uber in Sicily also… Palermo. No issues and cheaper than taxis.."}, {"username": "Shae Ann Hearn", "comment_text": "Got a Uber today from roma station and within 7 minutes it arrived"}, {"username": "Tara Roed", "comment_text": "Worked well in Rome. Free now never came through. Was great at train station when the taxi line was wrapped around and also ordered ahead when we needed to get to the Vatican super early in the morning. Only once was it expansive. We got a cheap\nTaxi outside the pantheon at the taxi stand 1x too."}, {"username": "Catherine Lackey", "comment_text": "Rome yes, Florence no."}, {"username": "Kateryna Fedyushkina", "comment_text": "Uber is always better in Italy ,but if you can :WALK,it’s Italy💖"}, {"username": "Beatriz Davalos Moreno", "comment_text": "you can use cabify, wetaxi, or uber in some places!"}, {"username": "Debbie Colacicco", "comment_text": "Non- existent"}, {"username": "Kristen Booth", "comment_text": "Uber was the best in Rome! Always there within 5 -8 min at most and cars very clean 🧼"}, {"username": "Karen Violet", "comment_text": "Works great in Rome. Leaving for Florence in a couple of days. Hope to have similar results."}, {"username": "Michele Rossman", "comment_text": "Not sure why people are telling you non-existent. Your UBER app can get you car, scooter or bike here that we have used. Super easy for bike or scooter and car tou have size options. Sometimes traffic makes them a little later than planned so a lot extra time if you need to. I have used FREENOW for a cab as well and that worked too. Some Uber car are nicer than others and same with taxis."}, {"username": "Jacqui Blake Briglio", "comment_text": "We used them in Rome with no problems. In Florence it was a longer wait. The wait averaged 25-35 minutes there."}, {"username": "Sabrina Sofia", "comment_text": "How much for a typical cab from trivi to S peters ?"}, {"username": "John Dobos", "comment_text": "Milan readily available..no luck in Florence."}, {"username": "John Bruckman", "comment_text": "Non existent take Taxis download We Taxi app"}, {"username": "Sheryl Elizabeth", "comment_text": "Found taxis cheaper tbh"}, {"username": "Matthew David", "comment_text": "Florence last week and Rome now, have yet to have an issue getting an Uber. Even got one on the outskirts of Florence at a wine tour."}, {"username": "Dorothy Press", "comment_text": "We used it in Rome."}, {"username": "Vikki Lawless", "comment_text": "We found Ubers fantastic - everywhere"}, {"username": "Marc Chomel", "comment_text": "Fugit about it"}, {"username": "Ray A Giraud", "comment_text": "Rome & Milan- Uber Black"}, {"username": "Cindy Millan", "comment_text": "FREENOW APP! Although it was tough to get a taxi the first few times"}, {"username": "Kristyn Jones", "comment_text": "I’m travelling in a group of 5 so a standard car is not possible - any suggestions on best way to manage this? Does Uber offer larger/6 seater vehicles or should I just book 2 Ubers 😄"}, {"username": "Angela Koots", "comment_text": "Uber Black was very reliable in Rome. We also used the Uber app to book regular taxis which were much cheaper but not as available.\n\nI would always try regular taxi on Uber app first and then if no luck, we did Uber Black."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "I see some people say Rome. It didn’t work for me there and Free now only worked 2 of the 3 times I tried. We did mostly taxis and that was hard too"}, {"username": "Patricia Hall", "comment_text": "None"}, {"username": "Lisa Steward", "comment_text": "We took taxi"}, {"username": "Sean Smith", "comment_text": "I found the normal taxis cheaper."}, {"username": "Joyce Iannicelli", "comment_text": "Is there Uber in Amalie coast?"}, {"username": "Amy Schmelzle Walsh", "comment_text": "Used Uber in Rome, Milan-- non-existent in Bellagio"}, {"username": "Anthony Bosco", "comment_text": "Depends where you are. Works great in Milan as a way to call taxi. In Trieste it didn’t work at all so we had to call a number for a cab. That was last week."}, {"username": "Chris Nichols", "comment_text": "It works great but only in certain cities. Sometimes it also gives you an option for taxis."}, {"username": "Brian Bratchie", "comment_text": "Used it all over Rome. Very reasonable."}, {"username": "Marcus Hiesler", "comment_text": "Here now. Seems non existent"}, {"username": "Sonal Parekh", "comment_text": "Used it in Rome a few times with no issues getting one!"}, {"username": "Judith Latemore", "comment_text": "Non existent and taxis are very expensive"}, {"username": "Sandy Radican Shikaly", "comment_text": "Rome and Milan"}, {"username": "Jennifer Goodwin Koss", "comment_text": "We used Uber in Rome one day. It was great."}, {"username": "Kelly Thuy-Trang Doan", "comment_text": "Great... I used it all over Rome, and the coast.\nAttached a Taxi Option too. Drivers are great with Mercedes & BMWs... which is impressive because imported like those are expensive in N. America"}, {"username": "Brenno Bianchi", "comment_text": "Uber exists in some city only as Uberblack and it is around the 50% more expensive then a taxi on the same route.\nIn other cities, like Rome I think, it is possible to use the uber app to call normal taxis.\nTaxi app easily found in many cities are Freenow and ItTaxi."}, {"username": "John Green", "comment_text": "Used cabs with no issues. It taxi app. Look for taxi stands. Very well marked. Look for taxi number and taxi company stickers on the side of the car"}, {"username": "Paolo Macera", "comment_text": "I used it in Rome, tried both Taxi and Uber.\nStarting and ending at the same exact place… cheaper with Taxi … but that’s my experience."}, {"username": "Katie Ewers", "comment_text": "Uber worked very well for me, nice and clean cars and nice drivers. This was in Rome."}, {"username": "Tilla Olivier", "comment_text": "No ubers"}, {"username": "Larisa Layvant", "comment_text": "Taxi at taxi stand only"}, {"username": "Allison Carter Whiteman", "comment_text": "We are in Rome at present have found Uber way more reliable than freenow. More often than not free now would “reject” our request. Uber always came within 5 mins"}, {"username": "Seda DC", "comment_text": "itTaxi app for taxis. Better than Uber and freenow, and cheaper"}, {"username": "Julie Tran", "comment_text": "Only in rome"}, {"username": "Anna-Maria Orodan", "comment_text": "It does exist!\nI used it in Rome, Bergamo and few days ago in Bologna."}, {"username": "Kim Hull", "comment_text": "I used it yesterday in Rome and it connected to something called ItTaxi. Worked fine."}, {"username": "Marty Harte", "comment_text": "I’m using Uber all over Rome. About 2-4 euros more but I like it.\nNaples yesterday. No Uber at all."}, {"username": "Tina Ferrari Cuva", "comment_text": "Present in Florence but seemed more expensive then the taxis and harder to get."}, {"username": "Eileen Lonergan", "comment_text": "Not great"}, {"username": "Michelle C. Perez", "comment_text": "How about in Naples?"}, {"username": "Laura Arboleda", "comment_text": "Thank you everyone!"}, {"username": "Fernando Leon", "comment_text": "Take taxis in the taxis Station. Is better ."}, {"username": "Jenna Morgan", "comment_text": "Ubers are good. Don’t try to get a taxi through the Uber app even though it says they are available / they cancel constantly we found, in rome."}, {"username": "Sephora Cutajar", "comment_text": "In Rome works great! Other areas so and so"}, {"username": "Rochelle Winsor", "comment_text": "Buses , and trains are easy"}, {"username": "Diana Şerban", "comment_text": "We were in rome last week and at 3 am we found an uber after 30-40 min of waiting… very bad. Happened multiple times"}, {"username": "Julchen Zamora", "comment_text": "Everywhere you see a TAXI sign\nDon’t stress over it. Currently in Venice was in Florence & Rome"}, {"username": "Kevin Derrick", "comment_text": "Non existent"}, {"username": "Fuad Osta", "comment_text": "I used it last year in Rome and was so good!"}]}, {"id": "2204500259949052", "text": "Wondering if anyone has experience with Ennio at Positano -Capri boat tours. I asked for a quote/ reservation and Ennio sent me a message on WhatsApp, then different link for payment and a request tor a credit card as a guarantee.\n\nAlso looking for recommendations for sunset group cruises including a good few hours on Capri and swimming / snorkeling\n\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2204500259949052/", "likes": 1, "comments": []}, {"id": "2204502579948820", "text": "We have bought train tickets on Omio. My husband did not put his middle name for the ticket. Will that be a problem. He’s tried adding it, but has had no luck. Do you need to add middle name when making train reservations with any of the trains?", "link": "facebook.com/groups/1373361046396315/permalink/2204502579948820/", "likes": 3, "comments": [{"username": "Ane Michaela", "comment_text": "You'll have no issues. They don't check the names, just the barcode :)"}, {"username": "Isabelle Panagapka", "comment_text": "My middle name was spelled wrong on our train tickets and I was very worried about this. Our tickets were scanned on all 4 of our train trips, but not once were the names checked."}, {"username": "Karen Albertyn Wood", "comment_text": "They don’t check names"}, {"username": "Michael Galan", "comment_text": "You're good"}, {"username": "Brenno Bianchi", "comment_text": "Trenitalia and Italo ask for your name and the train conductor can even check your ID, but it never happens. It just a system to make more complex for bots to buy the ticket when discounted and resell them later. It is just a anti ticket scalping practice."}, {"username": "Laura DeCicco", "comment_text": "We were never asked for our names"}]}, {"id": "2204505626615182", "text": "Hi planning our holiday now for end Sept/Oct. Looking at the tickets to buy for The last supper & Duomo. There are fast track & skip the line. I understand Fast track to be a separate line (as in Disney) but what’s skip the line? Is it for those that have prepaid tickets, which they suggest you do in any case? We arrive late afternoon and have a full day before moving on and we want to go to lake como as well🙄.", "link": "facebook.com/groups/1373361046396315/permalink/2204505626615182/", "likes": 2, "comments": []}, {"id": "2204506269948451", "text": "Riomaggiore. La galleria tra la via principale e la stazione ferroviaria #reels #reelsinstagram #instagram #trending #viral #explore #love #instagood #explorepage #reelitfeelit #follow #photography #आणखीfyp #reel #instadaily #reelsvideo #like #memes #foryou #music #facebookreels #facebook #facebookviral #reelsviral #reelsviralvideo #reelstrending #trendingnow #reelstrendingvideo #facebookpost #riomaggiore #monterossoalmare #manarola #corniglia #vernazza #cinqueterre #laspezia #reels2023 #ristoranteilgabbiano #paanokumitasafacebookreels #facebookreelssahod #facebookreelsearnings #metaverified #metaverifiedaccount #facebookreelsmonitization #facebookreel #fbreels #facebookreelssettings #facebookreelsincome #facebookreelsplaybonusprogram #facebookreelsvideo #facebookreelseligibility #facebookreelsviral #facebookreelspayout #facebookverified #bonassola #levanto #adsonreelsfacebook #adsonfacebookreels #adsonreelsmonetization #monterossobeach #monterosso", "link": "facebook.com/groups/1373361046396315/permalink/2204506269948451/", "likes": 0, "comments": []}, {"id": "2204509016614843", "text": "When traveling in Italy and using Airbnb how do you secure your important items? Most do not have safes.", "link": "facebook.com/groups/1373361046396315/permalink/2204509016614843/", "likes": 7, "comments": [{"username": "Vivien Paulik", "comment_text": "What items? And just leave in your lugagge and in the wardrobe"}, {"username": "Krissy DaRusso", "comment_text": "I carry my passport with me at all times, as I would if staying in a hotel."}, {"username": "Etschi Bruckner", "comment_text": "don´t bring the crown juwels! 😁"}, {"username": "Janet Sadowski- Carloss", "comment_text": "My daughter ordered this from Amazon - you can secure it with an attached lock (similar to a bicycle lock)"}, {"username": "Miyuki Kanno Paul", "comment_text": "Leave all expensive jewelry at home when traveling. We purposely wear inexpensive watches, for example. Every time I see an American tourists(especi\nally female) wearing noticeably big rock in her hand, I fear for her.\nWe carry our passports with us all the time, by the way"}, {"username": "Chantal Adams", "comment_text": "I carry my passport on me always the rest stays in the AirBnb"}, {"username": "Jenn Messina Babore", "comment_text": "Just lock up your bag if your worried about losing something. We never were concerned with our AirBnBs."}, {"username": "Julie Tran", "comment_text": "Bring a security lock for your luggage"}, {"username": "Donna Dougherty", "comment_text": "I was just in Italy for 21 days. Stayed at Airbnb’s felt very comfortable the doors lock I have a key I carried my passports wherever I went."}, {"username": "Rachel Cox", "comment_text": "My suitcase has a lock on it if needs be. I feel like a reputable Airbnb is more secure than a hotel though, where so many people have access to your room."}, {"username": "Sonia Smith", "comment_text": "I usually put thing in a pack inside another pack in my suitcase."}, {"username": "Chuck Morton", "comment_text": "How do you secure your important things at an AirBnB in the US? Procedure would be the same in Italy."}, {"username": "Jackie Ames", "comment_text": "I’ve stayed in three Airbnb in Italy I’ve never felt like my things were unsafe. Although , I did find a few hiding spots within the homes"}, {"username": "Betty Stilt", "comment_text": "Get an Airbnb with a safe. Many have them."}, {"username": "Rip Lonergan", "comment_text": "I have probably used Airbnb’s more than 50 times over the years and have not had an issue so far. We keep things in our suitcases. We always rent exclusive use Airbnb, not just a room in someone’s house."}, {"username": "Jenny Payne", "comment_text": "I use my case with a zip tag that has a code on them🌻 so far I have been lucky as I go to Italy a lot and never had a problem 🌻"}, {"username": "Linda Arnold", "comment_text": "Thank you for sharing!!!"}, {"username": "Shari Osborn Klarich", "comment_text": "I think your biggest worries should be public transportation and walking around crowded places. We wear pickpocket proof clothing. We’ve been to Europe more times than I can count and have never had a problem."}, {"username": "Sharon Milligan Martin", "comment_text": "Don't take things that are of value."}, {"username": "Frank Hunt", "comment_text": "Don't do Airbnb if you have important items"}]}, {"id": "2204512149947863", "text": "How do u recommend a trip to Rome & Florence & Venice during Christmas & New Year? Weather and everything", "link": "facebook.com/groups/1373361046396315/permalink/2204512149947863/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "Yes. A thousand times yes."}]}, {"id": "2204517776613967", "text": "Traveling to Sorrento in October with a group of 15. Looking for restaurant suggestions (would like to book reservations ahead of time because of our large group size) where the food is good, atmosphere is excellent, not $$$$$ and within walking distance of Central Wellness Hotel. Thanks in advance!!!", "link": "facebook.com/groups/1373361046396315/permalink/2204517776613967/", "likes": 0, "comments": []}, {"id": "2204519873280424", "text": "When in Amalfi", "link": "facebook.com/groups/1373361046396315/permalink/2204519873280424/", "likes": 450, "comments": [{"username": "Gabrielle Goodenough", "comment_text": "4 hours to climb back up🤣"}, {"username": "Sonia Dussault", "comment_text": "Anne Pellerin 🤣"}, {"username": "Jo Place", "comment_text": "Kathleen Reid"}, {"username": "LaDonna DeLaune", "comment_text": "And then carrying all the beach stuff🫨"}, {"username": "Olivia Tanna", "comment_text": "Devin Barui Janetta Dianne"}, {"username": "Morag Harkness", "comment_text": "🤣🤣🤣🤣🤣"}, {"username": "Kathy Curcio", "comment_text": "Nikki 'Edwards' May not this one"}, {"username": "Pearl Lucero", "comment_text": "Pearl Lucero"}, {"username": "Ella Matheson", "comment_text": "Ryan Mcdermid"}, {"username": "Emily Moffitt", "comment_text": "Jack Hayes the walk home"}, {"username": "Danielle Famelart", "comment_text": "ça ne ressemble pas du tout à Amalfie une vraie joke 😂😜"}, {"username": "Nicole Webb", "comment_text": "Clayton Webb one way to get rid of your wife…. Knowing how clutsy I am"}, {"username": "Jen Parks Rugh", "comment_text": "That’s awesome 😂"}, {"username": "Telma M. Moritz", "comment_text": "😀"}, {"username": "Jason Richardson", "comment_text": "Katie Richardson"}, {"username": "Joe Reams III", "comment_text": "Kathy Holden Reams how’s that knee?"}, {"username": "Angela Wenceslaus", "comment_text": "Omg 😱"}, {"username": "Chantel Gill", "comment_text": "Rekeish Gill"}, {"username": "Lani Jay", "comment_text": "haha funny! Sarah Bates Tammy Nitz Cassie Keyte Stewart Marsh"}, {"username": "Shiloh Coccodrilli", "comment_text": "Haley Grove"}, {"username": "Susan Murray", "comment_text": "zipline!"}, {"username": "Mariolina Bruno", "comment_text": "Rocco Longo and Mechelle Longo Ponte sounds like the stairs you told us about. Yikes!! Makes me dizzy just looking at it"}, {"username": "Emilia Johns", "comment_text": "Sally Hopper, Maria Giovanna imagine if we had this place in Sorrento"}, {"username": "Suzanne Johnston", "comment_text": "Suzie Johnston"}, {"username": "Linda Eligh", "comment_text": "I think we stayed there…"}, {"username": "Jennifer Cook", "comment_text": "Sean Russell Kathy Zink Russell🤣"}, {"username": "Graham Sherlock", "comment_text": "Amalfi Coast is hard work, people have no idea, I think it's best viewed on websites, the beaches are crappy, for me it's totally over rated"}, {"username": "Anne Chapman", "comment_text": "Piper Chapman"}, {"username": "Maree Shears", "comment_text": "We had 85 steps to our room in atrani..but this time was much better"}, {"username": "Tiana Alexandra Atkins", "comment_text": "Wil Atkins"}, {"username": "Sharyn Wright", "comment_text": "Abbey Wright Tess Wright"}, {"username": "Geri Reyes", "comment_text": "Danny LY"}, {"username": "Joanne Krauter", "comment_text": "So funny. Makes me scared just looking at this picture."}, {"username": "Deea Cata", "comment_text": "That’s an expensive “gym” haha"}, {"username": "Kim Jordan", "comment_text": "Sux if you need a new fridge"}, {"username": "Paula Houghton", "comment_text": "Not for me"}, {"username": "Karen Smart", "comment_text": "I remember looking at all the stairs to the houses thinking.. I would hate to have to carry groceries up there!"}, {"username": "Fay White", "comment_text": "Oh no.no way.imagine coming back up after cooling off at the beach⛱️ not my idea of a relaxing holiday 😎"}, {"username": "Deanna Hitchman", "comment_text": "Leonie Browning 🤣🤣🤣"}, {"username": "Tania Duval", "comment_text": "Perfect view. I'd do it."}, {"username": "Elise Falzon", "comment_text": "Donna Maree Starkey"}, {"username": "Meredith Williams", "comment_text": "😳😳😳😳"}, {"username": "Lynette Pitt", "comment_text": "Julie McIvor 😳"}, {"username": "Janis Sell", "comment_text": "Nelio Di Vincenzo I ain’t going down these stairs. Unless you have other ideas! 🤣🤣"}, {"username": "Anne WB", "comment_text": "Flavia Curreli 😂"}, {"username": "Anne WB", "comment_text": "Martine Burkel 😂"}, {"username": "Meiian Lai", "comment_text": "Carolina Sousa甘綺雯"}, {"username": "Meg Dennis", "comment_text": "Jillian Dwyer Ivanka Andrews this! 🤣🤣🤣"}, {"username": "Dee Brough", "comment_text": "😂😂"}, {"username": "Beverly Bovo", "comment_text": "Beverly Bovo"}, {"username": "Adrienne Gemmill", "comment_text": "Hmm would not like to carry groceries 🤔"}, {"username": "Gloria Nerad Farvour", "comment_text": "This is funny Lynn Nerad Walker"}, {"username": "Maguire Aoife", "comment_text": "Noreen Cassidy"}, {"username": "Cindy Lawrence Pigno", "comment_text": "20 mins to get back up 🤣"}, {"username": "Paula Poisella", "comment_text": "Love it🤣😉"}, {"username": "Grant Grasmick", "comment_text": "My daughter just got back from Italy last Friday night."}, {"username": "Suna Er", "comment_text": "Leyla Er so glad I didn’t do this year - oh … my knees 😂"}, {"username": "Lynn Barnett Head", "comment_text": "Defibrillators posted along the way?!"}, {"username": "Stephanie Mason", "comment_text": "I way am I ever in that area."}, {"username": "Deacon Tom Lang", "comment_text": "Wow! And I thought our stay up on the hill in Vernazza was difficult. There better be EMTs at the top of those steps with mass quantities of oxygen ready!"}, {"username": "Franco Chocko", "comment_text": "This is why when in the Amalfi coast you stay in either Maiori or Minori - both have a port and are flat compared to most other towns on the coast. Just my opinion."}, {"username": "Terrie Tilotta", "comment_text": "I feel nauseous just looking at the photo! Serious fear of heights!"}, {"username": "Ville Lignell", "comment_text": "JACOB'S LADDER, ST. HELENA."}, {"username": "Pat Beaulieu Hickey", "comment_text": "I couldn’t do it"}, {"username": "Gary W Anderson", "comment_text": "But an hour getting home"}, {"username": "Judi Tevere", "comment_text": "Whoa!"}, {"username": "Lisa Normington Vitalo", "comment_text": "My knees were never the same after a week stay in Praiano. Stairs stairs and more."}, {"username": "Linda Paoletti Muszynski", "comment_text": "Patricia Pippa Nicosia-Banko !!!"}, {"username": "Paul N Marietta Dodson", "comment_text": "I think we walked down those stairs last year😅😂"}, {"username": "Nourhan Gamal", "comment_text": "Nourhan Ali"}, {"username": "Kelli Ann Barkett Magill", "comment_text": "Cat Nelson"}, {"username": "Michelle McCowan - Cathcart", "comment_text": "Chuck Cathcart"}, {"username": "Chris Rae", "comment_text": "Kerry Brown 🤣"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Still, I'll go there"}, {"username": "Justin Baker", "comment_text": "I would order Uber eats breakfast, lunch, dinner"}, {"username": "Kevin Stuart", "comment_text": "There's one thing you would be either very fit or dead"}, {"username": "Carol D'Alessandro", "comment_text": "omg🤣🤣🤣"}, {"username": "Myshell Wallaby", "comment_text": "Kaylene Sheedy we should rent this place"}, {"username": "Nicole Gallo", "comment_text": "Ang Gallo 🙈"}, {"username": "Cheryl Hodges", "comment_text": "Plenty of places, like this in Amalfi. Certainly makes you fit👏😄👏"}, {"username": "Eileen Felicelli", "comment_text": "Exactly"}, {"username": "Karen White", "comment_text": "😂😂"}, {"username": "Jessica Renae", "comment_text": "Lisa ML 😂"}, {"username": "Rose Tabekum", "comment_text": "I’m sure it’s not furnished because those steps hmm"}, {"username": "Mary Jade Chan", "comment_text": "So true 🤣😂"}, {"username": "Grace Romano", "comment_text": "Grace Romano"}, {"username": "Anita Lawrence Mundy", "comment_text": "Holy molie! No thanks."}, {"username": "Petra Keen", "comment_text": "💯 % true! 😂"}, {"username": "Sarah Kim Bogeski", "comment_text": "Nora Bart"}, {"username": "Nancy Cicinelli", "comment_text": "What's the price?"}, {"username": "Angela Emmitte Tripp", "comment_text": "True story...we stayed in Scala it was a 1500 steps DOWN to the water..we did it to say we did it...5 did the down and back up first night there...they were huffing and puffing when they got back up"}, {"username": "Maureen Rooney", "comment_text": "Summer Leigh Vince Menichino😳"}, {"username": "Tanya Heenan Gammon", "comment_text": "So true! But going up was worse!"}, {"username": "Stephanie Gumm", "comment_text": "True story 😂"}, {"username": "Steven Spigarelli", "comment_text": "This is hilarious 😂"}, {"username": "Annette Mallery Auteri", "comment_text": "Samantha Riethmiller\nMiranda Lin Riethmiller\nAlly Revetti"}, {"username": "Roger W Ilsley", "comment_text": "Funny"}, {"username": "Teresa Heran", "comment_text": "Accurate"}, {"username": "Sy Sandblom", "comment_text": "D Rochelle Milton"}, {"username": "Mike Adams", "comment_text": "I think I was there.\nActually it was Cinque Terra.\n\nThe staircase INSIDE the house was Beautiful black Marble. - but soooo steep and no handrail.\n\nWe did not bring luggage up to bedrooms . And feared for our lives every time we used it.\n\nAfter carrying my suitcases up . My back has never been the same"}, {"username": "Joan Conlan", "comment_text": "Oh my god I have the spins"}, {"username": "David King", "comment_text": "“…literally, a breath-taking view”😂"}, {"username": "Denise Castonguay", "comment_text": "Lara-Lee O'Shaughnessy"}, {"username": "Rita Sanza", "comment_text": "Rita Sanza"}, {"username": "Cristian Jimenez", "comment_text": "Karla 😄 o de un clavado jajaja"}, {"username": "Liza Vega Santos", "comment_text": "Liza Vega Santos"}, {"username": "Eileen Angileri", "comment_text": "Bianka Angileri La Mude I think we did a fantastic job with our accommodation.\nEma Angileri"}, {"username": "Shane Doocey", "comment_text": "Kelven O Gorman PTSD 🤣🤣🤯🤯"}, {"username": "Mark Filbey", "comment_text": "Build up those legs"}, {"username": "Liz Kimmick", "comment_text": "Travis Kimmick. lol"}, {"username": "Patty Stillwell", "comment_text": "They should install a water slide. Haha"}, {"username": "Jennifer Gustafson", "comment_text": "True story in Conca our cab driver dropped us off at the bottom of our location told us we had to climb to our rental 1500 steps up with suitcases. We did part of it 97 degree heat. Called our rental and they said no and came to pick us up and drove us right to the location. But we had 4 steep inclines to climb up each morning to go anywhere and 400 steps down to beach and then back out. So do your stair stepper before you go! Lol. Still was worth it! It’s absolutely beautiful there!"}, {"username": "Rachel Zamorano Bonet", "comment_text": "Anna Earnest"}, {"username": "Victor Hugo Canseco", "comment_text": "La belleza de las vistas no tienen precio ahí...valió la pena el esfuerzo de subir y bajar tantos escalones!!!!"}, {"username": "Leila Jane", "comment_text": "OMG!!!"}, {"username": "Michele Trial Westerman", "comment_text": "Wear gripper gloves"}, {"username": "Frannie Kaplan", "comment_text": "40 minutes uphill"}, {"username": "Lisa Westrope", "comment_text": "they should install a slide just to the side of these steps :D"}, {"username": "Deepti Kaul", "comment_text": "What was rent per night !!!!"}, {"username": "Kim Douglas", "comment_text": "Stuff that"}]}, {"id": "2204529279946150", "text": "Hello! I’m looking to fly to Trapani in June next year from London but can only find stansted .. just wanted to save further looking by asking those who know, if you can get a flight from Gatwick or Heathrow!? Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2204529279946150/", "likes": 1, "comments": [{"username": "Louis Des Forges", "comment_text": "No Ryanair is the only major airline from Trapani. The benefit of using this airport is there are never usually long wait times for airport security or passport control (only 2 destinations outside the Schengen zone)."}, {"username": "Alessandro Iannelli", "comment_text": "You can get to Stansted from london with a coach, they are fairly comfortable. Personally, I don't see a specific reason why one would necessarily want to travel from Heathrow or Gatwick. If anything, I prefer Stansted because it is smaller. Also, on a side note, it used to be easier to travel from and to the u.k., now you need a passport and it's a lot of work to get one, at least in Italy."}]}, {"id": "2204436206622124", "text": "Come explore Spello, one of Umbria’s most enchanting places! There is probably nowhere else in Italy that is so vibrant and adorable: Spello is an ancient Roman hamlet without comparison, a pretty floralआणखी village nowadays part of the club of “The Most Beautiful Villages of Italy”. You will breath in the art and history of this charming village.\nJoin us: https://nextstop-italy.com/virtual-tours/spello-flower-town/\n\n#italytrip #italytravel #vacationmood #virtualworld #medievalart #italyiloveyou #rollinghills #medieval #virtualtour #hilltopviews #umbriagram #umbria #hiddenparadise #umbriatourism #Spello #virtual #flowers #flowerstagram #flowersoftheday #gardenlove #gardenlife #gardeninspiration #hamlet #hiddenplaces #hiddengems #hiddentreasures #hiddenbeauty", "link": "facebook.com/groups/1373361046396315/permalink/2204436206622124/", "likes": 16, "comments": []}, {"id": "2164634633935615", "text": "Day Tour on a luxury catamaran to the Maddalena Archipelago from Palau\nDiscover iconic locations along the Maddalena Archipelago during this full-day shared excursion in a comfortable, restroom-equipped… आणखी catamaran. Highlights include a photo stop along the protected pink-sand Spiaggia Rosa, free time for snorkeling in the islands of Spargi and Razzoli, and a traditional Sardinian lunch onboard the boat, with both seafood and vegetarian options available.\nRead more about Day Tour on a luxury catamaran to the Maddalena Archipelago from Palau - https://www.viator.com/tours/Sardinia/Exclusive-Day-Tour-on-a-luxury-catamaran-to-the-Maddalena-Archipelago/d24293-28557P36?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2164634633935615/", "likes": 3, "comments": []}, {"id": "2204390309960047", "text": "Only one night in Venice. What’s for dinner? Best regional food and or restaurant suggestions??", "link": "facebook.com/groups/1373361046396315/permalink/2204390309960047/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Bistrot de Venise right in the heart of Venice."}, {"username": "Annalisa Croci", "comment_text": "Try local places for cichetti like osteria della vedova"}, {"username": "Liz Anne", "comment_text": "On Murano: Vetri"}]}, {"id": "2204378403294571", "text": "Umbria at its best", "link": "facebook.com/groups/1373361046396315/permalink/2204378403294571/", "likes": 7, "comments": []}, {"id": "2204376819961396", "text": "Renting a boat in Sorrento for a private day trip (8pp)...my quote is about 1600 euros. . How much is everyone paying and is it cheaper to get one the day of or before on the docks?", "link": "facebook.com/groups/1373361046396315/permalink/2204376819961396/", "likes": 1, "comments": []}, {"id": "2204361926629552", "text": "Anyone have experience with travel companies who book all travel through Italy? Some include some meals, bus travel from city to city, tours. Thanks for your help!!", "link": "facebook.com/groups/1373361046396315/permalink/2204361926629552/", "likes": 1, "comments": [{"username": "Lisa Wylin", "comment_text": "I did two different tours with Collette Tours- awesome! Just pack your bags and everything is taken care of.🥰"}, {"username": "Angela Marsala-Gaydos", "comment_text": "I am looking at Firebird Tours-small group tours"}]}, {"id": "2204329959966082", "text": "Taking a Mediterranean cruise in November and stopping in Rome, Naples, Sardinia. and Florence. I know there are a lot of excursion options, but wondering if it’s better to just plan and explore in our own? With limited time, what are your top recommendations? We love history, food and wine, hiking.", "link": "facebook.com/groups/1373361046396315/permalink/2204329959966082/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "You could consider a tour in Sardinia with a boat that takes you to the best secluded beaches. As for Naples maybe a tour that takes you to Sorrento and Pompeii which may be faster than going by yourselves"}, {"username": "Gary W Anderson", "comment_text": "Take tours to learn when you have limited time. Make reservations and skip the line tickets NOW."}, {"username": "Ana Ka", "comment_text": "I would go with a private tour (and not in every location as it would get exhausting) or with appy guide as i prefer to explore on my own…. it’s nice to be on your own schedule 😁"}, {"username": "Ana Ka", "comment_text": "Where are you in sardinia? Sardinia is gorgeous!"}, {"username": "Sonita Sandhu", "comment_text": "You are also limited with time at each port so it may be easier to do a tour at Rome and Sardinia. Naples and Florence you can do on your own."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204299426635802", "text": "Hi everyone.\n\nWe have 5 nights in a beautiful villa in September & wondering if anyone recommend a winery/restaurant in in the Poggibonsi area for my husbands birthday? 6 adults & 5 children under 7. We all arrive from different areas that day & our villa check in isn’t till 5pm, so plan to celebrate his birthday with a lunch beforehand.\n\nThanks so much💛", "link": "facebook.com/groups/1373361046396315/permalink/2204299426635802/", "likes": 2, "comments": [{"username": "Leopoldo Conti", "comment_text": "Tenuta Torciano, is the best you can get close by"}]}, {"id": "2204264453305966", "text": "I see a lot of posts on laundry in Rome. For the first time in our travel history, we brought only carry on bags and limited clothes so we’re not lugging large bags around Italy.\n\nIn Rome, we stayed near Romaआणखी Termini. There is a laundry service 2 blocks away that actually does the laundry for you. For a batch, they only charged us €8. Not only they washed and dried, but also neatly folded and put it in a bag. I dropped off at 8:30am and it was ready by 10:30am. Great way to drop off before your excursions and pick up when done. They’re open until 9pm I believe. Larger loads maybe few more euros but worth it as you don’t have to rely on self service and wait for 2 hours in a laundromat.\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2204264453305966/", "likes": 97, "comments": [{"username": "Dave Conroy", "comment_text": "People could have a way easier life on the road with just some simple research and pre-planning like this. Nice one."}, {"username": "Nadia Filice", "comment_text": "Near trevi fountain there’s a laundry mat that we frequently use. It’s called Target (Lavanderia). They was dry and fold. Drop off in morning and pick up later in the day."}, {"username": "Tara Roed", "comment_text": "Nice! I think this service is available in a lot of towns. Feel like I heard of one on the amalfi counts as well. As much as I travelled light I would go lighter next time"}, {"username": "Yvonne Ormson", "comment_text": "Yes—these wonderful laundry services are everywhere. I can’t imagine hauling suitcases full of dirty laundry around Europe 😬\nCarry on only and weekly laundry service is so lovely ❤️"}, {"username": "David Ahlborn", "comment_text": "Thank you for this great information! 👍"}, {"username": "Cheryl Tomkinson-Hunter", "comment_text": "Thank you for sharing your laundry experience!"}, {"username": "Lynette Leone Watkins", "comment_text": "Perfect!!! Thank you!"}, {"username": "Shelby Reyes", "comment_text": "This is so helpful! I am worried about overpacking for my trip"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "Did you get to choose how things were washed? (Hot Vs cold water?)"}, {"username": "Lisa Roth", "comment_text": "This place is great, too. Same general area, but a little further in. I had a bunch of laundry done as a drop off service too. Prices are okay, work done quickly!\n\nhttps://\nmaps.app.goo.gl/\nswY7BxnKXWsrjyFW\n8?g_st=ic"}, {"username": "Carol Taylor Tisdale", "comment_text": "Great info!!!"}, {"username": "Victoria Russo", "comment_text": "Good to know"}, {"username": "Kimberly Coury", "comment_text": "We are heading there now!! Thanks for the wonderful suggestion. It’s been so hot that I don’t want to take the stinky clothes on the cruise. 😁"}, {"username": "Anne Riemer", "comment_text": "Thank you for the info, Jay."}, {"username": "Ann Brahmani Bost", "comment_text": "There was a place like this right around the corner from my Airbnb in Piazza Navona. And, yes, they did follow instructions for water temperature and drying."}, {"username": "Rach LJ", "comment_text": "Would you mind sharing which carry-on you used? I am looking to get a backpack for my upcoming trip."}]}, {"id": "2204242379974840", "text": "Hi all, I am looking for suggestions for places which I can visit near Dolomites. We have rental car so mobility is not a problem.", "link": "facebook.com/groups/1373361046396315/permalink/2204242379974840/", "likes": 0, "comments": [{"username": "Geoff Northcott", "comment_text": "How long do you have?"}]}, {"id": "2204122106653534", "text": "Has anyone stayed in the Navigli area of Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2204122106653534/", "likes": 0, "comments": [{"username": "Corina Cristea", "comment_text": "Yes , it’s a good area"}, {"username": "Ana Ka", "comment_text": "With lots of great restaurants and bars!"}]}, {"id": "2204376596628085", "text": "Trenitalia runs the high speed trains. Which trains are regional ?", "link": "facebook.com/groups/1373361046396315/permalink/2204376596628085/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "The non highspeed trains which connect the regions"}, {"username": "Ramesh Mackenzie", "comment_text": "Italio is the high speed train"}, {"username": "Katalina Loredo", "comment_text": "Katalina Loredo"}, {"username": "Chiara Normanno", "comment_text": "Trenitalia, Trenord in the North, and few other small local companies such as Espresso"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Also trenitalia"}, {"username": "Mariella Elsano", "comment_text": "Intercity"}, {"username": "Ville Lignell", "comment_text": "The slow ones that stop just at anything resembling a station. However: they can be more reliable because they travel on secondary tracks and mostly unaffected by jams & delays that plague the high-speed major tracks."}, {"username": "Liat Feldman", "comment_text": "Frecciarosa is also a high speed train. You can find tickets on the trenitala website"}, {"username": "Pao Magnoler", "comment_text": "You will find in trenitalia also regional, you can ask or look at the board where all the information is. R: is for regional, IR: interegionale. FR: Frecciarossa."}, {"username": "Voula Ladas", "comment_text": "There are a few different names for regional trains in Italy, including (abbreviated with an R on train schedules), Interregionale (IR), Diretto (D), and Espresso (E)."}, {"username": "Pearl Lucero", "comment_text": "Look for Frecciarossa"}, {"username": "Nicole MacLellan", "comment_text": "Do both companies strike?"}, {"username": "Sandy Radican Shikaly", "comment_text": "Trenitalia and Italo have high speed trains"}, {"username": "Diane Davis Lawyer", "comment_text": "I just finished reading this on Italian trains. It's very well written and great info as well. It was updated last month. https://\nwww.tiltedmap.co\nm/\nitaly-train-trav\nel-guide-italia\nrail-trenitalia\n-italo/"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Also Italo.it"}]}, {"id": "2204374789961599", "text": "Can anyone share the contact info for a driver to pick us up at Naples airport tonight at 10:30pm and take us to our accommodation near the Naples port?\n\nI’ve looked at a bunch of tour companies and since it is so last minute it seems most are sold out.\n\nThanks in advance 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2204374789961599/", "likes": 0, "comments": [{"username": "Regina-Rich Krett", "comment_text": "Try Welcome Pickups"}]}, {"id": "2204366163295795", "text": "We are Canadian going to Italy this fall Our phone provider is Rogers Please tell me what to do , or how to use our phones as all our important travel info ( tickets ect ) are on our phones. Thank You so much", "link": "facebook.com/groups/1373361046396315/permalink/2204366163295795/", "likes": 10, "comments": [{"username": "Jules Earl-Rossiter", "comment_text": "Go for a Tim SIM they are excellent...l always buy one when lm in Italy...you can buy one from any Tim shop in Italy....they do a tourist SIM which is 14.99 euro's and lasts for 30 days it comes with 50 gb data and 200 minutes... 🙃"}, {"username": "Sabrina Hysa", "comment_text": "i stopped into Rogers the other day to ask the gentleman what I do on my phone while in Italy/ France. You have to keep it in airplane mode, then under the little airplane mode is the wifi, make sure it is on. The moment you turn your airplane mode off you are charged a day ( 24 hours)."}, {"username": "Kelsey Larabie", "comment_text": "Another vote for Airalo, and I’m from Canada as well.\nDownload the app and purchase your esim before you leave home. Then activate it on airport wifi once you arrive in Italy."}, {"username": "Lea Tenzer", "comment_text": "Buy Italian sim card..best option"}, {"username": "Virginia Haughan", "comment_text": "I am with Eastlink here in Nova Scotia ,any recommendations\n?"}, {"username": "Patricia Klimchuk", "comment_text": "I was in Italy last year. Have Roger's too. They have a plan for Europe. So much per day. Worked well. I would turn off the phone every other day ,if I didn't really have a need for it."}, {"username": "Venette Macalinao", "comment_text": "Canadian here as well; eSim is the way to go. Airalo. I’ve used it in Europe last year. And will be using it again when I visit Italy and Greece this summer."}, {"username": "Cindy Shore", "comment_text": "Is it true that if you have an iPhone you can send texts to other iPhones as it is iMessage and doesn’t cost extra?"}, {"username": "Laura Boyce", "comment_text": "Canadian going in September for 1 month. Airalo esim for sure. Very reasonably price. Download app before departing. All 4 of us in our party will be using Airalo."}, {"username": "Line Gregoire", "comment_text": "Buy a sim card upon arrival, it's the cheapest"}, {"username": "Véronique Piercey", "comment_text": "Airalo e-sim. Just got back from a month in Italy and a few other countries and it was perfect."}, {"username": "Janeen Penner", "comment_text": "I would buy a sim card or esim for italy, but I'd also take screen shots or download what I need to my phone so as long as there is battery life I'll be able to find it and not have to trust data, especially when just entering the country."}, {"username": "Ryan Monahan", "comment_text": "Don't use Rogers Roam Like Home, it'll cost you a fortune. Just get SIM cards when you arrive at the airport in Italy. We paid 25 euros each and had 70gb each plus calling and texting. Used it for 18 days for the same price as 2 days of Rogers!!! E-Sim with Airalo is another great option but does not have provision for phone calls and we found lots of places in Italy are Old-School, you have to call for reservations etc."}, {"username": "San Dra", "comment_text": "Edward Boose…."}, {"username": "Desiree Leyden Kuhnlein", "comment_text": "I bought an orange SIM card on Amazon it was great and could use everywhere"}, {"username": "Wendy Holierhoek", "comment_text": "Canadian here too. We bought Orange pre paid holiday SIM cards. $60 for 20G of data, 1000 texts and calling. Available on Amazon. Change out your SIM card will get you a EU phone number with use of all of your phones functions."}, {"username": "Cherie Coe", "comment_text": "Quentin Coe"}, {"username": "Sarah Urciuoli", "comment_text": "Esim with Airalo if your phone is compatible. It is great and reasonably priced."}, {"username": "Stuart Parnell", "comment_text": "If you’re not tech savvy don’t get Airalo. It can be a pain. We use that now but it took spouse and kids several tries to get it right.\n\nIn Europe last summer we ordered the vacation SIM cards from orange on Amazon. Super easy to install. I swapped them on the plane and didn’t miss a beat. You get a brand new euro phone number that you can text m/call from that Airalo doesn’t do. All your apps will work. Everything is 4-5g and it is cheap. It was 30GB each for like $50 and the kids tethered off the parent phones when there was no wifi.\n\nI added the (French) phone number to my email signature and clients could text/call. So worked for business. Just monitor your data. It’s easy to add but when it runs out at the British Museum and the family is wrangy it’s inconvenient. 😜\n\nDo not EVER keep the overpriced canadian crap. $16 a day is highway robbery"}, {"username": "Sonia La Civita Filice", "comment_text": "I’m on Italy now. My husband has holafly esim but it\nWill not let me share the hotspot. I think holafly blocks the hotspot. However I suggest going to a cellphone provider store and finding windtre. My son got\nUnlimited data and 300 min international\nCalls for 30 euros."}, {"username": "Elmina Babineau Perras", "comment_text": "Canadian as well as with Rogers. I use Airalo, you just need to make sure your phone works with ESim cards."}, {"username": "Lilia Goldfarb", "comment_text": "Canadian here too, just dropped Rogers for Fido. Better plan. The moment I board a plane, my phone goes into airplane mode and stays there until I get back. I use whatsapp for calling and messaging. I am going to try Airalo on my next trip although I always managed to pick up wifi while moving around"}, {"username": "Stanley Wong", "comment_text": "Take away - turn on airplane mode AND turn off data roaming? Do I have to do both steps?"}, {"username": "Krystalena Laralee Joell", "comment_text": "I was there two weeks ago. I used Holafly esim. The European unlimited data plan with 60 min of each calls in and calls out WITHIN Europe.\n\nI was able to iMessage and FaceTime calls back to Canada. That’s only handy if you’re iPhone-iPhone tho.. what’s app , Facebook etc would work also."}, {"username": "Debi McGrath", "comment_text": "I'm just going to get one of these SIM cards when I arrive Wind Tre (formerly Wind and Tre), TIM, Vodafone, or Iliad (I'm also Canadian)"}, {"username": "Heather Denning", "comment_text": "Darryl!"}, {"username": "Laurel Onfrichuk", "comment_text": "Nathan, Heather"}, {"username": "Lori Charlene", "comment_text": "Download the what’s app…. We’re Canadian too going next year and will be using this."}, {"username": "Rebecca Snyder Corbett", "comment_text": "I buy a SIM card from TIM when I get to Italy. We went to the one in the basement of the termini but they are everywhere. You should make sure you have printed copies of everything in case your wifi doesn’t work!\nThe tourist plans are way cheaper than anything we pay in Canada 🇨🇦"}, {"username": "Donna Bravo", "comment_text": "I got in Amazon- Orange sim card - worked well!"}, {"username": "Aaron Peterson", "comment_text": "You automatically get Roam Like Home while travelling with Rogers, you can read about it on their website. $15 bucks a day and you use your phone like normal same data rates as home with overages the same. Max 20 days in a month that they will charge you."}, {"username": "Gianna Onesi", "comment_text": "I wouldn't use Roger's so $ buy a sim card or download esim"}, {"username": "Darcy Jessen", "comment_text": "We are currently in Europe and heading to Italy on Sunday. I have purchased an Airalo e-sim card. It’s very easy to understand and simple to use. I watched an you tube video and now would not do it any other way. If your phone is locked into a plan, my understanding is that in Canada, providers have to allow phones to be unlocked ( I could be wrong though). We did not go with our provider - Telus, at $16 a day but chose Airalo esim card for $22 for 5 gb. I turn off the card when using wifi. Turn it back on when needed. I still have 3.65 gb after 3 weeks. Good luck!"}, {"username": "Josee Sanscartier-La Rocque", "comment_text": "Francois La Rocque"}, {"username": "Laura DeCicco", "comment_text": "Save your tickets and CCs to your Apple wallet, you don’t need wifi for that. I’m with Rogers as well and only got charged for days that I used my phone without wifi. $15/day. We were gone 2 weeks and only used it 2 days."}, {"username": "Yvonne Ormson", "comment_text": "Just buy a local European SIM card when you arrive at the airport. $25-30 CAD for a whole month. Waaay cheaper than our overpriced Canadian international plans.\nIt’s very easy to switch the SIM cards and the stores will do it for you 🙂"}, {"username": "Donna Watson", "comment_text": "I am a 🇨🇦using Rogers as well. Just got back from one month in Italy. I bought a 30 day SIM card from Amazon before we left. Put in an old iPhone not using then used my current iPhone in wifi. Worked perfect"}, {"username": "Hope MacIntyre", "comment_text": "Joy Rea"}, {"username": "Ashley Czinege", "comment_text": "You can also just roam like home for $15 a day. 20 day max per billing cycle. I need my cell for work and use roam like home all the time .\n\nhttps://\nwww.rogers.com/\nmobility/\nroaming#searchba\nr"}, {"username": "Karen Gregorchuk", "comment_text": "Appreciate all the advice! Thank you 😊"}, {"username": "Deborah Benarroch", "comment_text": "Just came back from Italy. I am with Rogers. I got a sim card at the airport in Milan. I was able to use all my apps, have access to everything I had on my phone. They use WhatsApp for texting when communicating with hotels or reservations. You also get assigned a new phone number with the card, but we never used it. We had plenty of data."}, {"username": "Chris Franklin", "comment_text": "The Airalo app. It’s an eSim. You buy what you think you need in data for the country you’re in and if you need more you can top it up. We’ve used it in Scotland, Iceland, Portugal, Spain, England, France… worked great!"}, {"username": "Matthew Livio Conti", "comment_text": "I think you should also contact Rogers"}, {"username": "Carmela Noble", "comment_text": "My parents are there right. Ow from Toronto and bought an e sim off Amazon and are able to do everything. Cheaper than rogers roam like home"}, {"username": "Karen Schmidt", "comment_text": "like others, I used Airelo. I basically did everything I needed to with that. Easy to top up data if you have to as well. Used What’s App for phone calls and messages. We used maps a ton without running out, used internet to find places to eat and read reviews, etc. All the hosts and hotels used What’s App as well. As a back up we had the roaming plan. Just be careful in your phone to shut the Rogers sim off , and make sure the e-sim is the active one"}, {"username": "Gordana Todorovic", "comment_text": "Going in September also with Roger's. Planning to use an old phone and buy a sim card when there. If my phone could support an e-sim I would do that. Happy travels!!"}, {"username": "Roxanne Domes Wilkinson", "comment_text": "Airalo"}]}, {"id": "2204361333296278", "text": "I’m sharing a few things that may help others from my own experience in Italy these last two weeks (Rome, Florence, Venice, positano, sorrento, capri, Milan and lake como).\n\n1. Pack light. If you think you packed light, pack even lighter. Wash and reuse and/or buy there (yes they have everything you need).\n\n2. Pack clothes that dry easily. Dryers are not common. If needed ask hotel/Airbnb for paid laundry service.\n\n3. The main tourist places speak English but a small gesture of Italian helps with a good experience for all. I found that my Spanish (very similar to Italian) got me pretty far.\n\n4. Uber app is available in most places but difficult to confirm a driver. The metro (subway) is great. Taxis work well here and lots have bike/e-bike/scooter options. If you’re going somewhere far I’d suggest to prebook a driver.\n\n5. I have T-Mobile and I didn’t get reception anywhere. It was difficult to navigate without use of my phone. If you’re the same I suggest having a plan with routes/train lines etc before you leave your hotel/Airbnb so you’re not wandering around looking for WiFi.\n\nHope this helps someone.", "link": "facebook.com/groups/1373361046396315/permalink/2204361333296278/", "likes": 76, "comments": [{"username": "Elizabeth Yu", "comment_text": "I have T-Mobile international plan. My phone gets great reception."}, {"username": "Cheryl Belloff", "comment_text": "Awesome 👏 I have t mobile too ! What’s my options then ?? Not switching providers"}, {"username": "Michelle Thorpe", "comment_text": "Maybe your phone settings were set wrong on the actual phone. T mobile works great internationally"}, {"username": "Trish McIntyre Butters", "comment_text": "How many days did you do that itinerary in!"}, {"username": "Sandy Kimlinger", "comment_text": "Evan Kimlinger"}, {"username": "Anna Alves-Regalado", "comment_text": "How do I book drivers ?"}, {"username": "Joan Adams Schilling", "comment_text": "Download maps.me before you leave and download all the maps of the cities you will be in. You don’t need data to use it and it will give you walking directions in real time. Have used it all over the world"}, {"username": "Gina Romano Peralta", "comment_text": "This is all great to know!\nWe have Comcast phones. Would love to hear anyones experience with those in Italy?"}, {"username": "Tracy Foss", "comment_text": "Great suggestions , thank you"}, {"username": "Dave Colleen", "comment_text": "I'm sorry TMobile created problems for you. We have the global plan and had no problems using it in Italy (Venice, Florence, Cinque Terre and Rome)."}, {"username": "Melody Miles", "comment_text": "I’m working on my itinerary similar to yours , But I had Cinque terre , I had been to Italy before bit not to C T and Positano. Thanks for sharing."}]}, {"id": "2204353816630363", "text": "Hi!!\n\nCan anyone recommend a reasonably priced hotel in Naples (nice area and access to the trains) for one night? We fly in quite late in the evening so want the hotel before travelling to the Amalfi Coast.\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2204353816630363/", "likes": 0, "comments": []}, {"id": "2204352223297189", "text": "We are considering driving our rental car from Siena to Venice on August 15, an Italian holiday. I was reading a post about how much traffic there is in August. Now I’m wondering if we should turn in the car and do the train instead?? It is a weekday though. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2204352223297189/", "likes": 0, "comments": [{"username": "Giovanni Pianigiani", "comment_text": "It's the best day to travel, together with Xmas and NYE... empty streets, very low traffic"}]}, {"id": "2204327379966340", "text": "Does anyone in the group have any experience or opinion on using Nannybag.com for baggage storage across Italy (ease & security)? - with thanks", "link": "facebook.com/groups/1373361046396315/permalink/2204327379966340/", "likes": 0, "comments": []}, {"id": "2204305336635211", "text": "Hi all, not sure if anyone can help but thought I’d ask the question.\nI tried to buy AC Milan soccer game tickets and my card has been charged but I never received the confirmation email or receipt. I’ve emailed the contact centre but haven’t heard anything.\nHas anyone had this happen to them?", "link": "facebook.com/groups/1373361046396315/permalink/2204305336635211/", "likes": 1, "comments": [{"username": "Sherry Davis Wainz", "comment_text": "What site did you use to purchase?"}, {"username": "Chiara Normanno", "comment_text": "May be worth a shot to go here https://\nwww.acmilan.com/\nit/club/\ncasa-milan/\nbiglietteria-cas\na-milan"}, {"username": "Carmine Castiglia Jr", "comment_text": "I presume that you checked your spam folder..."}]}, {"id": "2204302119968866", "text": "Help! In Sorrento and being bitten a lot by mosquitoes. How can we relieve this\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2204302119968866/", "likes": 7, "comments": [{"username": "Judy Dameron Kapsimalis", "comment_text": "Try benadryl if the doc says it's ok. Helps swelling"}, {"username": "Maria Teresa Dimacali", "comment_text": "Look for this at any local grocery stores. It helps a lot with mosquito bites!"}, {"username": "Antonina Ingrassia-Arroyave", "comment_text": "Vinegar tbh"}, {"username": "David Davey", "comment_text": "Off Deep Woods but you might not find it in Italy"}, {"username": "Nick Cittadinni", "comment_text": "Go inside"}, {"username": "Jono Roland", "comment_text": "Antihistamine and anti itch cream from a pharmacy. If it’s infected you may need an antibiotic. If it’s hot and starts spreading up or across your limbs and/or you have a fever you need to go to hospital."}, {"username": "Frank Hunt", "comment_text": "Go to a chemist and get a repellant"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Zyrtec for symptomatic treatment, to prevent it use a moz away. I always buy the Singapore mozzie spray because it works without fail, and zero deet."}, {"username": "Luca de Leon", "comment_text": "You'll survive"}, {"username": "Alexandra A Welker", "comment_text": "Oh nooo. Definitely get an anti itch cream or try tea tree oil apply on the bite area and only scratch around the area to avoid it being inflamed and enlarged. And apply your repellent multiple, hope that helps."}, {"username": "Patricia Nascimento Correia", "comment_text": "Ice is the best thing to use, after ice apply Vicks"}, {"username": "Emma Chandler", "comment_text": "When you use the spray repellent with deet you then need to rub it into your skin not just spray it xx also local pharmacy will help with after bite meds but I always use alcohol gel on my bites, stings but clears them up fast xx"}, {"username": "Juliette Sastrowitomo", "comment_text": "in case of a horsefly bite you can get this at the pharmacy"}, {"username": "Juliette Sastrowitomo", "comment_text": "https://\nwww.jungleformul\na.co.uk/\nproducts/\n\nMosquito spray with feet and afterbite. Available at the pharmacy or local COOP"}, {"username": "Vivien McNulty", "comment_text": "Mine always blister like this. I bought an antibiotic cream with histamine in it from the pharmacy. €11."}, {"username": "Janie Bishop", "comment_text": "The secret I learned in an Alaska summer is Vicks vaporub ! It really works before and after ,"}, {"username": "Carol Brewer", "comment_text": "I am reposting this as it looks like a good idea with the summer and the annual pests.\n\nTo make the mosquito trap, one simply has to obtain a plastic water bottle, a small amount of water, a packet of brown sugar and a packet of yeast. According to the visual directions, the top of the bottle is to be cut off and turned upside down, with the drinking hole now facing down inside the bottle. The yeast and brown sugar is added to the small amount of water in the bottle. The mixture of sugar and yeast produces carbon dioxide which emits from the bottle, attracting mosquitoes. Once the mosquitoes go into the bottle, they suffocate and die. For the trap to be effective, the inventors added that the mixture must be replaced every two weeks.\n\nCreated en masse, this DIY mosquito trap would be rather effective, reducing the mosquitoes that carry dengue virus, West Nile or any other mosquito-borne illness. It was an invention designed by a teen who won a national scholarship about ten years ago . I’ve been using it since . He was trying to find a cheap way to cut down on malaria.\n\nThis worked well in my hotel room in Vietnam and Thailand that was filled with the mosquitoes. I carry a baggy of yeast and sugar mixture when I travel."}, {"username": "Lisa Baglio Garrison", "comment_text": "Wow hope you fine relief. 🙏🏻We were in Sorrento for 4 days 2 weeks ago and I got zero bites. And mosquitoes love me."}, {"username": "Cindy Fausto Ventenilla", "comment_text": "Ask for \"after bite\" in the pharmacy"}, {"username": "Diane Bolognese Pettengill", "comment_text": "Same way you’d take care of it what at home I would imagine."}, {"username": "Marina Trainor", "comment_text": "Peter Bella Mario"}, {"username": "Jackie Richards", "comment_text": "See if you can find this. They come in pellets put 3-4 in water and let dissolve have them take it 1-3 times a day. My kids are allergic to red ants and this worked great. Yes they swell up like that."}, {"username": "Karen Cumbo", "comment_text": "Bug spray"}, {"username": "Diana Prevot", "comment_text": "It’s infected. I know because I spent 30 days with penicillin in my arm. Don’t wait. ￼"}, {"username": "Bec Seagg", "comment_text": "Grant Seagg :-("}, {"username": "James Saxton", "comment_text": "Spray?"}, {"username": "J Kevin Dennis", "comment_text": "Witch hazel, alcohol, hand sanitizer w alcohol, bug spray all work for relief, swelling"}, {"username": "Prisca Aroomoogum", "comment_text": "Go to the chemist/\npharmacy and ask them for a lotion repellent.\nBut also, are you sure it’s mosquito and not some bed bugs ?"}, {"username": "Alicia Cox", "comment_text": "Oral Benadryl (diphenhydramin\ne) plus topical steroid like hydrocortisone"}, {"username": "David King", "comment_text": "There’s a product called AfterBite and it works like a gem! Takes the welts down within hours and almost immediately removes the itch.\n\nThat said, it also smells exactly like Windex… which I hate to admit, just might also do the trick 😂\n\n#IYKYK\n#MBFGW"}, {"username": "Frannie Kaplan", "comment_text": "Citronella and peppermint helps repel them so try and find something scented to wear.\nYou can buy something from Acqua&sapone, the supermarket or the pharmacy.\n\nOnce you get bit apply hot water (not cold) to help subside the itching. Diluted tea tree oil helps as well"}, {"username": "Katie White-Meade", "comment_text": "Go to a pharmacy and ask for something."}, {"username": "Diana Post", "comment_text": "Deet"}, {"username": "Liina Vaina Salanoviciene", "comment_text": "Lavender oil"}, {"username": "James Bellamy", "comment_text": "Take a dip in the pool. They can’t get to you when you’re under water"}, {"username": "Darryl Rasch", "comment_text": "Bringing my 98% deet 😂"}, {"username": "Tracy Punchard", "comment_text": "Thanks everyone. I have been using a repellent spray with deet in but this has not helped. Been to the chemist as one has blistered, my ankle has swollen and it is ozzing 🤮. Been given the roll on stick. Seems to help. Thanks again. 👍"}, {"username": "Anthony Sperduti", "comment_text": "Go in the winter"}, {"username": "Tiffany Eshoo-Schiff", "comment_text": "We went to pharmacy and bought anti-itch cream"}, {"username": "Angelina John", "comment_text": "Go to pharmacy"}, {"username": "Zoli Berecki", "comment_text": "Italians call this natural selection .... just stay and let it go"}, {"username": "Sharon Milligan Martin", "comment_text": "Go to pharmacia and ask"}, {"username": "Beverley Ford", "comment_text": "I get bitten like mad and earlier this year I used some Holland & Barrett Aloa Vera gel and it was great. Better than anything I have ever used. Any 100% Aloa Vera should give some relief."}, {"username": "Shannon Plane", "comment_text": "Arrived in Sorrento today, I really thought I left this crap behind in Aus. Will be off to pick up repellent before sunset 😔"}, {"username": "Juno Lee", "comment_text": "Besides putting on repellent diligently, when it’s not enough we got Zirtec from their local pharmacy (use Google Translate app to communicate, or show them the attached picture). Together they work wonder for my daughter."}, {"username": "Shilpa Kotian", "comment_text": "I am a mosquito magnet, I get bitten with all the protection so alway keep aloevera gel for after bite"}, {"username": "Rebecca Korpershoek", "comment_text": "Just go to the supermarket or pharmacy and buy mosquito repellent, no different to anywhere else!"}, {"username": "Dr-Jon Warnecke", "comment_text": "If they don't speak English well, ask \"contro zanzare\", meaning anti- mosquitoes."}, {"username": "Emily LeaTh", "comment_text": "To stop the itch, you need to denature the enzymes they left behind in you. One way is to heat a metal spoon in the hot tap water (it should be hot, but not hot enough to burn your skin) and then press the back of the spoon onto the bite. The heat should do the trick."}, {"username": "Craig McGhie", "comment_text": "Leave"}, {"username": "Mary Hopla", "comment_text": "Thankfully we both did not get bites. Spent 2 weeks in Northern Italy end of June. Oh I lie lol I got one nasty bite in Tourin at a Rice Production Farm ."}, {"username": "Tracy Punchard", "comment_text": "This was them 2 days ago. The ankle one now has burst and feels a little better"}, {"username": "Jim LeSire", "comment_text": "Bite them back!"}, {"username": "Maria Y Alexieva", "comment_text": "Look for the equivalent of this https://\nwww.veta-pharma.\ncom/index.php/\nen/products-2/\notc-products-2/\nitem/\n7-anestesol-vt-1\n00-ml.html. It's cheap and works like magic"}, {"username": "Krystal Sullivan", "comment_text": "Find a farmacia and ask for “repellente antizanzare spray” and if you have been bitten already, ask for “after bite”"}, {"username": "Saverina Lombardo", "comment_text": "You're low in b12 so you'd need to supplement."}, {"username": "Heather Weiss", "comment_text": "Pharmacy has the best options 🩷"}, {"username": "Dean Journey", "comment_text": "Lavender, citronella, clove, peppermint, basil, cedarwood, eucalyptus, peppermint, lemongrass and rosemary"}, {"username": "Zainab Tharoo-Karim", "comment_text": "Get some Fenastil from the pharmacist. We got that in Rome when my son got bites and it helped a lot!"}, {"username": "Robert Lawshe", "comment_text": "Use mosquito repellent?"}, {"username": "Stjepan Kujadin", "comment_text": "Go for a swim in the sea several times a day. Nature heals"}, {"username": "Aaron Peterson", "comment_text": "Bug Dope"}, {"username": "Suzanne Sanderson", "comment_text": "Go to a pharmacy - they will sell you something"}, {"username": "Kerry Martin", "comment_text": "I got some great citronella spray in the chemist there last month and got no further bites, took antihistamines to take the itch away, that’s a pic of the citronella"}, {"username": "Cat Bond", "comment_text": "Find a pharmacy (green crosses)…. The local post bite roll on treatments work well. I also bought a plug in mosquito repellant for my room when i was there. I got eaten alive my first day"}, {"username": "John Gugliucciello", "comment_text": "Go to farmacia, they sell insect repellent, they look like bandaids. Stick one on your arm, they work really well."}, {"username": "Yvonne Ormson", "comment_text": "Insect repellent 🤷🏼‍♀️ How do you normally repel mosquitoes in summer at home? 😉"}, {"username": "Jacqueline Carnio Fadda", "comment_text": "Lemon juice on the bite works wonders, go to the farmacia they can help if it’s unbearable 😕"}, {"username": "Noelle Pellegrino-Podagrosi", "comment_text": "unfortunately the mosquitoes here in Italy are out of control this summer! like super mosquitoes!!! We bought repellent from the store and if u have a villa or apartment some citronella for outside!!"}, {"username": "Angelo Masciarelli", "comment_text": "https://\nwww.googleadserv\nices.com/\npagead/\naclk?sa=L&ai=DCh\ncSEwjN8u-6truAA\nxVHAYsKHRFPCUAY\nABAPGgJlZg&ohos\nt=www.google.co\nm&cid=CAESaeD2_\nt7QDsEbXDFpJSNr\n2hl4ftvY_hycKs5\nzJIC1QIpjNZAxQm\n2j4NtoAMLlpe4Fi\n2QKI-GVxotsSiqe\nUONyUFeb3TSvcb3\nVt__YAZQgXyF4FO\n1k2e4A_KS1Fi4cH\nOkYGqNY8fiJPsEz\nIw&sig=AOD64_1Z\nEnhDg9vixYCkIM3\nEHdeEgC2K0w&cty\npe=5&q&ved=2ahU\nKEwiQ4em6truAAx\nUYxQIHHcbgCrwQ9\naACKAB6BAgFED8&\nadurl"}, {"username": "Angelo Masciarelli", "comment_text": "In all Supermarket (price is cheeper) or pharmacy you can buy several kind of products against mosquitoes."}, {"username": "Goran Gogic", "comment_text": "Sorry hon the Sorrrento mozzies are known for their bloodthirstines\ns."}, {"username": "Steven Shannon", "comment_text": "Deet"}, {"username": "Albert Campagna", "comment_text": "Slap them"}, {"username": "Elmer Maniebo", "comment_text": "Bite back. Show ‘em who’s the boss."}, {"username": "Tamara Bazze", "comment_text": "Drink more lemoncello 😜"}, {"username": "Anthony De", "comment_text": "Just sit down and talk nicely with them.ask them to leave you alone, you're on vacation.."}, {"username": "Fiona Cohn", "comment_text": "Using your fingernail, press down hard on bite cross ways."}, {"username": "Chiara Bettaglio", "comment_text": "Repellent for before, after treat the bite with a stick you can find in pharmacy or supermarkets, it relieves the itch, ask for \"dopo puntura\""}, {"username": "Carol Brewer", "comment_text": "Vicks vaporub on ankles and wrists . They hate the smell."}, {"username": "Mark Spielman", "comment_text": "Possibly mosquito repellant?"}, {"username": "Chia Chiang", "comment_text": "Put soap water on top of mosquito bit area"}, {"username": "Dee Scandone", "comment_text": "Dee Scandone"}, {"username": "Dee Scandone", "comment_text": "This is what I use when I’m in Sorrento. If they don’t have this one , they sell it in a spray. You can get it from any chemist."}]}, {"id": "2204287276637017", "text": "Hallo Guys, Can anyone tell me whether I can buy a Trenitalia Pass in any rail counter in Italy? Or should I purchase it online?", "link": "facebook.com/groups/1373361046396315/permalink/2204287276637017/", "likes": 0, "comments": [{"username": "Annabella Pojer", "comment_text": "I would book online maybe cheaper ?"}, {"username": "Heather Sechrist", "comment_text": "I booked every ticket from the app. Even local trains right before we boarded."}, {"username": "Tonsia Keytel", "comment_text": "Trainline App."}, {"username": "Gianna Onesi", "comment_text": "Trenitalia app"}]}, {"id": "2204280656637679", "text": "Hi everyone I hope you're doing well.\nThis month I'm going to Positano& Capri shall I book ferry tickets in advance? If yes can you recommend me websites for tickets? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204280656637679/", "likes": 1, "comments": [{"username": "निनावी सहभागी", "comment_text": "Up"}, {"username": "निनावी सहभागी", "comment_text": "Up"}, {"username": "Tara Roed", "comment_text": "I did with the ferry hopper app. I had specific times I wanted to travel. You till have to stop at the booth and print your ticket. If you miss the time they will let you take the next one."}, {"username": "Noralis Rodríguez Coss", "comment_text": "Lucibello.it"}, {"username": "Beth Padva Monahan", "comment_text": "When we went to Capris and Positano last week, we booked the ferry ahead of time. You have to check in at the ticket booth 30 minutes ahead of your scheduled time so they can issue you your actual boarding pass."}]}, {"id": "2204274699971608", "text": "Hi everyone I hope you’re doing well.\n\nThis month I’m going to Positano& Capri shall I book ferry ticket in advance? If yes can you recommend me websites for tickets? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2204274699971608/", "likes": 0, "comments": []}, {"id": "2204274633304948", "text": "Any favorite family tour companies for Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2204274633304948/", "likes": 1, "comments": [{"username": "Angela Marsala-Gaydos", "comment_text": "Looking at Firebird Tours"}]}, {"id": "2204269676638777", "text": "Does anyone know what these bugs are? Our apartment through booking.com is full of them running around 😭 is a refund appropriate?", "link": "facebook.com/groups/1373361046396315/permalink/2204269676638777/", "likes": 20, "comments": [{"username": "Lena Lai", "comment_text": "There should be some set standards in order for a place to be rented out…"}, {"username": "Tif Fanny's", "comment_text": "Rouselle Dy Teves heeeeeeee"}, {"username": "Val Condo", "comment_text": "Look like baby cockroach"}, {"username": "Pamela Linday", "comment_text": "Oh my God !\nThese bugs are Bed bugs\nYou must be carefull cause these bugs are a real nuisance.\nThey proliferate quickly and they can bite you every night .\nDon t bring back in your home !😱\nYou can put your clothes in your Freezer during 3 days\nAnd after you have to clean in the washing machine with 60 degres celsius\nGood luck"}, {"username": "Jill Rimunui Cooke", "comment_text": "They are German cockroaches"}, {"username": "Samantha Lucia", "comment_text": "Looks like baby cockroaches 🪳"}, {"username": "Angela Falletta DiGiampietro", "comment_text": "I would leave ."}, {"username": "Dena Popovic Greenwald", "comment_text": "Bed bugs"}, {"username": "Kerrin Hammond", "comment_text": "Baby cockroaches"}, {"username": "Moppet Reyes-Atento", "comment_text": "ipis🤮"}, {"username": "Sally Rush", "comment_text": "Looks like German cockroaches. They are very difficult to get rid of once they get into your furniture etc."}, {"username": "Kate Tolman", "comment_text": "German Roaches and they are the worst. If you see one the walls have hives of them. Let the owner know. It’s tough to get rid of them. And yes! Refund"}, {"username": "Matthew Di Rienzo", "comment_text": "Roaches"}, {"username": "Joanne Melzow", "comment_text": "Roach"}, {"username": "Lexi Finck", "comment_text": "These are roaches, good luck getting a refund through booking.com they are the WORST!!! My hotel in Amsterdam had bed bugs and we had to leave in the middle of the night. We fought with them for months and never got a refund."}, {"username": "Dodie Koch", "comment_text": "Look like bed bugs!"}, {"username": "Kathryn Gadboys", "comment_text": "Roaches"}, {"username": "Gary Kadlec", "comment_text": "Hummmmmmm"}, {"username": "Laura Rodriguez Latil", "comment_text": "Laura Rodriguez Latil"}, {"username": "Nichole Hughes", "comment_text": "Nichole Hughes"}, {"username": "Bern Louna Proctor", "comment_text": "1 cockroach is 1 too many. That is an infestation and it is unhealthy and that place should not be occupied.\nIf anything get in touch with their health authorities once you get your refund"}, {"username": "Cécile Sévilla", "comment_text": "On dirait des cafards. Vous devriez demander un remboursement sur le site Booking directement avec les photos"}, {"username": "Tami Neubauer Foster", "comment_text": "Any updates??"}, {"username": "Arzu  A-ova", "comment_text": "Baby tarakan)"}, {"username": "Nesha Swayne", "comment_text": "Roaches"}, {"username": "Jeri Olson Huston", "comment_text": "Those are cockroaches!! For every one you find, there are a bunch more behind the walls!"}, {"username": "Linda Prunkel Reinhard", "comment_text": "Baby roaches. Ugh."}, {"username": "Nellie Yuret Kellett", "comment_text": "Disgusting. Get a refund and get out"}, {"username": "Pinky Fadul-Oliver", "comment_text": "Put lavender and tea tree oil in dryer sheets and leave it inside your suitcase."}, {"username": "Dave Rogers", "comment_text": "They ate the bugs that have come from bookingc financial services. I would love to do some travel but have no money because your company has not paid me"}, {"username": "Dean Sheehan", "comment_text": "I call them Delicious in a light tempura batter.\nNot quantity but amazing on quality\nYum😎"}, {"username": "Patty Orr", "comment_text": "Absolutely you should get a FULL refund!! Totally unacceptable!!!\nI would not stay there! Call Booking and your credit card company! Sad!"}, {"username": "Patty Orr", "comment_text": "Deal directly with your credit card company! We had a similar issue, not bugs, but a similar issue and booking.com was no help at all. Kept on referring us to the host, which did nothing!"}, {"username": "Silvia Yong", "comment_text": "Small Roaches"}, {"username": "Erleen Zayas", "comment_text": "Just recently I read that an Airbnb lost a case in the courts because the apt was infested."}, {"username": "Dianna Knost", "comment_text": "Get out! It’s bed bugs"}, {"username": "Irwin Lopez", "comment_text": "Those are roaches"}, {"username": "Mary Killeen", "comment_text": "Bed bugs"}, {"username": "Lisa Lisa", "comment_text": "I have used booking.com many times with only one issue in Paris. If you booked with your credit card your insurance on it will pay for the refund, while they go after booking if host doesn’t respond. Good luck with your refund tho."}, {"username": "Gina Manzotti Rasp", "comment_text": "Those are bed bugs.\nMore than likely you stuff if now infected with them."}, {"username": "Richelle Trezise", "comment_text": "This is what a bed big looks like totally different and it doesn't look like baby roaches either but still unacceptable"}, {"username": "Lorraine Bartolucci", "comment_text": "Marc Bartolucci"}, {"username": "Ken Baker", "comment_text": "To provide some advice, you booked a place on booking.com that has at the time I writing 11 reviews.\n\nI never book what are essentially new properties, there needs to be hundreds of reviews at least.\n\nYou also booked one of the cheapest places in the town, need to be careful as you always get what you pay for."}, {"username": "Jolie Carbone", "comment_text": "That’s a red cockroach. Very common in some older houses especially in summer. They’re not bed bugs, don’t worry."}, {"username": "Lynne McNamara", "comment_text": "They’re definitely baby cockroaches!"}, {"username": "Noelani Randazzo", "comment_text": "Roaches"}, {"username": "Waleska Cabrera", "comment_text": "Roaches…"}, {"username": "Michael Lo", "comment_text": "Good ole fashioned cockroach"}, {"username": "Judi Regnier", "comment_text": "Will never use Booking.com after arriving in Lake Havasu in Feb and the home we rented wasn’t even available!"}, {"username": "Wendy Doolan", "comment_text": "Dead bugs are ok!"}, {"username": "Kristen De Landre", "comment_text": "T"}, {"username": "Betsy Meeks", "comment_text": "Those are bed bugs"}, {"username": "Teresa D'Alessio", "comment_text": "Gross"}, {"username": "Deb Alees", "comment_text": "Here is a clear pic to compare to of a baby cockroach"}, {"username": "Nancy Cicinelli", "comment_text": "Hope it all works out... I guess best to stay in hotels"}, {"username": "John Salami", "comment_text": "If they look like this….you have an expensive problem…..Bedbu\ngs"}, {"username": "Suzanne Carver Musashe", "comment_text": "German roaches. Don’t get them in your suitcase. Very hard to get rid of"}, {"username": "Debra Trolman Alvo", "comment_text": "La cu ca ra chas\nMany babies\nInfested\nRun\nGet refund once out\nTake lots of pics to document\nSo sorry you’re dealing with this 💕"}, {"username": "Jennifer Phillipps", "comment_text": "Looks like cockroaches!"}, {"username": "Walda Goldbach", "comment_text": "Please leave a review on booking.com to warn others. Sofar there are only positive reviews."}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "I would move immediately.\nMust wash all your items."}, {"username": "Marianne Salzman", "comment_text": "Paris Emerson-Vickers\ndid you try going through booking dot com directly to get a refund and assistance rebooking elsewhere?"}, {"username": "Paola Hewitt", "comment_text": "I would definitely not sleep there"}, {"username": "Christine Karaki", "comment_text": "Those are apartment roaches, they’re smaller than the regular roaches. There is likely an infestation and they could be coming from the neighbors."}, {"username": "Elaine Valte-De Jesus", "comment_text": "They look like baby cockroaches"}, {"username": "Helen Layton Brechler", "comment_text": "Roach infestation"}, {"username": "Kim Gray Muery", "comment_text": "Yes I would ask for a refund!"}, {"username": "Laura Spadotto", "comment_text": "Baby coachroaches"}, {"username": "Jackie Richards", "comment_text": "Roaches 🪳"}, {"username": "Liviu Constantin", "comment_text": "Call boiking, send them pictures, ask for a substitute accomodation."}, {"username": "Monica McAvoy", "comment_text": "Definitely"}, {"username": "Ihsan Khrichfa", "comment_text": "Baby cockroaches spray all your luggage outside when you return home and pay attention i would leave immediately"}, {"username": "Heather Wiedeman", "comment_text": "Check all your stuff\nYou don't want to take any with you"}, {"username": "Gabriella Marin", "comment_text": "Gabriella Marin"}, {"username": "Michelle Cotoni", "comment_text": "Looks like ticks!"}, {"username": "Tasha Morcom", "comment_text": "I think these might be German cockroaches also known as European cockroaches or Croton Bug."}, {"username": "Brooke Bish", "comment_text": "Bedbugs look like apple seeds."}, {"username": "Tania Llorente-Haring", "comment_text": "Those are German cucarachas 🪳 🤮. My biggest fear."}, {"username": "Jelsomin Covelli-Grindle", "comment_text": "Yeah, I think they’re small roaches!"}, {"username": "Jono Roland", "comment_text": "Cockroaches 🪳?"}, {"username": "Marianella Flynn-Morales", "comment_text": "How awful so sorry you’re going through this! Looks like negligence clearly the responsibility of the landlord. That’s not fair to you as they know if they would have this issue. Make a formal complaint. They should pay for your new accommodation. If you can go to a shop that sells essential oils mix eucalyptus, lemon and tea tree oil together 10 drops of each one with water and spray everywhere. Those bugs can’t stand those oils ur suffocated them. Try to find a dry cleaners, laundry mat to wash everything in hot water and spray your entire suitcase inside with the spray . Hope this helps."}, {"username": "Stevie Spears Douglas", "comment_text": "Look like baby German cockroaches"}, {"username": "Kirsten Lebrun", "comment_text": "Cockroaches????\nEw omg"}, {"username": "Kendall Powell", "comment_text": "Paris Emerson-Vickers I work for a pest control company and those are German roaches! Leave all your belongings outside your home and unpack them outside so that way you do not transfer to your home. They are a hitchhiking pest and will travel inside things and lay eggs and before you know it now you have it at your home!"}, {"username": "Kathy Korody Artuso", "comment_text": "Baby Roaches. Don’t bring in your suitcases in your house. Unload in garage or patio."}, {"username": "Laura Jetton", "comment_text": "Get your luggage out RIGHT NOW, or put them in the bathtub, so you don’t take them to your next place."}, {"username": "Vincenza Mattiello", "comment_text": "Bed bugs"}, {"username": "Suzie Poirier", "comment_text": "Little roach’s"}, {"username": "Victoria Cosham Was Johnson", "comment_text": "Definitely cockroaches, had some in a rental apartment in Barcelona once, wasn’t able to prepare food and they were absolutely everywhere 😩, we bought a couple of big sprays and that was effective during our stay but we sprayed everything and everywhere before we went out every day. Best of luck"}, {"username": "Anna Karas", "comment_text": "Little cockroaches"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Get out and get a refund"}, {"username": "Stacey Lavelle Johnson", "comment_text": "Those look like baby roaches"}, {"username": "Lheen VD", "comment_text": "Could you please tell us which apartment is this? I am going to Torino in Nov. Those are freshly hatched roaches. Trust me, I know!😬. Sorry to say but leave the place and move. They go inside ears too. If you are sleeping with open-mouth, then yeah. That too. 🙇🏼‍♀️."}, {"username": "Erika Kl", "comment_text": "They look like bed bugs"}, {"username": "Lauren Birch", "comment_text": "Roaches!! Keep your luggage zipped at all times so you don’t take them with you and infest other properties (or your home). Bag and seal dirty clothes that you may have left on the floor, before putting it in your luggage! Little roaches do bite. I wouldn’t sleep there."}, {"username": "Eleni Fistikaki", "comment_text": "If they are bed bugs - that’s not good news: You should spray all your belongings with lavender spray for bugs including the luggage outside and inside. Throw lavender killer bug thing inside the luggage, bags shoes to kill them. Then wash all your clothes in 90 degrees, then lavender or special spray for clothing again, as sometimes they survive. Or just bin everything away if you can and they are cheap and don’t take it back home. You must ensure that you do not carry any of them to your home hidden in your luggage or clothes ! Spray luggage and put everything in plastic bags very well closed with bug killer in them. If you go home like that you may catch it and there is no real way to get rid of them then. Google it and you will see."}, {"username": "Norma McElroy Frisina", "comment_text": "Make sure your luggage is zipped up or you will be taking them with you on your next stop ."}, {"username": "Daisy Yoo", "comment_text": "make sure when u finally get home, do not bring suitcases inside of ur house, have all in a bag, then dump the clothing in washing machine, then u have ur suitcase open and sun bath for few hrs, then have ur suitcase zipped and leave in ur garage for few days and repeat again, then it will be ok"}, {"username": "Adrienne Long", "comment_text": "No and no and more no"}, {"username": "Manuela Critelli", "comment_text": "Sono blattelle germaniche, qui in Piemonte è pieno. Sono molto infestanti. Con il giusto trattamento però vengono eliminate"}, {"username": "Colleen Assavedo", "comment_text": "They look like German cockroaches. They are small and hard to get rid of. I’m so sorry!"}, {"username": "Veronika Netter", "comment_text": "Veronika Netter"}, {"username": "Noelene Cameron", "comment_text": "They look like cockroaches 🪳 which isn’t nice. Contrary to what many people think though, their presence does not always mean the place is dirty. They are an ongoing problem in the tropics requiring regular treatments to keep them at bay.\nBut this is Italy so I would be concerned.,"}, {"username": "Linda Androvich Taylor", "comment_text": "They are cockroaches\nDemand refund"}, {"username": "Pilar Lopez Salinas", "comment_text": "Be careful! Booking.com is great when you don’t give them problems or complaints; however, when there is an issue; they don’t care st all and always on the side if the hotel not on the client. We had a bad experience in Greece and they didn’t help us: 4 days without wifi in a four hotel who offers as a service in booking. My husband asked them for a room change and they didn’t do anything putting vague excuses. We needed to stay in as they took from our account half of our stay without asking permission. Bad hotel: filakas in Syvota, Greece"}, {"username": "Maria Nilialouna Lourdes", "comment_text": "Ask for a refund!"}, {"username": "Heather Le Biller", "comment_text": "These are cockroaches 💯. They are either babies OR German roaches which you can google, they are very small and have certain coloring. I just can’t tell for sure because they are on there backs in the photos. Trust me, I’m originally from FL and I’m also a flight attendant who spends a lot of time in hotels. It’s definitely a roach and NOT a bedbug."}, {"username": "Mark Irving", "comment_text": "Where are you staying,\nHotel and place ?"}, {"username": "Carol Polichnowski", "comment_text": "Be careful\nThey do not\nEnd Up in your\nLuggage and all your clothing\n😮🙃😳"}, {"username": "Katie White-Meade", "comment_text": "German Cockroaches"}, {"username": "Farheen Rahman", "comment_text": "These are cockroaches 🪳"}, {"username": "Anita Clayton", "comment_text": "Wow first time I have seen cockroaches in Italy and we have travelled all over."}, {"username": "Terry Rose", "comment_text": "Please post the place where you are staying so we know ?! I’m sorry you are dealing with this!!"}, {"username": "Amanda Avery", "comment_text": "Get the F!!! Out of there"}, {"username": "Christina Impastato", "comment_text": "Get some moth balls and put in your luggage"}, {"username": "Etelka K. Liston", "comment_text": "Those are most definitely roaches. Just book another place."}, {"username": "Joy Knueven Noriega", "comment_text": "Feeling so sorry for you! I hope you easily find another place to stay so you can move on and enjoy your trip!"}, {"username": "Pasang Lhamo Lhalongpa", "comment_text": "Those are baby cockroaches 🪳😱😱😱😱"}, {"username": "Paris Emerson-Vickers", "comment_text": "Studio Hole - Lingotto is the name of the accomodation on booking. com. I believe this property is also on Airbnb due to signposts in and around the property. The host has not been able to respond about a refund at this point, over 6 hours after my message to him. Thanks everyone for your responses and support"}, {"username": "Dana Green", "comment_text": "They need to refund you asap and set you up somewhere else."}]}, {"id": "2204266823305729", "text": "We are arriving around 8pm in Milan Malpensa. Should we arrange to stay near airport or is it still easy to get into town by train or bus (Terravision) at this time of night? Recommendations on areas to stay please. I've heard Navigli or Brera are nice although we also need easy access to the train station for onward travels. Two days enough to see Milan? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2204266823305729/", "likes": 1, "comments": [{"username": "Chiara Normanno", "comment_text": "There are buses till before midnight, just make a reservation on their website."}, {"username": "Glenn Todd Webb", "comment_text": "Go on into town. Don’t waste a minute. Taxi stand right outside. Stay nearest duomo that’s where everything is."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Get Malpensa Express, last one is after 23. easy and cheap"}, {"username": "Tonsia Keytel", "comment_text": "2 -3 days, definitely do the hop on hop off bus, a couple of different loops, do all of them. Great way to see city and sights."}, {"username": "Ruth Sutton", "comment_text": "Enjoy ! 👍💥"}]}, {"id": "2204261323306279", "text": "Here is a little tip if you are planing to come to Umbria next vacation 💚🇮🇹.\nMontone is with its 1,600 inhabitants on the list of Italy’s 100 most beautiful cities, and rightly so. Everywhere you go inside the old city walls built centuries ago to protect the city’s citizens, houses, roads and churches are lovingly restored with great respect for the past. Montone belongs to Perugia province of Umbria, also called Italy’s green heart.\nThe city is believed to originate from the 10th century, and has throughout the time been subject to both small and large tyrants – as so many of Italy’s cities have been. We have known\nMontone since our first visit to Umbria almost 15 years ago, and from the outset we fell in love with the cobbled streets and balconies draped with colorful flowers that flow in line with the coarse streets that seem to go more than down. 6 years ago we decided to move to this beautiful town with our 3 kids. And we are still loving it.... Montone is located on top of a hill of 482 meters above sea level (40 km from Perugia, 140 km from Florence and about 240 km from Rome), overlooking the confluence between the two rivers Tiber and Carpina.❤️🇮🇹Lots of events are going on trough the year In the summer we have tjhe Umbria Film Festival and our palio Donazione della Santa Spina. And in november we celebrate the harvest with the Festa del Bosco.\nHope one day to see you in Montone😍", "link": "facebook.com/groups/1373361046396315/permalink/2204261323306279/", "likes": 150, "comments": [{"username": "Linda Charlene Vaughan Osborne", "comment_text": "Excellent pictures."}, {"username": "Dawn Pape Wolf", "comment_text": "Beautiful!"}, {"username": "Dr-Jon Warnecke", "comment_text": "I love Umbria! Lived in Perugia 1988-1991, and visiting this October!"}, {"username": "Ana Ka", "comment_text": "Stunning!!!"}, {"username": "Muhannad Abudahab", "comment_text": "This post is just a couple of days late. I have just come back from my Umbria road trip where I had the chance to visit Perugia, Assisi, Orvieto, Bolsena, as well as Bagnoregio ❤️"}, {"username": "Debbie Dexter", "comment_text": "Montone is wonderful! Thanks for sharing your great photos"}, {"username": "Beverley Ford", "comment_text": "Looks absolutely fabulous"}, {"username": "Melanie Baffes", "comment_text": "It looks wonderful -- too bad I didn't see it sooner because I just returned from a month in Umbria. But I'll definitely check it out. Thank you for posting!"}, {"username": "Charlotte DUva", "comment_text": "Looks so beautiful! How far is it from Florence? Like hours? I keep thinking it’s nearTuscany but it’s not"}, {"username": "Kathy Fryer", "comment_text": "Fabulous photos. Thanks for sharing these."}, {"username": "Rosemarie Walker", "comment_text": "Looks beautiful"}, {"username": "Andy Jones", "comment_text": "Jodie Bolton Jones"}, {"username": "Gina Romano Peralta", "comment_text": "Stunning!! Do you have recommendations\nof where to stay here?"}, {"username": "Elaine Catino Tsangarides", "comment_text": "You are a great photographer! Will add to my list. Have been to Gubbio but not Monetone"}, {"username": "Philip Curnow", "comment_text": "..... and a rather particular link to Facebook"}, {"username": "Renee Rodi", "comment_text": "Beautiful. Thank you for sharing"}, {"username": "Teresa Prophet", "comment_text": "What stunning photos, thanks so much for taking the time to recommend it , it's so beautiful"}, {"username": "Collette Lawson Duffield", "comment_text": "Just lovely!!"}, {"username": "Ali Moore", "comment_text": "Natalie Smith"}, {"username": "Gabrielle Goodenough", "comment_text": "Beautiful ❤️"}, {"username": "Laurinda Gray", "comment_text": "Beautiful!!"}, {"username": "Gianluca Rivizzigno", "comment_text": "So lovely! What a gem."}, {"username": "Sally Begaud", "comment_text": "Love the photos - thanks for this post - will now visit Montone next year 🙏🏽"}, {"username": "Jeanne Hannivig-jones", "comment_text": "Tim Keys next timexx"}, {"username": "Hanne Pedersen", "comment_text": "Vi kommer snart igen 🥰"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204257109973367", "text": "Good Morning, we are using Pisa as a base and would like to visit maybe Florence or some easy accessible places by train.\nA Sandy beach visit would be nice but not essential. would like some recommendations for restaurants that locals visit and not tourist ones in the main places.\n\nThanks in advance 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2204257109973367/", "likes": 0, "comments": [{"username": "Ana Ka", "comment_text": "Florence has a lot of great restaurants... Locals definitely go to Alla Vecchia Bettola, Cantinetta Antinori, Cestello and Fermento 1889."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "From Pisa there are many places: Lucca, Viareggio (nice with sandy beaches), La Spezia with 5 Terre, Pietrasanta, Florence and a nice little coastal town partially sandy and partially rocky called Castiglioncello\n.\nIf you have a car: Volterra, Certaldo, San Gimignano, a beautiful place called San Galgano, Vinci, San Miniato are all great day or half day trips. Some of them are reachable also with train+buses, rome2rio may be helpful.\nIn 1/2 hour with direct city buses you can also reach Calci, a small village in Pisa’s surroundings (it’s at the footsteps of the mountain you see from Pisa with the antennas on top) with nice walking trails and a beautiful Monastery with also a great Natural History Museum. Depending on your interests in Pisa don’t miss the totally underrated Museo di San Matteo (mainly great medieval wood paintings), the Museo delle Navi Antiche (with the only roman boats in the world) and the Orto Botanico (the oldest university botanical garden in the world).\nTo eat a burger with an Italian twist at sunset don’t miss Arno Vivo.\nIn any case I wrote a post about Pisa the 12 Jul with some other informations.\nIf you need some more informations write me in private!"}, {"username": "Brenno Bianchi", "comment_text": "At the city limits of Pisa there is the Charterhouse of Calci that is stunningly beautiful but nonody visit it because nobody knows it exists. Having my base in Pisa, I would go also there, a direct bus just from outside the walls around the Tower of Pisa arrives there in 30 minutes. I think it is the number 120 direction Montemagno."}]}, {"id": "2204256659973412", "text": "Camper van travel in Europe in December?\nDoable?\nOr am I kidding myself?\nI feel that it will be a convenient and affordable way to travel between cities/places", "link": "facebook.com/groups/1373361046396315/permalink/2204256659973412/", "likes": 1, "comments": [{"username": "Melanie Matthews Stuprich", "comment_text": "I think the biggest issue will be finding parking in cities and towns. It’s doable but seems to pose some struggles just going and getting a hotel wouldn’t."}]}, {"id": "2204252823307129", "text": "Hey guys, i am staying 3 days in genova, what are the most important things not to miss, besides taking a train to portofino🌚", "link": "facebook.com/groups/1373361046396315/permalink/2204252823307129/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Visit Cinque Terre as well.\nNear Genova you may consider Boccadasse, Nervi, Camogli, Noli.."}, {"username": "Ken Lerch", "comment_text": "Eating pesto"}, {"username": "Kimberly Lampros", "comment_text": "santa margherita is beautiful. Rapallo is also nice with shops and waterfront"}, {"username": "Ann Lombardi-Perkins", "comment_text": "The many cathedrals. Take a close look at the skyline"}, {"username": "Roland Trego", "comment_text": "Santa Margherita Ligure and Camogli! PHOTOS OF SANTA MARGHERITA AND NEARBY: (Take out the spaces.)\nhttps: // photos . app . goo . gl/\nFXrrSaCBdcJHezkH\n9"}, {"username": "Miyuki Kanno Paul", "comment_text": "Too many palazzo to choose from. Hit at least 3!\nIf the weather is good, then take a funicular up to the top of the city.\nWhen you want to sit down, relax and have some wine and enjoy cheese and meat parings, Enoclub Genova is fabulous. The owner Alessandro is a certified Sommelier and has extensive knowledge of wine.\nEat world famous Pesto Genovese.\nOn your way to Portofino, stop at Recco and have a slice of exquisite slice of FOCACCIA DI RECCO"}, {"username": "Sopra la Roccia", "comment_text": "Visita palazzo reale, palazzo ducale, vi è un museo del risorgimento vicino palazzo reale, il porto, acquario e centro storico con la cattedrale San Lorenzo, appena restaurata. Vai a Boccadasse. E sopratutto ordina una Pasta al Pesto"}]}, {"id": "2204251086640636", "text": "Hi everyone! I would love personal recommendations for a Milanese risotto near the train station in Milano (Centrale). I have searched but hoping to find something not obvious on Google Maps. We have limited time, hence the call out for recommendations. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2204251086640636/", "likes": 0, "comments": []}, {"id": "2204250263307385", "text": "Can someone explain the deal with buying wine at FCO to bring home on single direct flight to NYC? It doesn't count against your carryon allowance? I always see people bringing those two bottle carriers they pick up after security in the duty free shops but I don't know how it works with the airline. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2204250263307385/", "likes": 3, "comments": [{"username": "Stefano Follador", "comment_text": "If I don’t get confused the product you buy at duty free are kind of “out” of your luggage. You can get those two bottles more without them counting as part of the luggage"}, {"username": "Kelly Peel Garner", "comment_text": "Duty free is your only option to carry it on"}, {"username": "Stacey Esposito", "comment_text": "I bought a bottle of chocolate wine at duty free last night. I just had to show my boarding pass. The lady wrapped it in a clear plastic bag and sealed it. I was able to bring it on no problem and didn't have to do anything else"}, {"username": "Suz Wilson", "comment_text": "How much wine can you bring home from Italy to Canada after one month? Thank you"}, {"username": "Alessandro Iannelli", "comment_text": "Not just Rome or Italy... I bought once a bottle of liquor in a German airport and put it in my carry on luggage which at that point was almost about to burst, and no one cared. Maybe there's some sort of \"tolerance\" for stuff you buy in airports?"}, {"username": "Carmine Castiglia Jr", "comment_text": "I've never seen the point of it.\n\nSo, you bring home a few bottles and perhaps save a few $ per bottle compared to what you would pay in the US at a well stocked wine retailer. Was saving $10 really worth the trouble?"}, {"username": "Frank Dragna", "comment_text": "Pick up some Occhipinti SP68 Bianco."}, {"username": "Jaime Cleek", "comment_text": "I think as long as you're not transferring once you travel to the US to another US city you're ok"}, {"username": "Scott Seneca", "comment_text": "We bring wine back every trip. We have never paid duty and we put it in the checked bags. Just need to make sure it’s less than 50 lbs."}, {"username": "Zieldre Kruger", "comment_text": "You are allowed a certain amount depending per country entering....for\nus it was travelling into EU any europe country was 3 bottles per person. Yes it is slightly cheaper (minus Vat) but the reason most people buy at airports is because you don't need to put in your luggage for obvious reasons (weight and break) and you carry it on the plane as extra bag that does not count. When purchasing at airport they wrap and package your purchase very nicely."}, {"username": "Tami Sue", "comment_text": "Doesn't count as an item."}, {"username": "Lyn Pappas Dahm", "comment_text": "I send wine from wineries that I visit. It is always wonderful to drink wine from the vineyard you have been to, esp a few months later. If I drink a wine and really like it, I google it to see if I can find it in the states. I bring home pistachio liquor and limoncello because that is hard to get in the states.\nJust pack in checked luggage ( last trip I bought luggage to bring goodies home because I travel COO. Was cheaper than shipping)"}, {"username": "Keith Crossley", "comment_text": "I'm wondering on similar lines. Not sure what wines the average person here drinks (partly based on what they can get). I don't care for California or Australian except their expensive ones. I like modesly priced French or Italian wines and expect that's what I'll generally find there. It is a joy to be in a certain region and experience unique wines. I would consider sending some home, but never have. Examples wines from Bergerac or near Narbonne. Difficult to find here.\n\nBottom line, if you find something exceptionally wonderful - bring it home!"}, {"username": "Ian Fawkner", "comment_text": "If you’re flying back to Australia via the UAE (Dubai or Abu Dhabi) forget it …..won’t get into your transit gate lounge - it will be confiscated no matter the amount."}, {"username": "Anna EClar", "comment_text": "Red wines in Italy do not contain sulfites. This makes the wine much more drinkable. Also no hangover and no allergic reaction. You cannot buy Italian wine in the U.S. that doesn’t contain sulfites. Must be some country thing or something."}, {"username": "Irene Oda", "comment_text": "The problem is if you have to transfer to.another airport. You can put fluids in a carry on as long as you have a direct flight home from that airport. If you have a transfer point then the wine will be taken away from you."}]}, {"id": "2204248409974237", "text": "It’s time for our holidays in Italy!\nWe are a Greek couple arriving this Saturday to Bologna for 3 nights .\nWe are thinking to spend Sunday to a day trip to Modena and also attend a pool party to club there .\nWe will be on motorcycle .\n1)Is there also a train / bus connection ? Or is it safe to drive on casual clothes ? ( it’s not practical toआणखी wear motorcycle protections for small distances ,- have to carry also casual clothes etc)\n2) what would you recommend to do in Bologna if you have 1 full day and 1 half ?\n\nThen we will drive and stay in rapallo for 3 nights .\nProbably lying on the beach and eating pizza is all you can do there ? Nightlife ? Beach party maybe ?\nwe will also visit Porto fino for coffee .\nWhere can we swim there ? Any recommendations or things to avoid ?", "link": "facebook.com/groups/1373361046396315/permalink/2204248409974237/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "You'll probably get bored for three days un Rapallo, spend the other two driving around the coast"}, {"username": "Scott Perry", "comment_text": "In Bologna, cocktails at Guero. Tell them Scott sent you. 😄"}]}, {"id": "2204240339975044", "text": "Recommendation::\n\nGlobal pass eurail..\n\nOr\n\nSwing it?", "link": "facebook.com/groups/1373361046396315/permalink/2204240339975044/", "likes": 0, "comments": [{"username": "Tonsia Keytel", "comment_text": "Buy as you go, Trainline App."}, {"username": "Sam Mah", "comment_text": "It really depends. How long are you travelling for? Do you want to book everything ahead of time or do you want the flexibility of deciding a day or two before you go to the next place? We got a 3 month global pass and the amount of travel we did for 1 month in the UK would have cost as much as we paid for the pass, which means the 2 months we travelled in Europe was basically free."}, {"username": "Farheen Rahman", "comment_text": "Following! I too can’t decide!"}]}, {"id": "2204131339985944", "text": "My family is going to Rome, Naples, Florence, Pompeii. If you’ve been to these places can you please tell me things you wished you knew before you went (the God the bad the ugly) thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2204131339985944/", "likes": 21, "comments": [{"username": "Shirley Lewis", "comment_text": "Florence: I've spent many months there ... buy timed tickets to the Uffizi and the Academia well before you go; decide what you want to see in the Uffizi, it is huge, there are vast crowds and unless you have unlimited time and energy, go to only what you really want to see but do go to the roof top as it's a nice view and you can sit for a few minutes. seeing the David at the Academia is fairly easy. there are 2 nice gardens, the Bardini is less crowded and I think much prettier. there are many churches which fabulous art which are free to enter and a few which charge, Santa Croce charges and has several tombs of famous people Michelangelo etc. walk up to San Miniato church and cemetery and then to Piazzela Michelangiolo to watch the sunset, you will thank me 🙂 (you'll need to start about 2 hours before sunset) cross the Ponte Vecchio to the Oltrarno to wander and eat at least 1 dinner ... and so much more to see! you also can't go wrong to just wander the streets and look! be wary of Gypsies and pick pockets, do not hang you bag on the back of a chair while you're eating!"}, {"username": "Gary W Anderson", "comment_text": "Before you go make copies of passport, important papers and cards, just in case of loses. Don’t carry items in rear pockets. Get books from Rick Steves, AAA and libraries. Use guided tours to learn more, make reservations and get skip the line tickets NOW.\nRome, the Borghese gallery is great and a hidden gem\nFlorence, very walkable, the Uffizi, Academia (David), Medici home and gardens but a guided Tuscany tour and hidden gem the Galileo museum along with Ponte Vecchio at night is great.\nPompeii take guided tour or you miss a ton.\nDidn’t really enjoy Naples but was pretty as we rode the train thru it.\nTravel safe, eat well and enjoy gelato"}, {"username": "Laura Uribe", "comment_text": "It was well worth the visit, but depending on the time of year, Pompeii is incredibly hot."}, {"username": "Glenn Todd Webb", "comment_text": "Buy tickets for everything months ahead of time.\nNaples is gritty, dirty, compact but we loved it. It’s safe despite appearances.\nGet a Frommers or Fodors guide and plan each day. Rome and Naples have a hop on hop off bus. It’s cheap and gives a great overview. Buy extra days if you can and it turns into a cheap metro."}, {"username": "Rhonda Russell", "comment_text": "In Florence visit Santo Spirito. Watch that you don’t step on the posters that are placed in high foot traffic areas."}, {"username": "Rachael Richardson", "comment_text": "Wine window on Borgo san frediano ! Florence That is most important 🍷, keep your bags guarded\nEnjoy the food and aperol spritz is a must"}, {"username": "Carol Taylor Tisdale", "comment_text": "FLORENCE: Visit Santa Maria Novella Farmacia. Museo dell'Opera del Duomo located right behind the Duomo - lovely and to me more interesting than the interior of the Duomo. Eat at ZaZa. The Bargello is a unique museum. Take a TukTuk tour for an overview plus it takes you up to Pizzale Michelangelo. Medici Chapel. Definitely don't miss Santa Croce. Visit leather school behind Santa Croce. Explore the Oltrano area. Personally, except for only a couple of works of art - the Uffzi I could skip. It took up lots of precious time."}, {"username": "Susan Carney Ash", "comment_text": "Basics: Florence is amazing, and very walkable. Rome was a shock after that, as it’s much bigger. I recommend finding accommodations that are close to the attractions (e.g., Trevi, Spanish Steps)."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Learn and abide by the tipping culture in Italy."}, {"username": "Kathy Tully Sexton", "comment_text": "That’s a lot of big cities. The smaller towns are the real jewels here. Perhaps choose to eliminate Naples and see a walled city or a seaside town. Slow down and take it all in. That’s when the magic happens."}, {"username": "Shelley Frise", "comment_text": "One more thing the only place we were asked for passports was in the Naples train station"}, {"username": "Gina Palmerio De Carmo", "comment_text": "While in Florence take a trip to Fiesole.\nWhile visiting Pompei get a guided tour. Saw so many people just wandering around not really knowing what they were looking at. The map they give isn’t very good. Everyone I saw looking at the map was confused and asking others with maps where they were, how to get to somewhere etc. just seemed a waste of time. At least with a guide you don’t have to concern yourself with the “where are we and what are we looking at?”"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Neal Bainto", "comment_text": "Vat Refund.\n\nAlways ask first for prices. Some stores immediately give you something then ask for outrageous sums.\n\nVisit the Mall outlet store in Florence. take the bus.\n\nTake a guided tour for pompeii. You'll appreciate the ruins more. some tour guides even sing at the ampitheater."}, {"username": "Suzanne Shea-Simpson", "comment_text": "Been to Italy several times. Leaving for Rome end of Sept to catch cruise starting October 2. Cruise goes to Amalfi Coast, Sicily, Turkey, Greece finally disembark day 7 Athens where we will stay for 3 nights before flying home to FL.\nWe’ve booked several European trips through Tripmasters.com including Italy Rome, train to Florence, and train to Venice. Their itinerary usually has number days that you can add or subtract. On Tripmasters we usually book air R/T, hotels centrally located that you can change, includes train or another local flight to next destination. We don’t book any tours, transportation or extras. We use GetYourGuide.co\nm for tours and transportation.\nThey are great! On our Italy trip booked Day Trip to Cinque Terre from Florence that was fabulous. Also skip the line tours for museums, foodie tours, etc. Sorry for long text….enjoy your adventure."}, {"username": "Marie Ring", "comment_text": "Rome- we liked staying close/walking distance to everything. We used Rick Steve’s audio tours and downloaded them and listened as we toured many places in Rome- Coliseum, Vatican, St Paul’s, pantheon, a museum (can’t remember the name), Roman Forum, and did a walking tour at night with one as well. We like to explore places on our own, at our own pace and we don’t like being tied to tours. I would recommend buying tickets to the Vatican with a tour or pay for skip the line if that’s available. We waited 2 hours the days of because we missed buying them in advance 🤦‍♀️\nI’d recommend using trip advisor as you look for a place to eat- that was helpful to rule out bad options. We never made reservations just looked on the map when we were ready to eat. Also, ask people for recommendations\nfor restaurants while there- that was great too. I’ve only been to Rome twice and loved it so much both times. I never ate at a rooftop restaurant that views the city but I’d like to do that next time close to dusk or sunset!\nPompeii has no shade so bring a hat and comfy shoes. We used the Rick Steve’s audio tour there as well. You can pay to leave your luggage there if you’re on your way to another city. That was so helpful!\nWe stayed one night in Naples due to a very late flight, but if you’re flexible with cities, Sorrento is amazing and so is the amalfi coast (we stayed in Positano) I can’t recommend those cities enough!! If you stay in sorrento you can take a day trip to Capri and other coastal cities by ferry. That’s the only strong suggestion I have as I had heard a lot of recommendations\nto not stay in Naples so we went to sorrento. It’s very beautiful, clean, felt safer- but that’s my recommendation 😊. I haven’t been to Florence but will for our next trip! Have fun! Italy is my favorite place!"}, {"username": "Pam Gerretsen", "comment_text": "Pompei - currently only one cafe open in the site, and by midday, the queue was huge! Take drinks and a picnic, and there are fountains to refill (water is a bit cloudy but tastes fine!). Outside the main entrance, near train station, there was a stall selling chilled water bottles for €1 if you forget!"}, {"username": "David Johnson", "comment_text": "If you don’t mind a short bus ride, the Colosso dell’Appennino just outside of Florence was really wonderful"}, {"username": "Erin Vizza", "comment_text": "Materialistic comment: I wish I would have purchased more street art from the artists in Florence near Uffizi."}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "Naples is my fav! Capri is beautiful and the pizza. You have to eat the pizza and gelato!"}, {"username": "Pamela Smart Guilmain", "comment_text": "Bring bottled water and snacks to Pompeii. There are few options available. But it's wonderful!"}, {"username": "Tracey Vernik Lubas", "comment_text": "Following"}, {"username": "Genevieve Bastien", "comment_text": "Rome: there are fountains everywhere with drinking water so just bring a bottle to refill\n\nPompeii: try to visit very early in the morning or late afternoon so there is shade as it’s very hot but so worth it !\n\nNaples: Spanish quarters , Toledo street and then Lungomare are beautiful areas to walk by. You can also choose day trips by ferry to Sorrento or Capri (50 mins only each way)\n\nTry all the pizza in Naples. Some from Anthony Bourdain or Stanley Tucci recommendations\n(you can Google it)\n\nRome was absolutely beautiful. We stayed in Monti and could walk everywhere. It’s so worth it. Ask locals for restaurant recommendations\nto fall on little gems, that are not touristy\n\nHave an amazing trip"}, {"username": "Lisa Moak", "comment_text": "Definitely hire a guide for Pompeii!! We attempted to do the free Rick Steves audio tour on our own and couldn't find many of the things we were supposed to be looking at. We walked around for 2 hours and didn't see very much."}]}, {"id": "2204230279976050", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2204230279976050/", "likes": 2, "comments": []}, {"id": "2204228669976211", "text": "We had multiple flights through Rome and not were in Barcelona, our first flight was though Istanbul to Rome, we barely made it to the flight unfortunately our bag is still stuck in Rome and we’re in Barcelona now. Who do we contact about it? I filled out the form but after 2 days the reference number comes invalid\nMy AirTag shows it’s still at FCO. They told us they would deliver to us to Barcelona and nothing. I tried calling the number but no one answers.\nAnyone had this happen before? Who do we call at this point?\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2204228669976211/", "likes": 3, "comments": [{"username": "Jaime Cleek", "comment_text": "You keep calling your airline or baggage services at the airport"}]}, {"id": "2204224533309958", "text": "Hi everyone!\n\nThinking of hiring a car and driving from Sorrento to Ravello return in 1 day in May 2024, no rush, just sightseeing the coastline and maybe visiting Positano on the way just curious as to any issues we may come across with this drive? Road rules, EVs, parking, one way roads etc?\n\nGrazie mille!", "link": "facebook.com/groups/1373361046396315/permalink/2204224533309958/", "likes": 2, "comments": [{"username": "Rachael Richardson", "comment_text": "Yeah - crazy Italian drivers !"}, {"username": "Robin Burrell", "comment_text": "All of them. Think of an issue you could have, and you will have it."}, {"username": "Kay Rendall", "comment_text": "There r parking lots in Positano that r very expensive. Usually charge by day. The higher up the hill, away from the town, us3d to be less expensive. Never used them, but b&b did organise/book for a friend who was staying there. No where else to park. Was 40euro 4 years ago so I would expect maybe double. Amalfi I have never seen 1. Not sure about Ravello"}, {"username": "Sigrid Cormier", "comment_text": "You may want to reconsider, and check out a day tour from Sorrento, Positano and Ravello.\nOr take a bus."}]}, {"id": "2204220126643732", "text": "Is the road from Sorrento to Amalfi (town) a winding road? Asking because of travel sickness.", "link": "facebook.com/groups/1373361046396315/permalink/2204220126643732/", "likes": 11, "comments": [{"username": "Kally Trahearn", "comment_text": "Take a look at this website - it's got images of the roads and some good advice...\n\nhttps://\nfullsuitcase.com\n/\nnaples-to-amalfi\n-coast/"}, {"username": "Roz Fawcett", "comment_text": "I got travel sickness tablets for that very journey and was absolutely fine 👍🏼 we had a private driver"}, {"username": "Jennifer Stanek", "comment_text": "Take Dramamine with you. Works great even on the bus!"}, {"username": "Sandy Radican Shikaly", "comment_text": "YES"}, {"username": "Nancy Day", "comment_text": "Can anyone tell me if the ferry ride is rough in April/May and are they easy to get in and out of"}, {"username": "Miyuki Kanno Paul", "comment_text": "If taking a bus, sit close to the front. Stay focused and look straight at the direction of the bus and not moving your eyes too much. Avoid turning your head to talk to your companion behind you. Avoid reading anything especially having your head down. The worst place to sit is the very rear of the bus. You’ll feel the fishtail effect. No acidic drink(no orange juice!)/food in your stomach prior to the ride.\n\nIf driving by yourself, you will be so focused that you will never feel sick!"}, {"username": "Paula DiCicco", "comment_text": "YES!!! YES!!! And YES!!! 😳We drove it two days ago- my daughter was throwing up on side of road. Take something if at all ever motion sick before. Not worth it."}, {"username": "Jenny Payne", "comment_text": "Very"}, {"username": "Karen Smart", "comment_text": "Yes! We were in a van of 10 people and two of them got carsick on the road! 🤮"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Very winding!"}, {"username": "Clare Boxer", "comment_text": "We got the ferry, and I was so nauseous on the way back 🤢 I was worried about the road because the transfer from Naples made me feel quite poorly! Hopefully a car is better!! Good luck ☺️"}, {"username": "Shelby Symons", "comment_text": "We are on the amalfi coast now and got a private transfer from Sorrento to Praiano and the drive has so many bends but the whole coast does but I got motion sickness tablets while I have been over here as the long distance train rides were making me nauseous so I took them for the car ride and had no issues. Definitely recommend private transfer for those bigger trips. We used a company called City Airport taxis and they were reasonably priced"}, {"username": "Joan Belserene Forcheski", "comment_text": "YES"}, {"username": "Ashley Morris Podraza", "comment_text": "Yes, my son almost threw up!"}, {"username": "Karen Cumbo", "comment_text": "Is the Pope Catholic?"}, {"username": "Donna Pompei Lembo", "comment_text": "I get motion, sickness, and wore the sea bands. They work very well. ￼"}, {"username": "Annette Eadie", "comment_text": "Yes it is windy, but you won’t get to go fast enough for motion sickness."}, {"username": "Stacey Esposito", "comment_text": "Yes the roads are horrible for motion sickness. Dramamine helped. I threw up when we made it to the hotel. I wasn't expecting the roads to be like that. After dramamine I was fine"}, {"username": "Wendy Wallin", "comment_text": "Take the ferry"}, {"username": "Doris Callender", "comment_text": "Yes…It is very windy! We had a private car service & several of us still got car sick. I definitely recommend purchasing motion sickness patches before your trip. It’s absolutely breathtaking on the Amalfi Coast. Hope you have a great trip. 🍋"}, {"username": "Brad Nelsen", "comment_text": "Yes! And long."}, {"username": "Lauren Ako", "comment_text": "Naples to Positano. Bought those patches . never got sick. Same on way back to Naples."}, {"username": "Sheri Dettman", "comment_text": "Absolutely. Look on Google Earth or Apple Maps and click on satellite view."}, {"username": "Nancy Lewis", "comment_text": "Ohhhhh YES!!!"}, {"username": "Elisa Bernstein Wolfe", "comment_text": "We had a private driver and my daughter - who tends to have motion sickness - was fine. I was honestly surprise because of the way the road was but she did great."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Sure is! When we drove it 26 years ago, I left permanent finger prints on the door handle.😅"}, {"username": "Tricia O'Leary Keane", "comment_text": "Two of us hired a boat for the day from Salerno and went to Amalfi town and Positano yesterday and the water was like glass - had a fabulous day and very reasonable priced .. hope this helps"}, {"username": "Rachael Richardson", "comment_text": "Hell yes ! It’s scary"}, {"username": "Giulia Cardamone", "comment_text": "Can you take a motion sickness pill? If not, there are ginger tablets on the market or you could eat crystallised ginger on the trip to settle your stomach"}, {"username": "Gloria Maledi", "comment_text": "i use bracelets for motion sickness and ginger candy"}, {"username": "निनावी सहभागी", "comment_text": "Anyone?"}, {"username": "Kate Whitney", "comment_text": "Yes"}, {"username": "Marc Rosenfeld", "comment_text": "It sure is"}, {"username": "निनावी सहभागी", "comment_text": "Any alternatives to get there?"}, {"username": "Tracie Anthony", "comment_text": "It’s terribly winding. I get carsick every time."}, {"username": "Maria Leitner", "comment_text": "Yes"}, {"username": "Carmela Noble", "comment_text": "It’s very narrow and winding"}, {"username": "निनावी सहभागी", "comment_text": "Is Naples to Amalfi a better trip?"}, {"username": "Aiden Sone", "comment_text": "Yes. Bus ride was awful sorrento to positano. Took a car service back. Car was fine."}, {"username": "Eka Chelidze", "comment_text": "Yes , its better to go there by ferry ...⛵⛵"}, {"username": "Irina Nedelcu", "comment_text": "Yes very. I don’t normally get car sick but I was definitely very nauseous by the time we arrived. My husband and kids took gravol on the way back and it helped a little."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Oh yeah but exciting !!!"}, {"username": "Paola Bobko", "comment_text": "It is, then apologies for disappointing you but the Amalfi coast might not be for you. It’s winding and panoramic roads are the great (and guess bad for some) part of it."}, {"username": "Lorissa Gill", "comment_text": "yes, made me dizzy, take a gravol half hour before departure"}, {"username": "Shelley Frise", "comment_text": "We tried to take the ferry but the winds were high so no boats were running. I get car sick so the bus was not an option. I would prebook the ferry or a tour because they fill up fast."}]}, {"id": "2204202976645447", "text": "Hello\nNeed help. Done google search and this page search with no result. We are wanting to climb the tower at the Palazzo Vecchio does anyone know what website I need to get tickets from", "link": "facebook.com/groups/1373361046396315/permalink/2204202976645447/", "likes": 0, "comments": []}, {"id": "2204194876646257", "text": "We are going to San marino\nThen to Rimini train station to goto Rome.\nWould like to stay somewhere in the middle for a couple of days.\nIf you can help with a lovely spot\nThankyou...", "link": "facebook.com/groups/1373361046396315/permalink/2204194876646257/", "likes": 1, "comments": [{"username": "Scott Perry", "comment_text": "Bologna!"}, {"username": "Philip Curnow", "comment_text": "Has to be Umbria. No problem getting to Perugia and nearby Assisi. A perfect and relaxing 2 days."}, {"username": "Geoff Plus Jann Mains", "comment_text": "Thank you so much!\nSounds great 😊"}]}, {"id": "2204193849979693", "text": "Can any Aussies over there now please tell me how much $100AD converts to on euros please?", "link": "facebook.com/groups/1373361046396315/permalink/2204193849979693/", "likes": 5, "comments": [{"username": "Cheryl Pacholek", "comment_text": "Around 60 Euro."}, {"username": "Brooke Summerville", "comment_text": "Brooke Summerville"}, {"username": "Dorothy Hudson", "comment_text": "Best to change before you come as my sister changed $350 and got €145 at a money changers today in Milan\nWe changed $400 at a changer in Australia and got €220 just to have some cash\nI have also got a Wise card and their rate changes daily but is around 0.604to 0.614 and I think that is the way to go"}, {"username": "Lesley Richardson", "comment_text": "Yes was better to change in Australia 🇦🇺"}, {"username": "Ashleigh Harsanyi", "comment_text": "You’re better off getting a travel money card putting euros on it and when you need cash take out of a bank atm."}, {"username": "Dani Stewart", "comment_text": "Depends on the exchange rate and your bank"}, {"username": "Gillian O'Callaghan", "comment_text": "\"On paper\" about €60 but depends if you're getting it from an ATM, using your credit card or using physical currency exchange. You'll pay a bit for all those."}, {"username": "Wendy Wallin", "comment_text": "Just check the official exchange rate on the day you’re going to change"}, {"username": "Richelle Trezise", "comment_text": "Better to change here just wait till a good day we got cash for 57 c and travel card 62c"}, {"username": "Murene Cassai", "comment_text": "At noon on Thursday 2 August, 100 Euros would cost $AU164.32. $AU100 would get you 60.12 Euros. I use https://\nwww.xe.com/\ncurrencyconverte\nr/convert/?"}, {"username": "Kyle Goodwin", "comment_text": "25 cents"}, {"username": "Claire Buccini", "comment_text": "We use ATM to get cash and try to use the partner banks to ours in Oz. We bank with wpc and they have a deal with Deutsch bank, so we don't pay transaction fees, just the usual conversion fee, it is working to about 60 cents at present. Every time we have tried to change aud we are getting offered less than 53 cents"}, {"username": "Taylah Paton", "comment_text": "Not enough.\nI almost cried. But I’ve been here for 2 weeks and don’t think about how much things would cost in AUD anymore, because it hurts 😂😭"}, {"username": "Maria Grazia Rizza Costanzo", "comment_text": "Just today converted some cash for our trip. Not happy 😩"}, {"username": "Stacey Nicholas", "comment_text": "Louise Hocknull Sarah Chapman Sandy Jenaway Passmore"}, {"username": "Rebecca Goldsmith", "comment_text": "I ordered a wise card about 2 months ago and have been changing to euros when the rates has been good. It leave oz for Italy in 3 weeks. Is easy to use you transfer money from your bank onto wise card and set an amount to auto covert at the rate you desire and it when it hits that rate it automatically converts it to euros"}, {"username": "Deborah Coram", "comment_text": "Work on €60 but remember in Italy an Aperol spritz only costs between €3-€8 and they almost give you wine and food…so same same, if not a little cheaper. Petrol is $$$. Otherwise I thought COL even with the exchange was a little less over there than here. But change your $$ for cash at a bank before you leave. Work on needing about €30 a day for incidentals…the\nrest can go on your CC"}, {"username": "Maddi Ozolins", "comment_text": "If you’re still in Aus, I recommend opening an Up account. There’s no transaction or atm fees, if you make a purchase on card they’ll use the exchange rate that day.\nTheir app and communication is also amazing!"}, {"username": "Annette Doley", "comment_text": "It is 60 euro."}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler the whole money exchange thing worries me..we need to research"}]}, {"id": "2204192876646457", "text": "Tips/things to do in Perledo? We will be traveling from Cinque Terre and will spending 3 days in Lake Como area.", "link": "facebook.com/groups/1373361046396315/permalink/2204192876646457/", "likes": 0, "comments": []}, {"id": "2204190729980005", "text": "Hello everyone!\n\nAny Hotel or Aribnb that you recommend cheap or in a good price in Rome?\n\nThank you very much!!", "link": "facebook.com/groups/1373361046396315/permalink/2204190729980005/", "likes": 1, "comments": []}, {"id": "2204188913313520", "text": "Are there any train or airline strikes planned in August? I’ve checked the website that I’m familiar with, but don’t see any strikes announced for August. Any help that you can offer is appreciated. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2204188913313520/", "likes": 1, "comments": []}, {"id": "2204175683314843", "text": "Hi all…still working on itinerary based on the opinions and recommendations of the group. I am wondering the feasibility of a day trip to Dolomites from Venice? We have 3 nights booked in Venice before heading to Florence. Wondering if it’s too much to add or if I should put it on the list for a (hopefully) future trip. If it factors into yourआणखी opinions we are Venice 3 nights, Florence 4 nights (day trip to Piza/Luca), Rome 3 nights, Amafli Coast 5 nights (including Naples, Pompei/Herculaneum, Carpi/Blue Grotto). Trip goal is to see the ‘expecteds’ (we’re first time travelers to Italy) but also take in some ‘unexpecteds’ and get a feel for all the different settings/feels of Italy that one can in 15 days! My thanks for all the input from this group. I know everyone has different opinions about how to spend the time/$$ on a trip like this but reading different thoughts and view points is helping me build our dream trip. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2204175683314843/", "likes": 4, "comments": [{"username": "Gary W Anderson", "comment_text": "A day trip to Dolomites is possible, Pisa only has leaning towers but a day trip to Siena is worth it. in Florence enjoy the museums, the romance and walkability. Hidden gem is Galileo museum. Rome a hidden gem is the Borghese museum. Make copies of all important papers and don’t carry anything in rear pockets to just be careful. Travel safe, eat well and enjoy gelato."}, {"username": "Hollis H McGuire", "comment_text": "Dolomites are magnificent and, of course, historically important (Italians v Austrians WWI). But they’re very remote and not very Italian in your sense.\nCheck out the charming city of Verona (a mini Rome) and vaguely on your way to Florence.\nOr Bologna (did I say FOOD?)\nOr Parma (think great cheese: you can take a tour)\n😘"}, {"username": "Ryan Monahan", "comment_text": "We did 3 weeks in July and for us the \"unexpected\" spot was Lucca, we spent 2 nights in the walled city. Didn't know much about it going in, just on recommendation of friends. It was an absolute highlight of our trip!"}, {"username": "Karen Blackmore", "comment_text": "Personally I'd spend the time in Venice. Visit Burano, Murano and Torcello. Wander the alleyways. Three nights is only two full days."}, {"username": "Katie White-Meade", "comment_text": "Personally I would do at another stage if you are planning on going back to Italy. The rush doesn't make it worth it. You won't enjoy and be tired from your constant running around."}]}, {"id": "2204175383314873", "text": "We will be spending 2 nights in Barcelona prior to boarding our ship for a Mediterranean cruise - any great restaurant recommendations? Would love a\nplace locals love - doesn’t have to be fancy - just good food and fun ! Thanks !!", "link": "facebook.com/groups/1373361046396315/permalink/2204175383314873/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204170719982006", "text": "Looking for recommendations for food in any towns in Tuscany (not Florence), Milan, Lake Como (Varenna and Bellagio), Italian food or other types all welcomed! Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2204170719982006/", "likes": 0, "comments": []}, {"id": "2204170206648724", "text": "Next May-June 2024 I am hoping to find a nice two bedroom apartment somewhere in Northern Italy that would be a convenient spot to make my home base for a month to explore the area within the circle on theआणखी attached image. I’d like an apartment with a view in a location with adequate amenities for groceries, restaurants, entertainment, activities, etc., but without being in a big city like Milan. I’d to explore Tuscany, Cinque Terre, Lake Como, Lake Garuda and possibly Verona and Venice, but not sure what makes the most sense. Will having a single home base make sense somewhere in this area? If so, I would welcome any suggestions on towns and or specific apartments you’d recommend. If it doesn’t makes sense how many separate places do you recommend and for how long? Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2204170206648724/", "likes": 4, "comments": [{"username": "Pietro Adami", "comment_text": "Verona and Bologna would be the best choice; excellent train and roads connections for all your destinations. Maybe for the Cinque Terre and Toscana, Bologna is better"}, {"username": "Kathy Kibbe", "comment_text": "Bologna is a very “livable” city with a convenient train station - stay within the city walls"}, {"username": "Manuela Bonazzi", "comment_text": "Bologna è ben collegata a tutto tramite autostrada e treni. Se vuoi stare in un posto più tranquillo e piu economico ti consiglio di valutare anche Ferrara."}, {"username": "Lisa Ann", "comment_text": "I love Bologna!"}, {"username": "Alessandro Battxi", "comment_text": "Depends what you would like to see, big cities or small medieval towns? Brisighella is a must to go."}, {"username": "Elizabeth May La Duca", "comment_text": "I recommend staying in convent/\nmonastery in central Bologna while checking out www.Immobiliari\n.it and Tecnocasa.it and other local real estate agencies and local postings by owners"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I would chose Parma, cheaper than Bologna and well connected with everything!"}, {"username": "Alice Francesca", "comment_text": "I am Italian and I would pick Verona. It s gorgeous, small but rich in culture and things to do and very well connected via train"}, {"username": "Sande Ricci", "comment_text": "Genoa!"}, {"username": "Michela Zanni", "comment_text": "Bologna is the best in my opinion. It's the main railway junction, you can go wherever you want by train. Direct trains (also fast trains) for almost all destinations: Firenze, Verona, Venezia (Ferrara and Padova on the way), Milano (all 'via Emilia' towns on the way) and convenient trains with one change only to other towns in the area"}, {"username": "Laura Piccinini", "comment_text": "Modena !"}, {"username": "Ville Lignell", "comment_text": "Parma could be a good option, yet most moves you'll do by train will anyway pass through Bologna."}, {"username": "JeriLynne Clifford", "comment_text": "We stayed in Modena and loved it! Check out the season 2 episodes 1 and 2 of Master of None.\nIt is filmed in Modena. It gives you a feel for the “small city” feel."}, {"username": "Ryan Monahan", "comment_text": "We spent a few days in a bunch of those cities/towns earlier this month. It depends on your style... we really love the evenings/\nnights on location, enjoying a late dinner, walking around, going for drinks late etc. So it made more sense to change location so we could really experience evenings in each area without having to drive back to a central apartment. If you pack it in for the day earlier or don't mind late night travel and minimal on wine with dinner etc., then the central apartment could work."}, {"username": "Pao Magnoler", "comment_text": "Verona!"}, {"username": "Steve Bouffard", "comment_text": "Parma is nice"}, {"username": "Khushi Khanna", "comment_text": "For one month, would suggest you have at least 2 home bases, if not 3. Otherwise you will spend too much time traveling."}, {"username": "Yvette Bortoli", "comment_text": "Hiya! I had a similar idea to explore northern Italy. Wouldn’t Milan be a good spot to base yourself as there or so many places to visit/explore within 2hrs by train??"}, {"username": "Greta Pittana", "comment_text": "Rispondo in italiano tanto poi Facebook traduce.\nPer le 5 terre (+ Portovenere!!) hai bisogno di qualche giorno per cui fermati a dormire in zona (io ho dormito a La Spezia) e c’è il treno appositamente per le 5 terre. Da lì puoi andare anche a Genova (acquario!!!!).\nStessa cosa farei al\nLago di Garda, riva ovest scegli una città e in pochi giorni visiti un sacco di posti ( anche Limone in bicicletta con la nuova pista ciclabile). Verona va molto bene come base per visitare anche Venezia e altre piccole città vicine (Vicenza Padova Ferrara Mantova e Garda riva est). Poi potresti fare base a Bologna per visitare anche Ravenna Modena Parma. Per la Toscana non so aiutarti perché sono stata solo a Firenze e sembra essere molto cara per dormire. Però io dividerei le tappe, non puoi stare su una sola città per tutto il nord. Secondo me vai a visitare anche San Marino se puoi."}, {"username": "Zucchero Candito Kandinsky", "comment_text": "I'd go with Bologna, since it is a big railway junction and you can easily travel from there by train. Parma/Modena as second choice"}, {"username": "Linda Tibbles", "comment_text": "I would choose Verona, hopefully near train station."}, {"username": "Courtney Lynn", "comment_text": "Verona area! Close to the train and within a short drive to most of the sites you’re wanting to see. Don’t forget northern Italy has just as much to offer as the south does ✨"}, {"username": "Kathy Tully Sexton", "comment_text": "We stayed in Bologna just recently to “test the waters” for next year and getting an apartment. Bologna has a generous amount of public e-bikes to get around on that were reasonably priced, the public transit was easy and it is walkable too. We did the same in Genoa but felt Bologna was better suited for us if we didn’t have a car."}, {"username": "Nicola Bradley", "comment_text": "Both Verona and Bologna are great but there’s more to see in Verona"}, {"username": "Luca Lookone Ferrentino", "comment_text": "My suggestion is: look for an apartment in a \"cascina\" in the countryside, in Mantua province. Cheap and reasonably close to everything"}, {"username": "Elizabeth May La Duca", "comment_text": "I’m planning a 2—4 weeks solo trip Spring 2024, staying at my favorite hostel in Milan, www.hostelcolou\nrs.com 3 minute walk to Lambrate metro and train stations, 1 minute walk to Penny supermarket and Danelli panificio, pasticceria, caffetteria and chinese restaurant/\ntakeout = takeaway and several bus stops and self service laundromat…coul\ndn’t ask for a more convenient, quiet, safe location! 10 minutes to Central Train/bus station where I plan to take FlixBus to Geneva, Switzerland, then FlixBus or train to Lyon, 🇫🇷 France, then train to Torino, then train back to Milan, then train to Lecco or Varenna, then bus or ferry to Bellagio, then ferry to Tremezzo, then C10 local bus to Como city, then bus to Malpensa MXP Intercontinenta\nl Airport to fly back to JFK NYC"}]}, {"id": "2204169346648810", "text": "Hello Everyone,\n\nWhat is the best mode of transport to reach Zermatt from Milan?\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2204169346648810/", "likes": 0, "comments": [{"username": "Chris N Lynn", "comment_text": "Rome2Rio.com\n\nTrain or well, Train."}, {"username": "Russ Whitley", "comment_text": "Zermatt, Switzerland? If so train. About 3.5hrs."}]}, {"id": "2204163343316077", "text": "Can anyone recommend the best pear ravioli in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2204163343316077/", "likes": 1, "comments": []}, {"id": "2204162856649459", "text": "Traveling next summer with my husband and two teen girls. Planning to stay on the Amalfi Coast for 4 nights.\n\nWe are looking for some sun, beach, good food, rest and relaxation. We will be coming from a few days in Rome and will be moving on to Florence after this part of our trip.\n\nI would like to stay in one place for all four nights and use itआणखी as a “base”.\n\nHere are the three locations and hotel options that I am considering:\n\nOption 1: Hotel Grand La Favorita, Sorrento\n\nOption 2: Miramalfi Hotel, Amalfi\n\nOption 3: Capri, *** currently looking at hotel, but thinking that Capri might be best for a day trip rather than 4 nights?\n\nI would appreciate any thoughts or recommendations.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204162856649459/", "likes": 1, "comments": []}, {"id": "2204162789982799", "text": "We have four days in Umbria, based in Assisi with a car, best day trips (towns)?", "link": "facebook.com/groups/1373361046396315/permalink/2204162789982799/", "likes": 2, "comments": [{"username": "Beth Ann", "comment_text": "Spello"}, {"username": "Beth Ann", "comment_text": "Orvieto"}, {"username": "Dr-Jon Warnecke", "comment_text": "Gubbio first! Then Rasiglia, Spoleto, Spello, Perugia, Orvieto, Todi. All are beautiful, and if time allows, try Val d'Orcia, Sienna, and San Gimignano in Tuscany. There's also the Roman made Marmore waterfalls."}, {"username": "Sue Gaughan", "comment_text": "I recommend Spoleto and Bevagna, Perugia and Spello!"}, {"username": "Nicola Wallis", "comment_text": "Thanks for all your tips!"}, {"username": "Annette Fordyce", "comment_text": "Deruta is a charming little town that is know for it’s pottery. Most of the pottery shops are in the lower part of town, the upper part of town is also charming. We bought pottery from Grazia, and they shipped it home for us. Perugia is well with a visit. I’ve always wanted to go to Castiglione del Lago- it looks intriguing."}, {"username": "Debbie Maguire Hudson", "comment_text": "We’ve been to Orvieto and it was lovely."}]}, {"id": "2204153269983751", "text": "Anyone stayed at clemy in Rome hotel?", "link": "facebook.com/groups/1373361046396315/permalink/2204153269983751/", "likes": 1, "comments": []}, {"id": "2204132066652538", "text": "Would those who have spent time in Milan recommend getting the MilanoCard? Pay the fee for X # of days and get free transportation( bus, tram, metro), shuttle from Linate airport, Duomo ticket and discounts on other attractions. Or is it better to just pay a la carte and on the go for metro, Duomo rooftop etc? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204132066652538/", "likes": 1, "comments": []}, {"id": "2204131386652606", "text": "Do you have to book the ferry in advance in various places in Lake Como? Is it likely to get a ticket by walking up? I’m not sure if I want a set timeline that I need to get to the ferry.", "link": "facebook.com/groups/1373361046396315/permalink/2204131386652606/", "likes": 1, "comments": []}, {"id": "2204096393322772", "text": "Hello, Would love some names of traditional local restaurants in Venice and Florence Italy please!!", "link": "facebook.com/groups/1373361046396315/permalink/2204096393322772/", "likes": 1, "comments": [{"username": "Kelly Peel Garner", "comment_text": "Murano (Venice) Lovely court yard, great food and very local\n\nhttp://\nwww.osteriaalduo\nmo.com/it/"}, {"username": "Diane LoPriore Pryor", "comment_text": "Kelly Peel Garner made reservations for restaurant! Thanks so much. Happen to know if they have a shopping outside market like florence?"}]}, {"id": "2204110269988051", "text": "We just booked our Italy trip. April 1-11, 2024!!! So excited", "link": "facebook.com/groups/1373361046396315/permalink/2204110269988051/", "likes": 153, "comments": [{"username": "Valerie Nicole", "comment_text": "So exciting! We went this past year March 21-April 4th and it was a great time of year to go! Beautiful weather and not too crowded!"}, {"username": "Jamie Webb", "comment_text": "Did you book through a service, or just on your own? We are just now starting to plan, but not going for a couple years. So exciting!"}, {"username": "Kim Grace", "comment_text": "My bestie (Aus)and I (uk) have just booked our Italy part of trip /\naccommodation 10 days May’24-combined 50th bdays\nCannot describe our excitement..hav\nnt seen each other 5 years !!!!"}, {"username": "Gary W Anderson", "comment_text": "Travel safe, eat well, enjoy gelato but also just in case of loses make copies of ALL papers, don’t carry items in rear pockets and research each location thoroughly. Make all reservations and get skip the line tickets now."}, {"username": "Patrizia D'Arcangelo", "comment_text": "Great period. Italy awaits you with open arms"}, {"username": "Shannon Pacheco Modin", "comment_text": "We booked a tour through Trafalgar. They take care of booking everything. Hotel. Flights. Tours. Transfers. Most meals. We have opportunities to book optional tours. There are free times too to explore."}, {"username": "Raymond Capkin", "comment_text": "Long time to be excited"}, {"username": "Chantal Lacoste Robert Mérineau", "comment_text": "You must go to Bottega Pecchioli\nIt’s a must"}, {"username": "Janice Langdon-Kloosterman", "comment_text": "Whooo hooo\nWe are going in Sept this year"}, {"username": "Bea Kuckens", "comment_text": "You'll have a fabulous time :)"}, {"username": "Lina Stump", "comment_text": "Auguri!!!"}, {"username": "Tracey Vernik Lubas", "comment_text": "Does anyone have recommendations\nfor a small grouptour … Rome..Amalfi Coast..Florence\n..Cinque terre.. Venice that does transport via train, not motor coach? Graczie!"}, {"username": "Luanne Carey", "comment_text": "SO excited for you!"}, {"username": "Eileen Muro", "comment_text": "So exciting! We just came back from a 10 day trip...Rome, Florence and Venice. It was such an amazing trip."}, {"username": "Melissa J. Webster Groenewegen", "comment_text": "Are you doing your own planning or going with a tour company?"}]}, {"id": "2204115123320899", "text": "Hi wonderful Italy travelers! Quick question. We land on Friday am and need to book a fast train from Rome airport to Naples.\nDo we need to buy tickets in advance? If so how much time from when we land ( deplane get through customs get baggage etc) should we book the train for? Don’t want to hang at airport for too long and don’t want to miss the train!\nThanks for you advice!", "link": "facebook.com/groups/1373361046396315/permalink/2204115123320899/", "likes": 2, "comments": [{"username": "Rachel Gray", "comment_text": "Wait til you get to the station to buy the tickets. It will be easier if you don’t have to rush and worry about missing your connection"}, {"username": "Rita Scotto Epifanio", "comment_text": "I went to Rome today. A day trip from Naples. There are several fast trains every hour. We just bought the tickets this morning one way and then we bought them when we were ready to come back."}, {"username": "Mallory Weber", "comment_text": "What about ferries? Should we wait on those as well?"}, {"username": "Stacey Esposito", "comment_text": "Wait till you get there. When we landed it took 2 hours to get through passport control. Alot of flights had just landed. It's hit or miss. My mom landed 3 days later and got right through passport control"}, {"username": "Dafne Vassetti", "comment_text": "Not from the airport. You have to get to Termini Station First. From Fiumicino Airport you take the Leonardo Express that brings you to Termini train Station. Then from there you can get a high speed train."}, {"username": "Dafne Vassetti", "comment_text": "There is only one high spped train a day from Fiumicino Airport to Naples and it leaves at 9:38 am. https://\nwww.lefrecce.it/\nChannels.Website\n.WEB/#/\nsearch-results?c\nid=G_AV1022AWO_\nSEARCH_B_Trenit\nalia_E&handoff=\ntrue&referrer=w\nww.google.com"}, {"username": "Michela Zanni", "comment_text": "Yes, book in advance. August Is very high season"}]}, {"id": "2204114679987610", "text": "How is the following 6 nights in Sicily. Also any recommendations on where to stay? We don’t have to stay exactly in the cities mentioned below, as long as we are close.\n\nFly into Palermo - explore Palermo.\nCheckin to hotel in cefalu in the evening.\n2 nights in cefalu\n2 nights in Taormina\n2 nights in Catania (1 day we go see Etna. 2nd day we see syracuse and noto)\nFly out of Catania\n\nThoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2204114679987610/", "likes": 0, "comments": []}, {"id": "2204110739988004", "text": "Can you recommend a dependable wifi that I can use around Italy? Should it be an Esim or pocket wifi?", "link": "facebook.com/groups/1373361046396315/permalink/2204110739988004/", "likes": 0, "comments": []}, {"id": "2204110379988040", "text": "I’m taking a Mediterranean cruise with 12 hours in Livorno. 6am until 6pm. I know Livorno is a couple hours from Florence. I really want to just wander around Florence. Go to a museum. See the David. Etc. I’d have maybe 7 hours there? Thoughts on that?", "link": "facebook.com/groups/1373361046396315/permalink/2204110379988040/", "likes": 0, "comments": [{"username": "Lauran Cantwell", "comment_text": "Many ships usually have a transportation only option. Or a option for the Museum and some free time. Because of the distance, I'd be very careful booking non ship transportation."}]}, {"id": "2204104856655259", "text": "Can anyone help me with the easiest way to get to Lake Como italy from Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2204104856655259/", "likes": 7, "comments": [{"username": "Christine Sanci-Gentile", "comment_text": "45 minute train ride through Trenitalia."}, {"username": "Tonsia Keytel", "comment_text": "Train from Milan to Varenna, easy! Then take ferry from there to the other villages. Trainline App, easy to use."}, {"username": "Stefano Bressanelli", "comment_text": "From Milano Cadorna station take the train to Como Nord Lago. Get off and here you are near the lake."}, {"username": "Annette Brin", "comment_text": "You do not need a car to explore lake Como. The train is easiest. Are you day tripping or planning on spending a few days? Are you starting from airport or will you be in Milan already? I suggest getting to Varenna by train. This perfect location with big mountain views, charm and located center lake allowing for unparalleled access to quaint villages and towns that dot Lake Como via ferry. I suggest Varenna because it is town that probably has most frequency of ferry departures/ arrivals to Bellagio. Tremezzo, Menaggio all towns worth exploring."}, {"username": "Brenda Rabenau Erwin", "comment_text": "It’s a 20 min train ride"}, {"username": "Gianna Onesi", "comment_text": "Train"}, {"username": "Larry Reinier", "comment_text": "Train"}, {"username": "Mat PO", "comment_text": "Helicopter, for sure…."}, {"username": "Kristine McIntyre", "comment_text": "Private helicopter"}, {"username": "Kayla Hicks", "comment_text": "Thank you everyone!"}, {"username": "Jono Roland", "comment_text": "Train"}, {"username": "Marilene Sagaz Lanza", "comment_text": "Trem."}, {"username": "Bobby Jo", "comment_text": "Rent a small car"}, {"username": "Marco Brambilla", "comment_text": "Ferrovie Nord from Piazza Cadorna"}, {"username": "Sam Mouchamel", "comment_text": "Taxi 🚕 Milan to Belagio"}, {"username": "Candy Andersen", "comment_text": "Train to Varenna."}, {"username": "Robert Bill", "comment_text": "Train from Cadorna to Como Nord Lago. It will get you near Lake Como. Enjoy!"}, {"username": "Melonie Rycroft", "comment_text": "Train really easy"}, {"username": "Luisa Impeduglia", "comment_text": "By train from Milan"}, {"username": "Theodore Meyer", "comment_text": "Drive"}, {"username": "Shelley Bowen Glassman", "comment_text": "Hire a driver-most hotels have referrals for drivers"}, {"username": "David Mistick", "comment_text": "Train"}, {"username": "Elizabeth May La Duca", "comment_text": "Google Maps/directions"}, {"username": "Elizabeth May La Duca", "comment_text": "Train then local buses [C10, C15, …]"}, {"username": "John Bruckman", "comment_text": "Train"}, {"username": "Steve Savva", "comment_text": "By train"}, {"username": "Steve Savva", "comment_text": "Car is more versatile"}, {"username": "Tricia Harman", "comment_text": "Train"}, {"username": "Rose Stolarek", "comment_text": "Train"}, {"username": "Brian Johnson", "comment_text": "Trains leave Milano Cadorna like twice an hour. About an hour train ride. Book on Trenord."}, {"username": "Catherine Campbell", "comment_text": "Train. You can book via the Trenitalia app."}, {"username": "Kerry McMillen", "comment_text": "Train. Use Omio for tickets. No line"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Train with no problems, I live near Milan. You can buy tickets directly on trenord.it website (Trenord is the railway company that covers north Lombardia area where lake Como is)"}, {"username": "Miyuki Kanno Paul", "comment_text": "What part of Lake Como are you trying to go?"}, {"username": "Glenn Todd Webb", "comment_text": "Rent a car. We did. Drove to Stressa, Lugano, Tremezzo, Bellagio."}]}, {"id": "2204104816655263", "text": "Hi brains trust.\nPlanning my trip to Italy (2nd time so skipping some major places), flying from London to Rome then train to Florence, 4 nights in Florence thinking day trip into country side, day trip to CT, then train south and stay 4 nights at Sorrento with day trip to Capri and Positano (?) then fly out of Rome.\nThoughts and suggestions please?", "link": "facebook.com/groups/1373361046396315/permalink/2204104816655263/", "likes": 1, "comments": []}]