[{"id": "2192398164492595", "text": "We have spent the past week in Massa Maritima in Tuscany. It has been a fabulous week traveling all around the area but I highly recommend the beaches in the Folonica area and especially the Ziva Beach Bar if you want to get away from the heat and just enjoy the sea ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2192398164492595/", "likes": 6, "comments": []}, {"id": "2192397961159282", "text": "How did you do your money exchange? Once you got to Italy or at your bank in the state you live in? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2192397961159282/", "likes": 2, "comments": [{"username": "Richard Stein", "comment_text": "Our bank didn't offer an exchange, so we used TD bank not the best rate, but not too bad and very convenient."}, {"username": "Suzanne Ayres", "comment_text": "I need cash for my first night in Italy. I plan to exchange a few hundred at my bank then if I need more, go to a Bank ATM"}, {"username": "Bill Shafer", "comment_text": "Here is our recent experience in Rome, with exchanging currency\n\n$1,000.00 to Euros\nexchange rate .94 /1.06.\nNewark Airport €830.00\nRome airport €726.00\nRoma train station €820.00\nAcross from train station, €875.00\nIn front of train station by snack bar\n€900.00\n\nIf you feel the need to have euros the moment you land, only get a small amount at the airport. Wait until you get into the city and go to a ATM at an actual bank, they will charge less fees and have a better conversion rate. The airports and train stations are a rip off.\n\nUsing a credit card that doesn’t charge international fees, is the best way to go."}, {"username": "Jill Creager Kessler", "comment_text": "We can order different currencies at our AAA office. Typically takes less than a week."}, {"username": "Laura Allen Weinstein", "comment_text": "In the states before you leave. My bank got them the next day, but said 48 hrs."}, {"username": "Line Gregoire", "comment_text": "Wise card , great rates"}, {"username": "Karen Smart", "comment_text": "Just went to an bank ATM when we got to Italy and used my debit card."}, {"username": "Brice Blosser", "comment_text": "Spent most of it before leaving. You have to keep planning your trip even when you’re on it, including euros."}, {"username": "Pietro Adami", "comment_text": "Walk into any real bank, with your passport, and avoid train stations, airports, etc."}]}, {"id": "2192396631159415", "text": "Pompeii, or Herculaneum or both?", "link": "facebook.com/groups/1373361046396315/permalink/2192396631159415/", "likes": 2, "comments": [{"username": "Simon Kidney", "comment_text": "Both. But Herculaneum I felt was much better. Definately book a tour with an Archeologist, they are so informative."}, {"username": "Alison Carney", "comment_text": "Both. Obvs."}, {"username": "Andy Blackwood", "comment_text": "I prefer Herculaneum but both are spectacular. Pompeii is very big and has little shade. Walking around takes several hours and can be very hot and tiring. Herculaneum is more compact, has a little more shade and you can get round it comfortably in 2-3 hours."}, {"username": "Jenny Baptie", "comment_text": "Both are amazing but Herculaneum is more compact and definitely worth a visit"}, {"username": "Paul Thompson", "comment_text": "Michelle FYI it’s both"}, {"username": "Mike Natasha Bucher", "comment_text": "If time permits both"}, {"username": "Lynn Francisco Casella", "comment_text": "Pompeii Walk the cobblestone streets and see the art on the brothel wall"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Both excellent, especially if you love history. I have been to both and I actually preferred Herculaneum. It is in a better state of preservation."}, {"username": "Michelle Malarchy", "comment_text": "Both."}, {"username": "Vladimir Boskovic Serrudo", "comment_text": "Pompeii if one, both if possible"}, {"username": "Shana Woodfield", "comment_text": "Both, but maybe not on the same day. They suffered the same volcano’s eruption, but the effects are different."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192389661160112", "text": "We are going to Italy for 3 weeks next summer (august). We know a lot of things will be closed. Our travel agent has told us to consider changing where we want to spend our honeymoon due to the august holiday but Italy has been on my wishlist forever. This will be our first European trip and we are wondering how difficult it would be just to rent a car instead of relying on taxis/trains. We are flying into Venice then ending our trip at the Amalfi coast. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2192389661160112/", "likes": 15, "comments": [{"username": "Stephanie Saenz Bauer", "comment_text": "I would not drive. Trains super easy"}, {"username": "Ann Latour", "comment_text": "I am flying into Venice and flying out of Roma after spending time in Florence, San Gimi, and Sorrento. We plan to take the train between most of the cities but will rent a car in Florence for a few days to tour Tuscany. From what I learned public transportation is so convenient and the Amalie coast is best travelled by ferry. Happy honeymoon 💕"}, {"username": "Camilla De Romanis", "comment_text": "Change travel agent"}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "We prefer to drive. When it’s a city we ditch the car and train to where we want to be."}, {"username": "Pietro Adami", "comment_text": "Your travel agent seems not to know much about Italy …"}, {"username": "Kasey Jackson", "comment_text": "August holiday?? Will things be closed?"}, {"username": "Elaine Eitzer", "comment_text": "My husband always drove in Italy.It was difficult in Rome and other big cities."}, {"username": "Jennifer Larese Taylor", "comment_text": "Some small shops may be closed but Italy is fun in August- hot and crowded but fun. Collect the car after Venice and make sure that your hotels have parking and you’ll be good to go"}, {"username": "Lori Crites Perez", "comment_text": "We rent a car every time we go.. it's easy and a lot less hassle than depending on trains. Just get insurance in case it rains with hail. We have never had any issues"}, {"username": "Graham Sherlock", "comment_text": "August is way too hot, change your dates, avoid July & August"}, {"username": "Andria Saia", "comment_text": "Super easy to rent a car and get around 🥰"}, {"username": "Fatima Khraizat", "comment_text": "Why will they be closed during the season😱"}, {"username": "Aaron Jonathan", "comment_text": "Cinque Terre and Lago Sarapis"}, {"username": "Glenn Todd Webb", "comment_text": "No it won’t. Maybe a few things in small towns."}, {"username": "Regina-Rich Krett", "comment_text": "There are still plenty of taxis and trains despite the holiday. Some shops and restaurants will be closed but there will plenty of things open as well."}, {"username": "Alicia Cox", "comment_text": "We have been 3 times & drove ourselves every time. That said, it is nerve wracking a lot of the time - traffic, street signs on the buildings & they blend in, lots of traffic, traffic cameras, sometimes difficult parking - sooo just depends where you are gonna be. Amalfi I would never drive. Cinque terre is also a challenge. You can’t drive in Venice. Tuscany you NEED a car & it’s pretty easy as most of the towns are small. The big cities - Rome, Florence - easy to take a bus or train - so not really one size fits all."}, {"username": "Alicia Cox", "comment_text": "Get the insurance FOR SURE 😳🤪"}, {"username": "Daniela Parhar", "comment_text": "I wouldn’t worry about the car ( it’s different but nothing too hard ) or places being closed. The reason why I wouldn’t do it is the heat, it’s CRAZY plus with the crowds it becomes very difficult to enjoy as much as you would if you wait a few weeks. I was there in the end of September last year and the weather was amazing and it was busy ( Italy is so beautiful that it’s always busy) but in a good way."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "I would never drive here. Use high speed trains between cities and taxis for local as needed."}, {"username": "Frances Tomlinson", "comment_text": "Renting a car for areas outside big cities is fine. Yes the driving can be crazy but you soon get used to it - just make sure you keen an eye on the rear view mirror on the motorway as they come up fast and expect you so get out of their way to avoid them slowing down!\n\nSome things are closed for Ferie itself (14th August) but most are open and *some* families take their holidays around that time so close their restaurants. However increasingly I have seen family restaurants closing in Sept for hols.\n\nNot like it used to be 20 years ago when some supermarkets were even closed on Ferie"}, {"username": "Luisa Ravenna", "comment_text": "I don't think you will find all these things closed. A few small shops and companies (that are not of interest to tourists). August is a very important month for Italian tourism"}, {"username": "Patricia Turner", "comment_text": "We just came back from a 10 day trip with a car rental in Italy. We stayed in Salerno for part of our trip and used the ferry system to get to Positano. Salerno is less expensive to stay in, you can get to it directly from the autostrada and easier to park a car. It is a larger city so you may not want this but my family enjoyed this, the ferry was fun. If you stay in Salerno you might consider adding Casserta (royal palace) as a stop along your way. Good luck planning and congratulations\n!"}, {"username": "Jules Blumke", "comment_text": "Go!"}, {"username": "Chris Vilsack", "comment_text": "It will be expensive to return a car to a different location. I've read of costs in the €1k range. Europe is very well connected with trains, both high speed and regional. Plus the Italian countryside is stunning. Your views from the train will be postcard quality sites to see. And although ferragosto is a real thing, supermarkets, bars and restaurants will be open.. Most likely on a limited schedule. Enjoy!"}, {"username": "Marilyn Caladine", "comment_text": "To help with your decision just check what’s happening now. The weather is extremely hot which could spoil your honeymoon. Next year may get worse. Sept maybe nicer, less tourists, less heat 🍋"}, {"username": "Nicole Smith", "comment_text": "Why would a lot of things be closed?"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Take the train or arrange for drivers when the train is impractical. Much less of a headache and risk of fines and stress of finding parking."}, {"username": "Lynne Neeley", "comment_text": "We just spent 2 plus weeks in Florence, Chianti and Tuscany region. Flew into Florence. No car needed. Rented a car for the remainder of the time. No problems. Perhaps plan your trip to begin and end where you don’t need a car."}, {"username": "Lynne Neeley", "comment_text": "We did not find the driving difficult."}, {"username": "John Licata", "comment_text": "Take the train"}, {"username": "Beth Spiehler Selvia", "comment_text": "Any way that you could postpone until mid September when both the crowds and heat are down a bit?"}, {"username": "Russell Weidner", "comment_text": "Venezia, then Firenze by train; then rent a car (use lots on south side of city and explore Tuscany and Umbria to Amalfi!! Lamole, Tenuta di Ricavo and the many hill towns!! Also Civita !!!"}, {"username": "Marie Cuzzi", "comment_text": "If you can put off your trip until September the weather will be beautiful and less people"}, {"username": "Oriana Casadei", "comment_text": "Driving in Italy is not difficult per se. They do drive on the right side of the road! Having said that, traffic will be very heavy with tourists and Italians going on vacation. In many towns, you will have to deal with lots of roundabouts in addition to stoplights. Parking in the cities may be difficult to find. I have driven many times and just spent several days there. Found driving was a bit of a nerve wrecking challenge."}, {"username": "Laurie Frainetti", "comment_text": "That is exactly what we are doing in two weeks. Flying into Venice, then train to Rome, then rent a car when we leave Rome, make a stop for a few days in our family town Prossedi and then down to Amalfi coast for 3 days.…the car will be parked at the Airbnb in Amalfi for 3 days,\nand then we will drive out of there back to Rome to fly out and return car.\n\nI’ll let you know how it goes, but we had no trouble renting a car. Hindsight-I might have booked in September or May…I’m very nervous of the heat and crowds we’ve signed up for!!"}, {"username": "Kerri Cole Batista", "comment_text": "Things are not really that closed down in August - it’s more of a corporate holiday. You will still be able to enjoy it. We always drive but… you can’t drive in Venice - we sometimes wait til after Venice to pick up the car or drop off before Venice or if it’s just a 2-3 day we park in the garage at the dock. And Amalfi just implemented an odd/even day with license plate numbers trying to prevent tourists from driving in Amalfi. They implemented after our trip last year so I’m not exactly sure how that’s working out for car rentals."}, {"username": "Debbie Thompson", "comment_text": "Easy to drive we drove from Milan to Ostuni with many destinations in between with 2 young kids, it was amazing 🤩"}, {"username": "Tina Norris", "comment_text": "There will be no problem renting a car once you have it booked. Roads will be busy,"}, {"username": "Pam Gerretsen", "comment_text": "So far, we've always gone July/August because of school holidays. Yes, it can be busy. Yes, some shops and restaurants are closed, but apart from one very random day trip last summer to a town in Tuscany that I cannot recall the name of, there has always been plenty open. If August is what works for you, you'll be fine. We drive from the UK. Yes it's a bit crazy, but last year I drove through the centre of Rome, and we all survived (I'm still waiting for my medal 🤣). Be prepared, go with the flow, and enjoy!"}, {"username": "Amy So", "comment_text": "Many towns and cities are easier without a car. If you are going to Tuscany and Umbria areas, yes for a car. But in august, driving to AC will be a nightmare. Finding a parking spot will be difficult. If you are going later in September, it will be much much easier."}, {"username": "Danilo Esse", "comment_text": "Dont worry,everythin\ng is open at the main locations..enjo\ny every single moment stress-free..."}, {"username": "Nana Tirolese", "comment_text": "Driving in Italy will be really nervewracking. It is chaotic and crazy on the roads and I almost had a few heart attacks in the front seat with our Italian relatives driving. I Don't recommend it!"}, {"username": "Pietro Di Sorbo", "comment_text": "For what I see, I live in Italy, in August is quite everything open.\nThe real question in August is that is overcrowded almost everywhere."}, {"username": "Hen Garrett", "comment_text": "We always travel in August as we have kids in school and I work in one. We’ve rarely found anything closed that we’ve needed to go to. Cities are pretty busy (and hot) but we usually go to holiday areas or rural places eg Lake Garda, Tuscany etc. We always drive, usually our own car, but we’ve rented a couple of times. We love the freedom of going where and when we want. However if you are mainly in cities trains are much easier. We are coming for a weekend this summer and doing everything by train - that will be fun (and cheaper for us) but I always prefer a car. Have fun planning. You will have a great trip."}, {"username": "Darin Zeoli", "comment_text": "Driving in Amalfi requires both skill and confidence. A lot of both."}, {"username": "Sally Volpe Godin", "comment_text": "Driving in Italy is fast and chaotic- I don’t recommend! The trains were wonderful - the Frecciarossa through Trenitalia was clean and comfortable. Pay the extra money for business class. We went for 3 weeks last year - Rome, Amalfi Coast, Abruzzo (visiting family), and we didn’t find a lot closed. I hope you have a fabulous trip! 🇮🇹"}, {"username": "Frank Hunt", "comment_text": "August was busy but not closed last year…..🤷‍♂️"}]}, {"id": "2192388921160186", "text": "Suppose it's you and your family (two adults and two kids) who are arriving in Rome on August 27th. Firts time in Italy. You'll be spending 2 days in Rome and you are departing from Italy on September 3rd. You want to explore more of Italy during your stay.\nYou have two options for your return flight: Venice or Milan. Milan would cost me half theआणखी price of Venice for the return trip.\nWhich one would you choose?\nAlso, would you rent a car for the duration of your stay or take the high-speed train directly? Car rental is relatively cheap, around $280 for 5 days. Looking forward to your suggestions. Thank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2192388921160186/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Andy Blackwood", "comment_text": "If you only have a week, I wouldn't suggest going all the way to Venice, even though it is an amazing place. Come back another time and visit it properly . After a couple of days in Rome, head for Florence and then Verona before returning from Milan. The trains are good. You don't need to rent a car though this obviously gives you a bit more flexibility."}, {"username": "Joe-Linda Po Agustin", "comment_text": "Milan, train."}]}, {"id": "2192385331160545", "text": "Can anyone give me some good advice on what hotels to stay at in Florence I will be there for two nights and I want to make the best of the tune nights that me and my husband will be there please and thank you￼", "link": "facebook.com/groups/1373361046396315/permalink/2192385331160545/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d7778\n170-Reviews-Pal\nazzo_Castri_187\n4-Florence_Tusc\nany.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2307\n23-Reviews-B_B_\nHotel_Firenze_P\nitti_Palace_al_\nPonte_Vecchio-F\nlorence_Tuscany\n.html"}, {"username": "Nancy Kirby", "comment_text": "Hotel Alessandra- right near everything (arno, uffizi, ponte veccio, etc)"}, {"username": "Robin Barbera", "comment_text": "Loggiata dei servi. Two blocks from the duomo."}]}, {"id": "2192376817828063", "text": "Hola Grupo!\n.\nLes comparto esta foto. Por abajo del puente Rialto, en Venecia 🇮🇹✨\n.\n.", "link": "facebook.com/groups/1373361046396315/permalink/2192376817828063/", "likes": 4, "comments": []}, {"id": "2192375767828168", "text": "Hi all! Just FYI that our Aer Lingus flight tomorrow from Naples to JFK has been cancelled. Been on hold for 40+ minutes so don’t have updates… any suggestions besides more Aperol Spritz?! 🤪", "link": "facebook.com/groups/1373361046396315/permalink/2192375767828168/", "likes": 4, "comments": [{"username": "Lauren-Jade Roberts", "comment_text": "Tomorrow is a strike day! Many aperol spritz"}, {"username": "Melissa McCormick", "comment_text": "At least it’s on your way home… ours got cancelled on the way there 😭 enjoy the extra day?!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Contact your travel insurance to get your expenses covered."}, {"username": "Lane West", "comment_text": "Nope. Sounds like you’ve got it covered! Good luck!"}, {"username": "Kristy Earnshaw", "comment_text": "The best suggestion is what you have already said! Enjoy another Aperol Spritz and hold onto that right mentality of it is what it is!!!"}, {"username": "Martha Tuzson Stockton", "comment_text": "This happened to my son in Budapest. We headed to the airport, stood in line, the attendant said he couldn’t “see” other flights, we had to call. I said we’d been trying for hours. He called for us and was able to get us rebooked on another route. Might not work, but I always feel going there in person gives you more options. You can keep calling on the way and while you’re there. Plus, if you get a spot on a flight, you’re already at the airport. My advice."}, {"username": "Patrice Helen Fanning", "comment_text": "Try to rebook on line and enjoy the extra time."}, {"username": "Jennifer Romero", "comment_text": "When is strike due to be over ?"}, {"username": "Susan Siewko Cos", "comment_text": "My flight Naples to a Milan 2 days ago was delayed but finally took off and I made my connection to JFK. My girlfriend had an earlier flight and they cancelled that one, so she missed her flight to JFK. She took a train to Rome booked another flight and finally got home. Good luck! Coming home is always stressful."}, {"username": "Cynthia Marie", "comment_text": "Enjoy an extra day in Italy! Woohoo 🍸🍸"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Archaeology Museum of Naples and then some Neapolitan pizza!"}]}, {"id": "2192374884494923", "text": "Travel from Rome to Naples , what is the best way?", "link": "facebook.com/groups/1373361046396315/permalink/2192374884494923/", "likes": 2, "comments": [{"username": "Lorie Russell Atkins", "comment_text": "High speed train."}, {"username": "Dan Uccello", "comment_text": "Rent a car. I just did it a couple days ago."}, {"username": "Jordan Schmale", "comment_text": "Rome2Rio or Omio app"}, {"username": "Anne Hoenig Steib", "comment_text": "Train!"}, {"username": "Angela Gilmore", "comment_text": "Train! Just one hour trip. Check on Trenitalia and Italo websites for tickets ;)"}, {"username": "Luka Mirkovic", "comment_text": "Train, download Omio app"}, {"username": "Michael Galan", "comment_text": "Train"}, {"username": "Swl Erra", "comment_text": "The traffic is insane. Use train and enjoy! Safe and cheap 👍🏻"}, {"username": "Antoinette Vuceric", "comment_text": "Train no brainer! Enjoy!"}, {"username": "Larry Reinier", "comment_text": "Train"}, {"username": "Christiana Gurgel Aguirre", "comment_text": "Train"}]}, {"id": "2192353044497107", "text": "Hi all. Planning a 10 day trip to Sicily with 6 adults total in October. Does anyone have a great itinerary, VRBO suggestions and don’t miss places to see? We are all in pretty good shape so grottos, hikes, cobblestone streets no problem. We love the water, food, wine and history. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2192353044497107/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Denise VeyVoda", "comment_text": "Thank you so much! 😊"}]}, {"id": "2192372394495172", "text": "Best private driving tour of\nRome at night?", "link": "facebook.com/groups/1373361046396315/permalink/2192372394495172/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nRome-Golf-Cart-T\nour-Best-Activi\nty-in-Rome/\nd511-360122P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2192365444495867", "text": "I’m planning a trip in December/January…\nHow far in advance can I or should I book specific site visits such as Academia, Vatican, Colloseum?\n\nLooks like trains are 2-3 months early but what about key sites and museums?", "link": "facebook.com/groups/1373361046396315/permalink/2192365444495867/", "likes": 1, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "I doubt you will have any need to pre-book during that time frame..."}]}, {"id": "2192360081163070", "text": "Any hotel suggestions in puglia? Also in Sorrento? Greatly appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2192360081163070/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g652003-d2507\n85-Reviews-Il_M\nelograno-Monopo\nli_Province_of_\nBari_Puglia.htm\nl monopoli"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d1656\n729-Reviews-Gra\nnd_Hotel_La_Fav\norita-Sorrento_\nProvince_of_Nap\nles_Campania.ht\nml sorrento"}, {"username": "Frances Scannapieco", "comment_text": "I have been to Sorrento three times and always stay at Hotel Antiche Mura. Right in the center. Fabulous"}, {"username": "Andria Saia", "comment_text": "Puglia is a huge region - do you have a city in mind? We did an Airbnb in Bari that was amazing"}, {"username": "Virgz Van Møøre", "comment_text": "Palazzo Montefusco"}, {"username": "Steve Partridge", "comment_text": "Proud Garden in Caravigno. Stunning hotel retreat"}]}, {"id": "2192359794496432", "text": "My husband-to-be and I are traveling to Italy for our honeymoon in October this year and we are looking for any and all recommendations, but especially for a great horseback riding tour - preferably one that you can ride on the beach! We will be visiting Rome, Naples, Amalfi Coast/Capri Island, and Venice! Any suggestions are appreciated!! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2192359794496432/", "likes": 13, "comments": [{"username": "Tanya Lococo", "comment_text": "It’s not on the beach but there’s horse riding in Rome itself. It’s 10 minutes from the centre and you ride the first road built to Rome. Historically very interesting"}, {"username": "Maddy Cook", "comment_text": "The Borghese gallery in Rome was spectacular. Be sure to reserve tickets ahead of time (that seems to be the case with almost all museums and experiences). Probably obvious but the Roman Forum + Colosseum tour is unreal, make sure you get to go inside!"}, {"username": "Margaret Mackenzie", "comment_text": "I cannot see much riding on the beach happening near Amalfi - too many umbrellas and lounges. Maybe on the west coast of Tuscany?"}, {"username": "Swl Erra", "comment_text": "I can recommend you a photographer insta @emgarro\nHe made lifetime memories from our trips and really worth it.👍🏻👍🏻"}, {"username": "Claudia Castellini", "comment_text": "I don’t think you can find horseback riding tour on the beach in the places you mentioned; it may be easier in Maremma, Tuscany."}, {"username": "Maria Teresa Correale Willoughby", "comment_text": "As Nicola Algerino mentioned in his comment in Italian, Not far from Rome , the beach in Ostia . He also added a link for you to see . I’m sure you can find the address there."}, {"username": "Angela Gilmore", "comment_text": "Speaking of riding a horse, I know that there is a riding tour in the Vesuvio National Park, but it's not on the beach obviously 😅\nAnd considering the type of beaches I think they do not offer this type of experience. It seems something you could do in the Riviera Romagnola maybe (just thinking on the type of beaches and maybe some areas of Puglia? 🤔)"}]}, {"id": "2192349734497438", "text": "View from our hotel room. ⛲️", "link": "facebook.com/groups/1373361046396315/permalink/2192349734497438/", "likes": 20412, "comments": [{"username": "Ben Fedirko", "comment_text": "Been there! And it's true... if you throw a coin over your shoulder into it... you'll be back! It worked 4 times!"}, {"username": "Valerie Griffiths", "comment_text": "One of the most romantic places to get engaged 💍 😍 for my work colleague Ryan Shaw and Alice"}, {"username": "Caron Thornhill", "comment_text": "Wow! Amazing!"}, {"username": "Sueli Nastri", "comment_text": "Lugar mágico"}, {"username": "Annette Brund", "comment_text": "Christian Ljunggren Brund Kasper Fisker det ligner jeres 🇮🇹"}, {"username": "Ted Frances", "comment_text": "How much a night if I may ask ???"}, {"username": "Sarah Bland", "comment_text": "Paradise island 🏝️"}, {"username": "Konstantina Kanellopoulou", "comment_text": "Αmazing!"}, {"username": "Léda Fenyő", "comment_text": "Benne a lóvém"}, {"username": "Léda Fenyő", "comment_text": "Mitöbb oda se fèrni közelebb olyan sok állandóan a csodálója bár olasz országba rengeteg szökőkút van"}, {"username": "Shakuntla A Singh", "comment_text": "After seeing this, I feel like to visit Italy again 😍"}, {"username": "Maha Rashad", "comment_text": "Fav♥️"}, {"username": "Tiny Hartgring", "comment_text": "Zo mooi."}, {"username": "José Celestino Celestino", "comment_text": "Beautiful"}, {"username": "Patti Bucci-Denike", "comment_text": "Beautiful view!"}, {"username": "Ma Ga", "comment_text": "Ma Ga"}, {"username": "Hans van Dinten", "comment_text": "Gelukkig zijn er geen feyenoord supporters"}, {"username": "Patty Hill", "comment_text": "Been there with my husband way back in the 70s amazing"}, {"username": "Aoife Crowley", "comment_text": "Sarah Dervan Lynn Slattery"}, {"username": "Rebecca Depaul Aloi", "comment_text": "Truly am amazing place ❤️🥰"}, {"username": "Tcr Hernandez", "comment_text": "A place that i wish to visit someday with my beloved RMT 722.2023🙏🙏🌹❤️🌹🙏🙏"}, {"username": "Sandy Bivens Cheatham", "comment_text": "THIS WAS ANOTHHER WONDERFUL PLACE WE TOURED WHEN WE WERE IN ROME. IT IS A BEAUTIFUL PLACE ON THIS EARTH."}, {"username": "Pattie Kiser", "comment_text": "Beautiful"}, {"username": "Patricia LoMonaco Bogue", "comment_text": "I was there"}, {"username": "Sony Thaliath", "comment_text": "I was there"}, {"username": "Annie Tossings", "comment_text": "Beautyful Rome 🇮🇹🥰🤩"}, {"username": "Shirazi Godschalk", "comment_text": "Eden David"}, {"username": "Olivier Ricard", "comment_text": "Olivier Ricard"}, {"username": "Olivier Ricard", "comment_text": "Olivier Ricard"}, {"username": "Diane Arnstein", "comment_text": "Don’t forget to toss the coin across your chest and over the opposite shoulder…back turned toward the Fountain."}, {"username": "Miriam Mendoza", "comment_text": "Bellaaaaaa"}, {"username": "Judith Testa", "comment_text": "Noisy til 3 or 4 am! I would NEVER want a hotel room there!"}, {"username": "Carol Coppola", "comment_text": "Wow...beautiful"}, {"username": "Sharyn Getzels", "comment_text": "Fountain beautiful. Surroundings not so nice"}, {"username": "Andre LeCesne", "comment_text": "I love ❤️ this place"}, {"username": "Norma Glory", "comment_text": "I dropped a coin with a wish to visit Trevi fountain again."}, {"username": "Mika Cohen", "comment_text": "Din Emanueli🥹🥹"}, {"username": "TerryandMichelle O'Sheades", "comment_text": "We stayed there it was amazing"}, {"username": "曾小敏", "comment_text": "請問飯店名"}, {"username": "Else Nieuwenhuyse", "comment_text": "Bellicima"}, {"username": "Phyllis Schriedel", "comment_text": "Just there!"}, {"username": "Elly D'Amico", "comment_text": "I love Rome💜🔝🤩"}, {"username": "Donna Yablonski", "comment_text": "been there"}, {"username": "Ofelia Orozco", "comment_text": "Bello"}, {"username": "Rosemary Licata Freeman", "comment_text": "🇮🇹❤️❤️❤️"}, {"username": "PietenAnne Ros van Blerck", "comment_text": "Geweest heeel mooi maar druk"}, {"username": "Patricia Arce", "comment_text": "I wonder how much money is tossed in that fountain in a year."}, {"username": "Victoria Tursi", "comment_text": "Love the hotel fontana"}, {"username": "Marie Langschultz", "comment_text": "Love this and I’ve been there"}, {"username": "Annie Caubert", "comment_text": "La magnifique fontaine Trevie !"}, {"username": "Linda Eifler", "comment_text": "Beautiful!"}, {"username": "Martha Leal", "comment_text": "Inolvidable"}, {"username": "Joann Scali Higgins", "comment_text": "Visited this beautiful fountain in March and it was amazing!"}, {"username": "Wanda Gray-Rose", "comment_text": "It was breathtaking!"}, {"username": "Mihail Draghici", "comment_text": "O minunăție arhitectonica !!"}, {"username": "Gilmar Dechichi Bortoloto", "comment_text": "A cidade de Serra Negra-SP ,fez uma copia deste local."}, {"username": "Gilmar Dechichi Bortoloto", "comment_text": "."}, {"username": "Carmen Briceño", "comment_text": "Es una belleza spectacular"}, {"username": "Linda Ellason", "comment_text": "So crowded all of the time."}, {"username": "Susan Oden Kaiser", "comment_text": "Been there"}, {"username": "Galyna Kuian", "comment_text": "Bella Hotel Fontana!"}, {"username": "Galyna Kuian", "comment_text": "Galyna Kuian"}, {"username": "Diane Minakowski", "comment_text": "Love it"}, {"username": "Luciene De Sousa Guimaraes", "comment_text": "Grande merda!"}, {"username": "Donna Strinden", "comment_text": "So pretty"}, {"username": "Janice A Frank", "comment_text": "Cannot wait to see this in October."}, {"username": "Donna Montealegre", "comment_text": "I’ve been in this nice spot 2016 😍"}, {"username": "Gayle Lallman Suppe", "comment_text": "I stayed there and the view was amazing"}, {"username": "Sherri Massey", "comment_text": "Love that\nPlace !"}, {"username": "Krystyna Nowak", "comment_text": "Byłam"}, {"username": "Linda Heath", "comment_text": "What is the hotel called"}, {"username": "Beata Łuczyk", "comment_text": "Pięknie tam było i piękne wspomnienia polecam"}, {"username": "Lucia Machado", "comment_text": "Lindo demais!"}, {"username": "Georgia Weston", "comment_text": "Jordan Bloss"}, {"username": "Joanna Hess", "comment_text": "❤️❤️"}, {"username": "Patricia Gribbin", "comment_text": "Such a gorgeous place.❤❤❤"}, {"username": "Heidi Gamble", "comment_text": "My little girl is there , have the best time ever !!!❤️🙏"}, {"username": "Suzanne Caulfield", "comment_text": "I threw in a coin there !"}, {"username": "Vanessa Hartgrove", "comment_text": "Vanessa Hartgrove"}, {"username": "Ayesha Talha", "comment_text": "Talha Mansoor"}, {"username": "Eleonora Rusu", "comment_text": "Eleonora Rusu"}, {"username": "Charley Palser", "comment_text": "Tommy Whiting"}, {"username": "Vicky Vega", "comment_text": "Una belleza dios me permitio conocerlo, gracias, gracias gracias mi jesus amado👍"}, {"username": "Katherine Winrock", "comment_text": "Go."}, {"username": "Janete Euzebio", "comment_text": "Nossa que lindo 😍"}, {"username": "Peggy Williams", "comment_text": "Oh yes!"}, {"username": "Tina Mazzocco", "comment_text": "Bucket list"}, {"username": "Leonela Sierra", "comment_text": "Es impresionante yo no pude bajar pero tiré mi moneda es una locura linda experiencia mi deseo cumplido"}, {"username": "Mary Lombardo", "comment_text": "Best country to travel"}, {"username": "Robin Kelly", "comment_text": "Looks. Very busy !"}, {"username": "Жанна Ростовцева", "comment_text": "Название отеля можно?"}, {"username": "Γαρυφαλλια Βαμβακουλα", "comment_text": "Γαρυφαλλια Βαμβακουλα"}, {"username": "Tor Holst", "comment_text": "Expensive Hotel Room Noisy all Time"}, {"username": "מירב סטופניצקי", "comment_text": "ווואווו"}, {"username": "Zilda Matos Domingues", "comment_text": "Amei esse lugar."}, {"username": "Deb Holton", "comment_text": "Beautiful"}, {"username": "Kathleen Bolton", "comment_text": "Beautiful the eternal city xx"}, {"username": "Madeleine Frankinouille", "comment_text": "Dat valt heel goed mee het is prachtig"}, {"username": "Carol Morris Settel", "comment_text": "Hotel Trevi is right around the corner and so much cheaper."}, {"username": "Enza Sciurba", "comment_text": "Beautiful I was there a month ago ."}, {"username": "Hilda Howerton", "comment_text": "Always loved going to Italy!"}, {"username": "Ann Pieri Belt", "comment_text": "Three coins in the fountain!!"}, {"username": "Bernadette Lampkins", "comment_text": "Rome...wat a wonderful city...the people are amazingly friendly...sooo\no many things to see...the food...unbeliev\nably fresh..wholesom\ne..shopping...c\nrazy...what beautiful leather goods...once you get there...you wont want to leave. And...dont forget the vatican...even if you are not Christian..its incredible!!"}, {"username": "Bernadette Lampkins", "comment_text": "The Trevi...not to be missed..turn your back..throw a coin..make a wish...Dec..is sooo fun..chilly..ro\nasted chesnuts on the corners...baci chocolates"}, {"username": "Ted Ozdowski", "comment_text": "I h-8 you! Your room had to have been TRÉ$ chére! ♥️"}, {"username": "Armando Monrroy Rodriguez", "comment_text": "Me ha resultado las monedas que aventé a la fuente."}, {"username": "Liezl Millroy", "comment_text": "I've been there😀"}, {"username": "Ann Marie Hale Sada", "comment_text": "The beautiful Trevi fountain"}, {"username": "Mariana G. Cr", "comment_text": "Dnia Crasborn de Rivera 🙌🏽"}, {"username": "Joanne Coppola", "comment_text": "Loved it♥️🇭🇺"}, {"username": "Maria Do Carmo Claudio", "comment_text": "É linda!"}, {"username": "Patricia Gaby", "comment_text": "Rhooo le top et quelle vue j adore"}, {"username": "Terri Slade", "comment_text": "My favorite fountain!"}, {"username": "Jean Anderson", "comment_text": "Beautiful"}, {"username": "Sunsary Keo", "comment_text": "Very beautiful ❤️"}, {"username": "Paul Winkelman", "comment_text": "I spent some time here, and it was absolutely magical. So pretty."}, {"username": "Αζελα Καρα", "comment_text": "Αζελα Καρα"}, {"username": "Dimas Pereira Santos", "comment_text": "Estive aí no ano passado, saudade."}, {"username": "Richard Borrelli", "comment_text": "Nice picture"}, {"username": "Sigrid Van Damme", "comment_text": "Dorry Van Den Vreken en zeker niet vergeten een munt in te gooien he 😉"}]}, {"id": "2192349647830780", "text": "Car rental question - Is CDW and zero deductible the same thing? Or is it two separate insurances? I don't see CDW mentioned in some of the quotes we've gotten, but I know it's a requirement so wasn't sure if it was already included. Or, if we'll have additional to pay when we get there. Also, any car rental companies to stay away from? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2192349647830780/", "likes": 0, "comments": [{"username": "Sandra Shoffner", "comment_text": "CDW I think is collision damage waiver, not the the same as the excess insurance which is 0 liability."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}]}, {"id": "2192345487831196", "text": "Positano🇮🇹💙☀️", "link": "facebook.com/groups/1373361046396315/permalink/2192345487831196/", "likes": 181, "comments": [{"username": "Mike LeClear", "comment_text": "You look stunning!"}, {"username": "Francesco Ronchi", "comment_text": "Beautiful, and Positano looks good too"}, {"username": "Luuis Ojeada", "comment_text": "Bonito marco, para una bella chica."}, {"username": "Chris Pumpa", "comment_text": "Stunning 😍 😍!!!!!!!!!"}, {"username": "Krishant Salgado", "comment_text": "Beautiful Bella in beautiful Positano"}, {"username": "Mohamed My", "comment_text": "Mohamed My"}]}, {"id": "2192342514498160", "text": "What other cities/ places must see that are very close to Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2192342514498160/", "likes": 1, "comments": [{"username": "Swl Erra", "comment_text": "Santa Marinella, Cinecitta world,\nAnzio/Nettuno , Sperlonga 👍🏻"}]}, {"id": "2192340981164980", "text": "Going for 10 days in Italy (plus 2 days traveling). Expecting to put everything on the card that I can, so basically tips and small purchases in cash. I have 5 private tours and 2 days private driver.\n\nHow much cash do I need to bring?\n\nTIA and be kind 😁", "link": "facebook.com/groups/1373361046396315/permalink/2192340981164980/", "likes": 7, "comments": [{"username": "Diane Euston", "comment_text": "I was in Italy for 2 weeks and spent about €150- everything else on the card. I could’ve gotten by with €75 probably!"}, {"username": "Kyna Martin Autrey", "comment_text": "I only needed cash for some taxes paid to hotel in cash upon arrival. Took out between 400 - 500 at an ATM and just spent the rest on little purchases and used it for meals on last days just to use it up. Card worked everywhere for everything."}, {"username": "Lauran Cantwell", "comment_text": "I would do $500. In addition to driver and tour guide tips, there is also taxis and airport porters. Also in most restaurants, you cant put tip on card....they said it had to do with taxes. If towards the end you find you need more, just use atm. If you still have a little extra, just pay cash."}, {"username": "Kerry Collins", "comment_text": "€ 1000 for us"}, {"username": "Shana Woodfield", "comment_text": "At least a couple hundred USD or € for tips."}, {"username": "Patrick Poole", "comment_text": "500..make sure to bring some 1 euro coins.. most public bathrooms are not free and they don't take dollars"}, {"username": "Alessandro Iannelli", "comment_text": "In my opinion, the only cash that a tourist can't do without in italy is coins for restrooms, the average fee is 1 euro. Yes, you can go for free to a restroom of a bar if you buy something but they often suck. Other than that, it's entirely up to you. Even just a hundred euros can be enough, for the small purchases. Also, don't feel obligated to give tips, it is just not a part of italian culture."}, {"username": "Maria Coladangelo Ducca", "comment_text": "I would bring 5,000 $ ( equivalent of)in euros"}, {"username": "Donna Templet Brignac", "comment_text": "It’s a personal thing. I’m not comfortable without cash in my wallet. Just got back from Italy. I took $1000.00 in euro. Only put 200 in my wallet at a time. I had a Capital One Credit Card and Debit card with no fees. I find cash easier for Taxis and sometimes you can save a little money on purchases if you pay with cash. This is just my experience, hope it helps!"}, {"username": "Jenny Payne", "comment_text": "I always take more than enough cash but no big deal if you don’t use it 🌻"}, {"username": "Michelle Howard", "comment_text": "We are staying in Vrbos in Venice and Florence and Sorento and we’re told we have to pay the city tax via cash at check in."}, {"username": "Brian Osman", "comment_text": "I would start with 500 euro and if you need more get it from a bank ATM ,not just any ATM"}, {"username": "Kris Beacham", "comment_text": "Not a lot. Maybe a couple of hundred.\n\nThere is not a huge tipping sculpture there, so I might to dinners on my card like you.\n\nIf everything else is already paid for, you’ll have to go out of your way to find situations to tip."}, {"username": "Jackie Fochtman", "comment_text": "Kellie McKinley Fochtman"}]}, {"id": "2192334644498947", "text": "I’m looking for a driver for the duration of our trip - starting in Naples and ending in Turin. Just someone to drive us from location to location as we move locations and also just out and about some days. Will need something the majority of the days we’re there (~2 weeks). I’ll take recommendations for specific drivers and/or companies. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2192334644498947/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Linda Metallo Casey", "comment_text": "Call Mena Forino with Amalfi Coast Transfers. They are private drivers and the best."}, {"username": "Darlene Dommermuth", "comment_text": "Fabrizio is the owner of All Around Italy. He and his staff are awesome!!!!"}]}, {"id": "2192334311165647", "text": "Rome public transit vs hop on hop off bus? What do you recommend and why? Staying in Prati district. Wanting to visit the historical sites, vatican, piazzas, etc.", "link": "facebook.com/groups/1373361046396315/permalink/2192334311165647/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nRome-Golf-Cart-T\nour-Best-Activi\nty-in-Rome/\nd511-360122P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Laura Allen Weinstein", "comment_text": "The lines for the hop on/off bus were sooo long. Rome is very walkable. But if not, use public buses or metro. Cheaper & you have a better chance of getting a seat."}]}, {"id": "2192330921165986", "text": "Hi there! This is our first time traveling to Italy. We are coming from Zurich and need to end in Lyon for a wedding. So far, this is our itinerary:\nVenice for 2 nights\nFlorence 3 nights\nCinque Terre area 2 nights\nTurin 1 night.\nTrain to Lyon\n\nWould love some thoughts and if we are missing something important in that path, please share! TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2192330921165986/", "likes": 1, "comments": []}, {"id": "2192326041166474", "text": "Hi, am visiting Rome for a wedding at the end of August. Have booked to fly from Dublin into Venice and a two night stay at the MonteCarlo Hotel. Has anyone any advice. Then hoping to take a fast train to Rome after that with a three night stay at the Hotel Art at the Spanish Steps. Has anyone stayed at these hotels any good or bad points. Two adults and one 15 year old travelling?", "link": "facebook.com/groups/1373361046396315/permalink/2192326041166474/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192321021166976", "text": "Wich Beach Club is the best in Positano ? And why :)\n- Arienzo\n- Incanto\n- Pupetto", "link": "facebook.com/groups/1373361046396315/permalink/2192321021166976/", "likes": 14, "comments": [{"username": "Stacy Prestigiacomo", "comment_text": "Just came from Arienzo it was awesome"}, {"username": "Stacy Prestigiacomo", "comment_text": "Stacy Prestigiacomo"}, {"username": "Eliza Johnston", "comment_text": "Alex Kate knows a few, feel free to shout her a message!"}, {"username": "Tara Roed", "comment_text": "Arienzo was amazing!! We loved it. We also did one fire in Praiano. Love them too….but Arienzo is perfection to me"}, {"username": "Stephanie Osborn Rushing", "comment_text": "We are doing la scogliera…hope it’s good!"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Arienzo will be closed (10/8) when we arrive. It’s pricey, but who couldn’t resist its fabulous orange striped style?\n\nIf going for summer this year, it’s likely booked solid."}, {"username": "Fatima Larios", "comment_text": "How do you make rtw reservation?"}, {"username": "Andrea Gattini Pennington", "comment_text": "We didn’t want to spend as much as Arienzo (although it looked great) we did one day at Incanto to be on Grande Spiaggia and one day on Puppetto which is quieter and on Fornillo beach. Restaurant Da Fernandina on Fornillo for lunch is excellent. It is one down from Puppetto’s restaurant."}, {"username": "Rory Panepinto", "comment_text": "There is a section of the beach that is FREE 🤦🏻‍♂️. Spend your money on drinks & walk to the beach- or spend the extra at a great restaurant !! If you want to pay for a lounge chair - then there are plenty options for a fee $$."}, {"username": "Shirlee Hallman", "comment_text": "Is it just a beach club or is there a hotel as well?"}, {"username": "Denise Curtis", "comment_text": "One Fire Beach club. Cheaper and DJ music all day. Check into the Watermelon hour on YouTube"}, {"username": "Cettina Milioto", "comment_text": "We did Incanto it was great"}, {"username": "Jamie Mae", "comment_text": "La scogliera is the absolute BEST"}]}, {"id": "2192320354500376", "text": "Hello everyone - we’re excited to finally go on the trip of our dreams to Italy in a few weeks.. I’m nervous about the packing as we are travelling to Rome, Sorrento, day trip to Amalfi, Florence and Venice! Any packing tips? And the biggest question- any tips for good travel dual voltage hair dryers/ dryer brush?? Thank you in advance - this is an amazing page!", "link": "facebook.com/groups/1373361046396315/permalink/2192320354500376/", "likes": 5, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/44LUOV4"}, {"username": "Marie Cuzzi", "comment_text": "Most hotels have hairdryers and it’s so hot there now your hair will dry in 5 minutes"}, {"username": "Lorie Russell Atkins", "comment_text": "I didn’t pack very well when we went to Italy & Greece last month. My bag was too full to qualify for carry-on. 😩 However, I really liked using packing cubes because they kept my clothes organized during our 14 day trip. The weather was very hot 6/18-6/30 in Rome and the Almafi Coast. I didn’t pack a hairdryer or dryer brush because I didn’t want to spend $40 on a new dryer. I used the hotel hairdryers (work just fine) and packed my round brush for drying the front of my hair. Like I said it was so hot that using a hairdryer for 15+ mins would’ve made me need another shower. Honestly, just about every day I’d walk out of our hotel, braid or clip my hair back and put on my cute hat. Happy Travels!"}, {"username": "Gloria Maledi", "comment_text": "it's usually very hot. Trust me, don't underestimate that, bring the lightest clothes you have. Just at night by the sea there might be a possibility that you'll need a cardigan or something but during the day I don't think so.\nShoes must be comfortable, you're going to walk a lot on cobblestone"}, {"username": "Anna Stuckey Wheeler", "comment_text": "I can add more info. later but check to see if your current appliances are dual voltage. If so, you will only need the adapters to have them work with the EU outlets."}, {"username": "Allan Olexa", "comment_text": "Pack lightly. If you need anything, buy it there. Electronics charge fine on 220 V. We are in Europe several times annually so my daughter just bought an inexpensive hair dryer there."}, {"username": "Madeline Caporale", "comment_text": "Be sure to buy dual voltage hair dryer and/or dryer brush and take an adapter."}, {"username": "John Licata", "comment_text": "Pack wicking/quick dry clothes, use a washing machine if you’re in a VRBO/AirB\nLimit your electronics, most places have a hair dryer\nWear cork-soles sandals, they cushion your feet and limit need for socks, etc\nLight /crush hat\nA light silk/poly shawl if you want to get into churches that sometimes have restrictions on shoulders and short skirts/shorts"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Compression bags that you just roll up to release the air. I got a 20 pack on Amazon. They really help reduce the volume of your clothes. I also brought a few spares for an new items we bought. I have the hot tools (purple) dual voltage hair dryer. It’s small and fold and works as good as these things do. Very light clothes are a must it’s hot, we are here now."}]}, {"id": "2192303377835407", "text": "Going to Italy for the first time in September, torn between Sorrento and Sicily, what’s everyone’s thoughts\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2192303377835407/", "likes": 19, "comments": [{"username": "Kimberly MacKinnon Cherry", "comment_text": "My first time in Italy I went to Sorrento, loved it. Good jumping off point to Amalfi Coast and Pompeii. I have not been to Sicily, but it's on my bucket list."}, {"username": "Cathy Hayes", "comment_text": "Do both\nAll of Italy is amazing,but all are so different to each other ."}, {"username": "Imperia Arcidiacono", "comment_text": "Sicily is a must"}, {"username": "William Muth", "comment_text": "Planning a trip to Italy in September. ROME, then Florence, then Venice. Plan on renting a car to drive from Rome to Venice.\nAny feedback?"}, {"username": "Nicola Algerino", "comment_text": "Sicilia !"}, {"username": "Emma Pringle Tinson", "comment_text": "Taormina sicily"}, {"username": "Robin Barbera", "comment_text": "Lot to see in Sicily depends on where and fir how long"}, {"username": "Lori Scappaticci", "comment_text": "Sorrento."}, {"username": "Melissa Miceli Alomia", "comment_text": "Sicily 💯"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "How much time are you going for?"}, {"username": "Allan Olexa", "comment_text": "What care your interests? We like being in a location to live like a local in an Airbnb so Catania, Sicily for us."}, {"username": "Nancy Campanella", "comment_text": "Sicily !"}, {"username": "Davide Buccieri", "comment_text": "Sorrento"}, {"username": "Roland Trego", "comment_text": "If it's your first time, I would recommend Sorrento and the Amalfi Coast. On the other hand, if your pocketbook is a consideration, Sicily is considerably less expensive."}, {"username": "Linda San Paolo", "comment_text": "Been to Sicily May 2023.... although I enjoyed I would choose to go to Sorrento for the scenery. Unlike Rome where most everyone speaks English, the there definitely was a language barrier in Sicily."}, {"username": "Susan Palmer", "comment_text": "Both wonderful for different reasons"}, {"username": "Bonnie Rodgers Henderson", "comment_text": "Have done both. Would return to both but for different reasons. Sicily was settled by the Greeks, so archaeology is a little different. Loved the Sicilian wines, people and food."}, {"username": "Ryan Haynes", "comment_text": "Need at least 10-14 days to do Sicily properly, can do Sorrento in 2-3 days."}, {"username": "Gillian O'Callaghan", "comment_text": "Sicily for sure."}, {"username": "Virgz Van Møøre", "comment_text": "Sicily"}, {"username": "Jackie Southwell-Hall", "comment_text": "I’m going to Sorrento in September, purely to eat, relax and explore… using it as a base"}, {"username": "Jenny Payne", "comment_text": "Sicily for sure, you won’t regret it🌻"}, {"username": "Maria Menendez Dayi", "comment_text": "Sorrento if not much time. They are both worth and beautiful"}, {"username": "Stella Dee", "comment_text": "Sorrento!"}, {"username": "Elisa Marte", "comment_text": "Sicilia"}, {"username": "Michela Piovesan", "comment_text": "Assolutamente Sorrento!!!!"}, {"username": "Eka Chelidze", "comment_text": "Both of them ...👍👍"}, {"username": "Dimity Betar", "comment_text": "Sicily is a week or more , sorrento is a few days"}, {"username": "Iliana Zlatareva", "comment_text": "Sorrento, Amalfi, Capri, Napoli first"}, {"username": "Yolandé van der Westhuizen", "comment_text": "Sicilia ALWAYS 🥰"}, {"username": "Ricky Bates", "comment_text": "Been to both , both beautiful places , I'd go back to sicily but not sorrento , if that helps"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Marie Cuzzi", "comment_text": "Sicily"}, {"username": "Rita Sanza", "comment_text": "Sicily"}, {"username": "Keith Piccirello", "comment_text": "Florence"}, {"username": "Denise Robinson", "comment_text": "Been to both many times, Sorrento edges it for me bit if you can’t decide toss a coin xx"}, {"username": "Ro Renna", "comment_text": "Both are great. I think both have great beaches but Sicily has more to see if you like to visit different towns"}, {"username": "Hudd Cass", "comment_text": "I’ve been to both and hands down would choose Sicily. I was there a few weeks ago and cannot enemies I hadn’t been before. We stayed in Taormina for 6 days and drove to places like Catania for dinner one night, did a winery tour around etna and beach clubs and an Ancient Greek amphitheater - It has it all there."}, {"username": "Hudd Cass", "comment_text": "Also depends how much time you have. You need more time in Sicily cos so much to see and do, whereas I was happy with 2 days in Sorento."}, {"username": "Pietro Di Sorbo", "comment_text": "If you are deciding to spend 15 days go in Sicily."}, {"username": "Terri Boncore", "comment_text": "Sorrento"}, {"username": "Rachel Gallacher", "comment_text": "I want to sorrento last month solo, it was the best holiday I've ever had. Everywhere was stunning, everyone was friendly and helpful, loved every single moment and left my heart there. Went to top of versuvius, pompeii, amalfi, positano, ravello and capri. Defo going back next year and usually, as a rule I don't go the same place twice. Sorrento stole my soul!"}, {"username": "Anna Costanza", "comment_text": "Sicily ! So much to see and discover"}, {"username": "Lisa Martinez", "comment_text": "LOVED Sorrento and Taormina! Eapecially Sorrento!"}]}, {"id": "2192298384502573", "text": "Heading to Italy in April for the first time. Flying in and out of Rome and spending time in Rome and Umbria. We have 3 additional days in the itinerary and I’m completely torn between Florence and Positano. Where would you go between the 2?", "link": "facebook.com/groups/1373361046396315/permalink/2192298384502573/", "likes": 1, "comments": [{"username": "Andy Blackwood", "comment_text": "For a first time visit, it has to be Florence."}]}, {"id": "2192292474503164", "text": "Hi, I have booked the semi private Vatican and St Peter’s Basilica 7:30 am tour through Viator. If you have taken this tour, how long does it last? We are leaving Rome and heading to Sorrento after the tour and I’m trying to determine what time I should get train tickets so I can plan for a private transfer to pick us up in Naples to drive us to Sorrento.", "link": "facebook.com/groups/1373361046396315/permalink/2192292474503164/", "likes": 0, "comments": [{"username": "Vanessa Basara", "comment_text": "I did the same tour through Viator - it’s was 8.00 with breakfast - took till about 9:30-, then toddled off on our own .\nPrivate transfer from\nNaples to Sorrento which we did also n stopped at Pompei we used Ciro la Motta he’s on Fb- great drivers n cars"}, {"username": "Laura Allen Weinstein", "comment_text": "We didn’t do viator, but we did another semi private 7:30am we finished around 12:30ish. We took a 20min break to grab coffee ☕️ mid way through. Idk 🤷🏻‍♀️ if your tour will do the same. Ours also included Sistine chapel. Getting a cab to termini was the worst. They wanted 30€ cash."}]}, {"id": "2192289354503476", "text": "In Milan. We would like to take a day trip to Lake Como. Would go via train. Can we see/experience the lake in the town of Como itself that is near the Como train station or do we need to go to another town? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2192289354503476/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lake-Como/\nSmall-Group-Lake\n-Como-Bellagio-\nand-Lecco-Full-\nDay-Trip-from-M\nilan/\nd26113-6404P13?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Andy Blackwood", "comment_text": "It's a 10 minute walk from the train station to the lake."}, {"username": "Sande Ricci", "comment_text": "Yes! You can take the ferry around the lake"}, {"username": "Gloria Maledi", "comment_text": "the train station is very close to the lake. The city of como itself is very beautiful"}, {"username": "Olga Pasfield", "comment_text": "Definitely take the ferry around the lake. You don't get a decent experience from the city of Como itself"}, {"username": "Zanna Darcy", "comment_text": "Take the train to Varenna then a ferry across the lake or just to Bellagio. Varenna is much more charming than Como"}]}, {"id": "2192262604506151", "text": "Question about ferry tickets on Lake Garda. We will need tickets from Desenzano to Lazise on Tuesday 8/1. Is it advisable to buy the tickets in advance?", "link": "facebook.com/groups/1373361046396315/permalink/2192262604506151/", "likes": 0, "comments": [{"username": "Kathi Keefauver Thompson", "comment_text": "Anyone have any experience with these ferries?"}]}, {"id": "2191778524554559", "text": "Tickets are bought to fly into Rome on the 9th of August then we leave on the 12th for a cruise from Rome. I desperately wanted to go to Venice. I only booked the flight to Rome because Venice was in a drought, but now the water levels have returned to normal. I am thinking I should change our tickets to fly into Venice, stay the night then takeआणखी the high speed train to Rome. This is our 1 shot, we may never make it back there. To all the people that have made that trip, is it worth the hassle and do you have any tips on getting\nto Rome?\nUpdate: We actually save $600 by going into Venice. I'm so happy. We'll arrive before 10am. We'll do 1 night there then head to Rome. Thanks so much for all of your input. I feel confident now of how to get to Rome. Can't wait!", "link": "facebook.com/groups/1373361046396315/permalink/2191778524554559/", "likes": 7, "comments": [{"username": "Ilaria Conte", "comment_text": "Take the Frecciarossa train from Rome Termini to Venice Santa Lucia. It takes about 4 hours to reach Venice.\nAlternatively, change your flight if it doesn't cost you too much. Nevertheless, Venice is worth seeing, especially if you're not coming back again."}, {"username": "Hen Garrett", "comment_text": "Venice is beautiful but I can’t get enough of Rome. However for a summer visit, Venice might be less oppressively hot. I would still fly into Rome as it’s an easy airport to access and get the fast train to Venice so you can enjoy some views on the way."}, {"username": "Mary Anne", "comment_text": "Fast train to Rome is easy. Four hours, no changes. Venice is worth it!"}, {"username": "Kelly Reagan", "comment_text": "Worth the hassle. The train is a breeze."}, {"username": "Tracy Foss", "comment_text": "Can you change your tickets to fly home from Venice and stay a few extra days ?"}, {"username": "Tracy McKean", "comment_text": "Love Rome! I’m\nGlad I saw Venice and hope to see it again but I didn’t love It"}, {"username": "Joe-Linda Po Agustin", "comment_text": "If it’s expensive to change arrival airport to Venice, you can take the fast train to Venice on the 9th and go back to Rome late afternoon of the 11th. This will give you one full day plus a half day in Venice. Just make sure you arrive in Rome a day before embarkation day. A bit rushed, but you did say it is your one shot."}, {"username": "Frank Hunt", "comment_text": "Rome and surrounds are better and easier to visit than Venice, use your 3 days wisely."}, {"username": "Nancy Lewis", "comment_text": "I prefer Rome. Would stay as long as possible there before cruise. I feel there is so much more to see in and around Rome. Personal opinion."}, {"username": "Jay Hotte Thompson", "comment_text": "I LOVED Venice. Spent 4 days there last May. Would go again in a second. We flew into Venice, it was very easy. Vaporetti (water buses) are super easy and fairly cheap. But Venice is extremely walkable. To everywhere. We always either fly into or out of Rome and spend a few days there. It's a beautiful city, but highly recommend Venice. Especially if it's a want and you may never get back. High speed train from Venice to Rome is also super easy and cheap. We use Trenitalia when in Italy."}, {"username": "Sylvia Salinas Pastrano", "comment_text": "This sounds like something we might like to do. Has anyone on this thread bought a train ticket to Venice from Rome? Approximately what is the cost.\nI can look it up if someone can give me the name of the train line and /or app.\nPlanning our first trip to Italy in April. Thank you."}, {"username": "Annette Mayer", "comment_text": "Ok..one more opinion. After being twice in Rome and Venice. I would pay for fast train and get over to Venice . First book a hotel..its high season. Spend the time and take the train directly to port city night before your cruise.\n\nWhat to do in Venice? Keep your camera ready and just wander. I wouldn't even worry about tours. The city is just magic. If you want to splurge find a gondola on a small canal away from the train station or Grand Canal. See a gelato store? You need to stop and have some. Find what looks like a little bar and have a x wine and some chichetti.(litt\nle bites)."}, {"username": "Maria Coladangelo Ducca", "comment_text": "So much to see in Venice . Go there for the week .! Cancel cruise"}, {"username": "Victoria Laverty", "comment_text": "Yes"}, {"username": "Amy So", "comment_text": "Venice was magical even with one night. Make sure you go for the gondola ride. We did the gondola ride at 6:30 pm and it was really nice. About 35 mins for 80 euros."}, {"username": "Leila Jane", "comment_text": "Venice is one of my favorite cities to explore on foot. If you walk from the train station area all the way to St. Mark's Square instead of taking a boat you will see much more of the unique back alleys of the city. My opinion would be to go there and not miss it!"}, {"username": "Joe-Linda Po Agustin", "comment_text": "Trenìt!"}, {"username": "Giorgia Petraia", "comment_text": "If you’re not sure you’ll come back to Italy afterwards go to Venice no matter what ❤️"}, {"username": "Kay Jenkins", "comment_text": "use trenit.app to book tickets,they are emailed to you and are prevalidated"}, {"username": "Diane Janovas", "comment_text": "Totally worth it. If you can't change your flight,train there and then back. Stay at least one night."}, {"username": "Alida Karas", "comment_text": "Don’t miss Venice!!"}, {"username": "Larraine Piero Testa", "comment_text": "Italy is beautiful, Venice is UNIQUE! Everyone should see Venice at least once! You don’t need lots of days there but don’t miss it!!"}, {"username": "Jane Deaton", "comment_text": "To be honest, Venice will be so crowded I don’t think you’ll enjoy it. I would stay with Rome. There are some lovely little towns in the hills not far to the west of Rome"}, {"username": "Dann Hrusch", "comment_text": "Flight to Venice may have more connections than going into Rome, or high cost to change. If so, keep your current flight and just head straight to Venice when you land. Spend a night then head back to Rome. I spent two nights in Venice and that was more than enough for me. However I've been to Rome three times and would go back again and again. Just my opinion."}]}, {"id": "2192316857834059", "text": "Rome, Florence, and Venice from August 18-27. What things should I be aware of?", "link": "facebook.com/groups/1373361046396315/permalink/2192316857834059/", "likes": 2, "comments": [{"username": "Jane Deaton", "comment_text": "Prepare yourself for hordes in Venice. Not pleasant!"}, {"username": "Beth Casey Murphy", "comment_text": "Hot weather."}, {"username": "Marie Cuzzi", "comment_text": "Really hot weather and tourist season so lots and lots of people"}, {"username": "Peggy Fisher", "comment_text": "Not slowing down enjoying everything. When I got off the water taxi in Venice this is what I saw. Loved every moment."}, {"username": "Ben Parlopiano", "comment_text": "We were in Venice a month ago. While it is a beautiful city and I love it more every time I go, this last time it was very crowded. Just don't let it stress you. You are in Venice. Also, be aware of planned train strikes before you make a train reservation. Enjoy!!!"}, {"username": "Tricia Marshall", "comment_text": "The heat."}, {"username": "Dimity Betar", "comment_text": "It’s hot 🥵"}, {"username": "Michael Messina", "comment_text": "Just go and have good time"}, {"username": "Beth Casey Murphy", "comment_text": "The tourists usually congregate between the Piazza San Marco and the Rialto Bridge. If you can get off that path, you will see the uncrowded Venice."}, {"username": "Thomas Harris", "comment_text": "The heat. Rome and Florence can get extreme hot."}, {"username": "Anthony Sperduti", "comment_text": "The hellish heat"}, {"username": "Lynn Francisco Casella", "comment_text": "Lots of day trips as well as intense sightseeing in those cities"}, {"username": "Monika Vicanova", "comment_text": "Pretty much the worst time to visit italy- its after ferragosto, not only foreign tourist but all italians are on holiday, so prepare urself that it will be very crowded and busy, Rome and Florence will be hellishly hot and humid."}, {"username": "Rose Man", "comment_text": "Heat"}, {"username": "Stefania Barou", "comment_text": "Troppo caldo..."}, {"username": "Steven Shannon", "comment_text": "Extreme heat"}]}, {"id": "2192315974500814", "text": "We will be in Italy in the next two weeks. We would love to get out of Florence by train or bus to somewhere a little less crowded and interesting to explore. We won’t have a car. Any recommendations appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2192315974500814/", "likes": 9, "comments": [{"username": "Ann Marie Whalen", "comment_text": "Bologna - only 30/40 minutes by train - or do a wine tour that leaves from Florence into the Tuscan countyside (the country side is beautiful and there are lots of day trips availabe)"}, {"username": "Cinzia Berletti", "comment_text": "Orvieto or Spoleto"}, {"username": "Andy Blackwood", "comment_text": "Personally I'd go to Siena rather than Bologna"}, {"username": "Anne Brawley", "comment_text": "Lucca is really lovely."}, {"username": "Chiara Campagna", "comment_text": "Siena o Assisi"}, {"username": "Phyllis Snyder", "comment_text": "Siena or Arezzo"}, {"username": "Peter Rasmussen", "comment_text": "Siena is lovely bur very hilly."}, {"username": "Peter Rasmussen", "comment_text": "Peter Rasmussen"}, {"username": "Ettore de Vita", "comment_text": "Perugia"}, {"username": "Lia Geloso", "comment_text": "Siena"}, {"username": "Ilonka Sinkeldam", "comment_text": "Bus 7 in Firenze to Fiesole. You will have a beautiful view over Firenze without all the crowds."}, {"username": "Lucy Di Benedetto", "comment_text": "San Gimignamo!"}, {"username": "Rosella Latini", "comment_text": "Siena two days in beautiful Siena"}, {"username": "Rosella Latini", "comment_text": "Better to take bus to Siena from Florence more convenient"}, {"username": "Rhonda Russell", "comment_text": "Lucca, Fiesole, Cortona"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Definitely Cinque Terre. It’s magical. Especially Vernazza.\n\nAnd Siena for countryside and vino."}, {"username": "Frank Hunt", "comment_text": "Train always, so many places, so little time. Get the Trainline app to book tickets"}, {"username": "Nikki Livingston", "comment_text": "Cinque Terre! Riomaggiore, Vernazza and Corniglia!"}, {"username": "Blanca Gil", "comment_text": "Lucca, Pistoia, Arezzo can be easy cities to visit by train."}, {"username": "Roland Trego", "comment_text": "Lucca!"}, {"username": "Shana Woodfield", "comment_text": "Day trip too Arezzo. There is a nice park at the top of the town."}, {"username": "Shena Kennebeck Talbert", "comment_text": "Fiesole is amazing with views and experience. We went to the museum and also just walked around the neighborhoods. It's gorgeous. And so photo worthy. 5/5 would do again!!!"}, {"username": "Donna Egan Mason", "comment_text": "I have heard Volterra is an awesome place to check out"}, {"username": "Francesca Messina", "comment_text": "From firenze: Lucca, Siena, Assisi, Cortona, Arezzo"}, {"username": "Nellie Sarmiento", "comment_text": "Bus 7 to Fiesole, bus to Siena/San Gimignano. Love Lucca as well and Pietrasanta"}, {"username": "Charlotte Eriksen", "comment_text": "Capri"}, {"username": "Colleen Jennings", "comment_text": "Trentitalia website for tickets. Lucca is 1.5 hours away. Beautiful walled city very doable in a day. Book the 1st train out, last train back. Home of Puccini."}, {"username": "Glenys Cooper", "comment_text": "Trentitalia"}, {"username": "Elena Eckley", "comment_text": "Montecatini is west of Florence and lovely to visit"}, {"username": "Denise Bearg", "comment_text": "Lake Garda is amazing and you can get there by train with a stopover in Verona for an opera"}, {"username": "Stacy Prestigiacomo", "comment_text": "Venice"}]}, {"id": "2192313781167700", "text": "Hello! Has anyone in this group flown from Orlando to Italy? If so, which airline has the best service and prices? I’m traveling in the middle of October and have been told I should hold as prices should drop a little but in the meantime I am trying to ballpark cost. Spending a week there before moving on to France. Would like to see the Almafi coast, Rome and Tuscany, so an airport close to one of these and I could start my itinerary ￼from there.", "link": "facebook.com/groups/1373361046396315/permalink/2192313781167700/", "likes": 0, "comments": [{"username": "Laura Allen Weinstein", "comment_text": "Orlando to Rome is probably your best shot. You can take a train from Termini Roma to other locations. Or bus but train is faster. We flew out of Miami because it was cheaper & non-stop. Try ITA or American. I personally prefer Emirates for international. But ITA was great. The economy wasn’t bad. We had the row after 1st class."}, {"username": "Carmine Castiglia Jr", "comment_text": "It's important to remember that the vast majority of people who have made this trip will have done so once and only once. Therefore, having nothing to compare to, they can only speak to that one trip they made on that one airline on that one date.\n\nJust saying..."}]}, {"id": "2192311314501280", "text": "I’m going to Venice at the end of August with my husband and 2 other couples. We have 2 free days before we have a guided tours to St Narks Basilica & Doge’s Palace and also a private tour of the Jewish section. Any ideas on what to do with our free time?", "link": "facebook.com/groups/1373361046396315/permalink/2192311314501280/", "likes": 0, "comments": [{"username": "Andy Blackwood", "comment_text": "Take a water bus (vaporetto) out to the islands of Murano and Burano."}]}, {"id": "2192307714501640", "text": "Hey there. Anyone stayed at the hotel Alpi in Rome? Thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2192307714501640/", "likes": 0, "comments": []}, {"id": "2192309094501502", "text": "Bonjour, je veux aller faire la côte amalfitaine en mini van de Sorrento à Salerno. Selon se que j’ai lu c’est étroit et très achalandé. Est ce sécuritaire? Il mentionnait aussi qu’il n’y avait pas beaucoup de stationnement. Nous sommes 6, est ce mieux de le faire en autobus local ou en voyage organisé à partir de Pompéi? Merci de votre aide\nExcursion d’un jour seulement", "link": "facebook.com/groups/1373361046396315/permalink/2192309094501502/", "likes": 0, "comments": [{"username": "Catherine Lefebvre", "comment_text": "Allo ! C'est mieux de partir en traversier de Salerne. C'est 30 minutes pour Amalfi ou 1h pour Positano. Après, prenez le bus local (1.50€) ou un taxi ! Conduisez pas sur la côte, c'est l'enfer, ça passe pas, c'est full traffic et ya pas de parking. Ça va être moins stressant aussi ! J'y suis allée y a deux semaines 😊\nÀ partir de Pompei, tu peux toujours prendre un train jusqu'à Rome et là jusqu'à Salerne ou regarder si ya un train Pompei- Salerne"}, {"username": "Andria Saia", "comment_text": "We have driven in Italy and would not do the Amalfi coast. The roads there are CRAZY - narrow, winding and the buses fly around! And parking is very limited - there is a bus that leaves out of Sorrento in front of the train station regularly that will get you there in one piece. 😊"}, {"username": "Susan Siewko Cos", "comment_text": "We just came home from Amalfi coast. The traffic was very bad. From Pompeii to Positano should have taken 45 min. It took over 2 hours. It is too beautiful for a one day trip. I was there for 4 nights and it wasn’t enough. Do not drive there. Hire car service it is well worth your money. Zero parking and the person driving will miss out on all the views. Plus, they have a driving system only the locals understand. It is a system of organized chaos only they can navigate."}, {"username": "Caroline Blais", "comment_text": "Je ne suggère à personne de conduire sur la côte ! Traffic, étroit ,rapide et pas de parking. Nous sommes allés en autobus et vraiment spécial ! On est revenu en bateau !"}, {"username": "Emilia Ricci", "comment_text": "We’ve been to the area several times, and our preference is the ferry from the Port of Napoli. It’s a delightful trip with stops at the various comuni along the way (Sorrento, Amalfi, Positano, etc.)."}]}, {"id": "2192294387836306", "text": "Hi! Does anyone know how to get olive oil (5-10 liters) shipped to the US from a reputable retailer?", "link": "facebook.com/groups/1373361046396315/permalink/2192294387836306/", "likes": 0, "comments": []}, {"id": "2192305781168500", "text": "I am traveling to Italy end of September. Any recommendations for Airbnb around or outside of Venice? Also staying around Bologna and near Ancona or Rimini.", "link": "facebook.com/groups/1373361046396315/permalink/2192305781168500/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Venice https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d1194\n860-Reviews-Set\ntimo_Cielo_Bloo\nm_B_B-Venice_Ve\nneto.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Bologna https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187801-d1073\n0748-Reviews-B_\nB_Ceci_e_Cleo-B\nologna_Province\n_of_Bologna_Emi\nlia_Romagna.htm\nl"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Rimini https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187807-d2367\n73-Reviews-Vill\na_Lalla-Rimini_\nProvince_of_Rim\nini_Emilia_Roma\ngna.html"}, {"username": "Joe-Linda Po Agustin", "comment_text": "Sta. Elena B& B . Reasonable rates, a bit far but still within Venice."}]}, {"id": "2192303091168769", "text": "Is it better to book a rental car direct (through Avis or Europcar) vs using Expedia? We are looking to rent a car in Siena for a week. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2192303091168769/", "likes": 0, "comments": [{"username": "Jose Velez", "comment_text": "Shop around specially in kayak"}, {"username": "Carmela Noble", "comment_text": "I’ve always used Expedia as sometimes they have cancellation up until pick up. Some companies lock you in"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}]}, {"id": "2192070737858671", "text": "Yesterday vibe. Venezia, Italia 🎭 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2192070737858671/", "likes": 129, "comments": [{"username": "Noel Flood", "comment_text": "Yes please"}, {"username": "Sharmini Nair", "comment_text": "Enjoy loved every minute in Venice . Am having withdrawal symptoms now. Lol"}, {"username": "Nic Mauger", "comment_text": "Hayley Stevenson fruit drink"}, {"username": "Ricky Ellis", "comment_text": "Love Venice"}, {"username": "Mike LeClear", "comment_text": "Venice looks nice but respectfully your legs look nicer!"}, {"username": "Kevin Bates", "comment_text": "Nice legs"}, {"username": "Lisa Santagate Moreland", "comment_text": "Love the Hugo!"}, {"username": "Shula Hurvitz", "comment_text": "🇮🇹💯💥🥇🎯🍹"}, {"username": "Nikki Delaney", "comment_text": "Mojito looks amazing"}, {"username": "Lisa Ann", "comment_text": "The Hugo! My fav!!"}, {"username": "Sofia Lucia", "comment_text": "Sofia Lucia"}, {"username": "Bill Bowler", "comment_text": "*Venezia"}, {"username": "Roger Pajo", "comment_text": "God, I miss it"}, {"username": "Mike Adams", "comment_text": "Hugo zspritz"}, {"username": "Krissy DaRusso", "comment_text": "Is this the Hugo Spritz? I tried one the other day. I’m not a huge drinker but loved it more than the aperol spritz!"}, {"username": "Denise Coman", "comment_text": "Hugo spritz! Great drink, so refreshing! 😊"}]}, {"id": "2192297807835964", "text": "#iloveitaly 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2192297807835964/", "likes": 2, "comments": []}, {"id": "2192292847836460", "text": "I need transportation for 4 people from the Naples airport to the small town of Castellammare di Stabia just a little before Sorrento & then back to the Naples airport about 5 days later. I am now leaning toward private drivers for the sake of mind & not having to lug our luggage on & off trains and such. I have an elderly person traveling with me,आणखी so I’d like the convenience of just loading & unloading once.\nHave any of you used a private driver and if so, can you please provide the contact information? I am also wondering if they will give us a price for a round-trip, even though it will be 5 days later.\nAll Info is much appreciated! ￼", "link": "facebook.com/groups/1373361046396315/permalink/2192292847836460/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192287777836967", "text": "Flew from Australia to enjoy a gelato in front of the Trevi fountain.\n\nI must say I was abit anxious to visit after reading all the posts by people regarding how unsafe rome is my advise is to please stop theआणखी fear mongering on this site !!!! Yes keep your wits about you but it’s not as bad as what it was made out to be.\n\nVisit as many places as you can and try to do this in the early morning before the afternoon sun, buy some cooling towels and a camelback so you always have water with you for the day.\n\nMost of all just get out and enjoy yourself it is such a beautiful place ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2192287777836967/", "likes": 7480, "comments": [{"username": "Syfun Punom", "comment_text": "Totally agree!!!"}, {"username": "Syfun Punom", "comment_text": "Totally agree!!!"}, {"username": "Jo Sime", "comment_text": "Arriving there for 5 nights 21st aug with my 23 yr old daughter...from\naustralia...can\nt wait 🎉🥰"}, {"username": "Georgia Rhodes", "comment_text": "I went to Rome for the first time last year and I definitely didn’t feel unsafe. Such a beautiful place 🥰🩷"}, {"username": "Claudia Spaziani", "comment_text": "Thank you for your kind words!! It's true, it's very hot these days...pay attention to pickpockets but please, enjoy the eternal city 🇮🇹❤️"}, {"username": "Lenie Bijnen", "comment_text": "Daar is mijn kleindochter ten huwelijk gevraagd, een prachtige foto , voor haar ging hij op de knieën voor haar."}, {"username": "Lori Nachman", "comment_text": "I was there 2 weeks ago and felt perfectly safe. I traveled for 3 weeks in Europe, and had a blast with my family. No worries about safety."}, {"username": "Снежанка Христова", "comment_text": "Снежанка Христова"}, {"username": "Maria Idionei Meira", "comment_text": "Maria Idionei Meira"}, {"username": "Lori Carter", "comment_text": "Ugh. That's so crazy. Rome is not unsafe at all. Sure, petty pick-pocketing and scamming, but entirely safe for travelers who just pay attention to their surroundings."}, {"username": "David Kroening", "comment_text": "Cecilia Alessi was our guide and no worries at all…"}, {"username": "Thinh Bui", "comment_text": "Thinh Bui"}, {"username": "Julie Sampey Braddy", "comment_text": "We were in 5 cities in Italy this spring. The number of tourist were crazy. We had no issues but my daughter had her purse swiped on a train on a previous trip."}, {"username": "Sally McLelland", "comment_text": "Rome is amazing like any tourist place xx"}, {"username": "Patricia Ryan", "comment_text": "I totally agree. We did Rome 6/1, 2nd & 3rd. No problems anywhere. It was an awesome city! So much beauty & history!"}, {"username": "Linda Auxt", "comment_text": "I love it went were there"}, {"username": "Sharon Trainor", "comment_text": "I visited Rome in May and felt very safe. Loved it! Can't wait to go back"}, {"username": "Breda Crouchman", "comment_text": "I love Rome We live in Ireland u have to to be careful anywhere you go xxxxx"}, {"username": "Ferencné Lukács", "comment_text": "Csodálatos, voltunk ott a Családdal."}, {"username": "Kim Hetherington", "comment_text": "Gelato by the Trevi was my first Rome experience too. Amazing choice of ice cream and sorbet 🍨"}, {"username": "Jeremiah Smith", "comment_text": "Was just there. No issues."}, {"username": "Patti Mazurek", "comment_text": "My sister-in-law and I went in December. It is safe as it can be. We walked around late at night by ourselves."}, {"username": "Ken MacDonald", "comment_text": "I stood right there. Rome is a fabulous place to visit. As they say...\"The eternal city\"."}, {"username": "Roxanne Brand Gibson", "comment_text": "Same here....I love Itlay!"}, {"username": "Esther Teperman", "comment_text": "Esther Teperman"}, {"username": "Dick Ward", "comment_text": "Had a great visit there a couple of weeks ago both day and night. We were at the fountain at night and all you need to do is be aware of your surroundings no different then a big city here I. The states."}, {"username": "Suzanne Leach", "comment_text": "Agree! We had a wonderful time kept important things in front of me and absolutely no problems and the people were wonderful!"}, {"username": "Carmen Rincon", "comment_text": "Hermoso reencuentro!!🇮🇹❤️"}, {"username": "Kathy Giordano", "comment_text": "Looks great dick. Glad the visit was good."}, {"username": "Kari Leigh", "comment_text": "We had a great time in Rome, Florence and Venice in May…felt totally safe!"}, {"username": "Małgorzata Płonka", "comment_text": "bylam wiele razy wrzymie a ta fontanna zawsze mnie zachwyca"}, {"username": "Karen Russo", "comment_text": "Right. Every city is not perfect."}, {"username": "Micheal Macken", "comment_text": "Rome is totally safe if you take even the slightest precautions against pickpockets. Assault is extremely rare. So if you survive the drivers you are fine !"}, {"username": "Rebecca Robinson", "comment_text": "Dawn Blythe Catherine Wood Anna Holliday phew! Love this post! I was getting a bit anxious seeing the unsafe posts but this makes me feel much better xxx"}, {"username": "Cherylmarie Lundquist Armentrout", "comment_text": "Have been to Rome 4 times. Can’t wait to go back!!"}, {"username": "Cherylmarie Lundquist Armentrout", "comment_text": "It’s not just Rome or Italy. Someone tried to pickpocket me in Barcelona too. Be careful no matter where you are in Europe. Asia isn’t nearly as bad, by the way."}, {"username": "Margie Marg", "comment_text": "Maybe it's not fear mongering.. maybe these people genuinely had that/those experiences"}, {"username": "Kym Armitage", "comment_text": "Went to Rome last month. Never felt unsafe. Loved it"}, {"username": "Jaclyn Armstrong", "comment_text": "Our family just came back from Italy. My dad was targeted twice by separate pick pockets. Our teenaged daughters were targeted as we walked from the train station to the hotel. One of my daughters was also targeted. So it happens. I'm happy you had a great experience but it does happen. We were aware of our surroundings everytime."}, {"username": "Sara Olsen", "comment_text": "Totally agree. Just be sensible. Rome was wonderful and I always felt safe xxx"}, {"username": "Marie Russell", "comment_text": "Standing in the same spot 5 weeks ago eating a ice cream 🍦"}, {"username": "Rosario Ruiz", "comment_text": "Yes! Have water whit you for the day and a comfortable shoes. In Florence, they wanted to open my bag, but it happens in all cities 😂"}, {"username": "Michelle Lehoux", "comment_text": "I would give anything to return to Rome. If you turn around you will be looking at the hotel doorway that we stayed."}, {"username": "Ruth Blyton", "comment_text": "We never had any problems when we were there"}, {"username": "Doug Swigart", "comment_text": "Forewarned and forearmed, watch how you carry your personal items and you'll be OK."}, {"username": "Francisca Brazinha Amigo", "comment_text": "Lindo. Adorei"}, {"username": "王秀菁", "comment_text": "真的沒那麼可怕！義大利每個點都\n好美！包包背前面就好！人多時小\n心一點就可以！\n只有在拿坡里車站我親眼看到有人\n推行李後背包被拉開！我們提醒他\n！還好沒被偷！"}, {"username": "Lisa Sczesny", "comment_text": "I agree 100%"}, {"username": "Deborah Walsh", "comment_text": "I found Rome very safe and the lemon gelato at the place where you got it is the best I’ve ever had! Have a great trip!"}, {"username": "Mike Stramaglio", "comment_text": "Love Rome! Been there many times! Never scared!"}, {"username": "Ewa Chmielewska", "comment_text": "Byłam zwiedziłam jest super. Pozdrawiam."}, {"username": "Ann Joubert", "comment_text": "Totally agree!!! Was there in May and it was amazing"}, {"username": "Vandna Patel", "comment_text": "Vandna Patel"}, {"username": "Vandna Patel", "comment_text": "Vandna Patel"}, {"username": "Naomi Morales-Garza", "comment_text": "Priscilla Morales Varela"}, {"username": "Carolyn Haubert Levering", "comment_text": "Leaving Rome today after 6 fun-filled (albeit HOT) days. Felt safe the whole time (except when pick-pocket warnings would be announced)."}, {"username": "Joanne Bowen", "comment_text": "You have have your wits about you everywhere but I did not feel unsafe in Rome"}, {"username": "Maria Chin", "comment_text": "Have a wonderful time!Would like to visit again"}, {"username": "Michelle Jay", "comment_text": "Amen sista 🇦🇺👍🏻"}, {"username": "Karen Gaspari", "comment_text": "Never had a problem. Enjoy Italy."}, {"username": "Jackie Velez", "comment_text": "Jackie Velez"}, {"username": "Kasey Harman Billingsley", "comment_text": "I felt much safer in Rome than Phoenix!"}, {"username": "Rose Carpino", "comment_text": "Thank you for sharing this! I have been there was so nervous,heard so many stories so was very causous. Not to worry totally safe!!!"}, {"username": "Adele Waerig", "comment_text": "Rome is absolutely beautiful. Never ever had a problem. So much history there. Fabulous experience!"}, {"username": "Kristina Buelna", "comment_text": "I lived there….it’s a beautiful place. ♥️"}, {"username": "Emily Mellusi Iovine", "comment_text": "No problem with Rome"}, {"username": "Luigia Gray", "comment_text": "Loved visiting the Trevi Fountain."}, {"username": "Rod Maldaner", "comment_text": "I totally agree. It’s about being alert. I felt very safe there in April. The thieves look for easy targets. Don’t be an easy target. ￼"}, {"username": "Anthony McClure", "comment_text": "I lived in Rome for four years and never felt unsafe. It is an amazing place to see! Yes keep your wits about you and you can have a great time."}, {"username": "Eileen Fitzgerald Moriarty", "comment_text": "We never felt unsafe. Just came back and enjoyed every bit of it."}, {"username": "Katia Macri-Roberts", "comment_text": "I live in Australia and I’ve been to Rome many many many times. I feel more safe there than I do anywhere else."}, {"username": "Vivian Rodriguez", "comment_text": "I was there a month ago and loved it ! I felt safe. Yes we got our tote bag stolen from a group of guys singing we even tipped them . When we realized it , it was too late ! All they got was a bottle of water and umbrella. Better then the street of Chicago ,LA, New York."}, {"username": "Robin DiFeo", "comment_text": "Totally agree!!! Just returned and felt that the extreme warnings, while well-intentione\nd were not justified. Take the same precautions that you would in any metropolitan area."}, {"username": "Gennaro Maurizio", "comment_text": "Wait. There are people who’s unit of measurement is bullets per child complaining that Rome isn’t safe?🤦‍♂️🤣"}, {"username": "Heather Law", "comment_text": "Tell me a City that has zero pick pockets and trouble makers"}, {"username": "Jenny McGhie", "comment_text": "Craig McGhie Eerin Jennifer Mc🥰"}, {"username": "Nathalie Benats", "comment_text": "Thats in every city, keep your stuff with you..."}, {"username": "Danilo Traldi", "comment_text": "… e ricordatevi di non mangiare gelato o cibo vicino alle attrazioni. Se vi spostate, anche di poco, mangerete veramente Italiano"}, {"username": "Jenna Whiteman", "comment_text": "I’ve been to many European city and have never felt unsafe in any of them. Yes you have places where there are pick pockets and you have to just watch your bag but never felt unsafe day or night."}, {"username": "Antonio Milano", "comment_text": "I love them photos from Italy"}, {"username": "Jørgen Kauling", "comment_text": "Don’t visit italy I July and August"}, {"username": "Belinda Cuming", "comment_text": "I have been there, it’s beautiful and love it"}, {"username": "Giuliana Tramarin", "comment_text": "Occhi sempre aperti e borse sempre strette"}, {"username": "Candice Smith", "comment_text": "Rome is great! I went last summer with my 10 yr old. Never felt unsafe."}, {"username": "Simone Kellam", "comment_text": "Never had any problems in Rome, or anywhere in Italy"}, {"username": "Barbro Nybäck", "comment_text": "Nor have I and I love the town."}, {"username": "Emese Baliko Greksa", "comment_text": "Love Rome"}, {"username": "Clay Costello", "comment_text": "Been there done that and threw my coins. 👍👍❤️"}, {"username": "Chris Jordan", "comment_text": "Love Rome and it’s people are so friendly. Never any issues"}, {"username": "Małgorzata Płonka", "comment_text": "bylam tam cudowna fontanna w rzymie"}, {"username": "Пенка Гуевска", "comment_text": "С какво е опасен Рим? Бях там няколко пъти, в различни сезони. Както навсякъде по света, там също има къде да се скрием от горещините. Рим е красив и привлекателен с хилядолетната си история."}, {"username": "Anil K Dhiri", "comment_text": "Agree with authors views. A great city to visit."}, {"username": "Sandrine Ferreira Gds", "comment_text": "Moi j y suis partie avec ma fille sa c très très bien passé les gens super pour boire vous avez des fontaines partout et dès stand et des gents qui vendes des bouteilles d eau par contre oui attention à la chaleur il fait extrêmement chaud moi en mai on avait 34 donc attention et bonne vacances c superbes ouvrez bien les yeux et n oubliez pas de tourner la tête car il y a des surprise partout tous est magnifique"}, {"username": "Dianne Gardiner", "comment_text": "Loved Rome. Never felt unsafe"}, {"username": "Carrie Lapp", "comment_text": "Agreed"}, {"username": "Fiona Mary Lane", "comment_text": "I agree it's not unsafe at all, we were there at the end of May for my 60th and had an amazing time. Just felt fine wandering around, no danger, everyone was so friendly and welcoming including taxi drivers, who were so funny about the driving in Rome, and gave us loads of useful information about sightseeing, getting around etc. Hope you enjoyed yourself, can't wait to go again"}, {"username": "Susan Cliff", "comment_text": "Went to Rome in 2019. Did the Trevi Fountain. Had a great time. Rome is no more unsafe than any other city. Just need to use common sense as you would in any city in the world. Would love to go back."}, {"username": "Maria Julia Damaso", "comment_text": "Spectacular! Adoro Italia"}, {"username": "Tineke Schröder", "comment_text": "De zakkenrollers slaan vooral toe in de metro, daar dus goed oppassen 🍀"}, {"username": "Dorota Jurga", "comment_text": "Dorota Jurga"}, {"username": "Trish Benoit McNiven", "comment_text": "Been there- it’s beautiful and I felt safe😊"}, {"username": "Rose Pennachia", "comment_text": "As an Australian we travelled through Italy for over 3 weeks including Rome and we never felt unsafe! Yes it’s extremely busy, especially in high tourist areas. Never carry your wallet or phone in your back pocket or in back pack and you’ll be fine! Enjoy the pizza, pasta and Gelato and have the best time!!"}, {"username": "Stephanie Boldt", "comment_text": "I was there one month ago and felt very safe."}, {"username": "Tommy Wynn", "comment_text": "Visited Rome twice and never had any problems would go back in an instant it is superb and the people are wonderful"}, {"username": "Anita Young", "comment_text": "Rome Fabulous my Daughter and I went for her Birthday all sightseeing done Safe didn't feel threatened in eny way just enjoy amazing City and there train service fab. People great. March we went."}, {"username": "Joe Howley", "comment_text": "Safe enough if you keep away from The Vatican"}, {"username": "Claudia Marra Badia", "comment_text": "Yes. You have to be aware no matter where you go. I’m in different parts of Italy now. I feel safe"}, {"username": "Teresa Szabrańska", "comment_text": "Piekne klimatyczne miasto\n,sympatyczni ludzie nie znam lepszego miejsca do zwiedzania"}, {"username": "Carmel Toc", "comment_text": "People travelling to high tourist spots should not act as if they are in their own country and remain SUPER vigilant. The guy you paid to park near the Colosseum? Guess what? He will be gone as will your car before you get back because it’s illegal to park there. The credit card you gave the friendly waiter to take to the counter with your bill? It will be cloned most probably. Not just in Italy. Never let go of your child’s hand because children get snatched as a daily occurrence for trafficking. This is the real world we live in not seen through the tourists eyes. Once you adapt, you will feel safer anywhere."}, {"username": "Violetta Kasiorek-Trępała", "comment_text": "Rzym niebezpieczny , pierwsze słyszę"}, {"username": "Brooke Allise Goldstein", "comment_text": "I’ve been to Rome several times and never felt unsafe"}, {"username": "Wiolka Wiolka", "comment_text": "I agree. It is amazing place."}, {"username": "Gerardo Coronado", "comment_text": "Nada mejor que comerse un gelato frente a la Fontana di Trevi!!!🏛️🇮🇹"}, {"username": "Esther Ruscitti", "comment_text": "I love Rome. I have been there three times amongst other places in Italy. If you have the time try to see Orvieto. Have fun!"}, {"username": "Michael Cattee", "comment_text": "It's not unsafe"}, {"username": "Elizabeth King", "comment_text": "There's nothing unsafe about Rome at all, I spent 8 days in Rome as a solo female traveler and not once did I feel unsafe."}, {"username": "Erin Doell Immken", "comment_text": "Was there last month and never once felt unsafe"}, {"username": "Kinia Smith", "comment_text": "No. You leave your home - you die. Always."}, {"username": "Shirley Roberts", "comment_text": "Sept 22, We spent a week in Rome and went everywhere mostly on foot or public transportation.\nWe did not have any problems, do not be afraid, just use good sense that you would normally use anywhere traveling."}, {"username": "Misty Williams Corbett", "comment_text": "I’ve been to Rome 4 times, never felt unsafe or heard about it being unsafe"}]}, {"id": "2192287227837022", "text": "If you could pick 1 restaurant in Sorrento for an Anniversary dinner, where would you go? 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2192287227837022/", "likes": 0, "comments": []}, {"id": "2192281211170957", "text": "Please help!!!! I am able to extend my Italy trip for 6 more days. My itinerary is Naples 1 night, Sardinia 4 days, Sorrento 2 days, Capri 2 days, Naples 4 days. Now I have 6 more days where should I go.", "link": "facebook.com/groups/1373361046396315/permalink/2192281211170957/", "likes": 62, "comments": [{"username": "Frank Iaria", "comment_text": "Venice and Florence for sure"}, {"username": "Pong Ac Ai", "comment_text": "Rome and Florence\nVenice and Rome\nIt’s up to you\nDepends on your energy"}, {"username": "Mary Gregory", "comment_text": "Venice and a water taxi to burano"}, {"username": "Ro Todisco Weil", "comment_text": "4 days in Naples is way too much time!\nSorento is beautiful 🤩 & after 9 visits to Italy 🇮🇹 my favorite is VENICE…. It’s MAGICAL, really! 3 days is Venice would be terrific….soooo\nmuch to do there & see!\nEnjoy & have Gelato a couple of times, Yum 😋"}, {"username": "Maryan Raf", "comment_text": "Rome, Florence, Venice, Portofino. 1 day in Naples is plenty and wouldn’t do 4 days."}, {"username": "Jennifer Larese Taylor", "comment_text": "Since you are in South you could go to Sicily. You can get a ferry from Salerno or Naples"}, {"username": "JB Jess", "comment_text": "POSITANO for sure!!"}, {"username": "Barbara Hughes", "comment_text": "Go to Puglia.Alberobe\nllo....or Calabria Tropea. The South is wonderful."}, {"username": "Rose Porter", "comment_text": "Bari"}, {"username": "Cindy Vennare", "comment_text": "Calabria - Tropea! Have an Italian gin and tonic too!"}, {"username": "Angela Sea Mee", "comment_text": "Rome"}, {"username": "Carol Monroe", "comment_text": "Tuscany"}, {"username": "Justin Finch", "comment_text": "Pisa and Florence it’s a no brainer"}, {"username": "Claudia Trinchillo", "comment_text": "Stay longer in campania and extend sorrento plus boat to ischia and only relax there"}, {"username": "Alexandra A Welker", "comment_text": "Florence, Rome and/or Venice"}, {"username": "Adeline Alex Tanfara", "comment_text": "Rome"}, {"username": "Donna Maree Trickey", "comment_text": "Rome , Venice , lake Como"}, {"username": "Carla Rush", "comment_text": "Rome!"}, {"username": "Basia Szokarski", "comment_text": "Tuscany...agrot\nourism hotel with an infinity pool"}, {"username": "Lisa Borges", "comment_text": "I would travel further south to Tropea"}, {"username": "Michelle Cotoni", "comment_text": "How did you get from Naples to Sardinia? Is there a ferry and how long does it take?"}, {"username": "Julia Muller", "comment_text": "Way too long in Naples IMO. Visit Cinque Terre for a truly unique place, and ditto Venice!"}, {"username": "Kerry Laux", "comment_text": "Head south to Sicily!"}, {"username": "Ameen Motee", "comment_text": "Switzerland"}, {"username": "Roxanne Boccardi", "comment_text": "There is never enough time to see everything ."}, {"username": "Jade Illiano-Smith", "comment_text": "Go somewhere in puglia, alberbello, otranto, ostuni"}, {"username": "Ann-Dorte Bruhn", "comment_text": "Take a week in Sardegna, Naples two days, Sorrento 1 day, Positano 1/2 day, Amalfi 1/2 day👌"}, {"username": "Gillian Leetch-Armstrong", "comment_text": "Ischia is wonderful. Florence a must. 💖"}, {"username": "Pauline SassyNana DeRose", "comment_text": "The cutest lil town San Terenziano great lil market, shoe store a Dino place to eat lol. We had a Villa there for a week or so and drove all over. The restaurant had a dinosaur out front, stupid, but really good carbonara and other food too. Then there’s a restaurant that butchers a cow once a week and everyone rushes to get there, it’s fabulous. lol"}, {"username": "Dr-Jon Warnecke", "comment_text": "UMBRIA! It's less touristy, full of history, and more beautiful than Tuscany! OH, DID I SAY GREAT FOOD??!!"}, {"username": "Linda Raguenaud", "comment_text": "Terug naar Sardinië ik kan je mooie plaatsen aan bevelen."}, {"username": "Corina Cristea", "comment_text": "Roma, Florence"}, {"username": "Heather Lynn Brown", "comment_text": "We are in Italy now. It is hot hot hot. Since we've gotten here our very favorite thing was staying at a farmhouse/\nhotel in Tuscany that had a swimming pool. We did wine tasting during the day. Had beautiful views and dinners and got to hang out during the day in a lovely setting While cooling off in the swimming pool."}, {"username": "Sherri Nicholas Amatetti", "comment_text": "Florence and Positano!"}, {"username": "Aleksandra Sandra Djurdjevic", "comment_text": "Florence, Venice, Rome"}, {"username": "Cindy Lawrence Pigno", "comment_text": "Venice and Pompeii"}, {"username": "Renee Willems", "comment_text": "Ischia 3 days."}, {"username": "Berenice Ruschel", "comment_text": "Rome and Florence!!"}, {"username": "Lisa Camarda", "comment_text": "Sicily for sure."}, {"username": "Melissa Mizrachi", "comment_text": "Florence"}, {"username": "Christine Fleming Losh", "comment_text": "Florence, Rome, Venice"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Rome, Florence"}, {"username": "Gemma Risk", "comment_text": "Venice is amazing"}, {"username": "Elizabeth Veronica", "comment_text": "ROME! - Lucca, Cinque Terre, Venice!"}, {"username": "Tania Sidella", "comment_text": "Tania Sidella"}, {"username": "Michelle Bergman Davis", "comment_text": "ROME!"}, {"username": "Sar Malco", "comment_text": "Florence!"}, {"username": "Sar Malco", "comment_text": "I'd skip Naples"}, {"username": "Russ Whitley", "comment_text": "Spend some time in Tuscany. Get accom in one of the hilltop towns. You can travel easily around the region by car."}, {"username": "Donna Parrish", "comment_text": "Too long in Naples. Add Tuscany Florence and Cinque Terre."}, {"username": "Jenna Shea Wilkins", "comment_text": "Siena-Florence-\ncince"}, {"username": "Louise Coertze", "comment_text": "Venice en Lametzia"}, {"username": "Georgina Carrigan", "comment_text": "Pulgia is a must"}, {"username": "Melissa Miceli Alomia", "comment_text": "Sicily"}, {"username": "Patrizia D'Arcangelo", "comment_text": "Palermo and Cefalù (Sicily) + Tropea (Calabria)"}, {"username": "Sarah Bailey", "comment_text": "Florence"}, {"username": "Jo Newton", "comment_text": "Florence - I would go live there"}, {"username": "Lori Moratto", "comment_text": "Rome"}, {"username": "Leah Ann", "comment_text": "Florence!"}, {"username": "Beverly E-j", "comment_text": "Naples is a fantastic base for Pompeii, Herculaneum, arcelogical museum, castle elmo and also a trip up mount vesuvius, and the best Pizza ever. I really enjoyed my time there"}, {"username": "Emma Osbourne", "comment_text": "Cinque Terra"}, {"username": "Julia Muller", "comment_text": "Given your locked in locations I’d choose Tuscany, maybe 3 nights in each of Florence and Cinque Terre. I’d probably donate at least two of your Naples days at the end to Venice too… 5 nights in Naples is far too much IMO 😊"}, {"username": "Angela Gilmore", "comment_text": "I would remain in the center/south of Italy. So Rome obviously or if you want to remain near the sea, Sicily. Just pick a couple of random villages and enjoy. I would skip Palermo and choose smallest villages. All the island is beautiful. And the food OMG"}, {"username": "Richelle Trezise", "comment_text": "Rome, Siena"}, {"username": "Maria Davi", "comment_text": "Sicily! Cefalu, Taormina, Scopello….or anywhere else on the island. Great beaches, archeological sites (if that’s your thing) fantastic food and the people are wonderful! Enjoy!"}, {"username": "Floriana Rolfo", "comment_text": "Venezia e Roma"}, {"username": "Kathleen Hammer", "comment_text": "Anywhere you go in Italy will be a beautiful memory. 👁️ ❤️🇮🇹"}, {"username": "Kate Edwards", "comment_text": "Venice and Rome 😍"}, {"username": "Gwennyth Clothier", "comment_text": "Florence"}, {"username": "Barbara Brosnan", "comment_text": "Venice and Florence are wonderful"}, {"username": "Manuela Bonazzi", "comment_text": "Napoli 4 giorni è troppo. Vai a Roma."}, {"username": "Anthony Taylor", "comment_text": "Rome is only a hour away by train.You will need all of those extra days and more to explore Rome"}, {"username": "Louise Inglis", "comment_text": "Ischia"}, {"username": "Georgia Shorland", "comment_text": "My partner and I had to walk through Naples for 15 minutes to get to a second form of transport and it was horrible. Rubbish everywhere, smelled of sewerage, pick pocketers watching you 24/7. I’m sure there’s some nice spots if you look hard but even as a female with my partner I felt very uncomfortable there for the short time that I was!\nDo not recommend at all!"}, {"username": "Sheryl Elizabeth", "comment_text": "Rome, Florence, Cinque Terre"}, {"username": "Jen Larkin", "comment_text": "Be careful. If you take everyone’s advice you won’t see anything. Do as much as you can. I loved Bari, Ancona and trieste."}, {"username": "Iliana Zlatareva", "comment_text": "Ischia, Procida"}, {"username": "Iliana Zlatareva", "comment_text": "Leah where in Sardinia."}, {"username": "Claudia Castellini", "comment_text": "Are you sure it worth going to Sardinia?\nIn wich season are you coming? How do you think to get there and move around when you are there?\nSardinia has wonderful beaches, but it’s not an “easy place”!\nAnd I also think you have planned to spend too many days in Naples area (Capri and Amalfi coast are very close to Naples), I suggest you to move to Rome and stay at least 3 or 4 days, then Florence and Tuscany or Umbria, or Bologna, a very nice city from wich you can have day trips to Florence and Venice 😉"}, {"username": "Cettina Milioto", "comment_text": "Went to naples one day is MORE THAN ENOUGH! It pretty and vibes is City feel!!\n\nWe feel in LOVE WITH SORRENTO And RAVELLO stunning views\n\nRome for sure 2-3 days."}, {"username": "Laura Elash", "comment_text": "Florence !!! Beautiful city filled with history and welcoming wonderful people"}, {"username": "Debbie Plante", "comment_text": "Stay in one place. You could do day trips Sorrento , Capri and do less unpacking etc.. whatever u decide try to stay in just one more place."}, {"username": "Yvone van Romburgh", "comment_text": "Cinque Terre is a must❤️"}, {"username": "Mary Riva", "comment_text": "Venice"}, {"username": "Adriana Sormani", "comment_text": "Lago Como, Maggiore or Garda"}, {"username": "Antonella Pinna", "comment_text": "Stay longer in Sardinia. There are beautiful places to visit. Wonderful beaches and landscapes."}, {"username": "Jenny McDannell", "comment_text": "Rome and/or venice"}, {"username": "Lina Chaumont", "comment_text": "Go to Calabria … go to Tropea .."}, {"username": "Kay M Gregan", "comment_text": "Just had a week in Tuscany... Bologna, Siena and Montepulciano, side day trip to San Gimiango and wine tasting in the Chianti region, and Montalcino."}, {"username": "Christine Malota- Kendall", "comment_text": "Find a home base and just enjoy… Florence would be a perfect spot."}, {"username": "Pam Garelli", "comment_text": "Just enjoy it any way you want."}, {"username": "Trish Ayers", "comment_text": "Florence!"}, {"username": "Michela Scocco", "comment_text": "Ponza! And from Cilento to Tropea 🙃"}, {"username": "Annette Del Pizzo", "comment_text": "Matera monopoly and Ostuni just beautiful"}, {"username": "Teri Kirby-Eliasen", "comment_text": "Positano"}, {"username": "Kelly Rennie", "comment_text": "Definitely Florence."}, {"username": "Lorraine Pisani", "comment_text": "Ischia"}, {"username": "Karen Haney Logan", "comment_text": "Lake Como, Lucca, Orvieto"}, {"username": "Oneida Ann Murphy", "comment_text": "How about the Dolomites"}, {"username": "Julie Jarvis", "comment_text": "Following"}, {"username": "Lana Burovoy", "comment_text": "F.."}, {"username": "Laurie Denoni", "comment_text": "Relax and add the 6 days where you already are going. Il dolce far niente\nI went to Naples at 57 for 3 nights. Loved the chaos, the sites, the food and the people."}, {"username": "Sara Hertz", "comment_text": "Rome & Venice 🇮🇹♥️"}, {"username": "Amy Campbell", "comment_text": "Venice & Rome"}, {"username": "Raquel Pickering", "comment_text": "Florence!!! See David and wander the streets. Florence amazed me the most when I went this year."}, {"username": "Carmen M. Pagnano", "comment_text": "Almafi Coast, Positano"}, {"username": "Margaret Dana", "comment_text": "Amalfi, Positano."}, {"username": "Angela Borghetti", "comment_text": "Puglia and Sardinia"}, {"username": "Heather Nicole", "comment_text": "Cinque Terre, Sienna, Lucca, Orvieto… we drove from Rome through Tuscany and it was the best."}, {"username": "Elissa OConnell", "comment_text": "Amalfi coast Positano or Bellagio on lake Como"}, {"username": "Jenny Payne", "comment_text": "In Sicily , I love Cefalu beautiful 🌻"}, {"username": "Caterina Sergi", "comment_text": "Florence"}, {"username": "Nancy Vahl Raske", "comment_text": "Florence, Siena, Rome, Venice"}, {"username": "Karen Elaine", "comment_text": "Venice, Rome or Positano all beautiful 🤩"}, {"username": "Mickey Adams", "comment_text": "add 2 or 3 nights to Venice and/or Florence!!! Need to see them both actually!!!"}, {"username": "Francesca Messina", "comment_text": "Tuscany or Sicily"}, {"username": "Michelle Sultana", "comment_text": "Rome and Firenze"}, {"username": "Alessandra Fintoni", "comment_text": "Rome and florence"}, {"username": "Annabella Pojer", "comment_text": "Rome or Verona and lake Garda district"}, {"username": "Michelle Cardinal", "comment_text": "Sicily!! Palermo and Taormina 💜"}]}, {"id": "2192272737838471", "text": "Are you allowed to take water bottles/water backpack and a cinch sack into the colosseum?", "link": "facebook.com/groups/1373361046396315/permalink/2192272737838471/", "likes": 2, "comments": [{"username": "Brandy Hines", "comment_text": "Yes! And right now, make sure you do! It’s sooooo hot!\nYou will have to go through a metal detector though."}, {"username": "Gena Diaco Penland", "comment_text": "Yes! You can take water and backpacks into all of the attractions."}, {"username": "Kimberly Moser Horincewich", "comment_text": "Thank you!"}, {"username": "Mickey Hughes Kales", "comment_text": "When I was in Cairo and Luxor, you could take a water bottle and small backpack or purse into all museums, tombs, etc., but you will be screened and any bags will be searched. No problem."}]}, {"id": "2192262807839464", "text": "I'm flying into Rome next week. I'm looking for some tips/ recommendations for transportation from the airport to the train station. We are planning to take a train to Salerno ( the private transfer quote I got get the airport to Salerno was 815 euros)\nAlso, any tips for train tickets? Should I book an open ticket or specific time ?", "link": "facebook.com/groups/1373361046396315/permalink/2192262807839464/", "likes": 1, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "You can take the Leonardo Express train directly from the airport terminal to Roma Termini - Rome's main train station. It runs every 15 minutes during most of the day and takes 32 minutes. There is no need to buy tickets in advance.\n\nhttps://\nwww.trenitalia.c\nom/en/services/\nfiumicino_airpor\nt.html"}]}, {"id": "2192266951172383", "text": "Hi everyone; our long awaited trip to Italy is coming up at the end of September. I’m wondering if anyone has done a Vespa tour into the Chianti region ￼from Florence. I’ve found a Vespa rental company that offers a full day tour that seems more reasonably priced than the standard tour companies. However, their website is short on specific details about what’s included/covered; I’ve sent an email through their website but haven’t heard back yet.", "link": "facebook.com/groups/1373361046396315/permalink/2192266951172383/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Siena/\nFull-day-Vespa-T\nour-with-lunch-\nin-the-Chianti-\nRegion/\nd944-5919P37?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Colleen Robinson", "comment_text": "If you are interested in hring a driver -Andrea picked us up at our hotel at 9 and dropped us off at 6.. He was extremely knowledable about the area and wineries and spoke very good english. He charged us 520 euros for the day. You could ask him to take you to certain places or ask for recommendations\n. It was our favourite day. You can email him to get a quote and information\n\na64.vignoli@gma\nil.com"}]}, {"id": "2192263397839405", "text": "Has anyone taken the Bernina Express?\nWe are planning to take that route- Milan to Zurich. We are flying out of Zurich.\nIs it easy to reach Tirano from Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2192263397839405/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Bergamo/\nBERNINA-SCENIC-T\nRAIN-and-LAKE-C\nOMO/\nd27538-7427P5?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2192260331173045", "text": "What do you guys this of this itinerary ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2192260331173045/", "likes": 4, "comments": [{"username": "Renee Dillenbeck", "comment_text": "I’m actually curious about this as well. I was looking at 3 nights in Rome, 1 night in Florence, 1 night in Cirque Terra, 3 nights in Milan.\n(Milan time is required for why I’m going)"}]}, {"id": "2192231494509262", "text": "What websites do you use to find hotels in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2192231494509262/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotels-g187\n768-Italy-Hotel\ns.html"}, {"username": "Rachel Bradfield", "comment_text": "Expedia"}, {"username": "Sandy Radican Shikaly", "comment_text": "Booking"}, {"username": "Daniela Ricketts", "comment_text": "Rick Steve’s book Italy- great recommendation"}, {"username": "Patricia Turner", "comment_text": "Booking"}, {"username": "Heath Conn", "comment_text": "Always TripAdvisor."}, {"username": "Helen Ladkin", "comment_text": "Trip Advisor and check the reviews, then book direct with the hotel."}, {"username": "Jose Manuel Perez Garcia", "comment_text": "Booking"}, {"username": "Patrick Gilmore", "comment_text": "I use Booking to find the hotel then I find the hotels website. We have saved over $100 a night doing this. Booking is so over priced. If you don’t believe me - try it."}, {"username": "Nicola Algerino", "comment_text": "COZYCOZY"}, {"username": "Zarkovic Waltraud", "comment_text": "Ebookers, trivago.Trivago\ncompairs the hotelprises."}, {"username": "Melissa Feielin Hawkins", "comment_text": "I use direct hotel websites to avoid issues, added fees and ability to earn rewards and room upgrades, free spa treatments, excursions etc., regardless what county. Always lower rates then 3rd party booking agents too."}, {"username": "Jeff Gentner EA", "comment_text": "We always book directly with the hotel, using their website. Several times, when we used third party reservation sites, the hotel contacted us and offered upgrades or a better price if we cancelled and booked directly through them."}]}, {"id": "2192201544512257", "text": "Hi all ! I’m visiting Bacoli . Does anyone have any ideas for day trips ? We won’t have a car . Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2192201544512257/", "likes": 0, "comments": [{"username": "Ettore de Vita", "comment_text": "What do you need to know"}]}, {"id": "2192182844514127", "text": "Hi, I'm looking for the best way to get from Naples airport to paestum please. Also with wheelchair, we're staying in Savoy beach hotel. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2192182844514127/", "likes": 0, "comments": []}, {"id": "2192178874514524", "text": "Staying at Hotel Ponte Sisto when in Rome end of July. Anyone stayed there?", "link": "facebook.com/groups/1373361046396315/permalink/2192178874514524/", "likes": 0, "comments": []}, {"id": "2192161907849554", "text": "Best places to eat in bologna , also best things to do lake garda please?", "link": "facebook.com/groups/1373361046396315/permalink/2192161907849554/", "likes": 0, "comments": [{"username": "Andy Blackwood", "comment_text": "Bear in mind Lake Garda is not a single place but a large lake with several towns around it. Sirmione at the southern end of the lake is pretty but your best \"activity\" is probably to take a ferry ride zigzagging across the lake from one town to another."}, {"username": "Laura Piccinini", "comment_text": "In Bologna It can be nice \" osteria dell'orsa\" , \"osteria della tigre\" ,\"parlor\" for lunch and dinner in Town.\nIf you stay in Bologna more than 1 day i suggest to go to Modena 🙂"}, {"username": "Claudia Castellini", "comment_text": "To eat in Bologna I suggest you Ristorante Teresina (via Oberdan): real traditional bolognese cuisine, good for lunch and for dinner.\nFor a very special dinner, go to Scaccomatto agli Orti (via della Braina), really good, you can find both meat or fish.\nIn both these restaurants you need to book a table.\nOtherwise, if you want a fast lunch, go to Bottega Portici 2 Torri (piazza Ravegnana, just in front of 2 Torri), where you can eat some traditional dishes in a “modern format”, or in alternative in via degli Orefici (a few steps apart) you can find many nice places.\nIf you’d like to taste delicious seafood, I suggest you Trattoria da Maro (via Broccaindosso):\nit’s not bolognese cuisine (I think it’s Sicilian), but very good anyway (also here, book your table).\nAll these place are in the very center of the city, of course there’s can be much much more in other areas.\nEnjoy Bologna and our fantastic food! 😋"}]}, {"id": "2192016941197384", "text": "I want to know food option n shopping local place( Rome, Venice, Florence, Napel)- I will be going there for 3 weeks", "link": "facebook.com/groups/1373361046396315/permalink/2192016941197384/", "likes": 0, "comments": [{"username": "Hudd Cass", "comment_text": "Where?"}, {"username": "Ken Lerch", "comment_text": "Rethink question."}, {"username": "Ben Parlopiano", "comment_text": "Where???"}, {"username": "Vivien Paulik", "comment_text": "Mabye if you tell us what city 🤷‍♀️"}, {"username": "Dave Conroy", "comment_text": "Use Google maps around the location you're staying at or elsewhere. Check out the reviews."}]}, {"id": "2192259457839799", "text": "Looking for the best accommodation in a winery north of Florance. Separate villas with beautiful views. 4-5 Star.\nWould appreciate any suggestions.\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2192259457839799/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g616196-d1233\n912-Reviews-Pie\nve_Marsina_e_Bo\nrgo_Argenina-Ga\niole_in_Chianti\n_Tuscany.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g5556303-d489\n4136-Reviews-Pa\nlazzo_di_Varign\nana_Resort_SPA-\nVarignana_Caste\nl_San_Pietro_Te\nrme_Province_of\n_Bologna.html"}]}, {"id": "2192256611173417", "text": "Can someone please suggest a good wine tour out of Florence? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2192256611173417/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nChianti-vineyard\ns-escape-from-F\nlorence-with-tw\no-wine-tastings\n/\nd519-6367P126?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2192254411173637", "text": "We are traveling to Italy with 2 kids in August. Any hotel recommendations for Rome and Florence which will be convenient with transportation? Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2192254411173637/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "rome https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2050\n44-Reviews-Hote\nl_Artemide-Rome\n_Lazio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "florence https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2307\n23-Reviews-B_B_\nHotel_Firenze_P\nitti_Palace_al_\nPonte_Vecchio-F\nlorence_Tuscany\n.html"}]}, {"id": "2192252557840489", "text": "We are heading to the coast from Pisa and want a beach we can rent chairs and an umbrella….what beach do we go too? Quick, on our way now", "link": "facebook.com/groups/1373361046396315/permalink/2192252557840489/", "likes": 0, "comments": [{"username": "Claudia Amp", "comment_text": "Which coast? The Tuscan riviera is extensive! Towards north or south? Ahem 😅"}]}, {"id": "2192249284507483", "text": "I just booked a trip to Rome, Naples and Amalfi for late March 2024. Now I realize we will be in Rome on Good Friday through Easter. Will everything be closed?", "link": "facebook.com/groups/1373361046396315/permalink/2192249284507483/", "likes": 0, "comments": [{"username": "Andy Blackwood", "comment_text": "No"}, {"username": "Jeff Gentner EA", "comment_text": "No. Try to get tickets to Easter Mass with the Pope. Wonderful experience."}, {"username": "Lynn Barrett Robson", "comment_text": "Book your excursions early. It's sure to be packed with families on break."}]}, {"id": "2192248694507542", "text": "ISO Hotel near cruise terminal or best way to get to terminal if staying near Colosseum.", "link": "facebook.com/groups/1373361046396315/permalink/2192248694507542/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192244007841344", "text": "My family and I are visiting Rome and Florence in December. My 70 year old mom is coming with us…she has mobility challenges and has a hard time walking long distances. I am trying to prepare for the best way to get around both of these cities. Public transportation like buses may not work well for her. I’m really wanting an option to pick us upआणखी right from our hotel and take us where we need to go…are there lots of taxis available? What about rickshaws?\n\nAny advice anyone could give me to help make this as easy as possible on my mom would be amazing! Thank you in advance❤️", "link": "facebook.com/groups/1373361046396315/permalink/2192244007841344/", "likes": 0, "comments": []}, {"id": "2192243914508020", "text": "Hello. I'm an advid reader on fictional history books on Roman legionnaires. Is there much left from their days? Best place to look? Any interesting trinkets or jewellery. Thankyou", "link": "facebook.com/groups/1373361046396315/permalink/2192243914508020/", "likes": 0, "comments": []}, {"id": "2192239214508490", "text": "Can someone please elaborate on how strict the dress codes are for churches? Does no sandals mean no flip flops or really no open-toed shoes at all (are Birkenstocks ok??)? Do knees really need to be covered or just a more modest dress above the knee as compared to some very short dresses some are wearing in the states? Do men/boys need pants? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2192239214508490/", "likes": 1, "comments": [{"username": "Alla Zats", "comment_text": "This has been discussed multiple times in the group. You can find lots of information by searching. Also Vatican has rules on the website, you can use those for all the churches."}, {"username": "Gloria Maledi", "comment_text": "the dress code is not very strict. you can wear any type of shoes. I'm italian and I've enter many churches with dresses above the knee, it's too hot in summer to be all covered up. I just bring a light cardigan to cover my shoulders if i'm wearing something sleeveless. Just don't show up in booty shorts and a bra and you'll be fine"}]}, {"id": "2192238857841859", "text": "Hi, we are travelling to Italy in August and I was hoping to surprise my boyfriend (hence the anonymous post) with a photography session as he often comments that we don't seem to get many photos of us as a couple when we travel. I'm not sure what city would work best. If you have any recommendations for which city or even recommendations for a photographer, that would be amazing! We are travelling to:\n- Milan\n- Venice\n- Florence\n- Rome\n- Sorrento\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2192238857841859/", "likes": 0, "comments": [{"username": "Stas Varych", "comment_text": "I do a lot of couples photography in Rome so I can definitely recomment that haha. I dont suggest Milan. Early morning in Venice or Florence can be very magical also. Sorrento is beautiful too but I prefer seeing more of cozy streets and some beautiful architechture as a background for italian photos so Rome, Venice, Florence."}]}, {"id": "2192233911175687", "text": "Hi! We are planning a mid December trip. Flying into Rome. 3 nights in positano, 2 nights in Venice, and 4 nights in rome. Yes I know it will be cold and possibly rainy and lots of things shut down on the coast but we are coming just to see the area and to hike/trail run. Just wondering anybody that has been in December, wanting to make sure theआणखी buses still run and that at least a couple restaurants would still be open. Assuming they would since people live there? Very much looking forward to seeing it when it’s not blazing hot and crowded. We love cold weather so not worried about that part.", "link": "facebook.com/groups/1373361046396315/permalink/2192233911175687/", "likes": 0, "comments": [{"username": "Wendy J. Calvin", "comment_text": "Hi...I believe Positano and the Amalfi Coast are basically shut down - generally at the end of October...just a few places are open for the locals...maybe not even hotels. I would call some of the hotels to check what is open and or running - ferries, taxis, buses, etc....or wait for others to post who may have more accurate information. Not sure if Sorento is different?????\nFor Rome...it will be Christmas time - extremely festive!!!\nHave an amazing trip!"}]}, {"id": "2192233837842361", "text": "I'll be in Florence in a month, and I'm getting tickets to Uffizi Gallery. I see skip-the-line tickets with a guide, but I plan to explore it at my own pace. Do the Reserved Entrance tickets skip the line too?\n\nOr should I just do the guided tour?", "link": "facebook.com/groups/1373361046396315/permalink/2192233837842361/", "likes": 2, "comments": [{"username": "Linda Chase", "comment_text": "I always get a timed entry ticket as early as possible. Don’t use a guide, I just prepare ahead of time. Enjoy! It is magnificent!"}, {"username": "Laura Jetton", "comment_text": "Get the guide and when your guide is over go back to see more stuff.\nThe guides will tell you stuff you may not know.\nOur guide was wonderful!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Download Rick Steves Audio Europe as a supplement to his guidebook. You are not required to hire a guide"}, {"username": "Verity Daughtrey", "comment_text": "We've done both and preferred to see everything without the guide. We bought a good guide book at the entrance and went early, so that we didn't have to queue. Italy is so hot at the moment, a stroll through the gallery is a refreshing change. Enjoy! X"}, {"username": "Denise Russo-Silverman", "comment_text": "I booked skip the line guided tours and didn’t regret it. But it is more costly. I don’t know what your budget is in my case I was in Amsterdam and I booked a tour guide for $75 as opposed to 22 for an entrance fee. The extra 50 bucks was worth it sometimes it’s hard to follow the audio but I saw a lot of people doing fine with it."}, {"username": "Marie Cuzzi", "comment_text": "I would get the guide !!! It’s worth the money you can stay after the tour and be on your own"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Reserved tickets skip the line too."}, {"username": "Carmine Castiglia Jr", "comment_text": "You might want to think about purchasing a Firenze card. Well worth the cost if you plan to visit many museums.\n\nhttps://\nwww.firenzecard.\nit/en"}, {"username": "Peter Rasmussen", "comment_text": "Never used a guide."}, {"username": "Francesca Messina", "comment_text": "Reserved tickets are skip the line tickets.\nLittle reminder: if you book online ( https://\nwww.uffizi.it/ is the official website) you will have a voucher that you will have to switch at the ticket Office and then get in line.\n\nAs a tour guide I higly recommend booking a guided tour, we tell stories and information you will never find in any book or audioguides 😁"}, {"username": "Lushan Yao", "comment_text": "If you purchase the Uffizi ticket through the official website, you get free entrance to two other museums. They are beautiful to visit and not crowded. If I remember correctly, you have 72 hours to visit the other two."}]}, {"id": "2192233831175695", "text": "Noticing many say pack light and use carryons..which I’m good with but what do we do with anything that we buy and want to bring back with us if we only have carryon and will be tight with space?!", "link": "facebook.com/groups/1373361046396315/permalink/2192233831175695/", "likes": 13, "comments": [{"username": "Allan Olexa", "comment_text": "We always check a bag. Coming home, we put purchases in the suitcase then also check a folded duffel bag with our clothes."}, {"username": "Ken Lerch", "comment_text": "Ship it."}, {"username": "Becky Nelson", "comment_text": "I took clothes I didn’t care as much about and older shoes. I left some stuff behind to add new stuff. You are also allowed to take a full sized pillow. I bought a zippered pillowcase and put my travel pillow and a hoodie inside instead. Luckily I had put 3 days of dirty clothes in a plastic bag in there for one flight. They made me check my carryon and lost it for 39 days. It left me with 4 outfits to finish out my last 20 days. Be creative!"}, {"username": "Carol Rojas", "comment_text": "👀"}, {"username": "Eric Parks", "comment_text": "I buy a bag if I need it. I have a collection of souvenir suitcases."}, {"username": "Staci Wilson Shattler", "comment_text": "Bring (or buy there) a folding duffle bag to pack dirty clothes in and check on the way home. This opens up space to pack souvenirs in your carry on bag. Non breakable souvenirs can be packed & checked in the duffle, too."}, {"username": "Nancy Webster-Gregg", "comment_text": "Julie Webster-Rogers Halle Gregg"}, {"username": "Larry M Murray", "comment_text": "if your first trip you most likely will buy stuff but most people who travel more than once are not as apt to bring stuff home or they ship. We put an empty soft carry on in our hard cases and coming home we checked the hardshells with our clothes and stuff and brought the purchases home on our carryon. All the cheese we put in one package to make it easier to go through customs."}, {"username": "Laura Allen Weinstein", "comment_text": "I brought another backpack that folded up so when I wasn’t using it, it was tucked away. I used it on my way home as my “personal” item."}, {"username": "Sandra Maldonado", "comment_text": "I don’t travel to shop, that’s why a carry on is the way to go for me"}, {"username": "Kris Beacham", "comment_text": "Buy another suitcase and use that."}, {"username": "Laurie Jimenez", "comment_text": "I will never overpack for any European trip! Learned the hard way and it cost me $400 for excessive weight!😬🙄"}, {"username": "Karen Espinoza", "comment_text": "Extra big back"}, {"username": "Lisa Zarlingo Smith", "comment_text": "Last trip we kept everything small and I bought a cute tote bag for my personal item. Next trip I plan on shipping back a box."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Check a bag on the way home. Either buy a bag there, or bring one that can be folded up to check on."}, {"username": "Heather Corson", "comment_text": "Use vacuum bags for your clothes."}, {"username": "Barb DeVries", "comment_text": "Only buy scarves and coasters for souvenirs!!"}, {"username": "Lorraine Puz Morgan", "comment_text": "Ship it."}, {"username": "Tami Sue", "comment_text": "I check my bag going home. It wouldn't matter if it got lost for a couple of days."}, {"username": "Kay Jurgens", "comment_text": "There are duffel bags that fold down to a very small size. ￼"}, {"username": "Starla Dawn", "comment_text": "We bought a suitcase last day in Rome."}, {"username": "Martha Lee", "comment_text": "The goal is to have the carry on half full"}, {"username": "Cynthia Williams Landrum", "comment_text": "Do they pack things that you buy well enough to make it home safely?"}, {"username": "Stephanie Saenz Bauer", "comment_text": "We bought a bag while over and checked on way back"}, {"username": "Carol Shrieve", "comment_text": "Ship your souvenirs home. We did it twice via mailbox etc. Once in Rome and once in Venice. Boxes arrived before we got home!"}, {"username": "Julie Keener", "comment_text": "We pack 2 foldable bags. One time we had to buy a duffle bag to come home"}, {"username": "Robin Anderson", "comment_text": "I ship my bag. Never had a problem. My carryon is fairly empty for purchases then, especially breakables. But I did ship a bottle of melon liquor nicely in my checked bag."}, {"username": "Jennifer Baker Howard", "comment_text": "We planned a little differently. My hubbie is a passionate carry on only traveler. However, we needed to bring some things that were easier to put into a checked bag. So we planned for 3 carry ons with essential clothes, jewelry, meds, & essential toiletries for 3 ppl & 1 smaller size checked bag to put addl liquids plus plenty of room for things to bring home. We are doing multiple flights & this has worked really well for us. The 3 of us were easily able to pull all our bags in & around public transport & airports. If the checked bag is delayed, we had most of our clothes & important stuff with us."}, {"username": "Jenny Payne", "comment_text": "Send from a post office but take tape + marking pen as they don’t hold together that well when they tape them🌻"}, {"username": "Elena Colibraro Groves", "comment_text": "Thank you all so much! We are traveling to a few different locations so we decided to use our packable totes or purchase another luggage if need be!\nAppreciate the feedback!"}, {"username": "Carla Onofrio", "comment_text": "Bring an extra bag that you can pack with your souvenirs later and then check your suitcase on the way home. I only worry about the way there because I don’t want to be without clothes for my vacation."}, {"username": "Dave Colleen", "comment_text": "We brought 2 empty suitcases for purchased items. We figured if the 2 suitcases didn’t make it to Italy , oh well."}, {"username": "Fran Scotti Lindner", "comment_text": "Buy another bag and check it"}, {"username": "Phyllis Snyder", "comment_text": "Buy another piece of luggage in Italy to check upon you leaving for home."}, {"username": "Blanca Gil", "comment_text": "I can’t travel with a carry on only. I’ve always checked a bag and traveled alone on trains, planes and buses. I need space."}, {"username": "Rachel Solis", "comment_text": "We pack 2 foldable bags (can look up “the foldie” on amazon) and use them as our carryons on the way home and check our hardsided suitcases filled with souvenirs. So basically, we are COO on the outbound trip, and on the way home, we have both carryon and checked. And we always keep AirTags in our hardsided bags."}, {"username": "Gena Diaco Penland", "comment_text": "We took regular checked suitcases and an empty carry on to bring stuff back!"}, {"username": "Melanie Sartuche", "comment_text": "We bought another piece of luggage in Italy to pack the things we bought, then checked all our bags on the way home"}]}, {"id": "2192220421177036", "text": "Hi, traveling next month and visiting Pompeii. We have a tour for 10.30 am and would love to spend more time after but will be too hot. Can you go back to the site later the same day on the same ticket?", "link": "facebook.com/groups/1373361046396315/permalink/2192220421177036/", "likes": 0, "comments": [{"username": "Nicola Bloom", "comment_text": "Wow, that will be a good break for you! Toby and Co should be in the south at about the same time, perhaps you could meet up (though my geography being what it is, not sure how close you’ll be!)"}]}, {"id": "2192222134510198", "text": "We will be traveling as two couples. Will restaurants do separate checks or should we just figure out how to take turns paying?", "link": "facebook.com/groups/1373361046396315/permalink/2192222134510198/", "likes": 1, "comments": [{"username": "Ruth Hackert", "comment_text": "Whatever you do, agree on it before you travel"}, {"username": "Jim-Holly Ballew", "comment_text": "Most places will split. Or try using the app “Splitwise “"}, {"username": "Alex Kovacs", "comment_text": "I would assume it’s pretty easy to split - when you pay with your card they bring the little machine over and manually enter in what is on the check, just have them run it twice and tell them what amounts."}, {"username": "Emily Niland", "comment_text": "Tell them before you order you want separate bills"}, {"username": "Karen Blackmore", "comment_text": "Definitely agree before you go. Also if you want to splash out on a steak for example, agree to put in a bit extra. Depends how much you usually go out together! Don't want to be like my friend at uni, had a double vodka if I was paying and a coke if she was!"}, {"username": "Monica Colontonio Macho", "comment_text": "It has been our experience that they do not separate checks. We have just divided between each other as most dishes are pretty close to the same price."}, {"username": "Elizabeth Martin", "comment_text": "It’s not very hard to split the bill"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "They did not do separate checks"}, {"username": "Ken Lerch", "comment_text": "Ask at the time of ordering, not at the end. Dividere il conto, per favore."}, {"username": "Susan Siewko Cos", "comment_text": "Down load Splitwise app\nTake turns paying. Put everything into Splitwise and settle up when you get home. It takes the stress out of it all."}, {"username": "Greg Hamilton", "comment_text": "Having worked in hospitality for many years, I agree that it's easy to split bills - it just takes a little extra time to process separate transactions. Some restaurants dont want the hassle and wont split bills.\n\nSo, plan for both scenarios.\n\nFirstly, ask restaurant staff if they split bills. If so, happy days. If not, then resort to plan B which is your pre-arranged payment agreement with the other couple."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Went with 3 friends. We used Splitwise. Worked well!"}, {"username": "Jill Medrano Casey", "comment_text": "We struggled to get restaurants to split checks. (We were in Florence, Rome, Amalfi in June.)"}, {"username": "Alessandro Battxi", "comment_text": "Most of the places will split. Isn't an issue."}]}, {"id": "2192217941177284", "text": "Lake Braies.\n#lakebraies", "link": "facebook.com/groups/1373361046396315/permalink/2192217941177284/", "likes": 2, "comments": []}, {"id": "2192203611178717", "text": "Can anyone tell me the exchange rate in Rome for AUD to EURO atm please ?", "link": "facebook.com/groups/1373361046396315/permalink/2192203611178717/", "likes": 0, "comments": []}, {"id": "2192207644511647", "text": "Best place to stay in Venice. Is Venice worth going??", "link": "facebook.com/groups/1373361046396315/permalink/2192207644511647/", "likes": 1, "comments": [{"username": "Jill Wolder", "comment_text": "The “ best place “ to stay is the Cipriani. It is an amazing city. Nothing like it. Great history. Take a tour so you understand its importance. Then explore/ and get lost on your own."}, {"username": "Mike Frischenmeyer", "comment_text": "Have you been to Paris? Venice is the 2nd most beautiful city in the world, after Paris."}]}, {"id": "2192199624512449", "text": "Hi all. It appears that the day I’m due to fly from Rome to Croatia there is a national airline strike! Can anyone tell me what PERSONALE SOC. and ENAV mean? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2192199624512449/", "likes": 0, "comments": [{"username": "Megan Beals", "comment_text": "I'm wondering the same thing. I'm scheduled to fly out of Rome on the 17th"}, {"username": "Giorgio Zanichelli", "comment_text": "it means \"ENAV staff\", ENAV is the agency that provides air traffic control and monitors italian airspace"}]}, {"id": "2192179524514459", "text": "4 weeks in Italy\nBring it on 🇮🇹❤️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2192179524514459/", "likes": 1, "comments": []}, {"id": "2192176331181445", "text": "Trevi Fountain at midnight: instagram vs realtiy 😆\n\nStill worth seeing! Been coming to Italy (always via Rome) for many years, and I never skip this place!", "link": "facebook.com/groups/1373361046396315/permalink/2192176331181445/", "likes": 2, "comments": []}, {"id": "2192174027848342", "text": "Hi anyone have any cooking class recommendations in Rome. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2192174027848342/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nPasta-and-Tirami\nsu-Lovers-Works\nhop-in-the-Hear\nt-of-Rome/\nd511-21369P11?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2192165924515819", "text": "I signed myself up for a truffle hunting session in Florence (late Oct)\nHas anyone been on a truffle hunt in Italy? Was the experience fun?\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2192165924515819/", "likes": 0, "comments": []}, {"id": "2192165251182553", "text": "We are in the early stage of planning a trip to the Almafi coast. What town should we stay in for 3 to 4 nights?", "link": "facebook.com/groups/1373361046396315/permalink/2192165251182553/", "likes": 0, "comments": [{"username": "Lydia Brown", "comment_text": "It depends on if you are driving the Amalfi coast o your own. I would not stay in Positano (way to crazy with tourists), definately a day trip.\nConsider staying in Praiano, which is midway on the coast road (cute little hotel called the Open Gate)\nIf not stay in Sorrento and use that as a base. You can drive over the mountain road and enter from Maiori or Minori to do Ravello and the town of Amalfi"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\namalfi-coast/"}]}, {"id": "2192157177850027", "text": "Amalfi Coast in late Oct to early Nov - is everything still open during this non-peak time?", "link": "facebook.com/groups/1373361046396315/permalink/2192157177850027/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\namalfi-coast/"}, {"username": "Sandy Radican Shikaly", "comment_text": "Things start shutting down toward the end of October... ferries stop in November"}, {"username": "Jennifer Avrett", "comment_text": "Boats stop running October 31st and things begin shutting down then"}, {"username": "Laura Bolzic", "comment_text": "Yes we were there in November last year and still plenty of tourists."}, {"username": "Stacey Lavelle Johnson", "comment_text": "When do things reopen in the spring?"}, {"username": "Melissa Ropp", "comment_text": "I've been in November & had no issues. Few restaurants closed. Still did the ferry to Capri too. Going back again this November."}, {"username": "Jenny Payne", "comment_text": "Not much 🌻"}, {"username": "Jonna Beck Lewis", "comment_text": "Cynthia Winters May"}]}, {"id": "2169008336831578", "text": "Hotel Santa Caterina, Amalfi- A Corner of Paradise\nWith its picturesque view of the sea, the hotel is located a short distance from Amalfi town centre and is perfectly positioned for visiting nearby towns such… आणखी as Positano, Ravello, Sorrento, Capri, Pompeii and Herculaneum and Naples.\nThe Santa Caterina is one of the Amalfi Coast’s grande dame hotels, a seductive mix of luxury and top-notch yet down-to-earth service. With its spectacular clifftop location just outside Amalfi and five-star facilities, it is one of the most popular spots in this glorious corner of Campania.\nBook here for the best price: https://www.dpbolvw.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187780-d195505-Reviews-Santa_Caterina_Hotel-Amalfi_Amalfi_Coast_Province_of_Salerno_Campania.html", "link": "facebook.com/groups/1373361046396315/permalink/2169008336831578/", "likes": 729, "comments": [{"username": "Annette Christine", "comment_text": "Looks wonderful"}, {"username": "Jenny Redman", "comment_text": "Shame it’s not everyone reality …."}, {"username": "Gina DeCrescenzo", "comment_text": "John Boyle"}, {"username": "Md.Mazed Abdullah", "comment_text": "Too expensive... although looks spectacular and scenic on pictures"}, {"username": "Beata Naczyńska", "comment_text": "O wiele taniej jest hotel w Sorrento też pięknie położony na klifie A to bardzo blisko"}, {"username": "Melanie Hayes", "comment_text": "Hope Daley"}, {"username": "Deanna Pitta Gallo", "comment_text": "Any other nice hotels that are reasonably priced?"}, {"username": "Emma Cullen", "comment_text": "McCormack Bryan"}, {"username": "Joanne McHenry", "comment_text": "Karen Babic 😍"}, {"username": "Bella Cassandra", "comment_text": "Air bnb 150 a night 😂"}, {"username": "Rachel Blears", "comment_text": "Karl Blears can we go here please?"}, {"username": "Meg Baldwin", "comment_text": "Harrison Betts"}, {"username": "Lorie Butler", "comment_text": "Our son and DIL were married in the garden there. The food at the restaurant/\nreception was unbelievably good especially all the gluten free foods they made for me! The hotel bundled their wedding, reception, room. Husband and and I stayed walking distance away at an air BB facing the water."}, {"username": "Hồng Hạnh Nguyễn", "comment_text": "So pretty ❤️"}, {"username": "Cinzia Wong", "comment_text": "Passed by it many times. It’s beautiful. Spendy but beautiful"}, {"username": "Concetta Scalese", "comment_text": "Enjoy have fun and be safe ❤️🥰🍀"}, {"username": "Charlotte Natalie Jones", "comment_text": "Casey Baker 😍😍 I wish"}, {"username": "Michele Major", "comment_text": "My husband and I stayed there! It was absolutely beautiful"}, {"username": "Michele Major", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Roxanne Novia", "comment_text": "Wow how much is that one?"}, {"username": "Louise Matte Elliott", "comment_text": "Is there a reason why everything after October 2023 is blocked off? There are no rooms available in May of 2024?"}, {"username": "Michele Olson", "comment_text": "Ashley Jade"}, {"username": "Phil Greengus", "comment_text": "Wish someone would send Eric and me to Italy and the Alnafifi coast"}, {"username": "Abo D. Haedar", "comment_text": "Karzan Ahmed"}, {"username": "Kelly Verhaeg", "comment_text": "Bart Rogge"}, {"username": "Sha Zee", "comment_text": "Fortunate enough to get to spend time at this property in 2019"}, {"username": "Sha Zee", "comment_text": "Sha Zee"}, {"username": "Sha Zee", "comment_text": "Sha Zee"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "🥰"}, {"username": "Barbara Pea", "comment_text": "Rather sad to think that there are people who can actually afford to pay these prices yet I never will. And I'm a good person, my husband and I have worked hard all our lives and we are rather intelligent people. But we will never partake in such splendor. But we have each other and three beautiful children. I feel blessed but these photos are so enticing. Enjoy you rich folks out there."}, {"username": "Chuckie Goldman", "comment_text": "Wow! That's awesome!"}, {"username": "Victoria Russo", "comment_text": "Gorgeous"}, {"username": "Margie Basca", "comment_text": "This is my DREAM!"}, {"username": "Tammy Plain", "comment_text": "Gord Plain"}, {"username": "Antoinette Napoli", "comment_text": "this place looks absolutely stunning 😍"}, {"username": "Linda Charlene Vaughan Osborne", "comment_text": "Very impressive!"}, {"username": "Jennifer Tzor", "comment_text": "Angelo Leonardi"}, {"username": "Karen Turck", "comment_text": "Bob Hargreaves"}, {"username": "Kristina Shults", "comment_text": "Mikhail Vasilevitskiy"}, {"username": "Cathy Ann Mizzi", "comment_text": "amazing"}, {"username": "Julie McIvor", "comment_text": "Looks expensive 😓"}, {"username": "Joleen Hart", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Cindy Neal Norvell", "comment_text": "Michelle Norvell ❣️"}, {"username": "Michelle Cross", "comment_text": "Apple Cross only over $1000 bucks a night 🙈🙈🙈😂"}, {"username": "Heather Lauzon", "comment_text": "F"}, {"username": "Sara Punis", "comment_text": "Daniela Beaković"}, {"username": "Lizette Pavone", "comment_text": "Davide Pavone, volgend jaar?"}, {"username": "Monique Dautzenberg", "comment_text": "Sander Schreurs"}, {"username": "Emma Selfe", "comment_text": "Sam Selfe how amazing is this c"}, {"username": "Lynne Sutton", "comment_text": "Sue San this looks nice"}, {"username": "Paulette Molasses Sims", "comment_text": "Looks expensive.... 😆"}, {"username": "Kye Ishere", "comment_text": "For $7500 a night (quoted for 2 adults and 1 child) I'll pass.\nTo me, that is a whole 2 weeks in Europe, travelling, plane fares, food, attractions and accommodation. I'd rather see more, than see this 1 view for 1 night."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192397221159356", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2192397221159356/", "likes": 2, "comments": []}, {"id": "2155706051495140", "text": "Full-Day Small-Group Truffle Hunting in Tuscany with Lunch\nFollow your guide on a truffle hunt on this adventure from Florence. Travel by coach to the hilly landscape surrounding San Miniato, a Tuscan town… आणखी famous for its delectable white truffle. With the help of an experienced hunter and his trusty dog, make your way through the woodland, scanning the earth for this regional specialty. Afterward, reward your search with a 2-course lunch in Chianti, including a wine tasting and truffle pasta. Your small-group tour is limited to eight people and concludes with transportation back to Florence.\nRead more about Full-Day Small-Group Truffle Hunting in Tuscany with Lunch - https://www.viator.com/tours/Florence/Small-Group-Truffle-Hunting-and-Wine-Experience-from-Florence-with-Lunch/d519-7428TRUFFLE?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2155706051495140/", "likes": 13, "comments": [{"username": "Sarah Banks", "comment_text": "I did this tour! It was amazing."}, {"username": "Mary Sandor White", "comment_text": "Expensive"}]}, {"id": "2192255774506834", "text": "Live la Dolce Vita fro your home! Explore one of the world’s most beautiful places: the Amalfi Coast and the three islands of the Gulf of Naples, Capri, Ischia and Procida!\nJoin us: आणखीhttps://nextstop-italy.com/virtual-tours/amalfi-coast/\n\n#positano #positanoview #positanocoast #positanoitaly #amalfi #amalficoast #amalfitancoast #amalficoastitaly #atrani #capri #bluegrotto #procida #ischia #ravello #ravelloitaly\n#virtual #italygram #italytrip #vacation #virtualworld #italytravel #vacationmood #VirtualTour", "link": "facebook.com/groups/1373361046396315/permalink/2192255774506834/", "likes": 60, "comments": [{"username": "Shula Hurvitz", "comment_text": "🎯💥💯🥇🇮🇹🇮🇱"}, {"username": "Aurora Rory Valdez", "comment_text": "Yessi Beason"}, {"username": "Joleen Hart", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Steve Betsy Sillers", "comment_text": "Looks awesome!!"}]}, {"id": "2192152241183854", "text": "Hello, is there anybody who join the Muse concert event on 18th of July in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2192152241183854/", "likes": 3, "comments": [{"username": "Manon Cloutier", "comment_text": "Bonjour, je veux aller faire la côte amalfitaine en mini van de Sorrento à Salerno. Selon se que j’ai lu c’est étroit et très achalandé. Est ce sécuritaire? Il mentionnait aussi qu’il n’y avait pas beaucoup de stationnement. Nous sommes 6, est ce mieux de le faire en autobus local ou en voyage organisé à partir de Pompéi? Merci de votre aide\nExcursion d’un jour seulement"}, {"username": "María Cm", "comment_text": "Hi. I am selling one ticket for the MUSE - Will of the People World Tour concert on Tuesday 18 July 2023 @ 21:00 | Stadio Olimpico di Roma, Roma. Ticket for: Tribuna Monte Mario Onore SX / 13 / . Full price is 104 €. But we can talk about the price"}]}, {"id": "2192155851183493", "text": "Maybe this has been asked before, but is there public parking (lot lots not street) in the bigger cities like Florence? If so, is there an app or something to help find it?", "link": "facebook.com/groups/1373361046396315/permalink/2192155851183493/", "likes": 4, "comments": [{"username": "Michelle Casillas", "comment_text": "I don’t know about any apps other that using google maps for “parking” it will show the blue P. But be careful of the ZTL zones. Florence especially you’ll need to research where those are so you don’t get a ticket."}, {"username": "Carmine Castiglia Jr", "comment_text": "I know of this one for certain. Firenze Parcheggi - Parterre slightly above center on the map below. It's an underground parking garage (there is a fee to use it)."}, {"username": "Achim Marke", "comment_text": "Google maps look for parking or parcheggio"}, {"username": "Colleen Melnyk", "comment_text": "No joke, Florence is a nightmare to drive in, an absolute nightmare. I would park outside the core and Uber in, honestly."}, {"username": "Giovanni Pianigiani", "comment_text": "Easypark. Just checked, it covers Florence"}, {"username": "Robin Barbera", "comment_text": "If you have never driven in Italy... think again. Best places to park are on the outskirts of town"}, {"username": "Jim Kelleher", "comment_text": "If you are renting a vehicle, please make sure to rent the smallest possible vehicle that will fit you and your luggage. Whether you park on the street or in a lot, it’s very tight. The rental agency my offer you a free upgrade to a larger vehicle; turn it down. Smart travelers avoid the big vehicles since they’re near impossible to park."}, {"username": "Fran Scotti Lindner", "comment_text": "Do not recommend driving in the city. City centers are blocked for cars. Leave vehicle outside of city in public parking lots"}, {"username": "Gena Diaco Penland", "comment_text": "We are in Florence now and I would NEVER try and drive here!!!! The streets are super narrow and pedestrians everywhere!!"}]}, {"id": "2191987801200298", "text": "Planning our trip to Florence. Can anyone recommend whether booking directly with museums is best or using sites like Viator is best? Forgive me if this question as already been asked.", "link": "facebook.com/groups/1373361046396315/permalink/2191987801200298/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "viator https://\nwww.viator.com/\nFlorence/\nd519?pid=P000705\n87&mcid=42383&m\nedium=link&medi\num_version=sele\nctor"}, {"username": "Luce Biscardi", "comment_text": "Book with museums directly!"}, {"username": "Jeff Gentner EA", "comment_text": "We used Walks of Italy in Florence. Excellent experience. Skip the line tickets."}, {"username": "Joe-Linda Po Agustin", "comment_text": "I’ve always booked directly, no problems so far."}, {"username": "Claudia Amp", "comment_text": "Just book directly on their web sites."}, {"username": "Desiree Chetty Paliam", "comment_text": "We booked everything on direct websites. Even got Groupon deals on some. 😉 enjoy"}, {"username": "Jeff McLellan", "comment_text": "We just booked everything directly and went to the Bell Tower first thing to be the first up (and down). David viewing tickets sell out so book that sooner rather than later."}]}, {"id": "2191990851199993", "text": "I have read many posts about transit tickets and validation; none make me really understand what's going on. But I think I've figured it out, so posting to confirm for myself and others.\n\nYou can buy a train / bus ticket with two scenarios:\n1. Purchase a ticket that's \"open\" (my term) for any day / time.\n2. Purchase a ticket for a specific day /आणखी time.\n\nThe \"open\" ticket needs \"validation\", or cancelling, so you don't continue to use it free forever.\nThe \"specific\" ticket, obviously, doesn't have the problem of abuse. Use it and done.\n\nDo I understand this correctly?", "link": "facebook.com/groups/1373361046396315/permalink/2191990851199993/", "likes": 7, "comments": [{"username": "Jojo Hanna", "comment_text": "My understanding - paper tickets need validating. Online tickets, don’t."}, {"username": "Miyuki Kanno Paul", "comment_text": "If your ticket has the specific seat assignment on a specific train on a specific date/time, you don’t need to validate"}, {"username": "Katalina Loredo", "comment_text": "Train tickets: if you buy a ticket on the app or online and get the QR code, you don’t need to validate. A conductor will walk by at some point during the train ride and ask to see it. Nothing needs to be done beforehand. Paper tickets that are bought at the station with no date or time need the validation which you can do before getting on the train.\nBus tickets: you can buy tickets from apps and validate right before getting on the bus and some have you scan a QR code that’s next to the driver. If you buy paper, you have to scan it or insert it at the machine when you enter the bus"}, {"username": "Fetchin Gretchen", "comment_text": "Yes, you understand it correctly. In Italy, there are two types of train tickets: open tickets and specific tickets.\n\n* **Open tickets** are valid for any day and time. They must be validated before boarding the train, otherwise you could be fined. The validation process involves stamping the ticket with a date and time, which shows that you have paid for the ticket and that it is valid for that specific journey.\n* **Specific tickets** are valid for a specific day and time. They do not need to be validated, as the date and time are already printed on the ticket.\n\nThe reason why open tickets need to be validated is to prevent people from buying a ticket and then using it for multiple journeys. If open tickets did not need to be validated, people could buy a ticket and then use it every day, without ever having to pay for another ticket.\n\nI hope this helps!"}, {"username": "Francoise Coupal", "comment_text": "To play it safe I would validate either!"}, {"username": "Bernadette Collins", "comment_text": "Yes you do"}, {"username": "Daisy Yoo", "comment_text": "Yes"}, {"username": "Janet Messanelli Bozzone", "comment_text": "I believe you still have to validate an open ticket the first time you use it. Solution is to get mobile ticket and not worry about it. You still have to watch the time on specific tickets."}, {"username": "Ruslana Makovey", "comment_text": "What is app to buy a bus/train ticket?"}, {"username": "Rhona OConnor", "comment_text": "Yes. You..."}]}, {"id": "2191959577869787", "text": "Hi, Just wondering what is the best option for transfers from train stations to accommodation etc. We emailed the accommodation we are staying at in Badiola and the 13min journey would cost us $100AUD!", "link": "facebook.com/groups/1373361046396315/permalink/2191959577869787/", "likes": 1, "comments": [{"username": "Maria Calipari", "comment_text": "just check rome2rio first and then if need be, depending on your luggage maybe Public Transport...bus\n, tram etc https://\nwww.rome2rio.com\n/\nMay take longer, but you may discover some hidden gems on the way."}, {"username": "Mel Devereux", "comment_text": "We walked in Florence, used Welcome Pickups in Rome water taxi in Venice and walked in Milan. It wasn't cheap. To get back to the station is Florence and Rome we used a taxi (ordered a large one). We are also Australian and it is expensive, but when it was 38 degrees we decided the expense was worth it."}, {"username": "Claudia Amp", "comment_text": "Mostly taxis or NCC; taxis have flat fares for certain destinations, doesn’t matter the length of the journey. Alternatively you could hop on a bus if the area is well served but maybe Badiola may not be."}, {"username": "Giovanni Pianigiani", "comment_text": "Where is Badiola and what airport are you flying to?"}]}, {"id": "2191983704534041", "text": "Going to be in Italy for a month this fall. Heard I’ll need to get medical insurance cause Medicare won’t cover me out of the country. Any advise would be much appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2191983704534041/", "likes": 8, "comments": [{"username": "Kathy Weikert Figgis", "comment_text": "Some Medicare secondary plans cover foreign travel."}, {"username": "Hermineh Topalian", "comment_text": "All people from USA have problem with insurance, what country you have? Come over to Europe"}, {"username": "Laura Miller Bailey", "comment_text": "I got medical and travel through Allianz."}, {"username": "Raven Carr", "comment_text": "Check your Medicare Supplement or MAPD coverage guidelines. A lot of MAPD plans cover travel. If you are unsure, ask your Medicare insurance agent (who you got your secondary plan through) and they can help guide you and direct you on travel insurance as well."}, {"username": "Giovanni Pianigiani", "comment_text": "Forget what they say and get a decent insurance. Indeed ER is free so if you're dying you'll be saved. But if you show up at ER for anything not threatening your life you'll end up spending he whole day there. And don't forget transportation after you're done with ER: it's likely to cost several thousands € if you need any special assistance for traveling"}, {"username": "Janet Sadowski- Carloss", "comment_text": "AAA has it"}, {"username": "Patti Koscal", "comment_text": "Travel insurance is a must!"}, {"username": "Linda Slover Bright", "comment_text": "I always get Allianz, not just for medical care and travel, but for repatriation. That can cost over $80K."}, {"username": "Kathy Budde", "comment_text": "You definitely should get medical coverage because Medicare doesn’t cover a lot of the costs when you’re overseas. It states they cover emergencies but that doesn’t cover things like surgeries. My husband had a heart attack in London and then open heart surgery……the negotiated cost with insurance was over $41,000. The travel insurance covered that cost plus other incidentals."}, {"username": "Sandy Pitts McMath", "comment_text": "I bought a reasonable bc/bs policy for a month last fall."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "We got a medical plan thru Blue Shield, cheap and worth the piece of mind"}, {"username": "Pat Francis Moslow", "comment_text": "It depends on what policy you have. No one here will know that answer for you, call Medicare and ask."}, {"username": "Cyndie Cooper", "comment_text": "Thxs everyone for your input!"}, {"username": "Lisa Boyes Cooper", "comment_text": "If you can’t afford to pay the medivac back to your own country if anything happens you need it."}, {"username": "Crisandra Giorno", "comment_text": "Allianz, my husband got food poisoning and they paid all of the medical expenses for us."}, {"username": "Michelle Matosevic", "comment_text": "If you are from Australia take your government Medicare card, we have reciprocal health care arrangements with italy. You still need travel insurance, if you need to be repatriated back to your home country it will cost an arm and a leg. I believe if you can't afford insurance then you can't afford to travel."}, {"username": "Irma Hurlbert", "comment_text": "Never leave home without travel insurance"}, {"username": "Annette Mayer", "comment_text": "Alianz is so much more than medical insurance. And you need it all"}, {"username": "Beckie Mermod", "comment_text": "Check your supplemental insurance"}, {"username": "Trina Molnar", "comment_text": "I use Allianz. Great company, fast reimbursements when a claim is made."}, {"username": "Sue Waksmunski", "comment_text": "Buy the insurance. You can get insurance for 30 days. Look at it like this how much do you pay a year for your cell phone, or how much do you pay a year for your streaming services, cable tv, or satellite service. Put all of those fees together and it's going to be less to buy insurance. In fact my cable TV runs me $205 a month. Yes, I have a lot of extras. My insurance for my month-long trip with my husband covering the actual cost of my trip that would not be refundable if I had to cancel last minute was just over $500, and I had purchased more then $6,000 worth of insurance. Again the 6,000 was based upon the actual cost of non-refundable items such as hotel, plane tickets, Cruise Etc. $500 was a good investment for two people in their 70s for a 30-day stay. The insurance company I purchased was through my travel agent who had a preferred rate and the company is called Allianz."}, {"username": "Allison Mir", "comment_text": "Get comprehensive travel insurance - will provide assistance if you are sick/injured, loose your bags, can’t travel because you are sick/injured."}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "My husband broke his leg in Venice. We were expected to pay the bill before we left the hospital. (We had travel insurance and they paid our way home, but not the hospital bill.) it was cheaper than US, but the care was only fair."}, {"username": "Mary Donatelli Tonry", "comment_text": "No fee or charges of any sort to be treated in Italy. Our daughter was quite sick during a visit to Rome and was admitted without anything much more than Identification and symptoms (no insurance info taken)and even transferred to a second facility. No charge for any of it and she received very good care."}, {"username": "Marti Campbell", "comment_text": "We always purchase Alliance for international travel"}, {"username": "Rhonda Allen", "comment_text": "Allianz or Nomad"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Always purchase travel insurance. It covers medical and a whole lot more."}, {"username": "Ruth Hackert", "comment_text": "I have an annual policy from Allianz"}, {"username": "Sharyn Heyligers", "comment_text": "I strongly believe if you can’t afford travel insurance you shouldn’t travel."}, {"username": "Frank Hunt", "comment_text": "American right. Most people rate these companies on price and cover, that differs from person to person. Not many make claims to test how well they payout."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\ntidd.ly/3NhBkSA"}, {"username": "Andrea Curry Brown", "comment_text": "Trip insurance. Should have a medical insurance in it."}, {"username": "Martina Papamarino", "comment_text": "Se vuoi avere cure private ti serve assicurazione, ma in Italia se vai in ospedale ti curano a prescindere, la sanità è pubblica.. o almeno credo che non avrai problemi :)"}, {"username": "Alessia Conter", "comment_text": "If you have any emergency (for examples: broken arms, car accident, heartache ecc ecc) they will cure you for free or at least for a very little price. We have public healthcare."}, {"username": "Francesco Mitola", "comment_text": "In Italy hospitals are free. You don't need any insurance, referring to emergencies."}, {"username": "Helen Ladkin", "comment_text": "Travel insurance is imperative."}, {"username": "Diane Plott Miller", "comment_text": "I got mine this week through the AMAC (retired citizens website)."}, {"username": "Colleen Dawson", "comment_text": "If you need any help doctorsinitaly is a great resource. They were created with travelers in mind."}, {"username": "Betty Becker", "comment_text": "Always used Alliance as travel insurance."}, {"username": "Stephen Henn", "comment_text": "If you go to squaremouth.com, enter your criteria the search result will show you many travel insurance options and you can compare what each plan’s premium is, what’s covered and for how much, etc."}]}, {"id": "2191965797869165", "text": "im planning a trip with my family to italy next year and i’m needing to know what the best city to fly into is, the best airline, for a family of five is it easier to just rent a car and what are the best hotels? TIA!!", "link": "facebook.com/groups/1373361046396315/permalink/2191965797869165/", "likes": 6, "comments": [{"username": "Keith Piccirello", "comment_text": "Depends where you what to go what experience you want. I don’t stay at hotels. We use Airbnb. And we travel by train"}, {"username": "Sandi Van", "comment_text": "I’m just leaving with 6 people and went Rome , Naples (Pompeii), Florence, and Venice i used -Booking.com for accommodations most hotel 4 people per room\n-trains for traveling to different city\n-if you’re trying to go from city to city … start north or south then leave opposite ends\n- takewalks.com for different skip the line tours"}, {"username": "Giulia Cardamone", "comment_text": "Where are you flying from?"}, {"username": "Keith Britton", "comment_text": "Fly into a place close to where you want to visit."}, {"username": "Jeff Odom", "comment_text": "Look into multi-segment flights where you fly into 1 city and out of another if you plan to go to various cities. Google flights is your friend for finding them."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Renting apartments is your best bet with five people."}, {"username": "Claudia Amp", "comment_text": "Depends on the region/area you want to explore; Biggest airports with most connections are Milano Malpensa, Milano Linate and Rome; Pisa or Florence are also convenient if you’re planning on staying in Central Italy (Toscana/\nUmbria). Best hotels depends on where you’re staying; some regions have more facilities and smaller less touristy areas may not, this rule applies to all your other questions. Just use TripAdvisor, Booking and Airbnb to get some ideas on rates and options in the areas you plan visiting. If you’re in Rome or any major city, you don’t need a car to get around cause you’ll mostly be walking around and using local transportation (metro, buses); you’ll need a car if you’re planning on staying in the outskirts/\ncountryside (unless you have a railway station nearby where you can hop on a treno regionale, but still need a car to get around in the evening since trains stop running by midnight) but wouldn’t recommend if it’s your first visit to Italy, stick to city centers where most sightseeing is done. If you’re a family of 5 I recommend choosing apartments or b&bs over hotels might get a more homey feeling and probably cheaper deals."}, {"username": "Jasmyn Trejo", "comment_text": "we plan on visiting Rome, Milan, Venice then plan on moving onto see france, switzerland, and maybe london. how many days do y’all recommend in each city and and must sees in each?"}, {"username": "Nicole Boyson", "comment_text": "Here now with my family! We flew into Milan with Delta airlines and rented a car to drive over to Cinque Terre, drove to Pisa, to Florence, out to Tuscany, and then to Venice and Lake Como before back to Milan for our flight out!\n\nWe’d previously done a Rome family trip and there’s lots more cruises that take you over to Almafi, Naples, Sorrento, Capri area"}, {"username": "Navreen Mandair", "comment_text": "Depends what are you want to visit?"}, {"username": "Starla Dawn", "comment_text": "WestJet"}, {"username": "Ella Goldberg", "comment_text": "do not fly in and out of mxp it is a nightmare. Had no issues flying into Rome."}, {"username": "Ariana Ragoo", "comment_text": "Don’t use air Serbia they are terrible!"}, {"username": "Grace Scinto", "comment_text": "Qantas! Qantas has never crashed!"}, {"username": "Elisa Marte", "comment_text": "Rome of course"}, {"username": "Alison Sherratt", "comment_text": "Do not use Ryanair"}]}, {"id": "2191984187867326", "text": "What is a good day trip from Florence? Pisa?", "link": "facebook.com/groups/1373361046396315/permalink/2191984187867326/", "likes": 10, "comments": [{"username": "Fran Scotti Lindner", "comment_text": "Lucca"}, {"username": "Lori Broin", "comment_text": "Lucca, Sienna"}, {"username": "Gillian O'Callaghan", "comment_text": "I loved Pisa....went on the train from Florence."}, {"username": "Hermineh Topalian", "comment_text": "May,September"}, {"username": "Martin Rudolph", "comment_text": "Lucca"}, {"username": "Theodore Meyer", "comment_text": "Siena definitely."}, {"username": "Jojo Hanna", "comment_text": "Rome, 90 minutes on a ‘fast train’. €50 return."}, {"username": "Stefania Barou", "comment_text": "One life is not enough for day trips from Florence...Piza\n,Lucca, San Tsiminiano,Arez\nzo, il borro,Cortona,P\nienza,ect...Jew\nels in the big crowd of Toscana.!!!"}, {"username": "Terri Vitelli", "comment_text": "Bologna is a great city to go. Beautiful architecture. The best food in any restaurant, extremely walkable and accessible from\nThe train station. Bologna is my favorite of all places in Italy. So authentic"}, {"username": "Madeline Caporale", "comment_text": "Siena--visit the Duomo, tour the inside. So fabulous. Lots of great shops, just a wonderful little town to wander through and take in the views."}, {"username": "Anne Grosjacques Percell", "comment_text": "Cinque Terre! It's stunning."}, {"username": "Anne Brawley", "comment_text": "Lucca,Siena,Rom\ne."}, {"username": "Peter Rasmussen", "comment_text": "Siena is gorgeous. VERY hilly but beautiful."}, {"username": "Lisa Marie", "comment_text": "San gimignano for sure."}, {"username": "Debbie Thompson", "comment_text": "Siena and Volterra, San Gimignano is nice but much more catered to tourists than Volterra. Cinque Terre was really busy but nice.\n\nI’ve been to Rome lots of times and I always love it 😍"}, {"username": "Jacki Anderson Stranathan", "comment_text": "San Gimignano"}, {"username": "Peter Wendy Pittery-Vandecasteele", "comment_text": "Lucca, San Gimignano"}, {"username": "Pauline SassyNana DeRose", "comment_text": "Cinque Terre\nFive beautiful lil towns. You can walk to each or take a boat. It was one our fav places to visit. I just loved how, hundreds of years ago, they terraced the hillside to grow their produce.\nPlus all of the really quaint lil shops and how their boats are pulled up to their doors, as if they are cars. So cute and real"}, {"username": "Mia Catalano", "comment_text": "We are doing a day trip to Cinque Terre from Florence!"}, {"username": "Benita Hauskins", "comment_text": "Pisa is absolutely beautiful! You’ll regret after your trip you didn’t see this famous site if you don’t go."}, {"username": "Nana Esther Bertolino", "comment_text": "We took the Florence bus to go to Siena and San Gimignano Left early and got home late. Wonderful day trip . Look in your book and see some sights."}, {"username": "Kelly Rennie", "comment_text": "Skip Pisa!"}, {"username": "Kelly Rennie", "comment_text": "San Gimignano is absolutely beautiful!! Don't miss it!"}, {"username": "H Raymond Fasano", "comment_text": "Yes"}, {"username": "H Raymond Fasano", "comment_text": "Yes"}, {"username": "Lynn Francisco Casella", "comment_text": "Cinque Terra"}, {"username": "Marie-Josée Veilleux", "comment_text": "Wine tour to San Gemignano and Montalcino"}, {"username": "Adrienne Gemmill", "comment_text": "I loved Lucca"}, {"username": "Liz Ariar", "comment_text": "Cortona is nice, took the train from Florence."}, {"username": "Candy Mattiello", "comment_text": "San Gimiagno! What a great little town"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCinque-Terre-Day\n-Trip-with-Tran\nsport-from-Flor\nence/\nd519-6367CINQUE?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nTuscany-Day-Trip\n-from-Florence-\nSiena-San-Gimig\nnano-Pisa-and-L\nunch-at-a-Winer\ny/\nd519-5070TUSCANY\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "La Cinzia", "comment_text": "Volterra! Una delle città più antiche d'Italia"}, {"username": "Pauline Brown", "comment_text": "Siena and San Gimignano. Beautiful places. I just went on the local bus from Florence."}, {"username": "Berndt Weihs", "comment_text": "Siena!"}, {"username": "Jane Deaton", "comment_text": "Skip Pisa! Siena"}, {"username": "Светла Русева", "comment_text": "Siena, San Gimignano, Pisa"}, {"username": "Christina Vitas", "comment_text": "Pisa can be seen in 1 hour, don’t waste a whole day on it"}, {"username": "Jordan Messina", "comment_text": "Siena, lucca and montalcino (brunello wineries day trip)"}, {"username": "Sisse Brüel", "comment_text": "Dont go to Pisa 😏. Cinque terra in stead, would be my suggestion ❤️"}, {"username": "Erwin Andres", "comment_text": "You can go to Pisa but you will only get to see everything in an hour to 2 hours max. Still pretty cool to go there though. I enjoyed Siena a lot and there is a so much to see! I suggest going there for your day trip from Florence 😌"}, {"username": "Kirsten Abrams", "comment_text": "Staying in Florence."}, {"username": "Chris McLaughlin", "comment_text": "Lucca"}, {"username": "Erika Gallina", "comment_text": "Siena, Montalcino, Monteriggioni, Pitigliano, Pienza"}, {"username": "Claudia Amp", "comment_text": "Lucca, San Gimignano, Siena, 5 Terre, Pisa is a bit mild (if you take away the leaning Tower and the duomo); if you have a car the you can explore more; I live in Tuscany and there are a lot beautiful areas in the countryside (Garfagnana, Versilia with the Apuane Alps, the hills around Lucca, Volterra etc.)"}, {"username": "Theresa Simon Wallace", "comment_text": "We took the train to Venice."}, {"username": "Scott Taylor", "comment_text": "Lucca. Beautiful city!"}, {"username": "Suzanne Joslin Oliveria", "comment_text": "Bologna!"}, {"username": "Wayne Brown", "comment_text": "Look at Viator, they have loads of trips from Florence"}, {"username": "John Peter James", "comment_text": "A must and far less touristy then the constant Sienna and San Gia. Recs.\n\nVolterra. Montepulciano."}]}, {"id": "2191992907866454", "text": "Good evening, I’m going on a 10 day Greek Isles cruise in May leaving from Rome. I am traveling with 3 other couples (all who have never been to Europe). We are planning on staying in Italy before or after the cruise and would love to experience all that Italy has to share. I would love to experience staying in a villa in Tuscany and seeingआणखी some local vineyards and tasting some authentic Italian cuisine in a local restaurant or sipping on an espresso at a little cafe. Also, seeing the sunset from my deck looking over the Amalfi coast!! Does anyone have any suggestions or tips on what the best way to do this is. Should we do before or after the cruise, what’s the best way to travel to and from Rome and where can we find a villa for 8 people? Any advice/tips or suggestions would be greatly appreciated. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2191992907866454/", "likes": 3, "comments": [{"username": "Sandra Lombard", "comment_text": "I’m not from Italy; but I have been. We stayed 3 days in Rome and did all the highlights. But it was hot and there was tons of walking. They do have hop on & off we found them crowded and we didn’t care for standing around waiting. Then we rented a car and drove through Tuscany to Pisa then over to Venice. All 100% worth every minute. This took us three days.\nNow we will be back, I need ( yes need) more Tuscany it is stunning. We also like to see Lake Como and the south Naple; Capri . As far as doing it before or after I’m thinking before. As it was May when we went, it was already busy & hot.\nJust a tip you can prebook most of your entrances to skip the long queue. For accommodation and travel with a large group, I’m don’t have enough knowledge for this.\n\nEnjoy your trip it will be one to remember forever. Oh and Venice is worth a visit for at least a night or two, it’s an amazing wonder of the world"}, {"username": "Joe-Linda Po Agustin", "comment_text": "Do land portion before cruise and make sure you are back in Rome at least one day before embarkation, use train from / to Rome, try airb&b for accommodation."}, {"username": "Lisa Silverman", "comment_text": "We did Roman Roads Golf Cart Tour in rome. Took us to all the major sites without too much walking. It was lots of fun."}, {"username": "Elena Gallego Gómez", "comment_text": "Rent a car to visit vineyards and near cities and an Air BNB, also you need a plug adapter; American device cords won’t work"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Are you leaving from Rome and returning to Rome on the cruise? I would rent the villa in Tuscany before you depart rome. Maybe 3/4 days? Rent a van or two cars for the group so you can visit lots of towns and wineries, then after the cruise I would take the high speed train to Naples and the regional train to sorrento for another 3/4. Ferry for day trips to Amalfi & Capri. Check VRBO for villas in Tuscany."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Villa check on VRBO or Airbnb. I would do it before the cruise."}]}]