[{"id": "2203568776708867", "text": "Hello!\n\nWe are planning our first trip to Italy from New Zealand (after London, Amsterdam, Paris and Spain) next June and just wanted some advice on our route… we are thinking…\n\n❤️ Barcelona - Milan by plane (3 nights)\n🩷 Milan - Venice by train (3 nights)\n❤️ Venice - Florence by train (3 nights)\n🩷 Florence - Bari and other areas near by, Materaआणखी etc by plane (8-10 nights) ** possibly hire a car in this area for exploring?\n❤️ Bari - Rome by plane (4 nights)\n\nWe have roughly 25 days to spend in Italy, and it is the place we are most excited to go, I’ve spent ages googling and trying to plan and just want to know if this is a good route or not?! Also I would love to know if there are any spots near these places that are recommended not to miss!\n\nThank you in advance ✨", "link": "facebook.com/groups/1373361046396315/permalink/2203568776708867/", "likes": 3, "comments": [{"username": "Dafne Vassetti", "comment_text": "Perfect itinerary!\n\nSuggestions.\n\nMilano/ Lombardia - you can do a day trip to Bergamo (has been elected capital of culture for 2023).\n\nVenice - not to miss the Island of Burano!\n\nFlorence/\nToscana - not to miss San Gimignano, Lucca. In Florence try to visit San Miniato church (near Piazzale Michelangelo) during mass (monks sing in Latin, incredibile experience).\n\nBari, Puglia - Matera (Yes), you can try spending one night there (keep in mind Matera is in the Basilicata region). In Puglia don't miss Alberobello, Lecce."}, {"username": "Kate Laidlaw", "comment_text": "We’re currently in Rome (sounds like we’re doing a similar Euro trip but starting in Italy) and met a fellow well travelled Aussie who highly recommended the Puglia area and hiring a car… this is now on my list for next time!\n\nWe’re staying a night in Chambrey in France to break up Cinque Terre to Paris. It would be a huuuge day otherwise."}, {"username": "Raquel Pickering", "comment_text": "Honestly, Milan was not a highlight for me at all. We had two days there and apart from the last supper and the duomo, did not like. The surprise Jewell was florence! We went for three days to see David and could have stayed a week! Loved it. Our days were a Friday Saturday and Sunday and the Sunday was madness! So packed! It was great going to the leather markets walking around the fantastic Santa Maria del fiore duomo right in the heart and all the tiny alleys coming off it. So wished we had longer there."}, {"username": "Ana Ka", "comment_text": "I like your plan, but i would stay longer in Florence. When you have this much time, 3 days doesnt seem like enough... and Bari was lovely, but I wouldn't stay there for long... just maybe like you said - get a car and explore the whole region."}, {"username": "Raquel Pickering", "comment_text": "Also - do trevi fountain early morning. We got up at 6.30 and made it by 7am. Compared to the afternoon before practically deserted! We then walked to St peters and were in the basilica by 9am."}, {"username": "Chiara Normanno", "comment_text": "What about Amalfi Coast and Pompeii instead of Bari? Just a thought. Also, I'd do 1 day in Milan and I'd move on. You could use it as a base for Lake Como but the city per se it's not really worth 3 days for a first timer to Italy. I'd redirect those two days towards Florence or Rome. Or even consider Turin, which is the real underrated jewel."}, {"username": "Lucrezia Folger", "comment_text": "Sounds like a decent amount of days for each place, in my opinion, however, you could skip Milan and add it to Rome, with day trips or Largo Como, or Cinque Terra."}, {"username": "Roland Trego", "comment_text": "Barcelona to Milan by train is excessively long unless you are going to stop somewhere three or four days en route. Nice is a good choice. Otherwise, I would fly. Three days is a long time for Milan. One day is enough for the historic center. (If you are shoppers, that’s a whole different story.) Consider adding two days of Varenna or Bellagio on Lake Como en route to Venice."}, {"username": "Karen Scott", "comment_text": "If you're going to Bari. Head out to Alberobello for a few nights. Fabulous village with the trulli houses."}, {"username": "Bea Kuckens", "comment_text": "We took the train from Paris to Milan and it was a BEAUTIFUL trip. If we had it to do over again, we would have chosen another location in Netherlands instead of Amsterdam."}]}, {"id": "2203582206707524", "text": "Going to Italy Aug for two weeks…flying into Milan, Bologna for two nights, Florence for 3 nights, lake Garda 4 nights then back to Milan for four nights and going to Monza for the Grand Prix. Question..thinking of renting a car…yes or no?\nThinking of doing some day trips from Florence and Lake Garda.\n\nThoughts about driving?", "link": "facebook.com/groups/1373361046396315/permalink/2203582206707524/", "likes": 2, "comments": [{"username": "Ana Ka", "comment_text": "So from lake Garda I would definitely visit Limone sul Garda - a gorgeous little town. we absolutely fell in love with it. if there, visit the lemon orchards - they were stunning. Then Riva in Garda was nice too. I really really like Le Caneva Bistrot there, the food was absolutely amazing. From there, go to a winery in/near Negrar - they make Amarone wine there. One of my most favorite and most beautiful wineries - Zyme. Really really pretty! And nearby there is a restaurant Osteria Numero Uno. AMAZING food! But book ahead of time if you want a table!"}, {"username": "Stefano Follador", "comment_text": "From Garda lake you have the dolomites really close, than Verona is just there.\nIf you are into driving is quite easy to visit the motor valley from the lake area, head to Emilia Romagna and visit Ferrari, Lamborghini and so on…"}, {"username": "Chiara Normanno", "comment_text": "Logistically it makes more sense to go to Lake Garda after Milan. Use your days in Milan to visit Lake Como as well"}, {"username": "Ana Ka", "comment_text": "From Florence you can go to so many places... depends how far you want to go...\n\nNEAR FLORENCE: great winery nearby: https://\nwww.collazzi.it/\nen/ and gorgeous Medici villa with stunning frescoes... here is a great tour that we took: https://\nappyguide.com/\nstories/\nthe-grand-medici\n-villa-at-poggi\no-a-caiano or you can see this stunning painting that we saw also with appy guide tours: https://\nappyguide.com/\nstories/\npontormo-s-visit\nation. this painting literally made me cry. it's as stunning as any of the pieces in uffizi, but just not well known...\n\nFURTHER FROM FLORENCE DEEPER INTO TUSCANY: we absolutely loved San Gimignano. we went many times there... especially pretty is the main cathedral with frescoes. really memorable. Also stunning is a medieval town of Monteriggioni (it's very small, you don't need more than 30 mins there), Pienza, Lucca, Montepulciano. And for all of these small towns we just took a car and drove around with this tour and it was great. We used there the same appy guide tour and it was great as we were on our own schedule.\n\nEnjoy your italian holidays!!!! 🙂"}, {"username": "Claudia Castellini", "comment_text": "From Milan to Bologna and to Florence it is more convenient and faster the high speed train, in particular if you stay in the center in Bologna and Florence.\nIt can be better having a car to go to Garda Lake and probably for day trips in Tuscany from Florence.\nAnyway streets are fine, the only problem could be the traffic, in particular during weekends."}, {"username": "Ana Ka", "comment_text": "On Garda another gorgeous place with waterfalls is: https://\nwww.cascata-varo\nne.com/it/"}, {"username": "JeriLynne Clifford", "comment_text": "Since you are going to be in cities a lot I would use trains vs renting a car. Save the money you would spend on the car and gas. You can use it on food and wine! 😉"}, {"username": "Beverley Milson", "comment_text": "Ferrari museum on our itinerary… just north of Florence."}, {"username": "Michela Zanni", "comment_text": "Not for Bologna or Florence, but for Garda lake is better"}, {"username": "Cathy Lenters", "comment_text": "Been there years ago, you are a lucky gal gf. going to be an amazing holiday!"}]}, {"id": "2203589173373494", "text": "Recommendations for train bookings from vernazza in Cinque Terre Italy to Wengen in Switzerland.\nShould I book now fir travel in Sept ? Any websites for bookings?", "link": "facebook.com/groups/1373361046396315/permalink/2203589173373494/", "likes": 0, "comments": [{"username": "Gabriele Fordini Sonni", "comment_text": "Always books in advance if you're planning to use high speed rails, wich is something that you will probably want to do as prices are relatively low and the travel itself will be much more comfortable.\n\nUse the trenitalia website or use the official app"}, {"username": "Ana Ka", "comment_text": "for swiss tickets book directly here: https://\nwww.sbb.ch/en"}, {"username": "Giovanni Pianigiani", "comment_text": "I disagree with Gabriele. This is a x-border trip, using Swiss rail. I'm not even sure Trenitalia is fully listing them. I'd go with Google maps for a start"}]}, {"id": "2203590870039991", "text": "On an italy tour and after Rome I am a bit churched out. What non-religious things are there to see in Florence and Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2203590870039991/", "likes": 6, "comments": [{"username": "Jenny Payne", "comment_text": "Just wander through the streets + Old Pharmacy shop Street is Via Scala Florence, pitti palace, Boholli gardens, statue of David on the hill + catch a bus up to Fiesole and see the whole of Florence , so so much to do. San Lorenzo markets up stairs for lunch 🌻"}, {"username": "Stefano Follador", "comment_text": "Well I understand your motivation, but when you are visiting a place like San Marco Basel, it’s not about the church, it’s about history.\n\nBeside my personal opinion in Venice you have a lot to do.\nPalazzo Ducale is amazing, lot of Palace are available to see, the city itself is an open air museum.\nGo to the Jewish ghetto, visit the Murano glass factories or head to the arsenale or do a small island of the Laguna tour.\nThere are so much things to do beside religious stuff that you sure will have fun.\nYou can visit the interior of the Veneto region, look out to the villas from Palladio design or head to a wine area like where I come from in valdobbiadene or valpolicella"}, {"username": "Leanda Wall", "comment_text": "I get you. I was the same half way through our trip. I simply love the history and learning as I go. I adore the old buildings but oh my another church…..I was done. I think for me every church we came across I went in to see it. Lol"}, {"username": "Kristina Ruk", "comment_text": "Florence there are palaces to see Pitti called (if I write correctly in English not sure), the biggest gallery for all the Europe art. Venice not so much such..Venice myself I like to wonder on those little streets and be suprised how people are inventive to build town on water..And besides these town are the beggining of Europe civilization and had centuries of them..I am not relugious but like the architecture, how it was to build such huge thigs without technics what we have these days.."}, {"username": "Chiara Normanno", "comment_text": "Uffizzi and Piazzale Michelangelo in Florence. Murano and Burano in Venice (scenery). Go up San Marco Towerbell in Venice at sunset."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Actually in Florence there are two/three churches REALLY worth to see (Cathedral, Santa Maria Novella and San Miniato a Monte), the rest is not churches: Uffizi, Accademia, Bargello, Pitti, Boboli, Strozzi, Opificio Pietre Dure.\nAlso a little gem: Officina Profumo Santa Maria Novella"}, {"username": "Jenny Godfrey", "comment_text": "In Venice they have a beach if you want to spend a day at. Sandy and really lovely! Get the boat to lido. Get off and walk straight ahead down to very bottom."}, {"username": "Alice Francesca", "comment_text": "What about search online for the many venues that host modern and contemporary art?\nTHERE ARE DOZENS OF MUSEUMS OF CONTEMPORARY ART.\nVENICE:Peggy Guggenheim's and Punta della Dogana, not to mention the Biennale di Architettura going on right now (one of the largest fair for architecture) .Every other year in Venice, Biennale d'arte (contemporary art from all over the world).\nFlorence and Palazzo Strozzi just had a wonderful exposition of Olafur Eliasson.\nIn Rome Chiostro del Bramante hosting an exhibition on arte povera.\nPaul Gagosian has a big gallery over there too!\nChurched out!\nDo your own research."}, {"username": "Alice Francesca", "comment_text": "https://\nwww.italywithcla\nss.com/\nthe-modern-grand\n-tour-contempor\nary-art-in-rome\n/"}, {"username": "Alice Francesca", "comment_text": "So in Italy we never heard of modern and contemporary art, right?"}, {"username": "Diane Janovas", "comment_text": "Venice...the fish market,ride the vapoetto,and just wander the streets.Florenc\ne sunset from Michalgelo place. Uffizi. We went to an excellent modern art museum.take a day trip to via Reggio and go to the beach"}, {"username": "Isabelle Avl", "comment_text": "There are no many things to do in Italy if you don’t like churches.\n- Museums is a must (if you like Botticelli Michelangelo Raphaello Raffaello Caravaggio Giotto..) And contemporanei art.\nPalazzo Ducale, Galleria dell'Accademia,\nUffizi,\nPalazzo Grassi (Francois Pinault private collection) The Peggy Guggenheim Collection, or one of the many contemporary art galleries,\n- While in Venice go to Murano/Burano/\nTorcello\n- You can dine (specially during Biennale) or listen to an opera in a real palazzo\nhttps://\nwww.musicapalazz\no.com/en/\n- or simply scroll around the streets of Dorsodouro, or San Marco\n- spend time at the Rialto Mercator or Campo de la Pescaria and see real venitians « fare la spesa »\n- In florence, Ponte Vecchio, Piazzale Michelangelo for the vue, Palazzo Pitty and Villa Bardini and the gardens (Giardino Bardani and Giardino Boboli), Mercato Centrale, you can also rent an electric bike,\n- visits: Duomo, Campanile di Giotto, Battistero are absolutely stunning and worth a visit"}, {"username": "Alessandro Iannelli", "comment_text": "old churches are just monuments, that's how i see them, with the same eyes with which i see the pantheon, for example, or a greek temple. i see the architectonic beauty and don't care at all about the religious aspect. anyways, of course in florence you have the museums, that goes without saying."}, {"username": "Kerri Bevilacqua", "comment_text": "Florence: Santa Maria Novella pharmacy, Accademia Gallery, Uffizi Gallery, Ponte Vecchio, Piazzale Michelangelo, and lots of Medici sites. Mercato Centrale is a fun food area"}, {"username": "Kathleen Roll", "comment_text": "If you’re in Venice go to the opera or visit Murano and Burano or go to the beach"}, {"username": "Crystal Waltz", "comment_text": "Venice: Palazzo Grimani was great and nobody really knows about it so it's also quiet and really neat. Find the Bra Bar, the narrowest alley, take a gondola ride. Just walking around you will find something to do there. Such a beautiful city."}, {"username": "Jeff McLellan", "comment_text": "We did a self-drive classic Fiat 500 tour in the Tuscan hills. Was a blast."}, {"username": "Jessica Petyo", "comment_text": "Leonardo da Vinci interactive museum in Florence. It was inexpensive, had AC, and I learned sooooo much! We were pleasantly surprised by it and took our teens since they were churched out, and a bit over museums as well. Upon arrival I thought we would all be bored and it was geared for young kids, but it was really fun! You do need to book online for reservations."}, {"username": "Kay Rendall", "comment_text": "Just walk the streets in Venice, specially on the other side of the canal to St Marco. Ride the vaporetta. The colours of the houses change at different times of the day, sometimes pink, sometimes terracotta. Sit over a drink watch the world go by. Visit St Marco visit Burano by ferry. So much to see. 2 days will not be enough Just relax, soak up the atmosphere, wander down the little back streets where u see the locals. U will cross many small canals by bridge. Maybe get lost, end up a dead end or someone's door. Along the way u may see a small local bar where the locals r having a coffee or a drink. Join them. Sit outside watch the world go by. Venice is magic. Every time I go I find a new street, view. Makes me want to pull up an easel and start painting"}, {"username": "Patti Hunter", "comment_text": "Take a cooking class!"}, {"username": "Wendy Spano Bracco", "comment_text": "As my trip is coming up, I actually feel the same way! I booked shorter excursions to try to avoid the burned out feeling. I’m just not into a ton of churches and museums. So I tried to limit this as much as possible."}, {"username": "John Licata", "comment_text": "You may be in the wrong country"}]}, {"id": "2203590873373324", "text": "Hi all!🚗🇮🇹\nCould you send me tips/opinions about car renting (in La Spezia)?☀ thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203590873373324/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Don't drive around Liguria in August!;)"}]}, {"id": "2203597940039284", "text": "Is the metro easy to use and navigate ?\nDo you buy tickets or tap in/out with card as with tube in london ?", "link": "facebook.com/groups/1373361046396315/permalink/2203597940039284/", "likes": 1, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "What city? Both Rome and Milan have subway systems (others?) and there are local city bus systems everywhere."}, {"username": "Jay Parekh", "comment_text": "We used it in Rome and it’s very easy. Use Google Maps to figure out your route, and yes tap your cc to enter."}, {"username": "Chiara Normanno", "comment_text": "https://\nwww.atac.roma.it\n/\nbiglietti-e-abbo\nnamenti"}, {"username": "Karen Blackmore", "comment_text": "Rome and Milan can tap in and tap out. In Milan, you can use the buses and metro for 1.5hrs on one fee. Still tap in and out but it charges you correctly. Same in Rome I think, but we mostly walked there!"}]}, {"id": "2203529703379441", "text": "Couple of points on our train from Rome to Florence on Italo:\n\n1. We bought the Club pass which gave us access to the Italo Lounge. The lounge, at least in Roma Termini, wasn’t worth it. Only thing offered wasआणखी coffee and some pastries. You’re better off eating outside on the second floor where so much more is available and lively.\n\n2. Club seats on the train included catering. The pic below is the catering. It was a small sandwich with cheese and eggplant. The non vegetarian version was just replace eggplant with ham. I was offered a drink and got a beer. They never came back again if I wanted another one. Not worth the extra cost of the Club ticket. If you want to get first class still, get the Prima and save the 15 euro.", "link": "facebook.com/groups/1373361046396315/permalink/2203529703379441/", "likes": 28, "comments": [{"username": "Dave Conroy", "comment_text": "Haha, ouch. I guess a benefit of private ownership is you get multiple opportunities to be exploited the more you pay to keep the shareholder dividend high."}, {"username": "Luca Lookone Ferrentino", "comment_text": "C'mon it's a 1,5hr trip, less than the daily commute of the average american. Did you expect to be served a seven courses meal?"}, {"username": "Maria F. Ruiz", "comment_text": "Standard economic class is just fine. Seating is great, everything is about the same and you can buy your own snack. It's not worth it to buy first class in trains in my opinion"}, {"username": "Sally Aubrey", "comment_text": "Thanks for the information - not sure why everyone is so defensive about it"}, {"username": "Jay Parekh", "comment_text": "For the record, main reason I bought first class was cause researching in this group, many recommended it."}, {"username": "Jay Parekh", "comment_text": "The goal was to share my experience for others to learn from and make their own informed decisions. This forum is about sharing and learning."}, {"username": "Paolo Berardi", "comment_text": "Trenitalia is better anyway."}, {"username": "David King", "comment_text": "We generally travel first class on trains in Italy!!! The price difference is generally not something to fret over.\n\nFirst Class train tickets have frequently saved us from screaming children and unruly toddlers who lack respect for spacial distancing in public, as well as the occasionally loud tourist groups that think we all want to be a part of their obnoxious conversations. As an American, I feel so embarrassed by the behavior of other American tourists… and sadly, that observation never fails. The entitled attitudes we have observed stand-out like a prickly cactus in a flower meadow."}, {"username": "Dan Pieri", "comment_text": "Your in the best place in the world, lots of people would love to have that issue, quit complaining!!!"}, {"username": "Daisy Yoo", "comment_text": "thank you, I got the prima"}, {"username": "Janine Emma Lucas", "comment_text": "Sandwich looks great!"}, {"username": "Linda Johnson", "comment_text": "How much was your ticket?"}, {"username": "Wendy Spano Bracco", "comment_text": "I bought the Club tickets as I find these areas are more quiet and less chaotic. Once I was in a car full of young preteen boys. Never again. There’s very few seats as well if you look at the seating chart. I think we only have around 12 seats for the entire car. Definitely didn’t buy the ticket for the food."}, {"username": "Diana Himes", "comment_text": "We like the lounge for the ability to sit down and feel like our luggage is reasonably secure. There is a restroom in the lounge and access to coffee and small snacks. If hubby or I want to run out to the food court, the other can remain in the lounge with the luggage without stressing over pickpockets etc. We get club class on the train if the price is not too much just for the peace and serenity, not the food. We bring a picnic lunch for longer train trips. Prima class is very comfortable, but I would personally avoid it this time of year when there are just sooo many tourists traveling with luggage. The luggage racks fill up quickly and there’s not a lot of space for large bags by the seats. Bottom line for us…Dealing with crowds in the places we visit is fine if I don’t intentionally inflict additional aggravations and stress on myself that I have the ability to minimize."}]}, {"id": "2203537176712027", "text": "Hi all!\n\nI'll be in Firenze for 3 days!\n\nWhat are some cool brunch or coffee hotspots? Or food I have to try, such as All'Antico Vinaio?!☺️", "link": "facebook.com/groups/1373361046396315/permalink/2203537176712027/", "likes": 3, "comments": [{"username": "Friderika Kiss", "comment_text": "Really good restaurants that you should try: Trattoria Sabatino, Osteria Pastella 🍴🍷"}, {"username": "Joe Green", "comment_text": "Go to the central market near the Duomo. On the first floor up an amazing food court with a very wide range of options."}, {"username": "Stefano Follador", "comment_text": "Antico Vinaio is a must do, but sometimes is really overcrowded and I suggest you to look into some alternatives.\nIl Cernacchio is a good one, La Nicchietta is a nice one.\n\nObviously Firenze means Fiorentina, but do your homework and find a place you like not just a tourist trap"}, {"username": "Ana Ka", "comment_text": "For brunch I think the best place is above hotel Calimala - their Angel rooftop bar and restaurant. The food is amazing there! For coffee I would go to https://\ndittaartigianale\n.com/pages/\npunti-vendita"}, {"username": "Ana Ka", "comment_text": "Also, very happening place with great coffee and some brunch is this concept place: https://\nwww.lamenagere.i\nt/"}, {"username": "Ana Ka", "comment_text": "And for a few cool stories to learn about the city while having your coffee I would use this: https://\nappyguide.com/"}, {"username": "Rimsha Javaid Chaudry", "comment_text": "Cafe Gilli is great\n\nLa Carraia for Gelato!"}, {"username": "Krissy DaRusso", "comment_text": "LOVE LOVE LOVE:\nBrunch Republic\nDitta Artiginale"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Mercato di San Lorenzo, sandwich at I Fratellini, ice cream in Piazza della Passera."}, {"username": "Nancy Kirby", "comment_text": "Trattoria Anita\nGelateria dei Neri\nBoth musts!\nArt Bar is also fun!"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Karen Young", "comment_text": "La Buchetta- delicious 😋"}]}, {"id": "2203542773378134", "text": "Does anyone know ￼of a safe place to store luggage in Rome, for 5 hours before a flight? Needs to fit suitcases. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203542773378134/", "likes": 0, "comments": [{"username": "Jojo Hanna", "comment_text": "‘Left Luggage’, at the train station."}, {"username": "Jenn Messina Babore", "comment_text": "Stowyourbags worked well for us. It’s a block from Roma Termini."}]}, {"id": "2203548076710937", "text": "If staying in Massa Lubrense, how expensive is it to commute to Capri daily?", "link": "facebook.com/groups/1373361046396315/permalink/2203548076710937/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "The SITA SUD ticket from Massa to Sorrento is probably a few euros or less and if it's daily you may consider the 7 days ticket for a better value for your money. The ferry is around 20 euros one way so you do your math"}]}, {"id": "2203537796711965", "text": "Hello, in october we are travelling to Naples and the Amalficoast. We want to spend a day at the island Procida. Is it better to buy the ferrytickets in advance or can it also at the same day? And is it safe to park your car at he harbour?", "link": "facebook.com/groups/1373361046396315/permalink/2203537796711965/", "likes": 1, "comments": [{"username": "Gayle Moores", "comment_text": "You can buy the tickets in advance online. If you are staying in Sorrento the port is right down from the centre of the town.All the different ferries leave from there to the Islands and the Amalfi Coast.You can buy your ticket there.If you are staying on the Amalfi Coast you can buy tickets at the Amalfi town port or in Positano."}]}, {"id": "2203537863378625", "text": "We are due in Florence in a few weeks planning to park at VILLA COSTANZA on the outskirts and metro in anyone on here used this park and ride if so sny tips TIA", "link": "facebook.com/groups/1373361046396315/permalink/2203537863378625/", "likes": 0, "comments": []}, {"id": "2203551173377294", "text": "Urgent⚠️ I am in desperate help to finding this product for my partner before my flight home. It is CELLA Shaving Crème. I’ve been to many barber & cosmetics shops, apparently it’s a hard premium product toआणखी find 😞 On this note, what other nice gifts would you buy your male partner from Italy that can’t be found in Canada? Grazie MILLE Please type location names in ROME.", "link": "facebook.com/groups/1373361046396315/permalink/2203551173377294/", "likes": 1, "comments": [{"username": "Pietro Adami", "comment_text": "Www.barbaebaffi\n.it"}, {"username": "Pietro Adami", "comment_text": "Or amazon"}, {"username": "Miyuki Kanno Paul", "comment_text": "My husband is a huge fan of Mondial. We discovered the direct shop in Firenze, and he was in heaven shopping for his shaving needs there"}, {"username": "Brenno Bianchi", "comment_text": "It is not an hard premium product, it is a mid range shaving soap.\nThe company is based in Milan and here is quite common to find, look at some national chains like Tigotá"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203565293375882", "text": "Am in Florence right now and looking for your recommendation for best leather shop(s) in town. In the market for a jacket and purse.\nGrazie!", "link": "facebook.com/groups/1373361046396315/permalink/2203565293375882/", "likes": 12, "comments": [{"username": "Maggie West Penix", "comment_text": "Il Perseo. Tell Sam I sent you. I also go to the Scuola di Cuoio (School of Leather) Love both!"}, {"username": "Laurie Ladouceur Schmitt", "comment_text": "Go to the leather school."}, {"username": "Jill Wolder", "comment_text": "Via tournabuoni without any doubt."}, {"username": "Mary Alexiadis Caravoulias", "comment_text": "Il Perseo. I bought a beautiful jacket there a few weeks ago. Sleeves needed shortening, & Sam had it done within an hour!! Highly recommend!!"}, {"username": "Ann Marie Laface", "comment_text": "The leather school"}, {"username": "Debbie DiOssi", "comment_text": "Peruzzi Leather near Santa Croce."}, {"username": "Beth Sullivan", "comment_text": "https://\nscuoladelcuoio.i\nt/en/"}, {"username": "Lisa Pender McDede", "comment_text": "Lisa Terzigni-Miller we gonna need that extra suitcase!"}, {"username": "Debbie Baldi Volpini", "comment_text": "We went to murci"}, {"username": "Blanca Gil", "comment_text": "Infinity Firenze at Borgo Santi Apostoli"}, {"username": "Michelle Plutto", "comment_text": "Are they a better quality and less expensive than US?"}, {"username": "Brenno Bianchi", "comment_text": "Pineider and The Bridge"}, {"username": "Stacey Esposito", "comment_text": "Massimo leather. Got 2 leather jackets 2 handbags"}, {"username": "Billy Wisdom", "comment_text": "How far are they from cruise port"}, {"username": "Kristine Jayne", "comment_text": "How is the temperature?"}, {"username": "Julie Serino", "comment_text": "https://\nwww.facebook.com\n/\nprofile.php?id=1\n00063821911212&\nmibextid=D4KYlr"}, {"username": "Debra Wilbur Bailly", "comment_text": "\\"}, {"username": "Lexy Kammler Puzzella", "comment_text": "David's Leather. They will ship it home for you too!"}, {"username": "Ana Ka", "comment_text": "Sorry for posting a link, i thought those were allowed in this group, plus i thought it would help people to find the place easier. Noted about the links."}, {"username": "Ken Lerch", "comment_text": "Peruzzi off P. Santa Croce."}, {"username": "Karen Lawrence Smith", "comment_text": "My daughter got a beautiful red leather jacket at the leather school"}, {"username": "Debbie Alves", "comment_text": "Leather school"}, {"username": "Shirley Collar Wilson", "comment_text": "Mary’s Leather Goods in Sorrento-5 generations business-"}]}, {"id": "2203570633375348", "text": "We currently live in Northern Italy (between Venice & Verona). For those who aren’t aware, August is “the month” that Italians vacation. Many places close the entire month, and often other Europeans vacationआणखी in Italy. I’m sharing a clip written by a local Italian realtor.. I share this not to deter you, only to make you aware. 🌺", "link": "facebook.com/groups/1373361046396315/permalink/2203570633375348/", "likes": 186, "comments": [{"username": "Atet GC", "comment_text": "My money my trip my choice, whether it’s scorching hot in in august or the price is sky rocket high, if that is the only time we are able to go on vacation then be it. But all this notice and warning are very much appreciated. Thank you."}, {"username": "Jo Tunnicliffe", "comment_text": "We used to travel down from UK to Southern Italy and meet up with our friends from Naples there, we used to love celebrating ferragosto with them and sit on the beach to watch the fireworks being let off on the boats at sea. Happy memories"}, {"username": "Katherine AliNuñez", "comment_text": "Good luck to us that we are going this August 🧐"}, {"username": "Joe Guzzi", "comment_text": "Nonsense."}, {"username": "Joe Guzzi", "comment_text": "Prices of what?"}, {"username": "Diana Post", "comment_text": "Go to the north of England. It is beautiful and very few tourists! Heaven. ❤️"}, {"username": "Elizabeth Bernal Bain", "comment_text": "That picture looks like a typical day in Southern California"}, {"username": "Carla Vleugels", "comment_text": "Weekends especially Saturday in July and August are the busiest of all year because of people coming and going on their holiday. They call them Black Saturday. It’s the same all over Europe."}, {"username": "Nancy Vahl Raske", "comment_text": "I stay inside (hybernate in August lol) I hate heat- I’ll see you October or November"}, {"username": "Johnson Johnson", "comment_text": "Linda Johnson"}, {"username": "Renae Larcus", "comment_text": "We love Italy. But not in August."}, {"username": "Dalia Sherif", "comment_text": "Does anybody know how is it usually like in Genoa and Turin in August?"}, {"username": "Barbara Marie", "comment_text": "Looks like jersey every day. They've never sat on the 495 approach to the tunnel. We'll be ok."}, {"username": "Jessica Palladino", "comment_text": "Gerard Palladino!"}, {"username": "Lara Bourke", "comment_text": "This pic looks like Sydney traffic every day of the year!"}, {"username": "Laura McLaughlin", "comment_text": "Craig Mclaughlin"}, {"username": "Angela D Fourdyce", "comment_text": "That just looks like 5:00 traffic near me 😂\n… but no, would definitely not want to suffer the same on vacation 😉"}, {"username": "Joanna May", "comment_text": "We are in Italy right now with my family for my husbands work: 1 week in Milan this week and next in Vicenza. Hoping to see the Dolomites & lake garda next week. I do definitely wish we could have picked another time to come, but this is when his work wanted him to come, and there are definitely people at his company working 🤷🏼‍♀️"}, {"username": "Nancy Lewis", "comment_text": "Looks like LA on any given Saturday."}, {"username": "Jack Partington", "comment_text": "Every Italian tour guide has had this same advice for us."}, {"username": "Denise Russo-Silverman", "comment_text": "Thank you for posting. It’s good to know this. I think my next trip will be in June or early Sept"}, {"username": "Louise Thaell", "comment_text": "Thanks for sharing!!"}, {"username": "Virgz Van Møøre", "comment_text": "Good that people keep on traveling by car, always free places remain in the trains 😂"}, {"username": "Agne Krause", "comment_text": "Why do Italians vacation in Italy during August? They literally can chose any other season/month and enjoy less crowds and lower prices, it would just make more sense. Why don't they go to Europe/other continents like all tourists? I live in Chicago and would never book chi vacation for summer. I can do it all year round!!! It doesn't make sense to me lol"}, {"username": "Sarah Salisbury Vander Heide", "comment_text": "Mike VanderHeide"}, {"username": "Rach LJ", "comment_text": "Oh dear.. we arrive in Milan 29 August. Hopefully things will quiet down start of September 😬"}, {"username": "Gia", "comment_text": "Thanks for the info! I’m planning to go mid-September, what is it like then?"}, {"username": "Laura Nausadis Bieber", "comment_text": "Lisa Nausadis Wisz just thought you’d find this interesting"}, {"username": "Vickie Corso Fraser", "comment_text": "Who is the realtor ?"}, {"username": "McKenna Matthews", "comment_text": "Bo Stanley"}, {"username": "Allison Mir", "comment_text": "Spain is the same"}, {"username": "Voula Ladas", "comment_text": "Yep that’s why I avoid it at all costs . Just not worth the inconvenience."}, {"username": "Sharon Scott", "comment_text": "Some people don't have a choice but to book up in Aug, due to working in education."}, {"username": "Irene Oda", "comment_text": "Monuments and historical places are of course open but shops tend to close. Depending on the size of the towns businesses organize themselves as to who closes and when. The bigger supermarkets are open and bigger stores are open. Smaller boutique types may not be."}, {"username": "Jennifer Erdman", "comment_text": "Great information, Jennifer Ames Dexter. Thank you! I am also visiting your area in late September. Do you have any opinions of Fumane? The purpose of staying in that area is because it seems like a small town and it’s close to wineries we would like to visit and close to Verona and Lake Garda."}, {"username": "Frannie Kaplan", "comment_text": "They most certainly do not close all of August. Yes some people drag their feet at work or they're understaffed (particularly public offices) but this is everywhere in Europe. I remember doing a lot of paperwork or errands in August, the only beauty was less queues. If you need a lawyer or an accountant who has their own office then yeah, you should do it before August. People are so dramatic I think they like to make it worse than it is. In the last 10 years people have been traveling less and less because of financial reasons , because they like staycations, or because they don't let their mother/father/\ngrandmother pressure them in to staying at their house doing nothing on the hottest day of the year"}, {"username": "Jobjab Kusonthammarat", "comment_text": "Yes! It's true"}, {"username": "Tina Bellitto", "comment_text": "Ellen Simon"}, {"username": "Mel Matt", "comment_text": "Ferragosto vacation period usually runs from Aug 15- Aug 31.\nWe have a similar vacation period in Quebec called Construction Holiday where all construction and vendors close down the last week of July-first wk Aug, so traveling is very pricy ‘cause everyone’s booking tickets abroad with their families. That’s why we waited until after.\nAnd then when we get back from holiday, school starts for the kids 😞"}, {"username": "Alicia Burno", "comment_text": "Yes, as some of you wrote…we don’t have that many options, we have kids in college and have to follow their schedule. We will be arriving tomorrow and planning to do have the best time."}, {"username": "Paul Anderson", "comment_text": "Note south bound lane is wide open. Just chose your direction carefully. Your on vacation so you don’t have to go with the crowds."}, {"username": "Diane Davis Lawyer", "comment_text": "The same happens in France. But, I'm curious. If everything is 'closed' and people are on vacation, who mans the stores and restaurants? Everything can't be closed and everyone can't be on vacation or there's no one to serve the vacationers? So, I'm confused how this works!"}, {"username": "Joe Guzzi", "comment_text": "Meanwhile, tomorrow is our (Swiss) national holiday, which means that the borders will all be closed to commercial traffic, so expect huge delays!"}, {"username": "Lucrezia Folger", "comment_text": "When my children were growing up, I pulled them out of school and we traveled to a different country every year. Sometimes it was a place they were studying, sometimes a place we were just curious about. It was a huge advantage in their education and gave them insight into the sheltered life they were living. It gave them a real-life broader view of the world and cultures. I don't believe people have to be dictated to only traveling in the summer, the absolutely worse time of year."}, {"username": "Leila Myftija", "comment_text": "It depends.\nIt's not like that everywhere."}, {"username": "Michelle Dougherty", "comment_text": "Not going to lie, the exit to Desenzano from both directions of A4 have been awful for weeks. No worse yesterday than last weekend when I went to visit friends in Verona for lunch.\nI did my southern (Puglia) travels in early July, and now plan to stick close to home (Lake Garda area) until it all dies down.\nI'll be in the backyard pool, or across the street lake 🤷😂"}, {"username": "Pao Magnoler", "comment_text": "This is true! I've lived in Florence for 6 years and yes, you find a lot of tourists, little towns close their businesses and go on vacation. You find everything more expensive and temperatures are crazy high. I suggest if you are traveling to Italy and Europe in general, the best time is April-May or late September- October."}, {"username": "Claire Tarry Rahme", "comment_text": "Tayla 🇮🇹"}, {"username": "Shannon Pacheco Modin", "comment_text": "My kids are now in college. When they were younger we took vacations in summer and Easter and Christmas and thanksgiving. Coming to Italy with my mom and friends in April 2024. Very much looking forward to it"}, {"username": "Alyson Alai", "comment_text": "That picture looks like I-4 near Disney EVERY day ANYTIME schools are out."}, {"username": "Dixie Kotylak", "comment_text": "I had heard that August was not a month to go, just got back from two weeks in Italy during the heat wave lol! Cannot wait to return in future. ￼❤️🇮🇹❤️"}, {"username": "Julie Schell Cunningham", "comment_text": "Thinking of booking a trip. What are the best months to go? I was thinking of June so my boys can go with us and not miss school."}, {"username": "Mireya Sauer", "comment_text": "Have they seen the Jersey Turnpike on a Saturday? Lol"}, {"username": "Nikki Collins", "comment_text": "Jennifer Ames Dexter - where do you live? We used to live in Vicenza, which is between Verona and Venice. It was many years ago, but were some of the happiest years of my life. I hope it is for you, as well."}, {"username": "John Selvaggio", "comment_text": "We go to Lake Como in August. It's not that crowded and weather is perfect"}, {"username": "Wendy Spano Bracco", "comment_text": "As I was making dinner reservations, several of the restaurants in Cortona, Florence and Rome are closed the next week or two. We are going September 1 so we are fine. If you have no choice I understand, however do your research. It’s not a news flash that it’s an inferno and things close."}]}, {"id": "2203579110041167", "text": "Best places to see in 7 days during winter?", "link": "facebook.com/groups/1373361046396315/permalink/2203579110041167/", "likes": 1, "comments": [{"username": "Chiara Normanno", "comment_text": "Do you like art cities? Lakes? Sea towns? Mountains and ski resorts?"}, {"username": "Alice Francesca", "comment_text": "Winter when? Xmas time?"}]}, {"id": "2203535200045558", "text": "Come explore Spello, one of Umbria’s most enchanting places! You will breath in the art and history of this charming village.\nJoin us: https://nextstop-italy.com/virtual-tours/spello-flower-town/\n\n#italytrip #आणखीitalytravel #vacationmood #virtualworld #medievalart #italyiloveyou #rollinghills #medieval #virtualtour #hilltopviews #umbriagram #umbria #hiddenparadise #umbriatourism #Spello #virtual #flowers #flowerstagram #flowersoftheday #gardenlove #gardenlife #gardeninspiration #hamlet #hiddenplaces #hiddengems #hiddentreasures #hiddenbeauty", "link": "facebook.com/groups/1373361046396315/permalink/2203535200045558/", "likes": 12, "comments": []}, {"id": "2203177340081344", "text": "Hi, has anybody booked thru Booking.com and the owners of the appartment messages you and say we have to put a large holding-security deposit prior to checking in? Staying in Florence.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2203177340081344/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "No. I would get on to Booking.com and see if that's part of the terms. I have booked a few apartments but have not had this."}, {"username": "Alicia Burno", "comment_text": "Yes, in Rome. Also asked for our passports. We talked to Booking. Com and they fixed the situation."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Yes, but it should be written in the descriprion."}, {"username": "Kay Rendall", "comment_text": "Yes they often take a security deposit for damages. This is then released through your bank when u leave if everything is ok. Should be a seperate charge\nAlso I am travelling Italy for 3 months. Leaving tomorrow.\nI have found when making bookings this time, that the cancellation is 7 to 14 days, not 2 to 5 days like in years going by.\nIt is on conditions of booking.\nMy accomadation for 3/8, charged the full amount 7 days prior. My accom for 11/8 is taking full amount on 3/8. However I was prepared as read the booking conditions previously\nIt is not the same anywhere in Italy re this prepayment, as it was in previous years\nPerhaps because of Covid in the past, people were cancelling their bookings at last minute, leaving them with vacancies.\nI found this with nearly all the accom I searched.\nSo had to go with the flow. I have excellant travel insurance for cancellation if travel delays, sickness etc."}]}, {"id": "2203456420053436", "text": "Where to stay In the dolomites? Family of 5", "link": "facebook.com/groups/1373361046396315/permalink/2203456420053436/", "likes": 0, "comments": [{"username": "Angela Casanave", "comment_text": "I just booked this one for our trip.\n\nhttps://\nwww.airbnb.com/\nrooms/6907625"}]}, {"id": "2203496613382750", "text": "After reading so many posts about travellers not being aware about validating bus tickets I thought I'd warn about shop receipts. You must get and keep all receipts whether it's for something small like a bottle of water or an expensive bag. You can be stopped by the financial police as you leave the shop and if you don't have one both you and the shop are fined. Never happened to me but I have witnessed it.", "link": "facebook.com/groups/1373361046396315/permalink/2203496613382750/", "likes": 10, "comments": [{"username": "Alessandro Iannelli", "comment_text": "Yes, It is the law, for everyone of course, not just the foreigners."}, {"username": "Joanne-Peter Hart", "comment_text": "I am so glad you told me this. In Australia they ask if you want a receipt and I usually don’t bother. Never occurred to me this was a law!"}, {"username": "Debbi Mayfield", "comment_text": "Kayte Duffield"}, {"username": "Paula Bennett", "comment_text": "Do you have to keep receipt till you leave? What’s the rationale?"}]}, {"id": "2203461066719638", "text": "Where is a good place to stay in Florence with 2 kids ages 1 and 4?", "link": "facebook.com/groups/1373361046396315/permalink/2203461066719638/", "likes": 0, "comments": []}, {"id": "2203408326724912", "text": "Ciao!\nIt is probably a longshot, but does anyone have an earlier reservation that would be willing to switch? I’ve had it in my phone for a month to login and reserve a time. I messed up and missed it by a few days. Our train leaves at this time. Venice T fondaco Dei Tedeschi", "link": "facebook.com/groups/1373361046396315/permalink/2203408326724912/", "likes": 0, "comments": []}, {"id": "2202433246822420", "text": "Edit: Thank you for all of the great suggestions!\n\nI know ice in Italy is a \"hot\" topic. We're not worried about our drinks though. :)\n\nMy husband has had knee replacement surgery in the past few months and we are headed to Italy in a few weeks. He is walking well and not having issues, but is concerned about swelling at the end of the long days. आणखी Here at home we have gel freezer packs or he just uses a bag of ice and an anti-inflammatory.\n\nWe are looking for suggestions for \"icing\" his knee at the end of the day. We are staying in a combination of hotels and AirBNB's", "link": "facebook.com/groups/1373361046396315/permalink/2202433246822420/", "likes": 3, "comments": [{"username": "Michael Galan", "comment_text": "Hotels are easy. Ice buckets from the bar"}, {"username": "Penny Bellofatto Westberry", "comment_text": "Interestingly, our hotel in Lake Como (and the one in Interlaken) had vacuum sealed ice packs made up in the kitchen every time I asked. Which was often, as I tore a muscle before traveling."}, {"username": "Anita Clayton", "comment_text": "I’m sure hotels will oblige or you could buy a bag of ice from the nearest supermarket if Airbnb doesn’t have a freezer."}, {"username": "Jayne Geaney", "comment_text": "You can buy reusable cooling bandages on Amazon that you can buy additional coolant liquid to recharge them."}, {"username": "Grace Sulsenti", "comment_text": "Why not wait until he is fully healed???"}, {"username": "Rich Goodman", "comment_text": "Bag of frozen peas."}, {"username": "Gioia Clari", "comment_text": "In any chemist's and in some big supermarkets as well you can find plenty of solutions:\n- Thermogel: a reusable cushion that can be used for hot/cold therapy, you can also bring it home\n- Cold pack (\"ghiaccio istantaneo\"): a small bag that you can carry with you and doesn't need to be placed in the freezer - you break the inside of the bag when in need and it becomes cold for you to place where it hurts. Can be nice to have if it hurts while going around\n- Spray ice - the less recommended for your need though\n\nMoreover, as someone mentioned, you can ask your hotel for some ice, and I am pretty sure that any restaurant (except the super fancy one maybe) or bar you will stop by will be happy to give you some ice to use if you're in need and you tell them what happened"}, {"username": "Kerrin Barassi", "comment_text": "I took an ice tray & froze it in each air bnb. Too easy."}, {"username": "Kristina Ruk", "comment_text": "Any supermatkets have to sell ice cubes in a pack ;)"}, {"username": "Dave Conroy", "comment_text": "Go to an Italian pharmacy, and if he needs something they will advise and sell you the right thing. But a bag of frozen peas is pretty standard as an emergency ice pack. Also, a soothing balm might help to rub in."}, {"username": "Lynette Lowes", "comment_text": "We had no problem getting ice from the bar for a calf strain we had our own ice bag. All the hotels very helpful"}, {"username": "Kate Sully", "comment_text": "Bring the ice packs - just make sure they are frozen when going thru security. That's what I did and had no issues."}, {"username": "Ann Hall Dagostino", "comment_text": "Be sure to get compression socks for flight over and back and to wear daily. My husband has had both of his knees done in the pass few years. Compression socks worked perfectly"}, {"username": "Victoria Moorhead Murrow", "comment_text": "Buy a couple of collapsible ice trays and fill them when you’re staying at the airbnbs (Amazon has them)"}, {"username": "Francoise Coupal", "comment_text": "Bring your ice packs with you and you can put them in the freezer at your Airbnb or a hotel could also do this for you"}, {"username": "Mo Dee", "comment_text": "I hurt my knee in Rome. Spoke to a pharmacist who sold me instant ice packs I could use on the go. I used ice trays to make ice at the AirBnB."}, {"username": "Dawn Hofmeister", "comment_text": "I have knee issues and brought an ice pack that I traveled with. I also brought 2 compact ice trays so we made ice in each place. I brought zip locks so I could ice my back and my knees at the same time. One thing I would verify, make sure each Airbnb has a freezer. I know it sounds weird but one place we stayed in Venice did not have a freezer. The info said there was a fridge but didn’t mention that there wasn’t a freezer. Firenze was the only place I saw ice packs in a store. I have been looking! We’ve been traveling for 6 weeks. We stayed at airbnbs, one timeshare and one hotel."}, {"username": "Dawn Hofmeister", "comment_text": "Dawn Hofmeister"}, {"username": "Richelle Trezise", "comment_text": "Pack some rubber ice trays and make your own if staying in a place with a freezer"}, {"username": "Carol Ryan", "comment_text": "You can buy an ice gel that you rub on like Voltaren but it goes cold."}]}, {"id": "2203279050071173", "text": "We’re going to Italy for a month for our 25 wedding anniversary.\n\nWe’ve been to Italy 4 times already but are looking for some info on\n\nCompany’s or places to stay. Rome is high on our list. And we’ll take day trips\n\nFrom there. Tx in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2203279050071173/", "likes": 0, "comments": [{"username": "Max Sorber", "comment_text": "Orvieto by train"}, {"username": "Debbie Fekete Gene", "comment_text": "Highly recommend lake como. I stayed in Lierna and loved the place i had. It was an Airbnb by Alessandra"}, {"username": "Melanie Matthews Stuprich", "comment_text": "That’s a very broad question! Where have you been already? What do you like to do when you travel (ruins, churches, beaches, museums, etc)?"}, {"username": "Raymond Capkin", "comment_text": "Lago di Brais"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Anacapri … quaint and beautiful….."}, {"username": "Susan Petry", "comment_text": "We did a day trip to Florence to a cooking school, long day but great fun. I will see if I can find a link & PM it to you:)"}]}, {"id": "2203288346736910", "text": "Hi everyone. My Fiancé and I are visiting Italy for 6 days in September. Can anyone suggest a two-full-day Itinerary for Rome?\nWe enjoy unique sites, architecture, museums (will not spend hours reading everything just quickly looking), good food, beautiful landscapes and nature, oddities (creepy or morbid), or just anything interesting!\n\nWe willआणखी most likely stay in Sorrento for a few days afterward and take day trips from there. I would like to see Pompeii and the Amalfi Coast. Any suggestions on 4 travel days to do that as well would be great! Thanks so much! 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2203288346736910/", "likes": 16, "comments": [{"username": "Marilyn Kelly", "comment_text": "Do go to San Clement= across the square from Parthenon=11th C Basilica at street level = down + it's 4th century = down again to Mithraic Temple + part of a Roman house-passagewa\ny leads to Colisseum. Like walking down thru history"}, {"username": "Susan Argall", "comment_text": "Definitely do a tour of the Vatican. Book through Viator. They are located around the corner of the entrance so you walk to it in a group. No lines no wait."}, {"username": "Jill Dempsey", "comment_text": "I Schiavone is awesome!!!"}, {"username": "Lisa Valdovinos", "comment_text": "The Vatican, Colosseum, Capri, and a cooking class is always fun! We booked through Viator."}, {"username": "Jenny Genzale", "comment_text": "https://\nwww.timeout.com/\nrome/\nthings-to-do/\n48-hours-in-rome"}, {"username": "Djekin Jérémie", "comment_text": "Hello my brothers and my sisters I was born from a poor family I am 22 years old I am orphan of father of mother when I am 10 years old my mother died after 5 years my father also died I am the son"}, {"username": "Elena Eugeni", "comment_text": "Book the Domus Aurea"}, {"username": "Jonathan Catoe", "comment_text": "Skip Rome and go to Florence (Firenze) if you like museums and architecture and history and awesomeness."}, {"username": "Karrie LeBlanc", "comment_text": "Palazzo Colonna is amazing only open Friday and Saturday mornings. St.Callixtus catacombs, private early morning tour with Vatican before it opens which you book on their website, Doria Pamphilij on Via Del Corso and Palazzo Barberini art musuem."}, {"username": "Joe Green", "comment_text": "Look at a map. It took me a week to take this. Start at St John Lateran. A line then to the coliseum. The forum. Then a line up via del Corso to Piazza Popolo. You will see the main sights are minutes of this thoroughfare. Go up the Spanish steps, follow along till you can look down on the Piazza Popolo. The Vatican museum is best visited early in the day, very early. We stayed this time in Trastevere. Very lively. Lots of on street cafés. Enjoy."}, {"username": "Cathy DePonte", "comment_text": "Call Bruno. He is fabulous ! Private tours and he can get you skip the line tours to the Vatican, Colosseum, and transportation to Spanish steps, Trevi fountain, and the best restaurants to avoid the tourist traps. I tried to post the link to his site / but it is pending"}, {"username": "Mary Kelly Stevens", "comment_text": "Highly recommend Chiara Antonelli Tourist guide. She gives small group tours that are unique and so interesting. Anyone who takes her tours is very impressed by her knowledge and fun filled tours.🇮🇹❤️"}, {"username": "Anthony Martini Jr.", "comment_text": "Two days would not cover the Vatican and colosseum TBH"}, {"username": "Sarah Magnusson", "comment_text": "Hi Janice! This is a great article that actually includes detailed daily walking itineraries in Rome. It’s worth a read: https://\ncruisetrail.com/\ncruise-from-rome\n/"}, {"username": "Linda Yanni", "comment_text": "My favorite museum is Borghese Gallery - gorgeous sculptures. You will need tickets to get in. I haven't done them but a lot of people like the good cart tours. Check out Rick Steves book for top spots - Coliseum, Trevi Fountain, St Peter's, Pantheon -$5 charge to get in now, I understand. He has a walking tour that will take you by all these spots. You can't see it all in 2 days but you can get a taste. Enjoy!"}, {"username": "Corky Bradley", "comment_text": "Buy (or borrow from the library) Rick Steves book on Italy. TONs of great advice and savings!"}, {"username": "Suzy Coler", "comment_text": "Food tour in the evening is wonderful in Rome."}, {"username": "Michelle Lien-Burdick", "comment_text": "Highly recommend doing a tour while at Pompeii to hear the amazing history."}, {"username": "Carolyn Dahl", "comment_text": "We’re taking a culinary walking tour in Trastevere"}, {"username": "Khaula Rafique", "comment_text": "Download the app Visitacity and pick two day itinary fo"}, {"username": "Sonita Sandhu", "comment_text": "I loved Sorrento! Was there last August. Spent 4 nights. Half day to Pompeii by train. Booked a guide that met at train station. Was worth it! Took ferry over to Capri for half a day and another day ferry to Positano. I suggest going earlier unlike me who waited as ferries don’t go that often. Enjoy!"}, {"username": "Sharon Smith", "comment_text": "We hired a private car to drive us from Rome to Sorrento. Driver stopped and let us spend 2-3 hrs in Pompeii. It was perfect amount of time for us there personally. In Rome we visited the Vatican, St Peters Basilica and Colliseum with tour guides. In Sorrento, we hired a private boat around the Isle of Capri. We swam off the boat. Magical day!!"}, {"username": "Sally Ann Tanasi", "comment_text": "I always recommend Z’intonios restaurant in Sorrento. On Wednesday they have a wonderful open air market when in Capri go to the very top the views are spectacular at Axel Munthes home and gardens don’t miss"}, {"username": "Cathy Ricci", "comment_text": "If you have not checked out youtube search Rome it's pretty go"}, {"username": "Cathy Ricci", "comment_text": "Meant to say pretty good"}, {"username": "Claudia Van Oostrum", "comment_text": "Janice Redman Rome: city bike tour through Rome with BajaBikes / Bici e Baci.\nVatican city: have a great breakfast (7:30) within Vatican Museum and get quite early acces to the Museum and Sixtine Chapel. We got these tickets through Tiqets.\nWe loved it: breakfast was good and enough in quantity, the museum us not as busy and not as warm as during day time. (No aircon in the museum)\nOur apartment at Via Candia was at a perfect location (4minute walk from subway Ottaviano) for early morning visits in Vatican city & Rome: the entrance to the museum was only 3 minutes walk away.\nLike to do your groceries like a local? Buy fruits, veggies & sandwiches with lovely prosciutto crudo and mozarella 🥰 at Mercato Trionfale, via Tunisi👍🏻.\nEarly access to St Pieterbasiliek is recommend .\nPlease be aware that there is NO such thing as skip the line to get into the basilica. You will always have to go through security check. We were there at 8am last week and it took 50minutes to go through.\nIf you’re fit enough: climb the cupola / duomo ot St Pieter 👍🏻👍🏻.\nWe loved strolling around the old town.\nWant to see Trevi fountain in a different way: on monday mornings (and fridays ?) they clean out all the coins so the fountain is at a stand still and the money gets donated to charity later on (approx 2,5million € per year).\nVilla Borghese is on our list for next visit 🥰🤩.\nCreepy; visit the catacombs just outside of Rome. There are several. We skipped it for now due to the kids (6&9) we have with us 🤣🤣.\nSkip all the Instagram locations for food. Stroll around downtown, get lost and eat at an Osteria, trattoria or restaurant. And yes, at most restaurants you will always have to pay couvert charge of approx €3 per person. On the otherside, tipping (like 15-20% in usa) is not mandatory nor a custom. Leaving some coins / change is always nice👍🏻\nEnjoy🇮🇹!!!"}, {"username": "Stephanie Ratcliffe", "comment_text": "went to Rome for 5 days last year and didn't get to see everything, google is good, pin the places you want to see, plot a route..."}, {"username": "Rodger Cravens", "comment_text": "Maybe check google and create a list of things you want to see? Might be a good start. We don't know you to do this for you.\n\nMight check out Rick Stevens and go from there."}, {"username": "Ibbu Mohd", "comment_text": "Use \"visit a city\" app"}, {"username": "Erilyn Wedd", "comment_text": "My friend and I did a 3 day tour from Rome to Sorrento spending time in Pompei, went to Capri and the blue grotto (that was fantastic) then free day where we got a driver to take us to Amalfi and Positano.\nI have seen it advertised recently for around AU $900. Inc accommodation."}, {"username": "Sandy Radican Shikaly", "comment_text": "If you don't have a hotel yet in Sorrento I would book it ASAP.. many hotels have been sold out for this season about six months ago."}, {"username": "Janie Collins Campbell", "comment_text": "That’s not a lot of time depending on where you are coming from"}, {"username": "Ron O'Brien", "comment_text": "Regarding Rome, it Might help if you identified your priorities? Museums, photos, architecture, shopping, churches, art……. ."}, {"username": "Roxann Jenkins Rideout", "comment_text": "Florence and Venice we absolutely loved Venice ￼\nWe stayed 1 night but wished we had stayed for 2"}, {"username": "Deborah Schroeder", "comment_text": "Plot on a map of Rome the sites you want to see and then decide what makes sense for each day. Your hotel should reflect the most central location for all the sites and be prepared to walk a lot."}, {"username": "Sue Sherwood", "comment_text": "Make sure to visit the historic port for a day. Rent a day bed and eat!!! Its lovely."}, {"username": "Nancy Lewis", "comment_text": "I recommend Lake Como over Amalfi.\nJust my personal opinion."}, {"username": "Debra Kingston", "comment_text": "Get advance tickets for the Borghese museum. Amazing!"}, {"username": "Robbie Lombardi", "comment_text": "Do a day trip to Capri while in Sorrento."}, {"username": "Raymond Owens", "comment_text": "I would recommend watching Rick Steve’s’ video on Rome, and see the things you liked. My daughter and mom did a two day Rome trip last year, and they had a last just doing what looked interesting. They DID book a guided tour at the Vatican.\n\nHere is the link to Rick’s video…\n\nhttps://\nyoutu.be/\nRa3h6yKLSq4"}, {"username": "Henry Bunn", "comment_text": "We plan to be with you."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Alot of people will say Capri. I suggest going to Ischia. It's less touristy. I've was in Capri years ago and this year I decided to go to Ischia with my daughter who is 19 and she loved it as well."}, {"username": "Debbie Frank", "comment_text": "The Colosseum is a must and you can also look at hiring a tour company to take you around the town, which helps you see more. We used Rome in Limo several years ago. ￼. They were great!"}, {"username": "Mark Andrews", "comment_text": "He found a walking tour group for Rome that will get you into some of the top sites to see\n\nIn Sorrento we are staying at the Bellevue resort. It’s a bit pricy but we decided to treat ourselves. We got them to send for a pick up for us at Naples train station. They help organize a day tour to Pompeii mount Vesuvius and wine tour. We also found a tour boating company for the day to sail us around capri and down the amalfi coast live with stops in between. The boat will leave from the hotels docks too"}]}, {"id": "2203367393395672", "text": "I’m thinking of buying a rosary bracelet like this online, but since we’ll be in Italy later this year, thought I might buy one there instead. 📿 My question is: I know I can buy a rosary in Italy, but could I find a rosary wrap bracelet there? Or is that an American “fashion”?", "link": "facebook.com/groups/1373361046396315/permalink/2203367393395672/", "likes": 7, "comments": [{"username": "Dafne Vassetti", "comment_text": "Ant store near the Vatican or St. Peter will have all you are looking for."}, {"username": "Maddy Herbert", "comment_text": "I think I only saw traditional rosary beads at the Vatican, not bracelets. Rosary beads are very specific in construction with different beads for different prayers etc, so I think any bracelet resembling would just be “rosary inspired”, and sold as a fashion item as opposed to a religious piece.\nIf you like it, buy it!"}, {"username": "Karen Schofield", "comment_text": "Street traders and souvenir shop sell lots of things like this.\nThere are also kiosks in a lot of the larger/tourist churches"}, {"username": "Hollie Barcheck Juersivich", "comment_text": "Not sure you’d find something like this in the Vatican City, the rosary isn’t meant to be a fashion statement."}, {"username": "Laureen Garrido Jimenez", "comment_text": "I’ve seen lots of these in street vendors near Uffizi and Duomo in Florence. Cash preferred."}, {"username": "Emma Joyce", "comment_text": "Many in the vatian city . Saw heaps at the stalls"}, {"username": "Irene Oda", "comment_text": "I saw these at the Abbey of Monte Cassino. I'm sure you'll find these anywhere rosaries are sold. Larger churches now have souvenir shops selling anything from rosaries to self made liquors. Finding this should not be a problem. Just know that folks probably use these as prayer bracelets."}, {"username": "Andrea Marie", "comment_text": "If you’re looking for nice quality, check Savelli Religious near the Vatican. It’s the best Vatican shop."}, {"username": "Kimberly Coury", "comment_text": "I was at the Vatican today and saw many similar bracelets in the shops. Get one there. It will have so much more meaning."}, {"username": "Elena Innocenti", "comment_text": "In Roma you can find in the shops near vatican city, Via della conciliazione and surroundings"}, {"username": "Maryanne McDermott Sheckman", "comment_text": "I bought a rosary ring at the Vatican. You should look at those."}, {"username": "Sopra la Roccia", "comment_text": "Se vai a Roma proprio al lato del porticato del Vaticano vi è un grande negozio di articoli religiosi. Sicuramente hannonanche quel tipo"}, {"username": "Maria Coladangelo Ducca", "comment_text": "It is a rosary , not a fashion item."}, {"username": "Enas Mourad", "comment_text": "You will find all sorts of accessories in bazars around Vatican City range of prices from 1 euro to 15 i brought some good stuff for my friends it’s more meaningful to get it from there, the first bazar you will meet once you get out of the Vatican City has very nice collection with little gift boxes with pop’s photo on them or with Vatican City pics very nice for gifts as well"}]}, {"id": "2203390663393345", "text": "Will be travelling from Sienna to the Port in Civitavecchia in October, what is the easiest (Least transfers) way to do this, bus or train?", "link": "facebook.com/groups/1373361046396315/permalink/2203390663393345/", "likes": 1, "comments": [{"username": "Dafne Vassetti", "comment_text": "Check the website rometorio"}, {"username": "Jackie Hartley Brooks", "comment_text": "We will be doing close to same, Florence to Civitavecchia in early Nov."}]}, {"id": "2203428440056234", "text": "Question for Aussies travelling in Italy:\n\nIs there a Chemist Warehouse or Priceline type store? I’ve only seen small pharmacies or Sephoras so far. Need to find somewhere with the large range of hair dyes/hair products/cheaper makeup etc like those stores at home??", "link": "facebook.com/groups/1373361046396315/permalink/2203428440056234/", "likes": 1, "comments": [{"username": "Dafne Vassetti", "comment_text": "In Florence there are Caddy's store. But depends on the city where you are traveling to."}, {"username": "Tanya Luca Chetcuti", "comment_text": "F"}, {"username": "David Baillie", "comment_text": "https://\nwww.acquaesapone\n.it/"}, {"username": "Julie Norris", "comment_text": "I saw nothing like a chemists warehouse in Rome. Only Sapphora. There might be on the outskirts but I wandered the streets for a month last year and didn't see anything like it"}, {"username": "Maria F. Ruiz", "comment_text": "Tigota or MediMarket"}, {"username": "Junko Osaki", "comment_text": "Acqua e sapone, Tigotà and Risparmio casa"}, {"username": "Cat Furness", "comment_text": "Acqua & Sapone is the shop where I bought my hair colour and toiletries, they are in every city in Italy. Some supermarkets also sell these, Conad or Coop!!"}, {"username": "Annalisa Francesca Gianna", "comment_text": "Tigota"}, {"username": "Maria Sullivan", "comment_text": "There are para pharmacies that are more like supermarkets over there as most are like apothecary type pharmacies . Ask someone there in the hotel for a para pharmacy close by ."}, {"username": "Sally Warren", "comment_text": "Supermarkets! Especially if you have a car, the big ones near the big box stores have amazing ranges of beauty products (and alcohol btw)."}, {"username": "Kim Hull", "comment_text": "Thanks everyone! I found an Acqua & Sapone & got everything I needed"}, {"username": "Elena Innocenti", "comment_text": "Supermarket!"}]}, {"id": "2203450136720731", "text": "Has anyone been driving in Northern Italy and want to share their experience, as great places to visit and how the driving experience was? 🚙🏞️", "link": "facebook.com/groups/1373361046396315/permalink/2203450136720731/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "🤞🏼"}]}, {"id": "2203473906718354", "text": "Tip: we used scooters in Rome to get from one location to other. They are FANTASTIC! There are several different companies. We downloaded DOTT and Lime Ride. They have them in Rome and a few other towns in Italy. We loved them! Such a great way to “zoom” thought the city and explore as an alternative to walking everywhere. Just make sure to set up your account ahead of time, as it can get time consuming if you are doing it in the middle of the street.", "link": "facebook.com/groups/1373361046396315/permalink/2203473906718354/", "likes": 7, "comments": [{"username": "Sunny Lang Fan", "comment_text": "Is it like one of those scooters that you can rent and drop off at different locations throughout the cities ? If so,￼ does it charge by hours or day ?"}, {"username": "Tristan Cole", "comment_text": "Just watch out for the uneven sidewalks and cobblestone type streets. These things will throw you pretty far if you hit a bump."}, {"username": "Simone", "comment_text": "Il problema è che l'area di copertura dove gli scooter possono essere lasciati include solo un piccola parte di Roma."}, {"username": "Tracy Foss", "comment_text": "Just make sure u know how to ride a scooter with confidence driving on anything in Rome is an adventure!"}, {"username": "Sally Warren", "comment_text": "Be careful! Don’t want to visit a hospital on holiday."}, {"username": "निनावी सहभागी", "comment_text": "Just to add- it is not for everyone, but I surprised that I haven’t seen any post about it. I would definitely not recommend my parents to use it 😂😂😂, but we and our teenage kids loved it!!!"}, {"username": "Julie Norris", "comment_text": "My travel insurance doesn't cover them or I'd give one a go"}, {"username": "Sally Warren", "comment_text": "Hey looked like heaps of fun for the young folk and fleet of foot."}, {"username": "Daisy Yoo", "comment_text": "Do u mean scooters like this or the type that most Asia country use? If it is the one in the pic, darn I can never ride them , I tried"}]}, {"id": "2203288666736878", "text": "Thank you to all that mentioned some of the following that made my trip easier, and a bit of my own tips! 9 days, Venice, Florence, Sorrento, Rome\n\nThe tours I did and were fantastic! 10/10\n- Vespa Florencetown\n- Pompeii from Sorrento\n- Walking food in Venice\n- Pasta making in Rome\nTips!\n- Change money before you leave, get small bills and keep change if you can\n- Not a lot of bathroom counter space in the hotel rooms\n- Bring wash cloth\n- Take naps\n- We used the coin laundry machines in the big cities.\n- I adored each hotel and the staff making us feel so welcome\n- I never had a translation issue. Very thankful for all the Italians that spoke English., but I felt bad I couldn’t use any of the language I practiced for 200 days on Duolingo.\n- It was peaceful knowing I had my train tickets already\n- Bathrooms are not fun\n- Chicken is not often found on menus\n- Eating off the beaten path is sometimes easier said\n- City transportation was more $ than I planned- for the times when walking was not an option.\n- Amex was refused often\n- Streaming apps are not available in all regions- use VPN\n- You will fill your photo storage!", "link": "facebook.com/groups/1373361046396315/permalink/2203288666736878/", "likes": 25, "comments": [{"username": "Jeidy Christina Duarte", "comment_text": "I'm Italian and i tell you that Duolingo is useless in Italy for two simple reasons: the first is that to learn correct Italian you should be with an Italian person and speak every day, we have many ways of saying, these cannot be translated, they are cultural things. The second reason is that in Italy there are too many different dialects and they are completely different from the basic Italian. In fact, if we were to speak in dialect between regions, we don't understand each other. This is why i strongly don't recommend learning Italian with Duolingo or platforms. But with a native Italian professor and the dear old dictionary."}, {"username": "Brittany Friedman", "comment_text": "Can you provide more details on your walking food tour in Venice and pasta making in Rome tour?"}, {"username": "Cathy O'Hare", "comment_text": "Hi could you provide the details of who you used for the trip from Sorrento to Pompeii?"}, {"username": "Michelle Plutto", "comment_text": "Good to know about amex"}]}, {"id": "2203293376736407", "text": "Good evening, we are visting Lucca,pisa and Florence in September what are the must see sights ? I want to see a true Italian opera any suggestions? And it's our wedding anniversary whilst in Florence any suggestions on meal ? We got married in sorrento 🥰 we absolutely love Italy, the people, food, lemoncello and wine,sights xxx", "link": "facebook.com/groups/1373361046396315/permalink/2203293376736407/", "likes": 5, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "For italian opera check Teatro del Maggio Fiorentino they have something for September (both Rossini’s and Verdi’s are great operas)\nAbout Pisa I wrote a post here with a walking itinerary from the station, search it with the lens"}, {"username": "Ryan Monahan", "comment_text": "In Lucca, go to Pasquale’s for an amazing dinner!"}, {"username": "K M Uí Fhionnaláin", "comment_text": "In Lucca,go into the Piazza di Anfiteatro,sit at a table outside one if the restaurants,hav\ne a drink ,a meal and just sit ,look around and soak it in.It's amazing.Meravig\nliosa.Enjoy."}, {"username": "Renae Larcus", "comment_text": "In Lucca rent bikes and ride on top of the wall. So fun!"}, {"username": "Ana Ka", "comment_text": "For Lucca I recommend to see the church of San Frediano and its frescoes of Saint Frediano stopping flood of Lucca with a rake (very cool), then Duomo of San Martino for the holy face of Lucca crucifix - apparently made by a guy who entombed Christ... very important relic, and also the sleeping beauty statue... just stunning! And finally, just walk around the town... its full of cutest little streets and passages... for food we really enjoyed Santi Peccanti - stunning view and good food. Pisa i liked a little less frankly. The main piazza with the leaning tower is certainly interesting, but the town i was just ok with...\n\nAs for Florence, for a wedding anniversary dinner i would go to Cantinetta Antinori i guess or Angel rooftop bar and restaurant. I would also book a wine tour in https://\nwww.collazzi.it/\nen/ i think the building was designed by Michelangelo?..\n. and they also were opening a restaurant there when i was last time... havent tried it though. The tour and wine were fantastic! And i would do a fresco class with Alan Pascuzzi, he is a professor of art and an artist... restored many frescoes, very interesting guy... i took the class with friends and everyone just loved it. you don't need to know how to paint... he tells you everything. really great! https://\nwww.instagram.co\nm/alanpascuzzi/ Finally, for tours, we decided to self tour and used this tour and couldn't be happier as it told us about sculptures in the city and a lot of things we wouldn't have noticed otherwise.... we used it in uffizi too and it was fantastic: https://\nappyguide.com/"}, {"username": "Ana Ka", "comment_text": "Happy anniversary btw ))). I am sure it will be magical. Do check out in Florence also this renovated palazzo cocktail bar: https://\nwww.worlds50best\nbars.com/\nthe-list/\nlocale-firenze.h\ntml. we go there every time we are in florence. its simply magical. very romantic too :)"}, {"username": "Elena Innocenti", "comment_text": "Firenze go to “Buca Mario”"}, {"username": "Roland Trego", "comment_text": "Lucca: the Torre Guinigi for the view."}]}, {"id": "2203308570068221", "text": "2 VIP Vatican Tix for sale (Aug 8th, 7:30am). My daughter and I were supposed to be traveling to Italy for 2 weeks and unfortunately we had to cancel (she injured her foot and we’re just so bummed). I bought 2 tickets direct from the Vatican and we are unable to use them. Just asking for face value ($420). It is for the VIP early morning experience. DM me if interested. Will accept Zelle or Venmo.", "link": "facebook.com/groups/1373361046396315/permalink/2203308570068221/", "likes": 1, "comments": [{"username": "Melissa Lynn", "comment_text": "Danielle Andalora not sure when you are going but just a heads up. Gina is a good friend from WVU"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203317983400613", "text": "I was just wondering if anyone has been to Siena or Positano- if so, can you please share favorite restaurants, hotels, travel tips?\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2203317983400613/", "likes": 2, "comments": [{"username": "Iliana Zlatareva", "comment_text": "Favorite m.m.but for sure very expensive, one coffee 7 eur"}, {"username": "Ana Ka", "comment_text": "I went to Siena for a day and thought it was lovely. Really enjoyed the frescoes at Palazzo Publico (on the main square) and the Duomo. Get this guide and explore yourself without the crowd! Was best decision for us: https://\nappyguide.com/\n\nSorry, didn't eat there, so can't recommend anything..."}, {"username": "Alice Francesca", "comment_text": "Le tre sorelle in Positano! Family owned restaurant for decades! Right on the beach! Best seafood pasta ever! And I am Italian! ;)"}, {"username": "Charles Gulas", "comment_text": "The Duomo was beautiful in Sienna"}, {"username": "Karen Anglin", "comment_text": "Thank you! Any recommendations\non hotels you have stayed at? Thanks!"}]}, {"id": "2203318316733913", "text": "Has anyone ridden the ferry from Sorrento to Capri? It is called a hydrofoil", "link": "facebook.com/groups/1373361046396315/permalink/2203318316733913/", "likes": 3, "comments": [{"username": "Dafne Vassetti", "comment_text": "What do you want to know specifically? It's a 20/30 min ride to Capri depending on the conditions of the sea. If you suffer from motion sickness bring meds. You can sit in any available seat. Have to be at the deck at least 20 min before your departure time. There are restrooms and a small snack bar on board."}, {"username": "Bernadette McKay", "comment_text": "Yes it’s fine"}, {"username": "Sandy Radican Shikaly", "comment_text": "The hydrofoil is faster than the regular ferry"}, {"username": "Czecie Reyes", "comment_text": "Yes"}, {"username": "Margaret Saigling", "comment_text": "We rode it from Positano to Capri. It was fine. We also went on a cabin cruiser one time. Loved it!"}]}, {"id": "2203322140066864", "text": "Last December when we went to Venice we also spent a day at Murano and got a ticket to visit Gino Mazzuccato glass maker and assisted at how they created their beautiful Murano glasses.\n\nI recommend you have this experience!!\n\n.", "link": "facebook.com/groups/1373361046396315/permalink/2203322140066864/", "likes": 4, "comments": []}, {"id": "2203323893400022", "text": "Ciao! Does anyone know where I can buy Pedrotti wine?\n\nWe will visit these cities. TIA\n\nMilano\nBergamo\nVenice\nTrieste\nRoma\nFirenze", "link": "facebook.com/groups/1373361046396315/permalink/2203323893400022/", "likes": 0, "comments": []}, {"id": "2203324390066639", "text": "Any recommendations\nfor a place to stay in Cinque Terre?", "link": "facebook.com/groups/1373361046396315/permalink/2203324390066639/", "likes": 5, "comments": [{"username": "Maria LoSurdo", "comment_text": "Definitely Monterosso! The biggest town with lots of restaurants and shops. It’s beautiful and has a lovely beach. You can get the hydrofoil to the other towns and do walks or hikes. 🇮🇹❤️😊"}, {"username": "Sandy Harle", "comment_text": "La Spezia near railway stn and comute every day with a pass. Much cheaper n very quick xx"}, {"username": "Diane Newland", "comment_text": "Hotel la spiaggia in Monterosso al mare https://\nwww.laspiaggiamo\nnterosso.com/\n?adblast=7268058\n642&vbadw=72680\n58642&gclid=Cjw\nKCAjwt52mBhB5Ei\nwA05YKo2cvgPkjw\nqWUW9VWkS7hOlSD\nq1278Y1OHSjIO6T\nm67ILIwVTTwTazR\noCNmwQAvD_BwE"}, {"username": "Ted Kostisin", "comment_text": "We enjoyed staying in Lerici and taking the ferry over."}, {"username": "Nora Arrechea", "comment_text": "Porto Venere and visit the 5 Terre from there..."}, {"username": "Kerry McMillen", "comment_text": "Da Paulin in Manarola"}, {"username": "Whitney Meyers", "comment_text": "Villa Valentina"}, {"username": "Hilary Diekow", "comment_text": "Levanto-Hotel Garden"}, {"username": "Todd Trnka", "comment_text": "Porto Rocco in monterosso"}, {"username": "Mat PO", "comment_text": "I have always preferred staying Portofino and visiting Cinque Terre during the day."}, {"username": "Angela MacLardy Kinsel", "comment_text": "Manarola!"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "La Mala in Vernazza"}, {"username": "Filomena Lemme", "comment_text": "Hotel Baia in Monterosso, right by the beach and train station."}, {"username": "Shelley Frise", "comment_text": "If your energetic we rented a beautiful apartment. It is a 142 stairs into town and is located in the lemon groves. It’s very quite here."}, {"username": "Jeanette Hjartåker Berstad", "comment_text": "Monterosso ❤️"}, {"username": "Janet Courtney", "comment_text": "Villa Steno Monterosso 👌"}, {"username": "Brooke Ashley", "comment_text": "We stayed in La Spezia and caught the train or ferry in. We were so happy we did as it was a lot cheaper and way less busy."}, {"username": "Maria O'Callaghan", "comment_text": "We have stayed a couple of times in Levanto. The boat leaves from there as well as the train. We took the boat to Porto Venere, then back to Riomaggiore. From there we took the train to all the villages & back to Levanto which is less crowded & not as expensive.\nThe old town section is lovely."}, {"username": "Caroline Langlois", "comment_text": "Levanto, the town just after, small village, fabulous restaurant, Price low, 1 stop to cinq terres"}, {"username": "Alice Engstrom", "comment_text": "Il Pasquale innMonterosso al mare"}, {"username": "Jenny Labarbera", "comment_text": "We stayed in Monterosso in an Airbnb and loved it, we took the ferry to each of the villages."}, {"username": "Sue Averill", "comment_text": "Angela Bartnick Douglass Dunn"}]}, {"id": "2203325130066565", "text": "Has anyone stayed at hotel splendid in Venice and do you recommend it? ￼", "link": "facebook.com/groups/1373361046396315/permalink/2203325130066565/", "likes": 0, "comments": [{"username": "Gwen Cooke", "comment_text": "We always stay at Hotel Indigo in Saint elena , it’s an old monastery but it’s beautifully converted and the rooms are modern clean and spacious and the breakfast is amazing !! It’s outside of the hustle and bustle and so it’s calm and relaxing but close enough to walk to Saint Marks within 15 mins all along the lagoon and the gardens of Venice … or jump on a vaperetto … highly recommend… but am sure you will have a wonderful time wherever you stay because … Venice is … wonderful and magical and steals your heart 😊"}]}, {"id": "2203334006732344", "text": "Anyone use Premier World Discovery tour packages compared to Collette or AAA Members Choice Vacations? I’m concerned about hotels and reliability of World Premier. Any thoughts or experiences would be appreciated. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2203334006732344/", "likes": 0, "comments": []}, {"id": "2203326926733052", "text": "Hi, I would like to visit Vatican Museum and Sistine Chapel in 21st Aug but the tickets all sold out at the official website.\nDo you all have any idea where else can I get the tickets?\nSt. Peter Basilica is free entrance without buying tickets?\nIn worst case, I would just visit St. Peter Basilica.", "link": "facebook.com/groups/1373361046396315/permalink/2203326926733052/", "likes": 6, "comments": [{"username": "Stacey Esposito", "comment_text": "St peters is free to walk around the basilica. We went last night. Just go through security."}, {"username": "Stacey Esposito", "comment_text": "I'm not sure if you can buy tickets the day of at the vatican. There were a lot of lines but I think they were mostly tours"}, {"username": "Roxanne Franquelli", "comment_text": "Try Expedia or Viator."}, {"username": "Violeta Giorgiana", "comment_text": "I bought the tickets for the Vatican 20 minutes before I went to visit.\nI got there by metro, and on the way to the metro exit you see a shop that sells tickets, I also took the skipline to avoid waiting. After the purchase, I was sent to change the voucher for actual tickets at an agency not far from the Vatican. At the same time, they were cheaper than in other places, 25 euros, if I remember correctly. After that, everything went very quickly.\np.s.: I didn't have a tour, I visited by myself"}, {"username": "Pamela Jones", "comment_text": "Thevaticanticke\nts.com still has tickets for that date"}, {"username": "Jenny Frank", "comment_text": "Tiqets.com\n\nExcellent (like tocketmaster)"}, {"username": "Raquel Pickering", "comment_text": "St peters is free, just have to line up for metal detection. Try Get Your Guide for vatican"}, {"username": "Megan Sampson Olson", "comment_text": "We used Viator when we went."}, {"username": "Leanda Wall", "comment_text": "This is the one we did and booked through here\n\nhttps://\nwww.tripadvisor.\ncom.au/\nAttractionProduc\ntReview-g187791\n-d11449810-VIP_\nVatican_Breakfa\nst_Sistine_Chap\nel_St_Peter_s_B\nasilica_Guided_\nTour-Rome_Lazio\n.html"}, {"username": "Toby Levy", "comment_text": "I bought 2 days before my visit on Tiqets"}, {"username": "Shen Min Chue", "comment_text": "The standard entry tickets for Vatican Museums from the official site are already sold out. The next best thing perhaps is to consider purchasing from the official Vatican site the Vatican City Tour and Museums - Open Bus ticket which goes for €37. You just have to spend the first 45 mins onboard an open bus which tours around ( without alighting ) the beautiful Vatican Gardens after which the ticket acts just like any normal standard entry ticket to the museums, giving you skip the lines access and direct entry to the museum complex. And as a bonus, you get bragging rights for having visited the Vatican Gardens which few people would have done!"}, {"username": "Michele Naftal", "comment_text": "We just came from there and had Purchased “skip the line” tickets. It was well worth it. We did it through get your guide."}, {"username": "Marty Harte", "comment_text": "I did Viator skip the link tour this past week. Semi private 3 hour tour. Wound up being with City Wonders. Dario was the best."}, {"username": "Monica Saluja", "comment_text": "Sushreya Saluja"}, {"username": "Linda Pitler", "comment_text": "Check out Viator and he sure you get skip the line tickets."}, {"username": "Ellen Quinn", "comment_text": "Has anyone used GetYourGuide?"}, {"username": "Michelle Bergman Davis", "comment_text": "Viator and Get your Guide are great options. We booked our tour of the Vatican with early entry thru Get you r Guide"}, {"username": "Letty Veronica", "comment_text": "We got our tickets on Viator and had a great experience"}, {"username": "Carin Vos", "comment_text": "Get your guide."}, {"username": "Patricia Turner", "comment_text": "We booked through City Wonders for the early access Sistine Chapel and Vatican Museum tour. Our tour started at 8:00 am and the timing was perfect and our guide tour was fabulous! We couldn’t get in the basilica the day before (with a different tour company who said the line was too long for the allotted time of their tour) so our CW tour guide told us to take the door to the right in the chapel which takes you to the basilica. If you do this, you forgo the museum but we were ok with that as we really wanted to see the basilica."}, {"username": "Donna Mangone", "comment_text": "Www.Getyourguid\ne.com"}, {"username": "Sabiha Syed Shaikh", "comment_text": "The guided tours are hard to get. Just the entry is easy to find on the coop culture website."}, {"username": "Jessica Chiu", "comment_text": "You can also get the tickets with guided tours. That is how we managed to get tickets directly through the Vatican site. It is better than waiting in the very long line"}, {"username": "Kristie Storie Winston", "comment_text": "I always use the app called “Get your guide” there are many options to “skip the line”"}, {"username": "Deborah Schroeder", "comment_text": "Be at St Peter's at 630 am and stand in line for security when it opens at 7 am. No charge. As for the museum, tickets go on sale 30 days in advance and sell out very fast. Take your chance and get in line very early for the 9 am opening."}, {"username": "D'Anna Sullivan", "comment_text": "City Wonders. Great tour that included breakfast! Not sure the availability though."}, {"username": "Valerie Nicole", "comment_text": "https://\nwww.walksofitaly\n.com/\nrome-tours/\n?gclid=Cj0KCQjw2\nqKmBhCfARIsAFy8\nbuI58RelK-JzrAe\noNsoG8mDOfk_NK0\nalPonjSVzyKPXVf\n8UxvS6N_RIaAosW\nEALw_wcB&filter\ns=Vatican\n\nWe used Walks Italy for several tours we booked and had a great experience. We booked the early entrance small group tour for the Vatican back in April and it was fantastic! Highly recommend!"}, {"username": "Sue Vellegas", "comment_text": "I bought ours through Trip Advisor- we are going in November"}, {"username": "Nicole Harrow", "comment_text": "We used viator and did the breakfast tour. It was great, your guide was excellent."}, {"username": "Jackie Flores", "comment_text": "You can still get tickets under guided tour"}]}, {"id": "2203331123399299", "text": "Hey everyone 👋 booked Milan for a short stay in sept looking accommodation recommendations\nand any useful tips n tricks - places to eat, Visit etc\nAll advice welcome !\nThank you !", "link": "facebook.com/groups/1373361046396315/permalink/2203331123399299/", "likes": 1, "comments": [{"username": "Sandy Hookerman Kriger", "comment_text": "Go to Lucca- 🩵it"}, {"username": "Ana Ka", "comment_text": "best restaurant for us was https://\nwww.lagioiasanma\nrco.com/... and also Papermoon Giardino, Langosteria Cafe Milano... for art dont go to Duomo... in our view Chiesa di san maurizio with its stunning frescoes was a lot more fascinating. Check out nearby Raw Milano concept store. And of course see Leonardo's last supper! It's a must."}, {"username": "Ana Ka", "comment_text": "for accomodation - speronari suites are great! and also Be mate via Tivoli"}]}, {"id": "2203331656732579", "text": "Spam me with beautiful pictures of handbags you bought in Florence. If you know it, please include the name of the store and bonus if you remember the price. I’m so excited to see your treasures!", "link": "facebook.com/groups/1373361046396315/permalink/2203331656732579/", "likes": 208, "comments": [{"username": "Sarah Corney", "comment_text": "F"}, {"username": "Lynn Barnett Head", "comment_text": "Following"}, {"username": "Sharon McCarthy", "comment_text": "Anyone have suggestions for Shopping in Rome for bags. We've only got a day in Florence and I can't see Hubby wanting to shop for a new bag 🤣 we've got 4 days in Rome so time for me to escape and look 💖"}, {"username": "Denise Windeknecht", "comment_text": "F"}, {"username": "Lauren Martey", "comment_text": "Following"}, {"username": "Leesa Martin", "comment_text": "F"}, {"username": "Claudine Auclair", "comment_text": "And my husband said one suitcase for both of us…."}, {"username": "Tarra Ridderman-Gilland", "comment_text": "F"}, {"username": "Tairi Hansen Copenhaver", "comment_text": "F"}, {"username": "Jenny Delpy", "comment_text": "I will be there in October. Going to Milan & Rome. Are there any name brand items I can buy cheaper over there than in Australia?"}, {"username": "Susan J Semonite Armistead", "comment_text": "My husband had to cancel a day before our trip as he was sick. Our anniversary was during my stay there. I went with my sister to the bridge and bought some jewelry instead! 😂🤣"}, {"username": "Kim Barber", "comment_text": "Kim Barber"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Beware at the street markets in Florence. Many stamped Made in Italy are imported knockoffs."}, {"username": "Grahame N Katrina Stephens-Rolston", "comment_text": "Shera Lee 💖"}, {"username": "Mary Rose Madden", "comment_text": "Is anyone else like, \"this thread is my new porn?\""}, {"username": "Cinthia Alvarado", "comment_text": "Me in the comments 👀"}, {"username": "Judi Rinaldo", "comment_text": "Judi Rinaldo"}, {"username": "Karen Cavan", "comment_text": "Karen Cavan"}, {"username": "Karen Cavan", "comment_text": "It really different-"}, {"username": "Jenny Burds", "comment_text": "Jody Schultz"}, {"username": "Cheryl Swiatko", "comment_text": "Bought eight purses when in Italy. Six at the leather market in Florence, one in Venice, and one in Sorento. Just kept using my credit card…..lol! Cheapest was 20 euros and the weaved blue was the most at 35 euros."}, {"username": "Kat Morse", "comment_text": "We loved The Leather School and also Toro Firenze"}, {"username": "Maureen Bussoletti", "comment_text": "Any bargains on Gucci?"}, {"username": "Angela Tejeda", "comment_text": "Following"}, {"username": "Leah Roveroni", "comment_text": "When we went to Florence pre-COVID, one of our friends took an empty Carry-On Bag just to fill it up with all the purses that she bought from the Leather Market... was a great idea"}, {"username": "Suzanne Langlais", "comment_text": "Carol Susan"}, {"username": "Karen Tynan-Spencer", "comment_text": "Purchased in Florence on honeymoon."}, {"username": "Donna Steely Arnold", "comment_text": "F"}, {"username": "Kathleen Fiorini", "comment_text": "I bought 2 beautiful cross body bags for my adult sons. We are currently on a long road trip with the eldest who has itt on while he's driving so I'll take a pic later"}, {"username": "Norma Morán", "comment_text": "Any thoughts on the company, Leaf Bags?"}, {"username": "Mara Mike", "comment_text": "F"}, {"username": "Paula Marshalsey Dunn", "comment_text": "Following"}, {"username": "Julie McDonnell", "comment_text": "Emily Gruber Mirjalili"}, {"username": "Michele Anderson McBride", "comment_text": "240 euro?"}, {"username": "Theresa Salerno Adams", "comment_text": "My soft navy leather jacket and the salesman wasn’t too bad either"}, {"username": "Patricia Nyenhuis Secord", "comment_text": "Michelle Patterson !!!"}, {"username": "Laura Saylor", "comment_text": "Following now i have a new bag on my list to buy"}, {"username": "Marie Payne", "comment_text": "there are leather stores all over the place in Florence...I had to quit walking into them as I wasn't getting anything else done!!"}, {"username": "Ishita Majumder", "comment_text": "F"}, {"username": "Shirley Collar Wilson", "comment_text": "Mary’s Shop -Sorrento- 5 generations-bou\nght several bags (tanned washed in machine soft Buffalo), 2 belts/made to fit"}, {"username": "Jason Lee", "comment_text": "Melissa Lee"}, {"username": "Pat Mac", "comment_text": "Pelletteria Artigiana Viviani right near the Academia. I just love my bag."}, {"username": "Annette Sparks", "comment_text": "Oh my goodness. I need to take more spending money"}, {"username": "Denise Berry", "comment_text": "F"}, {"username": "Cynthia Anderson", "comment_text": "From a beautiful purse store in Siena. Suede and embossed leather.\n$240?"}, {"username": "Denise Bain Daltrui", "comment_text": "Go to the leather school when in Florence. It was an educational and interesting experience."}, {"username": "Lauren Purcell", "comment_text": "Are these leather markets only in Florence?"}, {"username": "Angela Hendrickson Simmering", "comment_text": "Don’t remember the store, just popped in walking by. Paid $65. ￼"}, {"username": "Dori Reader", "comment_text": "Follow"}, {"username": "Sean Noel", "comment_text": "F"}, {"username": "Cindy Leonard Bruning", "comment_text": "Bought at a shop in Florence. Thought it was different and fun!"}, {"username": "Karmen Strain", "comment_text": "Peruzzi Leather, €575. Custom made in my fav color purple. Took about 5 weeks to make. Shipped for free. Because they shipped it they deducted 12% VAT from the €575 price."}, {"username": "Ann Brahmani Bost", "comment_text": "Florence Moon has several shops in Rome. They have beautiful handbags. They also have nice jackets. The prices seemed reasonable.\nYou are likely to get the best prices at San Lorenzo market in Florence though, and you can bargain with them."}, {"username": "Alice Francesca", "comment_text": "Cliobags on instagram! All of them less then 200 Euros! All made in Italy!"}, {"username": "Marissa Bradley", "comment_text": "I’m not sure if they do purses but Benheart is an amazing leather company. The owner has an incredibly inspiring story and all goods are hand made by local Florentine artists!"}, {"username": "Kim Rogers", "comment_text": "Love all the bags!"}, {"username": "Dana Hebert Bendeck", "comment_text": "Following"}, {"username": "Enolita Castillo", "comment_text": "Shopping for leather goods in Florence is in itself a whole day affair...too many treasures to choose from. I always blow at least a third of my cash on purses alone. Then of course the 18k gold Italian jewelry is another thing to rave about in Florence. And oh, the Italian leather shoes! Just be cautious about buying leather goods at the leather market. There are fake leather goods that feel & even smell like they're made of calf leather."}, {"username": "Jeanne Ricca Newman", "comment_text": "Jennifer Ricca-Chiapperi\nno"}, {"username": "Juliet Roscigno-Filipkowski", "comment_text": "Got this one in Rome. It’s a backpack or purse (straps zip together)"}, {"username": "Andrea Howard", "comment_text": "Benheart"}, {"username": "Michele Saletros", "comment_text": "…"}, {"username": "Jo Ann Di Giamo", "comment_text": "Jaida Di Giamo"}, {"username": "Robert McCurry", "comment_text": "Sarah Ludlow McCurry"}, {"username": "Desiree de la Vega-Cannone", "comment_text": "Folliwing"}, {"username": "Tami Glispey Calabrese", "comment_text": "F"}, {"username": "Shelly Brost", "comment_text": "I know robertafierenza\nus on my must visit list next month!"}, {"username": "Cheryle Reid", "comment_text": "This cost $65 and I’ll post pic of where I bought it in the comments. Hopefully you’ll know where it is. I get so many compliments on my bag and I just love it."}, {"username": "Christina Will Koppin", "comment_text": "Found this in Sorrento!"}, {"username": "Judy Carey", "comment_text": "Are there any stores like these in Rome? Yeesh, makes me want to do the fast train to Florence from Rome!"}, {"username": "Sarah Reed", "comment_text": "Heather Sturgill🤩"}, {"username": "Heather McNamara Witt", "comment_text": "Following"}, {"username": "Erica Murray", "comment_text": "All I wanted was 1 handbag from Florence but when I got to the store I couldn’t decide which one so I got both ❤️"}, {"username": "Judy M. Harrison", "comment_text": "F"}, {"username": "Taylah Paton", "comment_text": "Leonardo Leather & Gold 😍"}, {"username": "Lisa Hry", "comment_text": "Wow, this\nPost is a keeper for sure 👜👛👝❤️"}, {"username": "Janine Manton", "comment_text": "Kathy Snell"}, {"username": "Janet Farrell", "comment_text": "I bought a beautiful bag in a store that Perillo Tours brought us to. I do believe that you get what you paid for. There were quite alot of stores that had some nice bags but....just like when you shop in China Town in NYC you will end up with a low quality leather and fake designer bags."}, {"username": "Holly Ng", "comment_text": "These are from the leather school. I think the price was 500 euros for the one with the top handle. I believe they said you can choose a color of leather and they can custom one for you if they don’t have it. Engrave with your initials too. They will ship it internationally\nfor free."}, {"username": "Cora Knutson", "comment_text": "F"}, {"username": "Lydia Mann", "comment_text": "Omg i regret not booking my trip to Florence! We’re just going to Venice, Rome and Sardinia…tell me the leather shopping is just as good there!!! 🤞"}, {"username": "Susan Capalbo", "comment_text": "Toby Katz Litsky we may have to go handbag shopping in Florence ☺️"}, {"username": "Raluca Volland", "comment_text": "My bag from Furla. This is impeccable quality. Bought it from Milan on discounts."}, {"username": "Dawn Peters", "comment_text": "Dawn Peters"}, {"username": "Kelley Koboldt", "comment_text": "Jane Wetzel we should keep this in mind. I’m definitely treating myself to a new colorful handbag"}, {"username": "Liz Sutton", "comment_text": "Are these prices euros or usa $ as I'm Australian"}, {"username": "Donna Spencer", "comment_text": "Lynn Mcconnell. Do you think I can find something that looks like a Jackie O bag that I have wanted for so long."}, {"username": "Lauren Vassallo Beattie", "comment_text": "I got this in San Gimignano it was a shop that u go below, i can't remember what it was called sorry."}, {"username": "Yateesh Kumar", "comment_text": "Nileema Kumar 🛍️ 💼"}, {"username": "Georgeann Farinacci Greene", "comment_text": "This is a great feed-I’m such a bag addict!!"}, {"username": "Laura Miller Bailey", "comment_text": "Following"}, {"username": "Lisa D Long", "comment_text": "Following"}, {"username": "Blanca Gil", "comment_text": "Infinity Firenze at Borgo Santi Apostoli\nAll different sizes, styles and prices."}, {"username": "Colleen Lorenzen", "comment_text": "Leather market Florence"}, {"username": "Tracy Foss", "comment_text": "Thank you everyone for your pictures & suggestions! I'm planning on taking a purse to leave behind & replacing it my sister thinks that is risky in case I can't find one I like 🙄 don't think that will be a problem..."}, {"username": "Colleen Jennings", "comment_text": "If you have a spare few hours get the bus from the bus station to the outlet village about 45 mins outside the city. I bought a Gucci bag there & a Coach shopper both the last seasons but I didn’t care as they were bargains."}, {"username": "Debbie Zaleski Cincurak", "comment_text": "Bought in leather market. Overpaid 70 Euro. Should be less than 50"}, {"username": "Jennifer Earnest Kenley", "comment_text": "Follow"}, {"username": "Mary Bentley-Bloom", "comment_text": "175$"}, {"username": "Cara Schlanger", "comment_text": "https://\nwww.coccinelle.c\nom/en/"}, {"username": "Shelley Phillips", "comment_text": "Shelley Phillips"}, {"username": "Vicki Mattia Martin", "comment_text": "Leather jackets in Florence from Ponte Vecchio Leather!!!"}, {"username": "Paul N Marietta Dodson", "comment_text": "Paul N Marietta Dodson"}, {"username": "Susan Tipsord", "comment_text": "Oh yes!! Keep those pics coming. We are in Italy now and heading to Florence tomorrow!! (Happy dance. . .)"}, {"username": "Tania Davis", "comment_text": "Only go to Valentina , I bought one of his bags at another store and paid twice as much before I realised he had his own store in Florence right near market and will give e you wholesale price"}, {"username": "Sandy Radican Shikaly", "comment_text": "Leather school in Florence behind Santa Croce..."}, {"username": "Kathy Morra Kuloy", "comment_text": "I bought my purses over the years at Misuri and Michaelangelo, authentic leather shops in the Santa Croce Piazza. The leather Scool is there also behind the church. In Misuri, ask to see the sale room in the back. They have a big selection of bags, wristlets, belts, gloves. Both stores will gold stamp your initials for free. I’ve paid anywhere from $60 for wristlet to $500 for a medium sized that was handmade."}, {"username": "Tami Sue", "comment_text": "If you want something special looks for shops that make it."}, {"username": "Courtney Champagne", "comment_text": "Courtney Champagne"}, {"username": "Deana Lynn", "comment_text": "Cortnee Hogans"}, {"username": "Nancy Willson", "comment_text": "following"}, {"username": "Lauren Velleno", "comment_text": "From Il Perseo Leather and Sam helped me pick it out. He was so helpful!"}, {"username": "Helen Layton Brechler", "comment_text": "Dont go to the leather market\nIts not a what it used\n\nThe side streets"}, {"username": "Joanne Troisi Cochrane", "comment_text": "Joanne Troisi Cochrane"}, {"username": "Joanne Troisi Cochrane", "comment_text": "Bought it in Pienza but they have a store in Florence"}, {"username": "Helen Layton Brechler", "comment_text": "If you want a great coat\nOr custom coat\nGo here\nWell worth the $$\nWe bought 3\nOne was custom made.\nShipped it to us in\nFlorida"}, {"username": "Jill Brothers", "comment_text": "Lori Littleford i need a green handbag now"}, {"username": "Tania MacFarland", "comment_text": "Kelly bag from Misuri. Love it 😍"}, {"username": "Jan Shelton Koprivnik", "comment_text": "Is there a leather market in Milan?"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "There are many poor quality imported bags for sale all over Italy. You get what you pay for. A quality leather bag made in Italy is not cheap."}]}, {"id": "2203336066732138", "text": "Planning a month long trip to Italy in the spring. What are the best apps to have downloaded?\n\nTrenitalia etc.\nThanks in advance for your recommendations. This will be our first trip! Planning for Rome, Florence and Lucca so far.", "link": "facebook.com/groups/1373361046396315/permalink/2203336066732138/", "likes": 3, "comments": [{"username": "K M Uí Fhionnaláin", "comment_text": "Trainline"}, {"username": "Paula DiCicco", "comment_text": "Here are the ones I used - plus Google Maps and Maps."}, {"username": "Ana Ka", "comment_text": "not an app, but a mobile friendly site that we used during our latest trip to florence and tuscany: https://\nappyguide.com/ it was great! good short tours about works of art, piazzas, history, etc. was well worth our money."}, {"username": "Steve Grossman", "comment_text": "Viator"}, {"username": "Sue Sherwood", "comment_text": "I did most of my planning on Trip Advisor"}, {"username": "Carey Kunzmann Ertz", "comment_text": "Does Open Table work just as well as The Fork?"}, {"username": "Cindy Sguazzin", "comment_text": "Please, do not miss Venice!"}]}, {"id": "2203338120065266", "text": "Planning to do a day trip from Milan to Lake Como at the end of August. I know 1 day isn’t enough to explore, but any recommendations on things we should prioritise during our day there?☺️🙏 TIA", "link": "facebook.com/groups/1373361046396315/permalink/2203338120065266/", "likes": 1, "comments": [{"username": "Ana Ka", "comment_text": "i would go to lake Orta instead 😉 much cosier"}]}, {"id": "2203338996731845", "text": "Hello! Haven’t seen any posts about purchasing travel/medical insurance. Any companies you would recommend for senior travelers? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203338996731845/", "likes": 1, "comments": [{"username": "Alicia Burno", "comment_text": "We did, we bought them with our airline tickets on Booking.com"}]}, {"id": "2203344266731318", "text": "Hertz or Alamo car rental in Florence? Please share your experiences. Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2203344266731318/", "likes": 0, "comments": []}, {"id": "2203349060064172", "text": "I am trying to purchase fast train tickets for September on Italo.\nI’ve tried in the app & on my desktop. My credit card, my husband’s credit card, both our PayPal accounts. Nothing is working.\nI’m in Australia. Has anyone had this same issue?", "link": "facebook.com/groups/1373361046396315/permalink/2203349060064172/", "likes": 1, "comments": [{"username": "Deb Harnett", "comment_text": "I’m from Australia I booked all my train tickets on Omio App so easy and no issues with paying\nHope this helps"}, {"username": "Lisa Boyes Cooper", "comment_text": "I used Omio as well from Australia and found it fantastic"}, {"username": "Fiona Waterland", "comment_text": "I booked tickets from Salerno to Alcantara via my laptop on the trenitalia website. No problems, easy to use. Included tickets for the connecting ferry to Messina."}, {"username": "Libby Hurcombe", "comment_text": "I’ve bought successfully from Trenitalia website with great prices Haven’t tried Italo though"}, {"username": "Marc Spiegel", "comment_text": "I booked using Omio on my phone and I'm sitting in Thailand. No issues."}, {"username": "K M Uí Fhionnaláin", "comment_text": "Do you have Trainline app? We booked on Italo through that with no problems but from Ireland.Enjoy you holiday🙂"}, {"username": "Liz Warren", "comment_text": "Check that your financial institution hasn’t blocked your account. This happened to us also while trying to book activities from Australia in London and Italy."}, {"username": "Todd N Nicole Clarke", "comment_text": "I’m from Australia and just came home, I booked all my train tickets through Trainline app you can see all options and choose your class and seats"}, {"username": "Brad Beckett", "comment_text": "Always add a travel alert to your accounts if your purchasing tickets from overseas. They use a local credit card processor outside of Australia."}, {"username": "Priya Joan", "comment_text": "Book directly with Trenitalia, you get the cheapest fare."}, {"username": "Gianna Onesi", "comment_text": "I agree try the Trenitalia website but make sure you aren't booking too advance"}, {"username": "Jane Colliver", "comment_text": "From my experience I had a problem using a debit card that monies come out of your account vs an actual credit card. Also I have also read on a previous post that to rent a car n book into hotels a credit card is needed. I haven’t been to Italy yet so can’t fully verify that but good to know in case."}, {"username": "Tracey Finney", "comment_text": "Hi Alison, I am from Australia also and travelling in September. I booked all my train travel through Italo and Italia Rail on the internet. I booked the tickets back in May of this year. I have not seen that error before."}, {"username": "Marina Trainor", "comment_text": "Peter"}, {"username": "Alison Simon-Ostan", "comment_text": "Thanks for all of your helpful advice. Turns out it was a card issue. I tried 3 different Westpac credit cards, they all failed. I used a NAB visa and it worked. Glad it’s all booked now."}, {"username": "Annette Sparks", "comment_text": "I’m from Australia and booked through Trenitalia. I had issues with purchasing Colosseum tickets - are you with Westpac by any chance?"}]}, {"id": "2203351096730635", "text": "We are planning a few days in Taormina. What hotels would you recommend with a view of the sea below and at the center of the town. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203351096730635/", "likes": 0, "comments": []}, {"id": "2203352953397116", "text": "Will be in Atrani in September and want to travel to Montecalvo. Any thoughts", "link": "facebook.com/groups/1373361046396315/permalink/2203352953397116/", "likes": 0, "comments": [{"username": "Glor Ols", "comment_text": "Here's a thought have a wonderful time, we'll be waiting to see photos"}]}, {"id": "2203355063396905", "text": "I'm looking for a suggestion for a farm or vineyard that offers both cooking classes and accommodations (to stay the night) in the Val d'Orcia area of Tuscany. Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2203355063396905/", "likes": 1, "comments": [{"username": "Ana Ka", "comment_text": "we did this one.... i think its in val d'orcia but not 100 percent sure. it was absoutely fantastic! https://\ncookintuscany.co\nm/"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.tuscan-chef.\ncom/\n?gclid=CjwKCAjwt\n52mBhB5EiwA05YK\no_7Nrjstx6xPcvl\nRORSj2ShR632HvI\nJuycTB165edTPbC\nCXrhmm9DBoCXy0Q\nAvD_BwE"}, {"username": "Alice Francesca", "comment_text": "In Pienza sleep at CHIOSTRO DI PIENZA!"}]}, {"id": "2203356800063398", "text": "Going to Milan/ Lake Como for 6 days. Planning on going to lake Como for 2 nights/ 3 days. Shouldwe stay in Como or one of the towns (Bellagio, Menaggio, Bellano, Tremezzo)?", "link": "facebook.com/groups/1373361046396315/permalink/2203356800063398/", "likes": 0, "comments": [{"username": "Bev Madill", "comment_text": "Definitely one of the towns. I love Varenna."}, {"username": "Kasia MacDuda", "comment_text": "We stayed in Mennaggio two weeks ago. It was beautiful. Easy ferry ride to Bellagio and Varenna. Lovely restraunts and shops in area."}]}, {"id": "2203359230063155", "text": "Trying to choose between an evening or daytime golf cart tour in Rome. Part of our group has been to Rome before but some haven’t. I know seeing things lit up would be cool but would it be preferable to see things in the daylight? Thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2203359230063155/", "likes": 2, "comments": [{"username": "Sunny Lang Fan", "comment_text": "Same question here ☺️"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Depends on the temperature"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203360010063077", "text": "Best part of the city to stay in Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2203360010063077/", "likes": 0, "comments": []}, {"id": "2203360256729719", "text": "Best location to stay in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2203360256729719/", "likes": 13, "comments": [{"username": "Diana Bonifaci", "comment_text": "Rione Monti or Trastevere"}, {"username": "Mary Grech", "comment_text": "Via Nazionale walking distance to everywhere."}, {"username": "Sande Ricci", "comment_text": "Campo di Fiori."}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton Cavalieri"}, {"username": "Larry Dash", "comment_text": "A couple of blocks from Piazza Navona near the Tiber. Easy walking to everywhere although a bit of a walk to the Borghese Gardens"}, {"username": "Susan McClellan", "comment_text": "F"}, {"username": "Giulia Biasini", "comment_text": "Pantheon. You are walking distance from every attraction"}, {"username": "Pat Cray", "comment_text": "NAVONA Square!!\nLovely"}, {"username": "Dixie Kotylak", "comment_text": "We stayed at hotel mediterraneo…lo\nved the location and old world charm. ❤️"}, {"username": "Lorrie Kenseth", "comment_text": "Romanico Palace Luxury Hotel & SPA was awesome. On the east side and walkable to everything."}, {"username": "Becky Schneider", "comment_text": "I’m not sure you can go too wrong staying anywhere, but we always stay in Trastevere. It’s quaint and lots of great food"}, {"username": "Lorissa Gill", "comment_text": "Trastevere"}, {"username": "Starla Dawn", "comment_text": "Hotel Barocco"}, {"username": "Michele Boubede Granito", "comment_text": "Trastevere"}, {"username": "Cindy Murillo-Hunter", "comment_text": "F"}, {"username": "Pierre Desnoyers", "comment_text": "Doubletree Monti"}, {"username": "Rusty Robertson", "comment_text": "Near the metro"}, {"username": "Trevor Ian Wright", "comment_text": "Una Roma hotel it’s 5 minutes walk from Termini train station"}, {"username": "Nancy Lewis", "comment_text": "Valadier Hotel.\nCheck it out. Small designer boutique hotel yet surprisingly affordable. Central location a few blocks from Spanish steps!"}, {"username": "Deborah Coram", "comment_text": "Campo di Fiori or Trastevere"}, {"username": "Meagan McGee De Armas", "comment_text": "We stayed in an air bnb right by the pantheon. So close to everything! Walking no more than 15 mins in any direction to see the sites."}, {"username": "Len Len", "comment_text": "I would definitelly avoid Termini area - not very nice and definitelly not safe according to many locals, good price for the accomodation though. Everything in Rome is a walking distance (at least for me). Walked around 120km in 4 days, many nice places and streets to discover. First time we stayed close to the American embassy, second time near the Vatican city, both OK."}, {"username": "Anna Nardone", "comment_text": "Monte"}, {"username": "Manal Ali", "comment_text": "Follow"}, {"username": "Rebecca Yeoh", "comment_text": "Pantheon / Piazza Navona / Campo de’ Fiori – best for first time visitors. Easily walk to major sights of the city. Don’t stay near Roma Termini."}, {"username": "David King", "comment_text": "We had a amazing stay at https://\npalazzovelabro.i\nt/\n\nJust across the bridge from Trastevere and along the backside of the Palatine Hill… 10 minute walk to the Coliseum and Forum entrance. Peaceful, quiet, and so walkable… our 2 bedroom suite had a separate living room and kitchenette, and great views!!"}, {"username": "Kathryn Wall", "comment_text": "I stayed at a great hotel in St Peters square- literally at the square. Residenza St Paola VI- very nice with a gorgeous Terrace"}, {"username": "Vaishnavi Pattabiraman", "comment_text": "Thank you for this question….I also have the same question. For first timers, and a female solo traveler- kindly make suggestions for staying in Rome."}, {"username": "Laura Celaya", "comment_text": "Follow"}, {"username": "Greg Transue", "comment_text": "Carole Transue"}, {"username": "Jim Corlett", "comment_text": "Navona square"}, {"username": "Andy Kav", "comment_text": "Piazza Argentina"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Trastevere"}, {"username": "Alyssa Gillis", "comment_text": "We stayed in the San Pietro neighborhood in a VRBO outside of the Vatican near St. Peter’s Basilica. It was a quiet neighborhood with restaurants and grocery stores a 3/4 minute walk, about a 7 minute walk from Saint Peter’s Square, 20 minutes from Castel San Angelo. I would wholeheartedly stay there again, and recommend it, though you’d have to be prepared to get buses or Ubers (anywhere from 12-25 minutes), into the more touristy areas of Rome, like Piazza Navona, Colloseo, Pantheon, Borghese Galleries etc."}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Maria LoSurdo", "comment_text": "I’d stay in the Centro Storico (historic/city centre) if possible."}, {"username": "Al-agouri Amal", "comment_text": "Cipro 🙏"}, {"username": "Matea Bonić", "comment_text": "Via Merulana (near Termini, near Coloseum, near Metro stations)"}, {"username": "Barbara Aitken", "comment_text": "F"}, {"username": "Ilona Daškevič", "comment_text": "Amazing place near San Pietro and Vatican. Metro Cipro 2 min walk 🙂"}, {"username": "Grace Rogers", "comment_text": "F"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I’d say Monti area, a little less touristy but still walking distance with the center"}]}, {"id": "2203360730063005", "text": "I’m stumped my cousin and I are going to Italy end September for 3 weeks she wants to go to Croatia also, I have 2 plans fly to venice stay 2,3 days ferry to porec 2 days train to split 2 days train to Dubrovnik 2 days ferry to Bari get car stay 4 days drive to Venice train to lake comp probably stop in between fly out Milan. Or fly into Milan lakeआणखी comp Verona day trips venice cruise from Venice that goes to split Dubrovnik Bari Greece Messina Naples off at Rome. Forgot ferry only runs Wednesday to Bari till 10/18. Sorry it’s so long but struggling thank you", "link": "facebook.com/groups/1373361046396315/permalink/2203360730063005/", "likes": 0, "comments": [{"username": "Jenny Payne", "comment_text": "Heck the ferries are going from Italy end of September? as definitely not running in October so we are flying from Rome,split return🌻"}, {"username": "Diana Smith", "comment_text": "The second itinerary looks great. How about the ferry to Brindisi?"}, {"username": "Diana Smith", "comment_text": "In any case you go to Greece after Dubrovnik then Brindisi if there is a ferry."}]}, {"id": "2203362620062816", "text": "Venice", "link": "facebook.com/groups/1373361046396315/permalink/2203362620062816/", "likes": 21, "comments": []}, {"id": "2203363116729433", "text": "Has anyone on this page done the Best of Venice, Florence & Rome in 10 days Rick Steves Tour?\nWould love feedback from those who have done this tour! Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2203363116729433/", "likes": 1, "comments": [{"username": "Ana Ka", "comment_text": "I have, and it was good, but I prefer this one i think, as it has different people there doing the tours and is a little more in-depth rather than generic: https://\nappyguide.com/ i think they have some famous historians there too, which was a nice bonus tbh"}]}, {"id": "2203378963394515", "text": "We plan to be in Florence on Easter and have a tour planned to Sienna and San Gimignano. The tour guide says things won’t be closed. Any opinions on that.", "link": "facebook.com/groups/1373361046396315/permalink/2203378963394515/", "likes": 0, "comments": [{"username": "Pietro Adami", "comment_text": "Towns will be open :-)\n\nJokes apart, Easter is a great time for visiting those areas"}, {"username": "Ana Ka", "comment_text": "Seems that yes, they are open, like the san gimignano museum: http://\nwww.sangimignano\nmusei.it/eng/\norari.htm BUT the church with its famous frescoes may be closed because they may have easter service there,...."}, {"username": "Alice Francesca", "comment_text": "Easter is peak tourist season for Italians too!"}]}, {"id": "2203391100059968", "text": "Hi, good day to everyone\nWhat is the best way to travel from Paris to Florence?\nIs it possible to take a bullet train from Paris to Florence? If yes which website should I book\n\nPlanning to stay\nFlorence - 4 night\nVenice - 2 night\nMilan - 4 night\nPlease advise is it enough?\n\nAny recommendation hotel for 2A 1T 1C\nWe will be in Italy next year May\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2203391100059968/", "likes": 0, "comments": [{"username": "Frannie Kaplan", "comment_text": "Not sure about bullet train but there might be some overnight trains.. also check out flixbus. 4 nights in Milan is too much unless you're using it as a base"}, {"username": "Chris N Lynn", "comment_text": "Rome2Rio will have answers.\nMore than likely you can take SNCF from Paris to Zurich. Zurich to Milan and Milan to Florence."}]}, {"id": "2203393076726437", "text": "Favorite view from your hotel room from any where in Italy. Go!! 🇮🇹 ♥️😍", "link": "facebook.com/groups/1373361046396315/permalink/2203393076726437/", "likes": 37, "comments": [{"username": "Suzie LG", "comment_text": "View of the lagoon in Venice from the Danieli Hotel…San Marco area"}, {"username": "Mike Makofske", "comment_text": "Don't have a pic, but I remember a lovely view of the Umbrian valley from our room at the Hotel Giotto in Assisi. It had just finished raining, and there were double rainbows in the distance."}, {"username": "Kathleen Hammer", "comment_text": "Kathleen Hammer"}, {"username": "Jessica Nichols", "comment_text": "Milan ♥️"}, {"username": "Michelle Louise Pearce", "comment_text": "We stayed in the centre of Florence. We had the smallest, beautiful balcony, that we wasn’t expecting, with this beautiful view 🥰"}, {"username": "Marita Sundin", "comment_text": "Continental Hotel i Sorentto"}, {"username": "Roger Almanza", "comment_text": "Airbnb in Florence. This is off the primary bedroom"}, {"username": "Roger Almanza", "comment_text": "Airbnb in Rome. Off the kitchen. Spent many evenings just drinking wine people watching 😁"}, {"username": "Stefano Bressanelli", "comment_text": "Montisola, lago d'Iseo. North Italy. Lombardy."}, {"username": "Giulia Cardamone", "comment_text": "Airbnb opposite Teatro Massimo in Palermo!"}, {"username": "Phillip Farquhar", "comment_text": "Lake Garda"}, {"username": "Trine Kindtler", "comment_text": "Dogliani"}, {"username": "Liselott Ekenlöv", "comment_text": "Positano"}, {"username": "Jenny Larsen", "comment_text": "Orvieto from our monastery stays room"}, {"username": "Jenny Larsen", "comment_text": "Jenny Larsen"}, {"username": "Lindsay Stewart", "comment_text": "Festival of St. Nicola Bari 2022"}, {"username": "Melinda Bourke", "comment_text": "Palazzo de Cupis rome"}, {"username": "Sephora Cutajar", "comment_text": "Airbnb in Rome - Camilluccia area😌❤️"}, {"username": "Phillip Farquhar", "comment_text": "Rome"}, {"username": "Melinda Bourke", "comment_text": "Melinda Bourke"}, {"username": "Barb Krieg-Stepien", "comment_text": "Our Terrace in Positano 💕\nAirbnb"}, {"username": "Jamie A White", "comment_text": "Lake Como didn’t disappoint."}, {"username": "Phillip Farquhar", "comment_text": "Naples hotel napolit amo"}, {"username": "Esther Starren", "comment_text": "Esther Starren"}, {"username": "Felicity Hills", "comment_text": "Felicity Hills"}, {"username": "Niin Dvali", "comment_text": "Agerola"}, {"username": "Milana Leytman", "comment_text": "Florence"}]}, {"id": "2203408556724889", "text": "Recommended self-guided walking tours in Florence, Venice and Sorrento? I want to take in the sights, visit really good stores and be close decent lunch locations.", "link": "facebook.com/groups/1373361046396315/permalink/2203408556724889/", "likes": 1, "comments": [{"username": "Ana Ka", "comment_text": "I really loved these, but i think they are only florence and tuscany... not sure they have venice... https://\nappyguide.com/"}]}, {"id": "2203413063391105", "text": "I have a tax refund inquiry: we are travelling by train and will be in Rome ,then travelling to Nice France ,then Barcelona , then will fly out of Paris. I have read that if we fly out of Paris we cannot claim the tax from the previous countries . So how do we go about it if travelling by train? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2203413063391105/", "likes": 0, "comments": [{"username": "Luca George Tudor", "comment_text": "You have to go to the customs at the last airport before leaving the EU, in this case Paris. They will want to see the goods that you bought to make sure that you are taking them out of the e.u. and will put a stamp on the forms that you have. After that fill in your credit card number, take a picture of the forms with the stamp on just to be sure, put them in their evelope and put them in the mail box, normally no stamp is required because already paid by the compay but check that to be sure. Within a few months they will put the refund on the credit card, if not write them with the pictures of the stamped form that you took and ask for refund again."}, {"username": "Debby Finn Martino", "comment_text": "You can get the tax forms stamped in any EU country. Download the Global Blue app, most stores use this, so you can track your refund. I received my refund on my credit card in 4 days after returning to US. If they ask to see your purchases they must be unused."}, {"username": "Dawn Marie", "comment_text": "I entered and left from VCE. In Greece I went to the global blue office and got my vat refund for my purchases in Greece. Look for an office and plan to stop"}]}, {"id": "2203415823390829", "text": "I heard a lot of restaurants will be closed near end of August, ( I will get there on the 22nd) and that’s when Italian residents take their vacations. Will I be able to find a really good restaurant? Side note; I am taking Finnair nonstop. Any experiences with them I’d love to hear about. TIA! ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2203415823390829/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "You will have no problems at all. Almost all restaurants are open in touristic areas. You might find some shops closed, but again that probably won't happen in the city center"}]}, {"id": "2203426670056411", "text": "Is anyone familiar with Perugia? I will be attending a wedding there this fall. Any advice on what towns/places to visit near Perugia?", "link": "facebook.com/groups/1373361046396315/permalink/2203426670056411/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "Perugia is a beautiful city and you could spend a couple of days there. In Umbria you could also visit Spoleto, Foligno, Lake Trasimeno and its islands , Bevagna, Rasiglia and Spello."}]}, {"id": "2203458350053243", "text": "Just a question about buying train tickets from airport. Should you prepurchase? Just hard to estimate how long it will take to get through customs etc", "link": "facebook.com/groups/1373361046396315/permalink/2203458350053243/", "likes": 0, "comments": [{"username": "Jojo Hanna", "comment_text": "I’d wait and buy at the station. Less stress and gives you time to grab a coffee, stretch your legs etc"}, {"username": "Laura Uribe", "comment_text": "The Leonardo Express runs every 15 minutes until 10:45pm so you won’t have a long wait. Just buy your ticket when you’re ready."}, {"username": "Bambi Harris", "comment_text": "I prepurchased my leonardo express tickets from airport to roma termini because we have two more trains to catch. You can use that particular ticket throughout day so it doesnt have to be a specific time, one less headache"}]}, {"id": "2203459460053132", "text": "Hello all,\nI’m going to Italy in late September / Early October. Just wanting to see if you can still swim in Amalfi / Cinque Terre?", "link": "facebook.com/groups/1373361046396315/permalink/2203459460053132/", "likes": 2, "comments": [{"username": "Mieke De Cnodder", "comment_text": "Good question 😁 we will be there too in the beginning of october"}, {"username": "Veronica Parravicini", "comment_text": "It’s autumn but you can definitely expect warmer days!\nLast year I was in cinque terre in the middle of October and one day was so warm you could swim"}, {"username": "Dana Danutza", "comment_text": "I will be there also, late october"}]}, {"id": "2203463933386018", "text": "No crowds in Rome, beautiful morning 💖", "link": "facebook.com/groups/1373361046396315/permalink/2203463933386018/", "likes": 978, "comments": [{"username": "Emma Holmes", "comment_text": "Kevin Holmes Meghan Sargison & Harry we need to be venturing out early! Coffee, pastry, trainers and off!"}, {"username": "Maria Sardi", "comment_text": "no crowds because it doesn't open until 9am"}, {"username": "Paula Luca", "comment_text": "One of my Favourite sites ! ❤️Pantheon makes u feel like your stepping back in time...And of course the Collisium too.....❤️"}, {"username": "Tricia Deenee", "comment_text": "Has the fountain that is in front of the Pantheon also disappeared?"}, {"username": "Sony Ucciferri", "comment_text": "what time were you there ?"}, {"username": "Ans de Vries", "comment_text": "Johanneke de Vries"}, {"username": "Rebecca Yeoh", "comment_text": "Spanish Steps in June. Taken at 8:45am. Def head out early to avoid crowds 👌🏼"}, {"username": "Pierre Côté", "comment_text": "What time???\n\nEnjoy!"}, {"username": "Heather Gianoli-Hinkley", "comment_text": "They were all at the Vatican today"}, {"username": "Carole Tarlap", "comment_text": "WHY???"}, {"username": "Lyn Pappas Dahm", "comment_text": "I love being out as Rome is waking!"}, {"username": "Meiian Lai", "comment_text": "Carolina Sousa甘綺雯"}, {"username": "Brian Sturkie", "comment_text": "Seema Parmar Sturkie- another confirmation we need to figure out how to stop finishing dinner at 11-12pm 😂😂😂"}, {"username": "Esther Steinbok Sustersich", "comment_text": "Trevi around 7:30 AM"}, {"username": "Christine Matthews", "comment_text": "6am?"}, {"username": "Kieran Edwards", "comment_text": "Stacey Edwards"}, {"username": "Gianna Marie", "comment_text": "Jess Kellen"}]}, {"id": "2203471180051960", "text": "Does anyone know if a reliable taxi or car service near Bellagio? We are staying in a villa outside and need transportation on Wednesday after the last ferry. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2203471180051960/", "likes": 0, "comments": []}, {"id": "2203472143385197", "text": "Recommendations for a spontaneous lunch in Florence?\n\nPeople recommended it in Rome, but my experience is the caveat is that Trastevere is the best area for spontaneity… city center was very much a miss with regards to lunches.", "link": "facebook.com/groups/1373361046396315/permalink/2203472143385197/", "likes": 2, "comments": [{"username": "Lucrezia Folger", "comment_text": "Where ever you find yourself that day. Stroll the back streets, off the heavily tourist areas. That's where I eat."}, {"username": "Sandy Hookerman Kriger", "comment_text": "Caffe D' Oro along side of the Arno by the PV🩵"}, {"username": "Anne Gee", "comment_text": "La Madia was great"}, {"username": "Ana Ka", "comment_text": "for us in florence it was this place: https://\nwww.fermento1889\n.com/ but i think they are only open for dinner"}, {"username": "Elena Innocenti", "comment_text": "Buca Poldo"}, {"username": "Dafne Vassetti", "comment_text": "Go to Santo Spirito Square and search for a place there ;)"}, {"username": "Bri Flosi", "comment_text": "I loved Gusta Pizza and Gusta Panini"}]}, {"id": "2203472796718465", "text": "Hi all,\n\nI had booked train ticket from Florence to Pisa with trenitalia.\nI want to ask if this ticket under free seating as I was not asked to make seat selection.\n\n** Regional train", "link": "facebook.com/groups/1373361046396315/permalink/2203472796718465/", "likes": 0, "comments": [{"username": "Matteo Basile", "comment_text": "Yes all regional train under free seating. Only be sure to get onto the correct car as there may be some 1st and 2nd class coaches. Inf the ticket is online purchase you do not need to validate and you can take every regional train in the following 3 hrs. If you purchase the ticket directly in the ticket office then you need to “validate” it before boarding the train"}, {"username": "Fiona Cameron", "comment_text": "You can’t make seat selection on regional train."}, {"username": "Wendy Byrnes", "comment_text": "Not a chance in hell will you get a seat allocation on a regional train without booking first class. Your ticket entitles you to board the train, and not get fined. The rest is pot luck.\nTrash your ticket and book first class reserved seating.\nPut the loss down to experience."}, {"username": "Elaine Valte-De Jesus", "comment_text": "I had to book Business Class in Italo high speed train because I wanted to choose our seats."}, {"username": "Elena Innocenti", "comment_text": "Yes"}, {"username": "Nguyen An", "comment_text": "I booked a first class ticket from Varenna to Milan on a regional train. There are so many people that once the train arrived, everyone started to jump in no matter 1st or 2nd class coach and we have to stand all 45 minutes during the trip. No one came in to check for the ticket as well. So it’s up to your luck anw."}, {"username": "Pao Magnoler", "comment_text": "Regional train you seat wherever you want, free seat."}]}, {"id": "2203479340051144", "text": "Hi everyone, just wondering if anyone has done a day trip to Portofino from Florence.\n\nI'll be going to Italy this October and I was thinking of taking an early train (3 hrs) from Florence to arrive in Portofino for 11am. Spend the day there then take the 6pm train back to Florence.\n\nI've been to Portofino before so this day trip would be to have lunch with a friend and then just wander about.\n\nThoughts? Is a day trip possible/worth it?\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203479340051144/", "likes": 0, "comments": [{"username": "Ana Ka", "comment_text": "Too far i think for a day trip..."}, {"username": "Louis Des Forges", "comment_text": "You also have to take a bus from S. Margherita Ligure to Portofino. I went in April, on the way back I was waiting for over 45 minutes as the first 2 buses were jam packed and the next bus was bedlam as well (plus then the actual journey back to the train station). Once you factor in taking a bus in addition to the train you will spend longer travelling back and forth than exploring Portofino.\nBTW There were very few taxis available, did see a few people come out of the queue but think they were quoting over €50."}]}, {"id": "2203479393384472", "text": "Hello, please what are the best app that you use in your travel and where it’s used ?", "link": "facebook.com/groups/1373361046396315/permalink/2203479393384472/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203480803384331", "text": "Out of curiosity. Does anyone know of amy good shuttle transfers in Rome? We need to ideally get from airport to hotel then eventually hotel to port for our cruise. Thanks 😁", "link": "facebook.com/groups/1373361046396315/permalink/2203480803384331/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "Train ? There is a Leonardo express that I think runs every 20 mins from the airport to Roma termini"}, {"username": "Karen Ries", "comment_text": "Romecabs.com is who I used"}]}, {"id": "2203486836717061", "text": "For the Americans traveling “alla cases” doesn’t mean your dinks are on the house 🤣😬😳. It means at the cashier.", "link": "facebook.com/groups/1373361046396315/permalink/2203486836717061/", "likes": 9, "comments": [{"username": "Angela Cagna Gaberel", "comment_text": "Alla cassa? Means at the cashier, “della casa” means self produced from the owners"}, {"username": "Leila Myftija", "comment_text": "Alle casse (plural) or alla cassa (singular)"}, {"username": "Joe Guzzi", "comment_text": "In ogni caso."}, {"username": "Paolo Berardi", "comment_text": "Alla cassa means to pay at the cashier.\nDella casa means that the wine is not bottled."}, {"username": "Aaron Peterson", "comment_text": "All Americans keep your dinks off the house and the cashier, they will probably appreciate that"}, {"username": "Alessandro Iannelli", "comment_text": "The Italian equivalent of \"on the house\" would be \"offre la casa\", or in some cases maybe \"offre la ditta\". If anyone ever hopes to hear this, abandon this hope."}, {"username": "Nathalie Séguin", "comment_text": "Oh I have a funny story on that subject. We were eating at a delightful restaurant in Rome where most of the patrons were locals. We had an amazing meal (anyone say Cacio e Peppe?). Anyhow, at the end, the owner offered us his homemade limoncello on the house. It was our first time in Italy and just discovered this nectar of the gods. We loved it so much we ordered a few extra rounds. The owner then told us we had had enough and asked us to leave. At that moment, we were not sure why because we were being \"good\" Canadians enjoying a great evening. Well, as it turned out, the owner thought we were taking advantage of his generosity by ordering extra limoncello which we had every intention to pay!!! Thankfully, we were able to clear that up with him and we all had a good laugh. Lesson learned: never order more of a free \"drink\" without indicating: per favore aggiungilo al mio conto 😂"}, {"username": "Isabelle Avl", "comment_text": "La Casa = house (plural: le case)\nLa Cassa = cashier (Paga alla cassa Plural : alle casse)\n« On the house » = offre la casa (literally : it’s offered by the house)"}, {"username": "Yvonne Ormson", "comment_text": "Oh my gosh—autocorrec\nt?! 😂"}, {"username": "Michelle Plutto", "comment_text": "Lol!!"}, {"username": "Etschi Bruckner", "comment_text": "\"alla cases\" doesn´t mean anything..."}, {"username": "Louise Maree", "comment_text": "‘Dink’ is an old Australian slang word for giving someone a ride on the handlebars of your bicycle 🤣"}]}, {"id": "2203488833383528", "text": "Italy transportation\n\nHi! How do you plan your transportation in Italy. We will be in Milan, Florence, Rome, Sorrento this September. I came across Trenitalia but some advised to book tickets in advance. My husband and I do not want to have strict time schedules but worry about the cost if we dont plan ahead.\n\nHow do you get around the city (Rome, Milan etc) as well. Does the tickets need to be booked in advance too? Thank you so much!", "link": "facebook.com/groups/1373361046396315/permalink/2203488833383528/", "likes": 2, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Often fares are much cheaper if booked in advance especially when selecting business or higher class of service. We only do advanced purchases when we need to be at the destination at certain time of the day especially a long distance travel such as Napoli to Milano"}, {"username": "Jenny Payne", "comment_text": "I use Italo train company often and I usually book my ticket the day before as it is a fast train and only does major cities. I walk everywhere in Italy as I show friends around and often we get a taxi from our hotel and walk back as it is not easy to get a taxi as the traffic is so busy unless you go to a taxi rank🌻"}, {"username": "Colleen Dawson", "comment_text": "Rome2rio is a great resource for planning travel from A-B. Seat61 is also a great website to look at, will give you information about train travel in Italy."}, {"username": "Janet Borrello Peppard", "comment_text": "If you are going between major cities, book the frecciarossa tickets on the Trenitalia app. You can compare the travel times to find the best trips/fares. Public transportation was fairly easy to use ….you can buy single or multi day tickets once there. Download Moovit app to see best way to get to local attractions."}, {"username": "Dafne Vassetti", "comment_text": "In the cities you get around with public transport (bus, metro) or taxi. You buy tickets at Tabacchi Stores, Newspaper stands, ticket machines (for metro) or ticket booths. No need to by them in advance. In some cities you can get a daily, weekly pass. In others you get a ticket valid for 60 minutes or more from when you validate it."}]}, {"id": "2203494560049622", "text": "Taking our first to Italy in the next few weeks. Itinerary includes Rome, Florence and Venice and then heading down to the Puglia region and ending in Naples. We have 19 nights. Is this too ambitious? Just interested in feedback. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2203494560049622/", "likes": 3, "comments": [{"username": "Jenny Payne", "comment_text": "How have you worked out how many days your staying in each town? Allow for travelling as most airb&b u can’t get in till 3pm or later 🌻"}, {"username": "Sally Warren", "comment_text": "Sounds great!"}, {"username": "Suzie LG", "comment_text": "19 nights seems pretty generous! Have a wonderful time!"}, {"username": "Lucrezia Folger", "comment_text": "19 days, 4 places sounds great! You'll have time in every city. Many people attempt this in 7-10 days!! Have a great time!!"}, {"username": "Jennifer Gustafson", "comment_text": "We did 3 nights Venice, 4 Florence, 4 rome, 4 Amalfi coast."}, {"username": "Doug Burke", "comment_text": "I think it's fine. Have a great trip!!"}, {"username": "Ana Ka", "comment_text": "seems fine :). Enjoy your trip :)"}, {"username": "Rachael Richardson", "comment_text": "We just did 3 nights Venice 2 Pisa 2 Florence 3 sorrento 3 Vico Equense 4 Rome has an absolutely brilliant time , you need to be fairly fit, just drink plenty , take a hat and enjoy every minute !"}, {"username": "Starla Dawn", "comment_text": "Oh that’s plenty I did more places and included Sicily in 10. And somehow it didn’t even feel crazy rushed. Private drivers helped a lot."}, {"username": "Annette Reyes", "comment_text": "Thank you so much! This group is always so wonderful and supportive 🇮🇹🫶🏼"}, {"username": "Roland Trego", "comment_text": "Puglia is the issue. It takes a long time to get there. (Rome to Polignano a mare is 5 hours by train.) And it's best to have a car to see Puglia. Rome 4, Florence 2 + 2 Tuscan villages Siena, Lucca, or San Gimignano, Venice 2, Puglia 4-5, Naples 2, back to Rome 1."}]}, {"id": "2203494933382918", "text": "Morning people,\n\nLooking for recommendation for -\nTop halal food places in Milan and Turin….\n\nAny good shisha loung spots in Turin / Milan\n\nTIA\n♥️", "link": "facebook.com/groups/1373361046396315/permalink/2203494933382918/", "likes": 0, "comments": []}, {"id": "2203495493382862", "text": "Travelling to Italy mid September- 4 days Rome & 4 days Florence. 2 adults and 2 boys who are very keen Mountain bikers - Probably a long shot but any recommendations for MTBing near Rome or Florence.? Tours, bike hires, companies we can be out in contact with ..?", "link": "facebook.com/groups/1373361046396315/permalink/2203495493382862/", "likes": 0, "comments": []}, {"id": "2203498840049194", "text": "Hey Everyone - we are in Sicilia, Italy in September this year. We will have a car and we are planning on driving from Syracuse to Rifugio Sapienza to catch the cable car up to Mt Etna in the am. Post our visit to Mt Etna we want to stop into a winery for lunch wine tasting on the way to Taormina - any suggestions which winery to stop at? Also what time to book at the winery after Mt Etna. How long does it take to descend and drive to winery?", "link": "facebook.com/groups/1373361046396315/permalink/2203498840049194/", "likes": 1, "comments": [{"username": "Melanie Brock", "comment_text": "Any recommendations\nfor wineries on the way from\nany Etna to Taormina"}]}, {"id": "2203499383382473", "text": "Looking for feedback - Florence tours for two adults and two kids (10 and 13)\n\n✅- pizza and gelato cooking class in a Tuscan farmhouse “tour” from Florence.\n-✅cinque Terre excursion- the sent of the sea 12.5 hr tour with lunch", "link": "facebook.com/groups/1373361046396315/permalink/2203499383382473/", "likes": 1, "comments": [{"username": "Ana Ka", "comment_text": "Sounds wonderful! Kids will love pizza class! We also used this website for ideas on what to see and for when we wanted to be on our own without the guide: https://\nappyguide.com/"}, {"username": "Camille Meigneux", "comment_text": "👀"}]}, {"id": "2203500590049019", "text": "Looking for feedback - Rome tours for two adults and two kids (10 and 13)\n\n✅- colosseum with cost to arena floor, forum and palatine hill\n-✅ Vatican museums and Sistine chapel skip the line\n✅ Rome underground - the catacombs\n✅ancient spoons way, aqueducts and catacombs e bike tour\n\nAny other good ideas to options with kids\n\nThey live music / bands / keen drummer and guitarists", "link": "facebook.com/groups/1373361046396315/permalink/2203500590049019/", "likes": 1, "comments": [{"username": "Dafne Vassetti", "comment_text": "Try food tour in Monti neighborhood area with Walking Palates. You can book through Viator. I think it's something fun to do with the kids.\n\nColosseum and Vatican are not very Child friendly. Colosseum+Roman\nForum it's two hours. Vatican almost 3 hours. Lots of historical information is given out. Kids might loose their attention after 50 min at the most unless the guide is very good also with kids (especially for the 10 year old). I am sure they will love the catacombs and the bike tour!"}, {"username": "Stacey Esposito", "comment_text": "My kids ages 11 and 16 hated the vatican. We were there during the 98 degree day which did not help. It was beautiful my 16 year old got more out of it than my 11 year old. The things they loved and may or may not work for you. We rented a car drove to verona to see juliet s balcony and ate lunch in the town. We could have spent more time here just walking around. In the town is a store with Harry Potter merchandise and picture ops that Mt kids loved for a quick stop. From there we drove to Maranello to see the Ferrari museum which took about an hour in there and my son ( 11 year old) and husband loved. Just some ideas for you."}, {"username": "Stacey Esposito", "comment_text": "Stacey Esposito"}, {"username": "Stacey Esposito", "comment_text": "Stacey Esposito"}]}, {"id": "2203510483381363", "text": "Hi fellow travellers, we are driving from Catania to Bari and looking for somewhere to stay overnight on our way.\nWould prefer to be closer to Bari to catch a flight the next day but open to suggestions - thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203510483381363/", "likes": 0, "comments": []}, {"id": "2203511446714600", "text": "Hello Everyone, I am in Florence now, where can I buy leather and gold products?", "link": "facebook.com/groups/1373361046396315/permalink/2203511446714600/", "likes": 23, "comments": [{"username": "Debora A. Diaz", "comment_text": "The Gold Market."}, {"username": "Jacqueline Corry Cicione", "comment_text": "Jacqueline Corry Cicione"}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "Following"}, {"username": "Vincent Liwanag", "comment_text": "Most of their leather goods are Made in Tuscany. Look for Lorenzo!"}, {"username": "August Thick", "comment_text": "Go the leather market in the San Lorenzo area of Florence."}, {"username": "Gemma DeVoldre", "comment_text": "Anywhere… you see them. By the Republiq area and San Lorenzo Cathedral. There pretty much anywhere there."}, {"username": "Theresa Thomas", "comment_text": "Cellini Gold."}, {"username": "Lauren Velleno", "comment_text": "Il Perseo Leather. I went there based on many recommendations\nand I’m happy I did! Sam helped me find the perfect purse."}, {"username": "Karla Kodanko", "comment_text": "Peruzzi Leather.\nThe Gold Corner."}, {"username": "Enrico Lecce", "comment_text": "In the center"}, {"username": "Frank Hunt", "comment_text": "Many leather goods are now Chinese imports, check the labels first before you buy, even then….🤷‍♂️"}, {"username": "Theodore Meyer", "comment_text": "Leather San Lorenzo market, gold Ponte Vecchio or all over."}, {"username": "Rhonda Smith", "comment_text": "Persephone Leather… I was not disappointed!"}, {"username": "Dawn Peters", "comment_text": "The Gold Corner 💛"}, {"username": "Dean Pecorari", "comment_text": "Sounds like a tourist trap"}, {"username": "Maria Sullivan", "comment_text": "Gold…. At Vaggi on the bridge . Have been fabulous over 45 years ."}, {"username": "Phyllis Waring", "comment_text": "Head to Piazza Santa Croce. There is a famous leather factory there which makes and sells exquisite quality leather purses..jackets\n..boots..etc. Also check out the outstanding leather stores and vendor stalls located nearby the Piazza!! Prices are reasonable!!"}, {"username": "Lisa Barra", "comment_text": "Coccinelle store. Look up address. beautiful leather handbags and accessories. Madova gloves right near Ponte vecchio."}, {"username": "Dawn Alioto", "comment_text": "Il Perseo leather has authentic leather and was highly recommended by a friend. The owner, Sam is very friendly and helpful too."}, {"username": "Bill Elias", "comment_text": "Literally everywhere."}, {"username": "Jenny Payne", "comment_text": "The best place for leather is from a Florentine person ,no one else the only guy I buy bags from are at the markets next to H&M where the boar is in one of the main streets going over the\nPonte Vecchio , be careful,I have lived in Florence off and on for a long time 🌻 or the department store Rinascente"}, {"username": "Toni Marie", "comment_text": "Peruzzi for leather"}, {"username": "Jean Flannery Mehrkens", "comment_text": "Following"}, {"username": "Jean Flannery Mehrkens", "comment_text": "Shannon Jean Sarah Mehrkens Molly Mehrkens"}, {"username": "Cynthia Cooke Newcombe", "comment_text": "Exciting, update us all on which places you liked."}, {"username": "Jen A Dee", "comment_text": "Following"}, {"username": "Kim Mazzilli", "comment_text": "Sada jewelry on bridge"}, {"username": "Sonya Daley", "comment_text": "We went to the leather school and bought some beautiful items and they will ship for free"}, {"username": "Giovanni Palma", "comment_text": "Mr. Leather, he has a spot on the MERCATO and a big store around the corner. Good prizes."}, {"username": "Annabella Pojer", "comment_text": "Just walk around and check out all areas for quality & price for gold it easy in Firenze 😀leather at markets 👍"}, {"username": "Ana Ka", "comment_text": "Ponte Vecchio for gold since the medieval times. Leather it depends.... many places. I heard this one is good, but havent been tbh: https://\nwww.pelletteriaa\nrtigiana.com/"}, {"username": "Scott Perry", "comment_text": "Benheart is a nice place for leather."}, {"username": "Blanca Gil", "comment_text": "Leather at Infinity Firenze on Borgo Santi Apostoli"}, {"username": "Amy Moran Weltin", "comment_text": "Amy Moran Weltin"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Bojola for leather"}, {"username": "Dixie Kotylak", "comment_text": "Ponte Vecchio!"}]}, {"id": "2203519256713819", "text": "Hi! My husband and I will be visiting Rome next month. Any suggestions on the best way to buy tickets for the Vatican tour? Would it be better to buy it directly from the Vatican website or through one of the guided tours?", "link": "facebook.com/groups/1373361046396315/permalink/2203519256713819/", "likes": 0, "comments": []}, {"id": "2203514483380963", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2203514483380963/", "likes": 0, "comments": []}, {"id": "2203228653409546", "text": "Rome/Vatican City:\nWe were lucky to secure tickets to guided tour to the Vatican Necropolis at 11:30 am.\n\nMy question is because of different entrances for each tour does it make sense to\n\n1. Climb St. Peter’s Tomb first thing in the morning - 8am\n2. Head to Necrpolis Tour - 11:30am (90 mins)\n3. Grab food\n3. Sistine Chapel try to grab a tour about 3:30\n\nWe will there mid September.", "link": "facebook.com/groups/1373361046396315/permalink/2203228653409546/", "likes": 1, "comments": [{"username": "Kate Carberry Ansart", "comment_text": "If you can get tickets to the Vatican museum for first thing in the morning, I would recommend that. The Sistine Chapel is located in the museum and gets crowded as the day goes on.\nWe booked the breakfast tickets and we were one of the first people in the Vatican - it was awesome!"}, {"username": "Shen Min Chue", "comment_text": "Yes, the above planning makes sense since the entrance for the Scavi necropolis tour is at St. Peter's Square and you simply exit the basilica, going straight out to St. Peter's Square and thereafter can easily get to the start of the Scavi tour. You will be getting back to Basilica again though after the conclusion of the Scavi tour where you will be released inside the basilica."}, {"username": "Monica Saluja", "comment_text": "Hariti Saluja"}]}, {"id": "2203245273407884", "text": "Hi all. I Just wanted to pop on and recommend Hotel Villani if your staying in Florence.\nGreat location in the historic center by Duomo. Friendly helpful staff. Amazing roof top view and clean rooms. I felt the price was reasonable for location. 450 euro for 4 night. Highly recommend", "link": "facebook.com/groups/1373361046396315/permalink/2203245273407884/", "likes": 34, "comments": []}, {"id": "2203273620071716", "text": "Is there a train directly from Rome to Sorrento .. or do you have to stop in Naples?\nCan’t seem to find a direct train service.\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2203273620071716/", "likes": 7, "comments": [{"username": "Christine Golia Brigida", "comment_text": "You have to stop in Naples then take the train to sorrento"}, {"username": "Dimitri Pianese", "comment_text": "No direct train"}, {"username": "Janine Emma Lucas", "comment_text": "Flixbus goes direct"}, {"username": "Sandy Radican Shikaly", "comment_text": "Beautiful High speed trains Italo and Trenitalia go Rome to Naples .. then there is a local train more like the subway in New York.. no thanks to Sorrento.. You can take a bus , hydrofoil or private driver.. We use Amalfi Coast Transfers"}, {"username": "Jason Hobel", "comment_text": "Take the high speed train ( Italo or Trenitalia ) to Naples and then you can take the Campania Express to Sorrento. Campania Express is a tourist train. It is not as nice as the high speed trains but better than taking the local trains. But it runs about every 3 hours so you would have to schedule around that. You can also take a but from Naples to Sorrento or a private driver too."}, {"username": "Josephine Vescio-harris", "comment_text": "The best way is to take train to Naples, then a private driver, that commuter train not so enjoyable"}, {"username": "Karen Kinney Codella", "comment_text": "Hire a private driver from Naples to Sorrento. Worth it!"}, {"username": "Sue Sherwood", "comment_text": "Get off in Naples and take the ferry to Sorrento. You wont regret it!"}, {"username": "Michelle Howard", "comment_text": "Is the ferry a good option?"}, {"username": "Vicky Pierro Altamura", "comment_text": "I took the high speed train from Rome to Naples then took a cab to the port and the ferry to Sorrento. Once you get off in Sorrento you need to take another cab to your hotel."}, {"username": "Giorgio Zanichelli", "comment_text": "No. Just a local train (about 3 or 4 every hour) from Naples to Sorrento\nwhich is not as bad as people say, also you're no better than the locals who take it every day so yeah just take the local commuter train, the commuter train station is right underneath the central station and it's so much cheaper"}, {"username": "Renae Larcus", "comment_text": "Change trains in Naples to Sorrento"}, {"username": "Rachael Richardson", "comment_text": "Book train to Naples and then get the local train to sorrento - just pay when you get there , it’s not that far and it’s not a bad journey"}, {"username": "Colleen Schimmenti", "comment_text": "Hope this helps you regarding local train."}, {"username": "Colleen Schimmenti", "comment_text": "Fast train info"}]}, {"id": "2203260416739703", "text": "Anyone done the day trip from Rome to Tuscany.\nIncluding lunch at a farm/ winery ?", "link": "facebook.com/groups/1373361046396315/permalink/2203260416739703/", "likes": 2, "comments": [{"username": "Hollie Barcheck Juersivich", "comment_text": "Yepper. Pic is the winery we went to."}, {"username": "Michael Westlake", "comment_text": "Fun in Tuscany tours. So the vespa tour to San gimignano and then to their Vinyard"}, {"username": "Sonita Sandhu", "comment_text": "It’s a bit further. Best to stay in Tuscany."}]}, {"id": "2203264520072626", "text": "Recently returned from a trip to Northern Italy w/ my best friend. Favorite part was Venice & seeing Harry Styles’ finale in Reggio Emilia. We stayed in Bologna & also visited Modena & Florence. I wasn’t allआणखी that impressed with any of the pizza we tried but the pasta was incredible. Still can’t figure out why public restrooms aren’t more plentiful 🤔The train was easy to navigate and most natives communicated in English quite well. Except the cab drivers (again 🤔) but we just used Google translate and that worked well. Every Poliza we saw was gorgeous (maybe it’s a requirement over there) 🤷🏼‍♀️ Not sure, but - well done! Got yelled at by one Italian lady who thought I was taking her picture 🙄 “NO PHOTO!” Didn’t realize they only have Coke & Coke Zero but everywhere has bottled water & only cost $1. Tourist souvenir shops were way more affordable than in the states. It was very hot but so worth it. Hope to go back to see the southern part of Italy, but even going back to Venice would be a dream come true.", "link": "facebook.com/groups/1373361046396315/permalink/2203264520072626/", "likes": 265, "comments": [{"username": "Gianna Onesi", "comment_text": "Lol@polizia- yes they are young and gorgeous I remember that lol!"}, {"username": "Kathy Kibbe", "comment_text": "I asked my sister where to get good pizza in Bologna and she said Naples 🤣 That said - so many other amazing things to eat there - the cheese, bread, charcuterie, pasta are amazing and the piadine are fantastic…truly\none of my favorite places in Italy"}, {"username": "Jennifer Walp Rydholm", "comment_text": "So did you try to break the law?"}, {"username": "Andrea Wurm", "comment_text": "I’m so jealous seeing Harry Styles there!! 😍"}, {"username": "Jono Roland", "comment_text": "Looks fabulous! You two look like siblings?🤓"}, {"username": "Mark Andrews", "comment_text": "Mark Andrews"}, {"username": "Jill Brothers", "comment_text": "Agree on gorgeous poliza. How do they get those long eyelashes!."}, {"username": "Laurel Waggoner Archey", "comment_text": "Fun updates! Bologna is for lasagna, ragu Bolognese and Naples is for pizza! Looking forward to the balsamic in Modena... LUCKY YOU to see Harry in Italy!"}, {"username": "Danielle Williams", "comment_text": "Thank you for sharing!!! Terrific photos and information 🤩"}, {"username": "Joyce Plett-Vogan", "comment_text": "I didn't enjoy the pizza in Italy either.\nI love our Canadian pizza!!!"}, {"username": "Pat Pat", "comment_text": "Thanks for sharing this. I’m going in September."}, {"username": "Joanne Smith", "comment_text": "Glad u had a good time"}, {"username": "Bronwyn Rowney", "comment_text": "I’m guessing that you can use the rest rooms in restaurants or bars.??"}, {"username": "Josephine Rauch Rotunda", "comment_text": "Yes, you do look like sisters or related at any rate… Two beautiful ladies! You will always have this wonderful memory of this trip you took together. Take many many more trips over your lifetimes, but make sure most of them are in Italy lol true Naples is known for their pizza, but Rome, Sorrento etc. had wonderful pizza also. I didn’t like the lasagna any place in Italy… I guess I am used to the Americanized version. Thanks for sharing your memories.❤️"}, {"username": "Lina Stump", "comment_text": "Wow you've must have gave to bad places for 🍕, Sicily has the best pizza"}, {"username": "Dafne Vassetti", "comment_text": "And also there is regular Coke, usually waiters ask you what is your preference and they bring you the regular one if that is your choice."}, {"username": "Alice Francesca", "comment_text": "They only have coke and coke zero? Our supermarkets and cafes have plenty of all kind of sodas and fruit juices.."}, {"username": "Jeidy Christina Duarte", "comment_text": "I'm from Florence, pizza is a Neapolitan specialty and not from all of Italy. You must know that each region in Italy has its own typical dishes. If you want to eat a good pizza in northern Italy you have to look carefully in restaurants. Not all restaurants specialize in Neapolitan pizza. Pasta in the north is especially good in the regions of Emilia Romagna and Tuscany because there is a long tradition. Last point, unfortunately in Italy they don't speak English, because it's not easy to learn it in Italy, but citizens are trying to learn it, especially the new generations and those who work in tourism. I hope you had fun 😁😁😁"}, {"username": "Phyllis Snyder", "comment_text": "I live in Mexico and public restrooms are few as well- it’s the cost of maintaining them."}, {"username": "Phyllis Snyder", "comment_text": "Pretty ladies!"}, {"username": "Frances McDonagh", "comment_text": "I got an amazing pizza in Bologna but you are in wrong place for pizza that is more Naples pasta is good in Bologna and Florence"}, {"username": "Michelle Cummins", "comment_text": "Me and my bestie are meeting in Rome next May for our combined 50th celebration, just us and the Amalfi Coast! 🥂 Sounds like we need to get arrested - thanks for the tip 🤣\nKim Grace"}, {"username": "Fran Fitzpatrick", "comment_text": "Going back in 2024.I think once you go there you are compelled to go back.We did two weeks in Rome,Tuscany,Fl\norence and Venice.Going back to Rome and Florence for a few days each and then 3 weeks in Sicily.Can’t wait to go back!"}, {"username": "Valerie Collanton", "comment_text": "Glad you found people who spoke English well just keep in mind in Italy they speak Italian"}, {"username": "Pamela J. Roe", "comment_text": "Looks like an amazing time!"}, {"username": "Michele Baron Vold", "comment_text": "Where did you stay in Bologna?"}, {"username": "Maria Costi", "comment_text": "In Greece is also a requirement I think for men to be hot to be a cop!\nEvery single one!"}, {"username": "Pao Magnoler", "comment_text": "You have to know where to eat pizza, if you are eating near the Duomo in Florence, you will find more like an American pizza, you have to know we're."}, {"username": "Philip Curnow", "comment_text": "Next time you go, drop the Coca-Cola and seek out Chinotto. Roma and Naples for pizza of course. South Italy? Matera of course."}, {"username": "Lisa Mullins", "comment_text": "Amanda Mullins"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "So happy you lived your visit!!! Hope to welcome you again.\nThe best pizza I ever ate was in Napoli"}, {"username": "Taryn Walter", "comment_text": "How many nights would you recommend to stay in Venice so that you feel you really get so see and enjoy it? Any recommendations\non accommodation for couples?"}, {"username": "Kathy Fryer", "comment_text": "Thank you for sharing this!"}, {"username": "Susan Beebe", "comment_text": "We were just in Venice and left the day before Harry’s concert.😩🥲🥲. We found the wall where Harry filmed a scene in “My Policeman”."}]}, {"id": "2203274586738286", "text": "Hi,\n\nMe and my husband are planning a week tour in Rome on January to avoid crowd with our 8month old baby. Yes a week, so we can explore and enjoy without making our baby very tired.\n\nWe are struggling if weआणखी will bring stroller or baby carrier and if Rome is toddler friendly? i fear cobbled streets and lots of stairs and toilets.\n\n(we are used to more colder climate so winter is not a problem, just not rain)\n\n**pic for attention**", "link": "facebook.com/groups/1373361046396315/permalink/2203274586738286/", "likes": 28, "comments": [{"username": "Larry Dash", "comment_text": "MamalovesItaly.\ncom/\nRome-with-a-baby"}, {"username": "Serena Mascheretti", "comment_text": "I would do baby carrier! A lot of stairs and subways."}, {"username": "Cathy Saultzman", "comment_text": "You can’t post an amazing photo without telling us where this is. 😜"}, {"username": "Tari Lawson", "comment_text": "I think carrier would be easier."}, {"username": "Lisa Lord", "comment_text": "Lots of cobblestone in Rome! I think the carrier would be more comfortable for baby and the carrier 😊 We too are going to be in Rome in January! Keeping fingers crossed for good weather 🤞🏻Have a great time!"}, {"username": "Mary Lee Ellington Mrochek", "comment_text": "It’s been a while, but we took both a jogging stroller (Bob) and a carrier. Only a jogging stroller will work on those cobblestones! I would not take a regular stroller."}, {"username": "Amber Jozsa", "comment_text": "Just went to Rome the other day with my 4 month old I would bring Both. We used the stroller for around the fountain de trevi. Yes its cobblestone but we had no problem getting around. We used a travel stroller that folded to fit in a bag and I just held him on the subway, but saw plenty of people with strollers on them they just used the elevators to get around. Worked well for us cause it was hot and he could have a fan on him"}, {"username": "Kate Laidlaw", "comment_text": "Currently in Rome and have not seen many prams or wheelchairs. Those that are, the poor kids are having a very bumpy ride and then the dads carry it up/down stairs. You’d had a lot more freedom to explore with a carrier 😊"}, {"username": "Jocelyn Blanke Sia", "comment_text": "I’m in Rome right now and see some strollers parked in entryway of places, so it seems people use them. 🤷🏻‍♀️"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I would bring both. A stroller is great because you don’t have to carry your baby all day (but not a stroller like yoyo with super mini wheels, you need something with slightly bigger ones, I had one with 3 big and it was perfect). But for some visits the carrier wins because with the stroller it’s just impossible (like the Coliseum and Forum)"}, {"username": "Diana Bonifaci", "comment_text": "Rome is not toddler friendly!! I would bring a carrier but if it is very hot maybe a stroller too?"}, {"username": "Maree Bauckham", "comment_text": "We spent 8 nights in Rome earlier this year and have been in January also. It was brilliant both times in the cooler, less crowded months of the year. It was lovely too, not having to travel every couple of days to a new place and we felt we had a much more rested holiday. I will leave the question about stroller versus baby carrier for others that have experienced taking babies to answer, but yes there are lots of stairs and cobbled areas especially in the ruins. Enjoy 😊 your trip."}, {"username": "Elouise Missy", "comment_text": "Bring both, but expect you’ll mostly use the baby carrier. We just got back and didn’t end up using the pram, it was too much hassle. The cobblestones and stairs are tiring!"}, {"username": "Lisa Johnson", "comment_text": "We were there in January of this year and it wasn't cold (and we're from Australia!!) it was a pleasant 16to 18 degs Celsius. My husband was in thongs (flip flops) most of the time and we were getting strange looks from all the Europeans 😂😂 I would personally avoid a stroller, baby carrier would definitely be best. The streets are uneven. Also, barely a toilet in sight, so this may be an issue. I kept buying coffees so I could use the restrooms. Have a blast!"}, {"username": "Alexis Sweeney", "comment_text": "We just did Rome with our 8 month old, she did great in the carrier but it was obviously very hot for us. We took lots for drink breaks in between attractions so not having the stroller while stopping into different bars was nice. In January it will be much much cooler so I would not mind doing the carrier again. However, after we left my husband and I decided that next time we think we could bring the stroller and do fine. I think this is contrasted to our visit to Positano a couple days before where we would never dream of bringing a stroller. Way too many stairs, Rome is much more flat and there are alternative routes to avoid some stairs. My suggestion would be to invest in the cheap $100 travel stroller that’s floating around on Tiktok. It folds up fairly slim so you can store it away on the train, bus, wherever. I think that’s our game plan for the next trip. We currently live in Pisa where the sidewalks are similar. We’ve never used a jogging stroller and have been fine thus far. There may be some bumps here and there but our babe doesn’t mind."}, {"username": "Jazmin Avila", "comment_text": "We used our uppa baby vista stroller for our two babies (3 month old and 21 month old) the entire time. Sidewalks everywhere. Very doable. But I do recommend a good hefty stroller. Not just any stroller would hold up on the older streets in my opinion. Maybe if it’s only for a week? Our stroller worked wonderfully. I had a carrier too but we were there all month of July so it was way too hot for me to carry. We also had a rental car. But if you plan on doing more public transport or taxi then a stroller may be more hassle than what it’s worth to you unless you just plan on walking everywhere. You can most definitely carry if you’re going in cooler months."}, {"username": "Jenna Phillips Clabeaux", "comment_text": "I’m doing both"}, {"username": "निनावी सहभागी", "comment_text": "Thanks everyone for your helpful answers.\n😉😊"}]}, {"id": "2203278040071274", "text": "Has anyone taken any particular tours in Florence that they found exceptional? Talking about tours dealing with attractions and places within Florence- not to other areas of the Tuscany.", "link": "facebook.com/groups/1373361046396315/permalink/2203278040071274/", "likes": 1, "comments": [{"username": "Tracy O'Brien Boulle", "comment_text": "F"}, {"username": "Lisa Lord", "comment_text": "When I first visited Italy in 2018, we used the tour group, Walks of Italy, for Florence and Rome. They were awesome!"}, {"username": "Ana Ka", "comment_text": "I did many tours and this was my most favorite tbh: https://\nappyguide.com/ they have some free stuff too, so you can decide if you like it before paying money."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203280306737714", "text": "Booking train, haven’t seen this before. What do I pick?", "link": "facebook.com/groups/1373361046396315/permalink/2203280306737714/", "likes": 52, "comments": [{"username": "Deb Carlson", "comment_text": "Robin Gault"}, {"username": "Kyra Savoie Miles", "comment_text": "When I was in Australia I took a picture (like you did) of the credit card reader, later looked at my bank statement. It was significantly better in local currency letting my bank do the exchange (as everyone has mentioned)!"}, {"username": "Ashley Martins", "comment_text": "Always choose Euros, you will get a better exchange rate."}, {"username": "Joni Ingram Ellington", "comment_text": "I use my Costco credit card for traveling. They don't charge international fees."}, {"username": "Frannie Kaplan", "comment_text": "Euro"}, {"username": "Liz Fresolone", "comment_text": "Going to Italy, would it be better to go to ATM there?"}, {"username": "Carmine Castiglia Jr", "comment_text": "The question not asked is, why are you buying train tickets in advance?\n\nDo you have a reason for doing so? Are you certain that it is a valid reason?"}, {"username": "Raquel Pickering", "comment_text": "I'm just depressed looking at your rate. Australian conversion is gutwrenching. 😞😓😩"}, {"username": "Shelly Stowell", "comment_text": "Euros!"}, {"username": "Laura Hall", "comment_text": "Euros"}, {"username": "Phyllis Snyder", "comment_text": "Local currency always- euros"}, {"username": "Mario Torre", "comment_text": "Weird because the Cdn $ is the better deal !"}, {"username": "Leilani Nemeroff", "comment_text": "Let your credit card convert it, and use a card without a conversion fee."}, {"username": "Marina Trainor", "comment_text": "Peter Bella Mario"}, {"username": "Renee Rundle Stoneham", "comment_text": "Always use local currency not US. Your bank will give you a better exchange rate."}, {"username": "Jennifer Smith", "comment_text": "Always choose euros"}, {"username": "Scott Taylor", "comment_text": "Always pay in native currency"}, {"username": "Patty Ham", "comment_text": "Pay in the local currency - your credit card will give you the best exchange rate."}, {"username": "Bobby Jo", "comment_text": "Choose euros. That exchange is not good"}, {"username": "Hartmut Huber", "comment_text": "Better pay in EURO"}, {"username": "Caitlin Quinlivan", "comment_text": "pay in euro. it will work out cheaper"}, {"username": "Lalita PosBa", "comment_text": "Download the Trainline oficial app. I think You can see more choices 😀"}, {"username": "Lalita PosBa", "comment_text": "And I was told to choose Euros at all times."}, {"username": "Bozena Pawelek", "comment_text": "Dollars!\nOtherwise you get fees for exchange"}, {"username": "Keith Crossley", "comment_text": "The exchange rate right now is you get US 91 cents for one euro. Here they're taking 4 cents from you."}, {"username": "Dorian Ziedonis", "comment_text": "Pay in local currency with your visa or MC, they'll get best exch rates. Buon viaggi!"}, {"username": "Ana Ka", "comment_text": "I always choose local currency"}, {"username": "Sam Sabrina Haney", "comment_text": "Use Euros, but before you go make sure the card you are planning to use doesn’t charge you an extra fee for foreign exchange. vis Capital One does not but Chase does charge for foreign exchange."}, {"username": "Rita Bivona Morgan", "comment_text": "euros"}, {"username": "Jennifer Johnson Mayes", "comment_text": "Euros"}, {"username": "Zak Walker", "comment_text": "Looks like you’re choosing whether you want to pay in USD or Euros. If you have USD select that. If you have Euros, select that."}, {"username": "Michael Barnes", "comment_text": "The smaller number, definitely.\n😅"}, {"username": "Brad Beckett", "comment_text": "Send it in Euros if you have a USD account. If you check the exchange rate the USD amount is about $10 higher. Let your bank back home do the exchange."}, {"username": "Heather Acaley Lozano", "comment_text": "Always pick the local currency (I assume that is the Euro in this case since it’s on the Discover Italy group). It’s will save you money as your bank will typically have a better conversion rate than the vendor you are paying through."}, {"username": "Katie Heron", "comment_text": "My bank charges a fee to convert to USD, so i always pay in local currency"}, {"username": "Lauren Slann", "comment_text": "Always better to pay in the currency of the business or site in this case. The exchange rate they offer you is normally much worse than what your bank/credit card will convert to"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Euros"}, {"username": "Susan Motley", "comment_text": "Always euros or you have to pay the exchange rate fee that they can mark up"}, {"username": "निनावी सहभागी", "comment_text": "Thank you!!"}, {"username": "Kristin Zdonek", "comment_text": "Always choose the local currency ; just make sure you’re using a no foreign transaction fee card . Current exchange rate is .91€ to $1.00 , so you’re losing value with their rate ."}, {"username": "Ian Beyer", "comment_text": "Always use local currency and let your bank do the math."}, {"username": "Tom Walsh", "comment_text": "I would go Euros. When travelling I use our CC, and it’s cheaper to pay in Euros than convert to your currency (in our case CAD)."}, {"username": "Zach Hunter", "comment_text": "Always pick local currency. It’s never a good idea to let local businesses to set their own exchange Rates."}, {"username": "Janine Emma Lucas", "comment_text": "Always book foreign charges in the local currency"}, {"username": "Silvia Scholz Natal", "comment_text": "I always choose the currency from the country I’m in!"}, {"username": "Eric Parks", "comment_text": "I just checked my bank and their rate is just slightly better. I'd take the USD option just in case of added fees. (Net difference for me was $5 in favor of the euro rate, but you may have added fees)"}, {"username": "Sandra Maldonado", "comment_text": "They are charging $0.04 more then today’s exchange. That’s an increase of about 6 bucks. I’d take my chances back home."}, {"username": "Michelle Boudreau", "comment_text": "I'd hate to see what they would be charging in Canadian dollars. Yikes! The exchange rate is approx. $1.50 atm"}, {"username": "Elizabeth Yu", "comment_text": "Always pay in local currency, besides, according to Google, the current exchange rate is $1 USD = 0.91 Euros."}, {"username": "Alla Zats", "comment_text": "Euros. Let your bank convert the currency"}, {"username": "Ewa Żołądek", "comment_text": "Will you please reply to these 141 messages?😄"}, {"username": "Barbara Bastianini", "comment_text": "Always choose the local currency. In this case pick Euros."}, {"username": "Katie Zapp", "comment_text": "If you are putting it on a credit card, make sure your card doesn’t charge extra for international transactions. Simple call to your credit card"}, {"username": "Neika Toota Kelley", "comment_text": "It says there’s a markup if you exchange so use the local currency the euro and let your bank do the conversion for free"}, {"username": "Linda Jo Rice", "comment_text": "Always take local currency. Your bank gives better exchange rate than vendor"}, {"username": "Chris McLaughlin", "comment_text": "Local currency"}, {"username": "Robert Lawshe", "comment_text": "Pretty obvious. In Euro"}, {"username": "Pamela Weber Voges", "comment_text": "Always euros…your bank will give you the best exchange rate."}]}, {"id": "2203283226737422", "text": "Which app have you found to be the most helpful for drinking water fountains in Italy please?", "link": "facebook.com/groups/1373361046396315/permalink/2203283226737422/", "likes": 1, "comments": [{"username": "Eric Parks", "comment_text": "Waidy"}]}]