[{"id": "2208876179511460", "text": "Italia Dolomites Sella Passo", "link": "facebook.com/groups/1373361046396315/permalink/2208876179511460/", "likes": 79, "comments": [{"username": "Sarah Bognuda", "comment_text": "Spectacular!"}, {"username": "Gianna Onesi", "comment_text": "Stunning!!"}, {"username": "Jonathan Catoe", "comment_text": "When were these photos made?"}, {"username": "สฐาปนพงศ์ ก้องวัฒนะสกุล", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Paul Davis", "comment_text": "Baruch Lerman: what time of year is this? The landscape is toast which surprises me given the cool climate. We were there last month and everything was lush."}, {"username": "Laura Chen", "comment_text": "Where is this"}, {"username": "Brittany Bullock", "comment_text": "Zack Williams"}, {"username": "Lisa Warman", "comment_text": "Magnificent 🤩"}, {"username": "Nie Xiaoqian", "comment_text": "I've been to Italy, but I've never been to this place, and I feel like I can shake hands with God.😁"}]}, {"id": "2208876552844756", "text": "Italia Carezza", "link": "facebook.com/groups/1373361046396315/permalink/2208876552844756/", "likes": 5, "comments": []}, {"id": "2208879136177831", "text": "Italia Burano", "link": "facebook.com/groups/1373361046396315/permalink/2208879136177831/", "likes": 98, "comments": [{"username": "Morgan Dragicevich", "comment_text": "Leigh Brown we’ll definitely have to do here. I’ll put our itinerary together this weekend"}, {"username": "Amanda Stewart", "comment_text": "Karen Stewart so beautiful 😍"}, {"username": "Wilma Resta", "comment_text": "Wilma Resta"}, {"username": "Debbie Horton Rough", "comment_text": "These are amazing pictures… how long were you there ? ❤️🧡💙💚🩵🩷💜"}, {"username": "Tanya Bitar", "comment_text": "What a beautiful island! Love your pictures."}, {"username": "Tanya White", "comment_text": "Jennifer Linda 👏👏"}, {"username": "Émélie Chalifoux", "comment_text": "Francis Mailloux"}, {"username": "Rita Sharma", "comment_text": "Will be there in 2 days . Can’t wait ."}]}, {"id": "2208885642843847", "text": "I am looking for suggestions as to what to do, not to do and where should I family eat and stay on New Years Eve and New Years day in Naples, Italy???", "link": "facebook.com/groups/1373361046396315/permalink/2208885642843847/", "likes": 0, "comments": [{"username": "Victoria Seidman", "comment_text": "Stay at Decumani Hotel de Charme!!"}]}, {"id": "2208886362843775", "text": "Hi All,\n\nI am packing for my trip to Italy in 2 weeks and I’m picking out dresses. This may be a silly question, but a couple of my dresses that cover my knees for church tours have small cut outs on theआणखी abdominal area. If I were to wear a white button down shirt to cover my shoulders - and therefore my abdomen - would the dress be allowed? The two dresses I’m questioning are pictured here. Again, I’d be wearing a white linen button down shirt as my shoulder covering, so I could cover my stomach with that as well.", "link": "facebook.com/groups/1373361046396315/permalink/2208886362843775/", "likes": 58, "comments": [{"username": "Rebecca Jensen", "comment_text": "Do know if it is humid, your feet will swell up and be more apt to rub. Take mole skin for those rub points."}, {"username": "Annette Tamminga", "comment_text": "I remember being young and having abs and no hips. 🤣. They look very nice and a shirt over the top will be fine. Black may be warm but depends where and when you are going. Nice for dinner."}, {"username": "Jess Joe", "comment_text": "Ijust pull the dress up a bit to join the split. It's only while you are inside, then just pull it back down."}, {"username": "Nissa Nolan Foster", "comment_text": "I've done an oversized white shirt over my midi slip dresses and it worked nicely for going to dinner after churches when the weather got cooler :)"}, {"username": "Nancy Day", "comment_text": "Yes on both"}, {"username": "Josie Mammone", "comment_text": "If you go to the Vatican they give you free shawls to wear."}, {"username": "Patricia Carper", "comment_text": "As long as you can close/button the shirt. My daughter had on one like your blue one with a short jean jacket ( in May) and one guard wanted to kick her out of St. Peter’s. Luckily another guard came over and let her close her jacket and continue our tour."}, {"username": "Phyllis Snyder", "comment_text": "Just take a scarf to wrap around."}, {"username": "Maria Walker", "comment_text": "As long as your shoulders are also covered you will be ok. Of course abdomen needs to be too.Pack a scarf that helps if you have nothing else."}, {"username": "Teresa Heran", "comment_text": "Both would work with your linen shirt. Both look great on you. 💕"}, {"username": "Sarah Hirsch Keller", "comment_text": "You’ll be fine with a shirt. A lot of people just bought scarves there as a cover too"}, {"username": "Sarah Hirsch Keller", "comment_text": "I actually saw a lot of people in shorts that would wrap a scarf around their waist like a sarong and get in without any problem."}, {"username": "Joanne Smith", "comment_text": "Love the dresses"}, {"username": "Carol Scotton", "comment_text": "Yes"}, {"username": "Bob Miller", "comment_text": "But the churches can put paintings up all over with nude women."}, {"username": "Gail Lafferty", "comment_text": "Why not always just tuck a chiffon scarf/shawl into purse or pocket?"}, {"username": "Elizabeth Grafel", "comment_text": "Bring a scarf to cover your shoulders if going to church in Italy!"}, {"username": "Sharon Milligan Martin", "comment_text": "Fine"}, {"username": "Annette Ciuffreda-Masi", "comment_text": "Wear your dress have your white linen shirt . if need be tie the shirt in a knot around your waste to cover the mid section and shoulders. Once your no longer in the church take the shirt off."}, {"username": "Theresa Vucina Rocca", "comment_text": "Yes cover midriff with your shirt. I just saw where a girl with her back cut out had to buy a scarf. Some churches are stricter than others. In Ravenna you could wear sleeveless shirts however other churches or Sistine Chapel not. So just to be prepared, carry a scarf."}, {"username": "Judy Dameron Kapsimalis", "comment_text": "Yes"}, {"username": "Amy So", "comment_text": "No. Bring a scarf of something like that to cover. My daughter has similar outfits and my husband had to take off his shirt (he had a t shirt inside) to let my daughter cover it up."}, {"username": "Joanne-Peter Hart", "comment_text": "A button up shirt would be perfect to solve the problem. Shoulders, midriff and knees need to be covered in all churches, not just the Vatican. Saw ladies being turned away at St Mark’s Basilica in Venice. Ladies were upset as they had purchased tickets."}, {"username": "Tania Lyons", "comment_text": "Omg please!!!!\nDress respectfully when going in to any Churches in Italy how difficult can this be!!!!\nIf not please don’t enter any churches.\n\nI love to Dress up but keep it for your dinner nights out!!"}, {"username": "Melissa Flanigan", "comment_text": "Just take a scarf !!!! Cover your shoulders and whatever with a scarf/\npashmina!! Only place I saw knees to be covered was Florence - just been respectful about length ie butt cheeks hanging out of demin shorts and a pashmina to\nCover everything else !!"}, {"username": "Gloria Maledi", "comment_text": "it's ok, you can wear a shorter one, I've never had a problem, I've lived in italy my whole life and I don't own any long dresses"}, {"username": "Rob K-Zarka", "comment_text": "Sandi K-Zarka, have you considered this?"}, {"username": "Grian Schaeffer", "comment_text": "Just respect their rules. You’re a guest. If you question the dresses, you already know the answer…\nTake something appropriate for these occasions and take these black dresses for dining or whatever 🤷🏼‍♀️"}, {"username": "Julia Titus", "comment_text": "Yes, just wear a white button down over it for church. Both dresses are stunning on you, especially the black. Where did you get it ?"}, {"username": "Lea Dry", "comment_text": "Absolutely!"}, {"username": "Sarah Istwany", "comment_text": "Both great!"}, {"username": "Vanessa Huff", "comment_text": "You can show whatever you want, as long as knees and shoulders are covered! Saw some interesting dresses while there a few weeks ago! Lol!"}, {"username": "Dawn Reau", "comment_text": "Cute!"}, {"username": "Jen Belsito", "comment_text": "I think that would be fine."}, {"username": "Judith Mark Truyol", "comment_text": "Any of them with the white shirt over them will be ok"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Just pull up the bottom part of the second one, should be fine"}, {"username": "Erin Mitchell", "comment_text": "Will be fine."}, {"username": "Jenni Vail", "comment_text": "Yes!! But where did you get them!? 🤗"}, {"username": "Terri Orf", "comment_text": "Either works. With the shirt."}, {"username": "Sarah Bridget", "comment_text": "You'll be grand, a shirt covering skin will be appreciated by the guards and guides in the more religious areas. Well done for being thoughtful though!"}, {"username": "Diana Subkova", "comment_text": "It's fine, but I saw that in some cathedrals and chirches they are giving something to cover. Like one time use, so you will be fine even without shirt :)"}, {"username": "Josephine Enrile", "comment_text": "Works with shirt but hot and humid weather in Aug need loose and light colored dress"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "More evening wear I think. Too hot for black."}, {"username": "Fil Minichiello", "comment_text": "I always just tie a large cotton scarf to my handbag strap so I have something to throw over quickly"}, {"username": "Tamera Pence", "comment_text": "Yes"}, {"username": "Kim Aranha", "comment_text": "Make sure the shirt covers your tummy - the church will appreciate you showing the respect"}, {"username": "Véronique Poisson", "comment_text": "Both are OK for the church"}, {"username": "Christine Verbeek", "comment_text": "Absolutely acceptable. Ppl break all the rules and they don’t really enforce it. Definitely take a couple scarves, always handy. That’s a great travel dress 👍"}, {"username": "Holly Frederick", "comment_text": "Of course as long as both are covered"}, {"username": "Nikki Blosser", "comment_text": "Yes of course. If your stomach and shoulders are covered it would be fine..👍🏼"}, {"username": "Dunia Aldyni", "comment_text": "No just put scarf 🧣 over your shoulders"}, {"username": "Jo Tunnicliffe", "comment_text": "The dress code conversation always reminds me of our trip to Rome many years ago. Whilst waiting in the queue to go into the Vatican one of the security was having a conversation with a couple and their daughter who wanted access, although the mom and dad were dressed appropriately they would not let them in due to what the daughter was wearing, she had on short skirt and a cropped vest top, the dad said she is a child and only 11, to that the guard turned around and said then why let her dress like a prostitute?! The family walked away embarrassed and an upset child, so even kids are not always immune to this regulation."}, {"username": "Grace Tufano Impastato", "comment_text": "They do not bother you if your knees show but must cover shoulders"}, {"username": "Janice Finn Clemans", "comment_text": "Absolutely fine"}, {"username": "Sarah Brass", "comment_text": "They will be perfectly fine even without a coverup. I saw all kinds of outfits in Italy, in all kinds of places, and they were not told to cover up. You can always tie one around your waist or have it in your bag just incase."}, {"username": "Nadia Mckenna", "comment_text": "That sounds perfect"}, {"username": "Andrea Romano", "comment_text": "Yes , shoulder and knees covered. Shirt should work"}, {"username": "Delia Miscella Wroblewski", "comment_text": "You’re going to be hot in black. I brought a few black dresses and the only time I wore one was on the flight back to the US."}, {"username": "Linda Copeland", "comment_text": "Both will be fine with the shirt, but make sure you wear comfortable shoes!"}, {"username": "Jenny Godfrey", "comment_text": "Lots of women are wearing this sort of style dress this year so don’t worry just have a top or scarf to cover when going into religious places like churches and your be fine. Im in Venice now was in Florence few days ago and lots of women and girls have this style outfit"}, {"username": "Bethany Rudy", "comment_text": "Yes, that should be fine"}, {"username": "Benita Hauskins", "comment_text": "That’s fine with wearing the linen shirt. Enjoy your trip!"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Yes!"}, {"username": "Jonathan Kancir", "comment_text": "I’ve seen dresses that covered less so you should be golden"}, {"username": "Wende Shurin", "comment_text": "Yes, both would work with the shirt."}, {"username": "Robyn Smuin", "comment_text": "Yes, you'll be fine."}, {"username": "Lisa Powers", "comment_text": "Yes"}, {"username": "Anna Gambino", "comment_text": "Short will be fine. Cute dress 🇮🇹"}, {"username": "Sherry Held", "comment_text": "Yes!"}, {"username": "Liz Staab", "comment_text": "the one on the left likely because the shirt draped on you will cover that skin"}, {"username": "Jennifer Smith", "comment_text": "Following"}, {"username": "Tania Vázquez", "comment_text": "The dress is fine, I went with one similar! I had a pashmina for cover my shoulders and the hole in the dress. And everything was fine. it's light and easy to carry"}, {"username": "Jorge Ronay", "comment_text": "Yes, both would work. Just cover your shoulders with a shall before entering any holly place."}, {"username": "Karen Jones", "comment_text": "Where is the dress with the triangle cutouts from? Both are super cute!"}, {"username": "Sue Tamblyn", "comment_text": "At the Vatican last week and the majority followed the dress rules. Those that did not certainly did not cover shoulders and the majority of men wore shorts!"}]}, {"id": "2208817756183969", "text": "Anyone here used mydaytrip.com aka: Daytrip for transfers, tours? Good idea? Bad?", "link": "facebook.com/groups/1373361046396315/permalink/2208817756183969/", "likes": 0, "comments": [{"username": "Nicole Goodwin", "comment_text": "My sister in law is a travel agent of 35 years, she recommends & uses them when she travels. I'm considering using them for a Naples to Sorrento transfer."}]}, {"id": "2208840789514999", "text": "Lago di Tenno, Italy😍🇮🇹!", "link": "facebook.com/groups/1373361046396315/permalink/2208840789514999/", "likes": 2, "comments": []}, {"id": "2208852452847166", "text": "Italia San Gimignano", "link": "facebook.com/groups/1373361046396315/permalink/2208852452847166/", "likes": 352, "comments": [{"username": "Rosemary Sheldrick", "comment_text": "Absolutely gorgeous!!!🙋🏻‍♀️♥️♥️♥️♥️♥️♥️♥️"}, {"username": "Debra Burroughs Disario", "comment_text": "One of my favorite places"}, {"username": "Bonny S Boggs", "comment_text": "Bonny S Boggs"}, {"username": "Donna Hinton", "comment_text": "Beautiful area!!"}, {"username": "Diane Henderson", "comment_text": "Thais place was amazing. Loved it."}, {"username": "Sandy Kennedy", "comment_text": "I want to live there forever and ever and ever!!"}, {"username": "Lynn Mcconnell", "comment_text": "Donna Spencer this is where we are going one afternoon while in Siena"}, {"username": "Cara Bowman", "comment_text": "Amazing pics!"}, {"username": "Cláudia Donini Ardengue", "comment_text": "Eu pude contemplar de perto essas belezas a poucos dias atrás... é tudo lindo 🤩🤩"}, {"username": "Rita M. Basulto", "comment_text": "Loved St Gimignano!"}, {"username": "Kelly Peagler Myers", "comment_text": "Charles Myers Shawnna Chance"}, {"username": "Joan Romiti", "comment_text": "We enjoyed our visit, wasn’t that crowded as I see here. Stayed just outside, in a bnb it was lovely.."}, {"username": "Jessica Stewart", "comment_text": "Ron Stewart"}, {"username": "Lois Letterie Cianci", "comment_text": "Awesome pictures! Love San Gimignano, one of my favorites, was there in October and can't wait to be back in 2024!!"}, {"username": "Geraldine Calabrese Anello", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Peter Antal", "comment_text": "One of the best place❤️"}, {"username": "Petra Pechan Groves", "comment_text": "Keryl Lesley Edwards this is near the place you sent me today."}, {"username": "Carolyn Atkin", "comment_text": "Rene Kilmartin not long to go and that will be us 🏛️🧳"}, {"username": "Barbara Judge", "comment_text": "Barbara Judge"}, {"username": "Enolita Castillo", "comment_text": "Been there...missing\nthis beautiful place a lot"}, {"username": "Lisa Kay", "comment_text": "What is the name of the shop with the lovely cheese?"}, {"username": "Mary Sandor White", "comment_text": "Glad to hear of all the raves about this town. We are staying here in September for 5 days at the Hotel Sovestro. Anyone familiar with hotel/winery?"}, {"username": "Rob McMahan", "comment_text": "Why are people in jackets and sweaters? I thought temps were in the 90’s?"}, {"username": "Kathy St Pierre", "comment_text": "One of our favorite places ❤️"}, {"username": "Hans van Twist", "comment_text": "🇮🇹❤️🇮🇹❤️"}, {"username": "Karen Tanner Rogers", "comment_text": "Beautiful place"}, {"username": "Rachel Blears", "comment_text": "Karl Blears"}, {"username": "Regan Verwey", "comment_text": "So beautiful. We are going next month."}]}, {"id": "2208747979524280", "text": "I met Luisanna on our first trip to Sorrento several years ago. She was an awesome tour guide with a abundant knowledge of the Amalfi region and particularly so Pompeii. I have maintained a FB friendship withआणखी her ever since and, as a matter of fact, will be using her services again in October when she will be spending a day with us at Herculaneum and Naples. Anyone visiting Sorrento or the surrounding area interested in an awesome tour guide, I highly recommend Luisanna of Daydream Tours.", "link": "facebook.com/groups/1373361046396315/permalink/2208747979524280/", "likes": 9, "comments": []}, {"id": "2208760059523072", "text": "I need some help please…we are travelling to Italy (coming from Monaco via Lucca in December towards Florence\nMy question is, is it worthwhile to travel to Italy in December… are most towns closed for the season..and, is Italy big on christmas markets?", "link": "facebook.com/groups/1373361046396315/permalink/2208760059523072/", "likes": 3, "comments": [{"username": "Bill Shafer", "comment_text": "It is definitely worthwhile to travel in December. Italy is beautiful at Christmas time! Most things shut down after the ￼Epiphany in January."}, {"username": "Daisy Yoo", "comment_text": "We are doing in early Dec and can not wait"}, {"username": "Miyuki Kanno Paul", "comment_text": "Only southern resort towns such as Sorrento, Capri, Amalfi coast along with seaside town in north such as Rimini will go dormant. Some do operate year round. The price of hotels goes down significantly from November, so take advantage of the off peak season!"}, {"username": "D'Anna Hohe", "comment_text": "Things are certainly open. You may encounter more rainy weather so be prepared. In general, Italy is not big on Christmas markets except in the northern areas - Bolzano, Trento, etc. Florence does have s Christmas market as well.\nIf, however, your purpose is Christmas markets, Germany, Austria and France are better areas to explore."}, {"username": "Lorraine Cronje", "comment_text": "Thank you! We cannot wait…"}, {"username": "Carlotta Crespi", "comment_text": "Closed? Why should towns be closed? December is clearly not \"beach season\" but Italy is an all year round living country , not a gigantic amusement park that would shut down once the \"season\" is over..."}, {"username": "Fiona Mac", "comment_text": "Milan markets are great x"}]}, {"id": "2208745639524514", "text": "Hi everyone!\n\nWe are in Lake Como a few days next month. We have secured a private transfer to take us to Bellagio and from there I know we operate the ferry system. As I’m looking at tickets I’m trying to understand if I should book tickets in person or online. I know I will absolutely NEED to get a ferry to Varenna because we stay there afterआणखी Bellagio. Will tickets run out if I wait til I’m in Italy?\n\nIt’s very possible I’m doing this wrong but I can’t select the time I want. It just gives me an “adult ordinary fare” for the day I selected. Thoughts?\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208745639524514/", "likes": 20, "comments": [{"username": "Alison de Lisle", "comment_text": "Fast ferries can only be booked in person on the day. It’s a first in basis. Not sure about Bellagio to Varena but when you want to get back to Como you’ll need to book on the day."}, {"username": "Lauren Neely", "comment_text": "It’s easy! Even on Easter Sunday (super crowded time!) we were able to walk up and book tickets for within 35 minutes. There will be a ticket booth and they will tell you where to stand to wait for the next ferry to your destination"}, {"username": "Michele Liggett", "comment_text": "My understanding is you can't get ferry tickets in advance."}, {"username": "Danni Whitby", "comment_text": "I ordered my ferry tickets online. I’m here now and have taken 3 ferries today. Sometimes they’re a little late but they show eventually. The lines are INSANE so definitely but your tickets in advance online. Having said that, not ONCE have they checked my tickets coming on haha"}, {"username": "Andrea Hirsch", "comment_text": "We were just there last week and stayed in Bellagio. Absolutely no need to buy ferry tickets ahead of time!"}, {"username": "Beth Spiehler Selvia", "comment_text": "Just walk up to the ticket booth and purchase as needed. Also, if you need to get across the lake quickly on a timeline, there’s an option to go on the hydrofoil instead of the ferry. It’s more expensive, but very quick. We used the ferry for leisure travel and the hydrofoil on our departure morning. It allowed us to sleep in a bit and get to the train station quickly."}, {"username": "Susan Rodway", "comment_text": "We bought them right before getting on the ferry."}, {"username": "Kay Rendall", "comment_text": "I tried to book on line but it us not possible. Was at Tourist info today at Como and she confirmed. U have to book on day, lines r extreme. She told me need to be at 7.30am to get tickets for 9am. At 8 this morning there was already 30 min wait in line to buy tickets. However she said as soon as I arrive in Bellagio to buy return ticker, as lines r less early in day."}, {"username": "Luanne Carey", "comment_text": "We always get them right at the ferry stop. Haven’t had an issue in all the years we’ve been going to Como. Have fun!"}, {"username": "Katie Skeens Leonard", "comment_text": "This makes me feel a little better thank you everyone! Just trying to be as informed as I can be !"}, {"username": "Renae Larcus", "comment_text": "Just buy them at the pier. Easy."}, {"username": "Ibbu Mohd", "comment_text": "Buy online\n\nnavigazionelagh\ni.it/en/\ntickets-and-time\ntables-lake-com\no/"}, {"username": "Basia Szokarski", "comment_text": "So easy to take public ferry from varenna to Bellagio. No need for advance tix. Just get an hour or so in case they sell out last minutep"}, {"username": "Liva Klein", "comment_text": "I tried to book in advance for end of August and website says they are sold out. Checked for October to see if that's system error and I guess it might be as tickets unavailable even for October so not sure how to do it but would be good to know"}, {"username": "Annette Fordyce", "comment_text": "We bought tickets at the ferry office the day of travel. However, it was soon sanely crowded (this was in May) that the first ferry going back to Varenna was full and we had to wait for the next one and barely made our train back to Milano."}, {"username": "Marian Van Soelen Hand", "comment_text": "We were there last week and the ferries were so full going out of Bellagio that people who couldn’t get on would run to the line for the next ferry so the lines were insane and you had to be in it for 45 min before ferry came. It was a hot mess. Also tried to get on a fast ferry to Bellagio and it was sold out for the day (at 11 am). The locals were saying that the ferry system cannot handle the crowds that are there this summer."}, {"username": "Lisa Drozdowicz", "comment_text": "Ferries fill up fast! If you can’t get on one you could hire a car service. We got to the ferries at 11 am and couldn’t get a ticket for one until 3pm and it was the slow 2 hour trip!"}, {"username": "Mary Nelsen", "comment_text": "I think they’ll be a whole lot cheaper if you get them now"}, {"username": "Annette Mayer", "comment_text": "Going in October and plan to just buy right at the ticket office"}, {"username": "Rose Stolarek", "comment_text": "We just walked up and bought a ticket"}, {"username": "Trevor Brown", "comment_text": "Pack your swimmers."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Bellagio to Varenna is one every hour or less than one hour, you just get to the ticket office and get tickets"}, {"username": "Lucy Wright", "comment_text": "We were there in June. We got the fast ferry don’t !!! It was like a work bus and little could be seen of the surroundings. We thought we’d booked a return journey but we had to get a slow boat back it was stunning we saw everything and were sat on deck. Don’t choose the fast boat if you want to experience the lake xx"}, {"username": "Kirsty Manning", "comment_text": "There’s two ferry piers in Bellagio. The one front and centre is the passenger only ferry. Don’t bother. Walk down the promenade to the car ferry pier- it takes pedestrians too, it’s easy to get tickets on the spot and the ride is quicker. Straight to Varenna."}, {"username": "Angie Wong", "comment_text": "We were there last week. No issues with tickets going to Varenna from Bellagio. Our hotel told us that there is always room on the car ferry so no need to book in advance. Do note that it has a separate ticket booth just down the road from the ticket office for the passenger only ferry."}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "We got to front of the line because of wheelchair otherwise huge line up! Also note return times so you can plan accordingly."}, {"username": "Carolina Lamb", "comment_text": "We just were there, from Bellagio we purchased ferry ticket to Verenna day of! Easy peasy!!"}, {"username": "Lesley Fisher", "comment_text": "We were there recently in late June for only a couple of nights staying right on Lake Como near Como town. We planned to do day trips to Bellagio & Varenna & we’re also told to just to go in person to the pier & line up early on the day! So we did & every single boat, ferry & the fast hydrofoil option was sold out! And that was after lining up for an hour with very long queues & we got to the booking window to be told this! You would think they would put a sign up or an announcement but as we got to the window the lady said… but today we have availability still on the smaller ferry boat to do the tour of Lake Como so we bought these tix not realising the tour was of just the first part of Lake Como & no further! We got to see Como & parts of Lake Como from the water & it was a pleasant ride & you could hop on & off at some of the small lakeside villages & hop on the next ferry that came along.\nAs all the other options were booked out it had to be good enough! 🙄\nWe also heard whilst standing in the queue from other people that you can book online but not sure if that was just whilst in Italy or on the day or whatever as it was too late for us to book anyhow by the time we heard this!\nGood luck & you may be ok as crowds may be smaller when you go but remember this year EVERYONE seems to be in Europe (especially Italy) this year travelling! So best bet pre book if you can or get there super super early! 😊"}, {"username": "Karin Lutz Crocombe", "comment_text": "Steve Crocombe"}, {"username": "Francesca Giovanelli", "comment_text": "You can not book the ferry in advance from Bellagio to Varenna. You can by the ticket at the moment and go in"}, {"username": "Roland Trego", "comment_text": "I don't know what others do, but I have never booked a ferry on Lake Como."}, {"username": "Frances Barnes", "comment_text": "We just walked up to the ticket office and bought for the next ferry"}]}, {"id": "2208741202858291", "text": "So I’m planning a trip in southern Italy. I was planning on visiting Rome Naples(Pompeii and Sorentoo)and Sciliy where should I stay?", "link": "facebook.com/groups/1373361046396315/permalink/2208741202858291/", "likes": 1, "comments": [{"username": "Carey Matthews", "comment_text": "Consider a stay in Tropea. My wife and I used it as a travel base for 3 weeks.\n\nTropea https://g.co/\nkgs/Xn9fF9"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208739182858493", "text": "Any recommendations for pisa. Going October.", "link": "facebook.com/groups/1373361046396315/permalink/2208739182858493/", "likes": 10, "comments": [{"username": "Peter Barron", "comment_text": "Don’t get pineapple on it 🫤"}, {"username": "Frank Hunt", "comment_text": "Yes, get off at the railway station and have a leisurely walk to the tower. Enjoy the shops, cafes, restaurants and architectural features often missed by many."}, {"username": "Mike Parrent", "comment_text": "Sliced."}, {"username": "Alberta Brack McAviney", "comment_text": "One day and move on"}, {"username": "Priscilla Narvaez Griggs", "comment_text": "We walked from train station to the tower and happened upon a mural by Keith Harring!! The walk takes you over a bridge that is lovely (and a little chapel on the river bank). Go to tower and make the climb. Wander through the \"cemetery\" courtyard, then be in the baptistry when the doors are closed and someone comes in to chant, demonstrating why the baptistry is called a musical instrument. I love Pisa and have been there twice. It is worth the half day (or so) to visit."}, {"username": "Tissie McClure", "comment_text": "Be sure to go to the baptistery! We had a guide, and she told us so much information about the four doors and the 12 columns… It was wonderful!"}, {"username": "Livia Magyar", "comment_text": "Forget Pisa. Go to Lucca instead."}, {"username": "Stefano Nocetti Francesca Berlingieri", "comment_text": "Half day for The tower, Baptistry, historic cemetery, walk in Via Roma, Piazza dei Cavalieri, Arno River, chiesa di Santa Maria della spina, Palazzo blu Museum, Tuttomondo, San Rossore Natural Park. Come to Lucca for 2-3 days after"}, {"username": "Vickie Marino", "comment_text": "Gayle Keen"}, {"username": "Veronica Solimando-Lynch", "comment_text": "It’s boring!"}, {"username": "Mike Adams", "comment_text": "Short amount of time .\n\nDifficult to park near tower.\n\nTaxi, Uber, public transport"}, {"username": "Stephanie Ratcliffe", "comment_text": "loving this post, we are flying into Pisa for our first 3 days of a month long trip (we wanted flights from Edinburgh on a Monday!)"}, {"username": "Sam Jones", "comment_text": "Don't need more than half a day there. If that."}, {"username": "Michael Spiekermann", "comment_text": "Buy a picture postcard and save your time and money"}, {"username": "Joe Easton", "comment_text": "Nothing there except the little leaning tower. Spend an hour and go to next town."}, {"username": "Rita Ferragine Poole", "comment_text": "I would suggest skipping it."}, {"username": "Lindsey Mitchell", "comment_text": "I spent 1/2 a day there last month & while my initial reaction was less than desired, eating at the cafe above the museum shop was a spectacular/ breathtaking view of the leaning tower. We booked tickets to climb the tower (1 day in advance) & it was really cool. Honestly turned out to be an amazing time in Pisa! I hope you go, it’s one of those things you should do at least once in your lifetime."}, {"username": "David King", "comment_text": "It’s an hour and a half at best:\n\nGo into the church (it’s gorgeous!!), Walk around the outside and notice the mismatched marble columns (allegedly stolen depending on who you ask), Take the obligatory pictures, Eat a quick lunch (sorry but there’s nothing spectacular there)… and then do the standard “junky shopping” as our Livornese tour guide called souvenir shopping 🤣"}, {"username": "Frank Hunt", "comment_text": "Yes, go by train, is a nice walk through the town, lots to see, cafes, shops architecture on the way to the tower. Various ways to walk back to make it more interesting."}, {"username": "Renae Larcus", "comment_text": "See the tower and move along. Lucca is great. Siena. San Gimignano"}, {"username": "Martinez Martin", "comment_text": "Stop there, tour the museum and take some pictures and then move on. We stayed in Lucca which is really close to there for a couple days abd it was our favorite city in Tuscany."}, {"username": "Steve Grossman", "comment_text": "Spend no more than thirty minutes there"}, {"username": "Carrie Stallard", "comment_text": "If you get tickets make sure they are emailed to you the day before! We got an email confirmation but it said that it was not our ticket. After many phone calls they said that they didn’t have our email to send the tickets (even though the confirmation was emailed!!). We ended up getting tickets several hours later so we were stuck there for most of the day"}, {"username": "Janis Huegel", "comment_text": "Meh"}, {"username": "Diana Smith", "comment_text": "Kind of boring. See the tower and then go to Florence, travel through the region… is beautiful!"}, {"username": "Milt Lawhorn", "comment_text": "If you’re in the neighborhood of Pisa then you’re not too far from the Cinque Terre, make sure you find away to go there, it’s about a 100 times more awesome than Pisa and Pisa’s pretty nice."}, {"username": "Russell Weidner", "comment_text": "Enjoy and absorb all of the history and culture"}, {"username": "Dixie Kotylak", "comment_text": "Enjoy! I wasn’t going to go (as a side trip) but I fell in love with Pisa! ❤️🇮🇹❤️"}, {"username": "Caterina Liquori-Culhane", "comment_text": "So much traffic getting there. My kids wanted to go or I would of skipped it"}, {"username": "Sharyn Wright", "comment_text": "Not worth it"}, {"username": "Kai Wilhelm Tell", "comment_text": "No. Not at all."}, {"username": "Nancy Jones Bruscino", "comment_text": "Not my favorite. After seeing the leaning tower there is nothing to do. I would spend the time elsewhere in Italy. So many fabulous little towns to spend time in."}, {"username": "Robin Braziel", "comment_text": "We went In May and thought it was worth seeing. The three buildings in the square are beautiful and truly unique. Not sure about October. Definitely a tourist trap to sell trinkets but that happens outside the walls of the square."}, {"username": "Patrick de Vringer", "comment_text": "Push the tower, take photo. After one hour you are done. Go Lucca or Cinque Terre then 😉"}, {"username": "Ken Vecchia", "comment_text": "Go and take a hold up the tower picture"}, {"username": "Jason Hobel", "comment_text": "To be honest, it was not that exciting. There are so many tourists there and it just takes the enjoyment out of it. We went to Lucca afterwards and wish we had the whole day there instead. Lucca is a great town among other cities like Siena, San Gimignano and so on."}, {"username": "Jen Del Raso", "comment_text": "Take the train to Florence if you can."}, {"username": "Esther Starren", "comment_text": "Go see the tower and leave 😬😂 lucca or viareggio are lovely! And don’t eat near the leaning tower, tourist trap and not good food!"}, {"username": "Sherri Leis Dillavou", "comment_text": "What kind of recommendations\n? Food? Lodging? Cheesy picture?"}, {"username": "April May", "comment_text": "We stopped in Lucca on the way to stay overnight in Lerici for the beach and then did Pisa on the way back to our base lodging in Tuscany area. In Pisa, we ate a meal, saw the sights and shopping area, ate gelato and left. I was glad we did it, but we didn't need a whole day. And I certainly wished we had more time in Lerici and Lucca"}, {"username": "Raymond Capkin", "comment_text": "Good Chinese restaurant\nLEE NING"}, {"username": "Daniela Parhar", "comment_text": "Don’t miss the baptistery. We were lucky enough to that while we were inside, this person started singing and it was absolutely mind boggling. The best part of our visit there. You just need a few hours there. Walk around the park where the tower ir and that’s about it. It’s a nice place."}, {"username": "Ana Maria Clapon", "comment_text": "I'll go to Volterra on the same day."}, {"username": "Beth Ann", "comment_text": "Day trip or stay for a few days in Lucca"}, {"username": "Stephen Anderson", "comment_text": "See the Tower. Maybe straighten it? T"}, {"username": "Annie Slater", "comment_text": "Max 2 hours needed. One really... And apparently the pickpocket capital of Italy. I highly recommend you spend an hour at Pisa and then go and spend many more hours at nearby San Gamignano. It was breathtaking there!"}, {"username": "Eliza Hatzivassiliadou", "comment_text": "Only the tower, nothing more. Would rather go to Lucca or change plans and go to Florence"}, {"username": "Laura DeCicco", "comment_text": "Don’t listen to anyone telling you to skip it. You don’t ave to spend lots of time but since you’re going to be there you really should see the tower. You can see Pisa and Lucca in the same day."}, {"username": "Barbara Bastianini", "comment_text": "My advise would be to explore a bit beyond the Leaning Tower area. Too many tourists drop in for a brief visit & leave. Then because they themselves didn’t see anything else there they conclude that the tower is all there to see there. But Pisa, like most Italian cities has several\nInteresting things to see and do.\n\nI’d suggest you walk along the beautiful medieval city walls for a great view into the city. And also walk along the Arno river for beautiful views sbd cross at least one of the historic bridges. Enjoy great gelato. (Coltelli and Tartufo 13 Gelaterias are considered to have some of the best gelato in all of Italy. Pisa features one of those beautiful public squares that Italy does so well. the Piazza Cavalieri was designed by Vasari and is lined with impressive historic buildings. The Palazzo Blu Is a great art musrum inside a stunning 16th century palace. Check out the tiny gothic church of Santa Maria della Spina. This place is real jewel-like gem. To contrast with the historic sights you might want to see Tuttomundo, a modern, colorful street mural by Keith Harding. The botanical gardens of Pisa were started by the Medici family and are now considered to be the finest botanical gardens in Italy and all of Europe. There are several historic churches worth a visit. Borgo Stretto is an important shopping street if you’re interested in that. If you’re not shopping it’s still worth it to see the stone archways and the colonnaded shops. Plus the beautiful townhouses painted in shades of terracotta and pink that have hanging wash are just so picturesque!\n\nThese are just a few of the many worthwhile sights that I hope you get to see. Pisa is most definitely not a one-trick-pony!\n!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Not worth the time fighting the crowds for a photo op."}, {"username": "Brian Osman", "comment_text": "It's just a stop off, not to much there besides the obvious"}, {"username": "Gillian O'Callaghan", "comment_text": "I loved Pisa.....it is an easy day trip from Florence."}, {"username": "Jerry Scaglione", "comment_text": "You can't go wrong with pepperoni."}, {"username": "Michael Messina", "comment_text": "Lucca dont miss , Pisa just quick look.Hold the tower make sure doesn't fall."}, {"username": "Jan Lumberg Kupczyk", "comment_text": "We loved Pisa. It's not just the tower, it's a Baptisty and church. Just glorious. Everyone enjoys different sights. We love churches!"}, {"username": "Gregg Pires", "comment_text": "My recommendation is skip it. There's nothing to see there"}]}, {"id": "2208281442904267", "text": "Edit to Add: not looking for group tours, would like a more tailored experience.\n\nAm I allowed to ask advice for finding a travel agent? I am looking for someone who can accommodate our Girl Scout troop as we plan a trip to Italy and France for 2025. Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2208281442904267/", "likes": 1, "comments": [{"username": "Gregg Pires", "comment_text": "We are using a company called Joe Banana Limos, they were recommended by a family of 12 that used them in June. They have booked all our tours and all our transportation.\nThey are honest and very reasonable priced and even told us when it was more cost effective to use local transportation than charge us their price, now that's integrity, ask for Nunzia."}, {"username": "Kathy Flood", "comment_text": "Check with ef tours. That is who he used for my daughter's high school class"}, {"username": "Terra Sichel", "comment_text": "I used EF for my gs trip to Europe."}]}, {"id": "2208729002859511", "text": "So me and my son will be traveling from lauterbrunnen Switzerland to Venice . We are taking the public tram bus train systems wanted to break up the trip instead of over 7 hours stop in-between some place forआणखी a day any recommendations? This is the way we will be coming would stay a day someplace enjoy no. Touristy area good food and hiking any castles along the way?\n\nThanks Dave and Jacob", "link": "facebook.com/groups/1373361046396315/permalink/2208729002859511/", "likes": 8, "comments": [{"username": "Stefano Bressanelli", "comment_text": "Brig has a nice Castle. Domodossola has a nice historic town centre and can offer a good Italian tasty Mountain flavour with the food. The nearest Castle from Domodossola Is the Vogogna Castle. Few km."}, {"username": "Anita Clayton", "comment_text": "Verona"}, {"username": "Carey Matthews", "comment_text": "Dear Dave & Jacob; if you're still in the 'planning' stage - here are some insights from my wife and my trip through the area.\n\n#1 - Obviously, a stay in Milan is typical. So- much available on key sights/\ncathedral/\nfortress.. I'll leave that to you to find.\n\n#2 - consider staying in Padua vs Venice. We spent just over 3 weeks using Padua as our base.\n\nThere are multiple short cheap trains between Padua & Venice. You'll save considerable $$$$ in Padua which is its own treasure.\n\nUsing Padua as the base, we day tripped to Venice AND almost all the islands - market day to Chioggia !!\n\nChioggia https://g.co/\nkgs/VTBZiY"}, {"username": "Mark Spielman", "comment_text": "Skip Milan, try Stresa on lago Maggiore, it's a gem. If you like a bigger city, Verona is hard to beat."}, {"username": "Bev Madill", "comment_text": "I'd suggest Sirmione or Stresa. Good luck."}, {"username": "Pamela Dorigo", "comment_text": "Hi, Milan could be the first choice but maybe you can have other chance to visit Milan, you can enjoy the Garda lake and stop in Peschiera del Garda, it worth to stay one night. Very beautiful is also Verona but maybe too close to Venice and you don't cut really the train trip!"}, {"username": "Angie Tripp", "comment_text": "."}]}, {"id": "2208729519526126", "text": "Thank you Milan!\n\n#solotraveler", "link": "facebook.com/groups/1373361046396315/permalink/2208729519526126/", "likes": 36, "comments": [{"username": "Stefano Bressanelli", "comment_text": "You are welcome!!!"}, {"username": "Cinzia Colombo", "comment_text": "My city!! Hope you enjoy the vibes! Welcome!"}, {"username": "Ken Vecchia", "comment_text": "Love this building"}]}, {"id": "2208703039528774", "text": "Hi..landing in Verona airport late October. Are there any direct links to Malcesine? Staying 3 nights there then heading to Venice..is there a direct train..are should we book private transfers for both. Any information on either places too would be great. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208703039528774/", "likes": 1, "comments": [{"username": "Stefano Bressanelli", "comment_text": "There are direct buses from Peschiera del Garda train station to Malcesine/Riva del Garda."}]}, {"id": "2208679449531133", "text": "My husband & I going to be in Taormina Sicily in October for 1 week.\nWe are looking for a hotel within 1 mi or less to the to town. Can anyone suggest a nice hotel 3-5 ⭐️", "link": "facebook.com/groups/1373361046396315/permalink/2208679449531133/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187892-d6567\n15-Reviews-Hote\nl_Taodomus-Taor\nmina_Province_o\nf_Messina_Sicil\ny.html"}]}, {"id": "2208713306194414", "text": "Pictures of doors I took while in Capri & Positano. I was inspired by others in the group ❤", "link": "facebook.com/groups/1373361046396315/permalink/2208713306194414/", "likes": 883, "comments": [{"username": "Estela Mederos", "comment_text": "Estela Mederos"}, {"username": "Donna Hinton", "comment_text": "Love this!❤️"}, {"username": "Maureen King", "comment_text": "Love this!❤️"}, {"username": "Nancy Caruso Watts", "comment_text": "This was my wish for our last trip. Between a huge group and rain, rain, rain, I didn't get enough 😫"}, {"username": "Kathy Kattic McKee", "comment_text": "Kathy Kattic McKee"}, {"username": "Marie-Josée Mercier", "comment_text": "Christine Bolduc 😍"}, {"username": "Angela Perky Perkins", "comment_text": "Angela Perky Perkins"}, {"username": "Jo Courage", "comment_text": "Yep adopting these ideas 🚪on my next travels as it’s just gorgeous!"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Love these"}, {"username": "Kelly James", "comment_text": "I love taking pictures of doors in Italy because they are so interesting"}, {"username": "Ann Conlin Cantatore", "comment_text": "Beautiful"}, {"username": "Maria Fedele", "comment_text": "Thank you for sharing. I found the doors in Italy intriguing and so unique. So much so that my husband said I went to Italy to only look at the doors☺️☺️"}, {"username": "Kim AndKids", "comment_text": "I didn't know this was a thing. I love it!"}, {"username": "Moyra Clarke", "comment_text": "Love this!"}, {"username": "Claire Williams", "comment_text": "Love this!!!"}, {"username": "Sherri Wills", "comment_text": "I'll post mine when I get there next month!!! OMG Im super excited.!!!!"}, {"username": "Gabrielle Goodenough", "comment_text": "Gorgeous ❤️"}, {"username": "Sony Ucciferri", "comment_text": "So beautiful"}, {"username": "Annette Saviano Citta", "comment_text": "Beautiful"}, {"username": "Simone Fiebig", "comment_text": "Great idea ."}, {"username": "Marilena Mainelli", "comment_text": "Bellissima idea"}, {"username": "Sonia Therese", "comment_text": "Love this idea, I might try it too!"}, {"username": "Mindy Grossman Sepinuck", "comment_text": "I love doors too!"}, {"username": "Jill Brothers", "comment_text": "Love doors, I did a study of town water wells last time and plan to do again this year"}, {"username": "Dianne Giordano", "comment_text": "Love, love Positano"}, {"username": "Steve Sullivan", "comment_text": "I did an entire series of the doors in Europe and another of the symmetry of their wood stacks."}, {"username": "Margo Wood", "comment_text": "Beautiful"}, {"username": "Christine Robinson", "comment_text": "Michael Robinson Kate Winstanley there's a photography project x"}, {"username": "Varsha Paharia", "comment_text": "Daksha Bhoola\nPositano / Amalfi Coast in 2025\nR u game ?"}, {"username": "Lucie Belle-Isle", "comment_text": "You make me want to hop on the next plane for Italy. I just love it. Will be back next spring. I can’t wait!"}, {"username": "Nancy Louise", "comment_text": "I love this idea . Yes, the doors are beautiful in Italy . This was Rome ."}, {"username": "Kristen Jacobs", "comment_text": "I’m so glad others are as obsessed as I am! Love!"}, {"username": "Regina Mauro", "comment_text": "I am a doors and entrance photographer too. Great photos"}, {"username": "Annette Mallery Auteri", "comment_text": "Annette Mallery Auteri"}, {"username": "Annette Mallery Auteri", "comment_text": "Miranda Lin Riethmiller\nSamantha Riethmiller I can't wait to see all the different doors!"}, {"username": "Dixie Kotylak", "comment_text": "Love this!!!"}, {"username": "Julia Sirena Byrnes", "comment_text": "Love this!❤️"}, {"username": "Gayle Moores", "comment_text": "These photos of the doors in the South of Italy are so beautiful!"}, {"username": "Francia Clasara", "comment_text": "Fantastic idea! I would love to do that as well. Somebody has posted the same thing and put it in a frame it was beautiful art"}, {"username": "Jaroslava Blahova", "comment_text": "krásné"}, {"username": "Carole Tarlap", "comment_text": "I love doors.....do the same thing."}, {"username": "Katalin Tóthné Dr'Vándorfi", "comment_text": "Spectacular!"}, {"username": "Maureen Strazzari", "comment_text": "Thanks for sharing."}, {"username": "Andrea Romano", "comment_text": "Andrea Romano"}, {"username": "Dawn Leatherby Araujo", "comment_text": "Nice pics! I love all the different doors with character in Europe."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Beautiful 😍"}, {"username": "Sandra Kelly", "comment_text": "Sandra Kelly"}, {"username": "Jen Parks Rugh", "comment_text": "Love this!❤️"}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson more doors we need to see to add to your wall"}, {"username": "Heather Barbie", "comment_text": "Davidson Mauricette the twins were onto something!!! Haha"}, {"username": "Donna Nicoletti Guiffreda", "comment_text": "The doors are spectacular in Italy 🇮🇹"}, {"username": "Stacey Miller", "comment_text": "I'm glad I'm not the only door photographer!"}, {"username": "Suzanne Goudezeune", "comment_text": "Beautiful. I did that too !"}, {"username": "Teri Bakke", "comment_text": "Beautiful!"}, {"username": "Rhona Veisfeld Modugno", "comment_text": "Love it 💕"}, {"username": "Shelby Dean Mayorga", "comment_text": "It makes me so happy to see that so many other people are fascinated by cool doors.\nMy husband laughs at me and doesn’t get my obsession to photograph them when we travel.\n\nHe supports me, just doesn’t “get it”.\n\nI love seeing all the fantastic doors! ❤️"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Very cool 😎"}, {"username": "Jayeeta Pramanik", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Julie Agarkov Mayblyum", "comment_text": "Love this!❤️"}, {"username": "Kaye McNutt Sabota", "comment_text": "Love these"}, {"username": "Debbie Mullins Grindstaff", "comment_text": "Love this"}, {"username": "Kathy Dowdell", "comment_text": "Love it!"}, {"username": "Lynda Petralia", "comment_text": "Beautiful. And here’s a great way to preserve those pictures. Saw this somewhere. The frame even has a little door handle keeping with the door theme. So creative."}, {"username": "Wendy Finlayson", "comment_text": "Love this...."}, {"username": "Tami Neubauer Foster", "comment_text": "I love taking photos of doors and windows!💜"}, {"username": "Patricia Rada Basili", "comment_text": "Beautiful! The doors in Italy are gorgeous"}, {"username": "Katie Ewers", "comment_text": "Loving this trend! 🤩"}, {"username": "Mary Jane Palmigiano", "comment_text": "I love this ❤️Be cool to make it into a poster..."}, {"username": "Debbie Riffe Fulco", "comment_text": "I saw this and I’m going to frame my pictures. Very cool idea."}]}, {"id": "2208725779526500", "text": "Another 'train' question. Sorry! I see some folks are recommending buy in advance and some say buy the day of or the day before.\n\nFor those saying \"buy in advance\" can you give your reasoning?\n\nFor those saying \"आणखीbuy the day of\" your trip or 'day before\" can you also give your reasoning?\n\nEverything I read says the fast train tickets are more expensive the closer you get to the day of your trip or they sell out. No one wants to risk that, but we certainly don't want to risk buying tickets and then losing the money altogether if our plans change. This has become a very stressful decision to make! Any suggestions or ideas are greatly appreciated! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2208725779526500/", "likes": 7, "comments": [{"username": "April May", "comment_text": "We found buying more than 24 hrs ahead of time was cheaper. It depends on your schedule what will work for you"}, {"username": "Louis Des Forges", "comment_text": "It depends if you are sure on your plans and whether you are using an express or regional train. I always advise against buying tickets in advance straight after a flight, because if your plane is late and you miss the train you will have to buy a new ticket.\nIf its a regional train just buy on the day as no discount for buying in advance and you cannot reserve seats for regional trains as mostly used for short trips/\ncommuters going to work."}, {"username": "Sara Beth", "comment_text": "I bought our fast train tickets months in advance at early booking specials for about $40 for 2. Day of—tickets were as high as $100 for 2. (Rome to Florence and La Spezia to Rome trips)\n(We landed at Rome airport at 7:00am and I booked train tickets from Rome Termini to Florence at 10:35am to give enough time to land, take Leonardo Express…and it worked great—-too much time actually, but better safe than sorry)."}, {"username": "Stefano Bressanelli", "comment_text": "If you take High Speed trains or Intercity , Better to make ticket before ( better offers, low prices) . The more you wait, the more you spend...\nIf you travel with regional (all the rest...) You can make ticket even One minute before departing. No reservation, same price."}, {"username": "Jay Parekh", "comment_text": "If you’re with a group of people, booking last minute may result in not sitting together."}, {"username": "Tammy Lloyd Eubank", "comment_text": "I noticed on the Trentailia website they have a refund option you can add to your ticket cost. Does anyone know anything about this?"}, {"username": "Melissa Therrien", "comment_text": "We bought day of as I was travelling with 3 kids that aren’t always timely! Only one time we couldn’t get seats together but were able to get tickets to where we were going without a problem during high season in July. While might’ve been more expensive it worked for us without worrying about missing a train. We weren’t going very far each time -Rome-Orvieto then Orvieto-Florenc\ne and Florence to Milan. The regional trains it didn’t matter as those seemed to only have 2nd class -those were crowded."}, {"username": "Kim Dixon", "comment_text": "You already said it… price and availability. Only you can decide what level of risk you are willing to take. you can also buy tickets that allow for free or cheap changes."}, {"username": "Jerry Lyubelsky", "comment_text": "We bought ours months in advance based on an itinerary that we set up for ourselves giving enough time to get to train stations. Make sure we weren’t going to be late etc. etc. this way we were guaranteed a spot we were able to all sit together and no hassles day of just get on the train when you’re supposed to and that’s it"}, {"username": "Blanca Gil", "comment_text": "Buy in advance because I don’t want to deal with my luggage, being vigilant, crowds and buying train tickets. Italian train stations can be extremely busy especially the big ones (Rome, Venice, Milan, Turin). I buy all of my fast trains or “must” cities (the next city that I will have an overnight stay) early in my travel planning. My city stays do not change. Day trips I will buy day of because sometimes it does change (weather, tired, I day trip elsewhere)."}, {"username": "Ben Poupard", "comment_text": "I should have booked further out and did not. The tickets cost more the day before. I would have saved at least $40 for the two of us."}, {"username": "Miyuki Kanno Paul", "comment_text": "Sometimes I buy in advance because I will be already in Italia and must take a certain train within particular timeline to move from one city to another. I usually take advantage of reduced fare for business or executive class for longer distance.\n\nWhen flying into Italia, I buy tickets when I arrive at the train station. You’ll never know if your flight will be delayed for any reason, how long it will take to go through the Passport Control and the Customs. No stress, no biting nails or pulling your hairs out😉."}, {"username": "Joe-Linda Po Agustin", "comment_text": "Group of 14 travelling together, we will be taking around 20 train rides for this trip. High speed trains I booked in advance to get best prices and to be able to sit together. The rest, we will buy closer to travel date when we’re already in Italy. Our destinations are set, but I built in some flexibility ( advantage of DIY planning)."}, {"username": "Jason Hobel", "comment_text": "It is cheaper to book in advance. If you want seating close to each other and well it is one less thing to worry about 😁"}, {"username": "Jill Medrano Casey", "comment_text": "I think it's mostly just a matter of how \"planned\" people like to be. I get anxious if I wing it, especially because this trip had 6 people, so I bought my tickets in advance. Plus, it would've cost a lot more for those six tickets. If it was just my husband and myself, my anxiety would have been less and I might have just purchased the day of."}, {"username": "Karen Schmidt", "comment_text": "Buying in advance =cheaper and guaranteed seats together"}, {"username": "Véronique Piercey", "comment_text": "It is definitely more expensive buying day before or day of but sometimes can be worth it for the flexibility. However, it has happened to me twice that on main routes (Rome to Florence and Florence to Venice) that the train time I wanted/needed to get to my destination was sold out and I had to wait 3-4 hours for the next available train. If neither of these factors are a concern, then no need to book ahead."}, {"username": "Kristy Bretagne", "comment_text": "Why not a Eurail pass for Italy? That appears to be cheapest imo"}, {"username": "Elena Mcleish", "comment_text": "I think you’ve answered your own question. If your plans may change then don’t book in advance. Our accommodation dates etc were all booked in so booked trains in advance. We didn’t do any day trips by train but if we had I probably wouldn’t have book in advance. In a day trip you don’t have luggage to worry about."}, {"username": "Michael Westlake", "comment_text": "get a train app. We used Omio with great success. Pickl a train in a month's time and note the price. Check back every week and see if the price changes. They you have the info you need."}]}, {"id": "2208726906193054", "text": "Going to Rome in September. I’m looking to do a colosseum tour. I’ve been looking online and seeing daytime, nighttime, underground, and some that include the forum, the arena, palatine hill or combinations of these.\nCan anyone offer a suggestion for what to see or which tour you thought was best? We are all adults if that matters and there are 7 of us.", "link": "facebook.com/groups/1373361046396315/permalink/2208726906193054/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nSkip-the-Line-To\nur-Colosseum-Ar\nena-and-Imperia\nl-Forums/\nd511-391194P3?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Dina Witter Pradel", "comment_text": "We hired a private guide to take us through the Colosseum, Forum and Palatine Hill during the day. He was so passionate about Roman history, that it really bought everything alive for us. I originally booked him through AirBnB, and I admired that he told me upfront that he might not be able to get Underground tickets, unlike the other tour companies I've been hearing are cancelling tours at the last minute when they can't get Underground tickets. We ended up creating a more custom tour with him, and I just bought timed AudioGuide tickets directly from CoopCulture, but going through with him instead.\n\nWe returned in the evening for the Underground Tour, but we could only buy direct tickets from the Coop for the Italian tour, and honestly, could have skipped this because 1) We couldn't understand it most of it, even with Google Translate and 2) We'd seen everything from above and learned about it earlier in the day. The evening tour is only an hour, and you don't get to see the Forum or Palatine Hill, which we found really interesting."}, {"username": "Amy French Baillie", "comment_text": "Purchase through coopculture…the\nofficial site for tickets. Had the 24 hour forum/palatine/\ncolosseum ticket last week. Was fab"}]}, {"id": "2208728072859604", "text": "Today!", "link": "facebook.com/groups/1373361046396315/permalink/2208728072859604/", "likes": 3, "comments": []}, {"id": "2208283169570761", "text": "We are a Family of 5 with 3 teens going to Rome next Monday. Should we take a train or hire a driver from the airport. Worried about pickpocketing. Thanks for all the advice!! Coming from Canada!!🇨🇦", "link": "facebook.com/groups/1373361046396315/permalink/2208283169570761/", "likes": 16, "comments": [{"username": "Kelly Thuy-Trang Doan", "comment_text": "Lena Lai 🤭 Go ahead, say what's on ur mind.. 😝"}, {"username": "Marisa Dilieto-Brenner", "comment_text": "We hired a driver also !!! The best thing we did ❤️❤️"}, {"username": "Paul Wilson", "comment_text": "It really depends how good a pickpocket you are.. 🤷‍♂️"}, {"username": "Rebecca Loewenthal", "comment_text": "I had almost the same question:\n\nShort answer:\ndriver/taxi\n\nLong answer: We took the train which went relatively smoothly, but then we needed to get from the train station in Rome to the place we were staying. It was night, it was super sketchy. We had got multi day bus tickets and we’re waiting for the bus for a long long time. Thought about taking a taxi at this point but couldn’t decide and kept hoping the bus would so up.\nBasically, just made everything much more complicated and stressful.\n\nIf it had been day light it would’ve been super hot.\n\nJust take a driver/taxi from the airport. So much less stress and less physically taxing."}, {"username": "Susan Lowry Lamb", "comment_text": "OK on the subject of pick pocketing. This one seems to have taken on a life of it's own. Do not be paranoid. JUST be smart because your odds are increased, just like you are in any big city in the world. Make sure the entire famdamily takes more than the normal precautions, which are nothing as we walk around with wallets in pockets and wide open purses."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "take a transfer https://\nwww.viator.com/\ntours/Rome/\nRome-Airport-Tra\nnsfer-Private-L\nuxury-Service-w\nith-Driver/\nd511-35870P7?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "David Jack", "comment_text": "I found the train rife with pickpockets. Hired a car for myself.\n\nIf you don’t know the area for parking, maybe just get a taxi?"}, {"username": "Keri Deveau Eaton", "comment_text": "We used movinrome very affordable. I booked it prior to arriving on their website. Very easy."}, {"username": "Nicole Miano", "comment_text": "just returned from Rome & Florence…pre book a taxi … most cabs will not take more than 4 passengers. we had to always grab 2 cabs for 5 people. i didn’t notice any pickpocketing. i wore my bag close to my chest, put extra secure clips on my husbands backpack. enjoy!!!!"}, {"username": "Starla Dawn", "comment_text": "I loved having a private driver for my trip with my teenaged daughter. Hired 2 different ones for 4 different days of the trip and it made it so much more enjoyable and stress free.\n\nFor trains book business class to avoid them."}, {"username": "Tami Sue", "comment_text": "Probably cheaper to take a taxi. I wouldn't worry about pick pocketing. If u do ride trains keep an eye on your stuff. And tell your kids about keeping their stuff secure and don't keep their heands down on their phones."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Official taxis at the airport are regulated. 50€ to central Rome."}, {"username": "Shannon Sharrock", "comment_text": "I am on a train right now from Florence to Rome. I didn’t feel threatened by pickpocketing but I’ve have been very cautious, as I am in big cities in the US as well.\nI will say that a lot of trains are delayed often according to an Italian we are traveling with. . Mine was actually canceled (15 mins before departure) but jumped on another to get to Rome. No one to actually help you at the stations."}, {"username": "Kimberly Glossbrenner Yates", "comment_text": "We just went as a family of four with two teens and there are taxis available at the airport if you don't pre-book as well. We did that and it was fine"}, {"username": "Amalia Cristina", "comment_text": "If you are 5 people better to rent a car"}, {"username": "Rebecca Yeoh", "comment_text": "I would get a driver just for ease sake. However, don’t be worried about pick pocketing. Just be alert, not alarmed. As long as everything is packed away well you’ll be fine. This group has made it something bigger than it actually is."}, {"username": "Nancy Ann Paolino", "comment_text": "Taxi 50 euros"}, {"username": "Artilla Puddy", "comment_text": "I have travelled on trains in Italy when visiting and I have never had a problem with pickpocketing Nor have I anywhere else in the world. Pickpocketing can be in every big city. Just be cautious"}, {"username": "Nancy Ann Paolino", "comment_text": "This pickpocket thing has to stop. If you are prudent in your surroundings you will be just fine like back home."}, {"username": "Suzanne Hendriks", "comment_text": "Driver!"}, {"username": "Susan Monaghan", "comment_text": "We have taken the train many times over the years. I don’t remember it ever being terribly crowded, and have always felt safe on it. It comes into Rome at the far end so you can avoid a lot of the station crowds by using the side exit. I suspect you can get a taxi there."}, {"username": "Wilson Neyland", "comment_text": "The only time I’ve had to deal with pickpockets was in St Peter’s in Rome. I had a horrible cold and I just let them grab the used tissues from my coat pocket. 🤣 They aren’t attacking you at every turn. Just be smart about where you keep your valuables."}, {"username": "Rebecca Dempsey", "comment_text": "We rented a driver(limo service)to and from the airport and it was fabulous. On the return there was an accident and he maneuvered through the villages to get us where we needed to be. Worth every cent!"}, {"username": "Shell Therese", "comment_text": "Why has everyone gone manic about pick pocketing ? lol...anywhere in the world you go, if you are tardy with your belongings someone will eventually snatch it! So just exercise normal common sense and it'll be just fine."}, {"username": "Vince Malfatti", "comment_text": "Taxi is probably the quickest and cheapest way y to get you to your destination🚕"}, {"username": "Michele Runge Tapp", "comment_text": "For sure train! We traveled with 5 teens - zero issues . Just make sure u buy business class"}, {"username": "Ann Moore-Pak", "comment_text": "Those teens with luggage on the train have to hustle to get off quickly. If they have back packs or carry on, should be okay. Teens are quick. But if they have suitcases to put overhead? No. I’m all about drivers though. Makes it easier. Get a driver!"}, {"username": "Vladimir Boskovic Serrudo", "comment_text": "Someone should tell Americans that Europe is about 4 times safer than US for most crimes (except for homicide, where Europe is about 40 times safer)."}, {"username": "Linda Wallace Smith", "comment_text": "Hire a driver or take a taxi. That way they will take you and your luggage directly to your hotel."}, {"username": "Jim O'Neill", "comment_text": "There is no issue with pickpocketers. Be aware of your surroundings. Keep your personals safe like you would in any other big city. We took the train everywhere and it allows you to see the countryside where a car doesn’t. Also way more comfortable"}, {"username": "Jenn Messina Babore", "comment_text": "It was cheaper for us to hire a taxi than to take the train and also more convenient."}, {"username": "Melissa Cortez", "comment_text": "We hired a driver for family of 6. It was very nice after a long plane ride. 85€"}, {"username": "Zara Budaghyan", "comment_text": "for 5 persons it's affordable and more comfortable to take a taxi... there are local taxi applications that work well, just make sure you indicate the number of passengers and large suitcases if any"}, {"username": "Amanda Albert Notaris", "comment_text": "driver - i just went with 3 teens . we stayed away from trains."}, {"username": "Shelley Frise", "comment_text": "We used a driver from the airport to the hotel. After a long flight we didn’t want to deal with luggage on the train. Not once in the 3 weeks did we feel uncomfortable with pick pockets. Just be smart and keep stuff out of your back pockets and keep your purse in front of you. Enjoy your trip"}, {"username": "Carol Taylor Tisdale", "comment_text": "Get the app Welcome Pickups. Very professional and will meet you inside at Arrivals. For 5 people plus bags you will need a large vehicle - maybe a van."}, {"username": "Vivien Paulik", "comment_text": "If you worry about pickpocketing how you want to go out from the hotel and walk around in Rome? Btw for a 5 people family with teens I vote for a car, not a train."}, {"username": "Allison Carlisle Young", "comment_text": "We used limousinrome.co\nm for our family of 5 after a day of travel and all the suitcases. He responded quick with quotes. We had a good experience with him. The cars are small and families using taxis had to split up into two or three cars depending on luggage"}, {"username": "Marie Cuzzi", "comment_text": "Hire a driver …."}, {"username": "Andrea Stewart Graham", "comment_text": "Driver, when we arrived there was a strike and trains were not running. Taxi lines were hours long."}]}, {"id": "2208720282860383", "text": "Still pretty frustrated at the lack of information and the misinformation coming out of the governor of Sicily regarding Catania Airport. ￼ He just held a a news conference, claiming the airport is a full operation when in reality according to flight tracker, yesterday was one of the worst days since the fire. Reuters and Euronews and others verify that 8000 passengers were left stranded yesterday on ￼just one airline.\n\nI am scheduled to arrive on Friday, via Rome. Alitalia has canceled my flight AZ1745 ￼ every day since July 16. This is a game they play so you can’t change your ticket without paying change fees. ￼ They wait until two hours before the flight and then cancel it. Repeated emails to Alitalia have gone ignored and theie 800 number from the US doesn’t work. ￼FYI. (I didn’t pick Alitalia, American Airlines did.)￼\n\nI feel for the people of Sicily after these fires and I’m actually there with dollars to support them but when their leaders blatantly lie to keep the flow of passengers coming, the credibility goes to zero. I’m hoping to avoid the situation where news reported hour long lines, outside on the tarmac when the temperature was 118° Lines for water were over an hour long. ￼\n\nStay tuned for a first-hand report, that actually and accurately assess the situation. ￼", "link": "facebook.com/groups/1373361046396315/permalink/2208720282860383/", "likes": 0, "comments": [{"username": "Shelagh Kosinski", "comment_text": "Did you call American?"}, {"username": "Susan Marten", "comment_text": "I would honestly consider not going and possibly consider another country"}, {"username": "Zoom-Zoom Nation", "comment_text": "So it's inconvenient that their island is burning down? Or just that the information is trickling in while they work to save the homes of the citizens."}, {"username": "Carlotta Crespi", "comment_text": "Alitalia no longer exists btw..."}]}, {"id": "2208553446210400", "text": "Has anyone hired a bike and just explored the streets that way? If so which cities did you do and how much was it to hire?", "link": "facebook.com/groups/1373361046396315/permalink/2208553446210400/", "likes": 0, "comments": [{"username": "Ken Lerch", "comment_text": "I ride bikes on my annual trips to Lucca but I usually negotiate a weekly rate. I have also rented in Florence for maybe 3-4 euros/hour."}, {"username": "Daisy Yoo", "comment_text": "Lucca"}]}, {"id": "2208516389547439", "text": "What’s a good time to go to St Peters Basilica ? Has anyone been very early?", "link": "facebook.com/groups/1373361046396315/permalink/2208516389547439/", "likes": 3, "comments": [{"username": "Andrea Corey Andrews", "comment_text": "Best time was when it opened ."}, {"username": "Mark Campbell", "comment_text": "We got there around 2 hours after it opened and the line was about a 2-3 hr wait that went completely around the piazza."}, {"username": "Daisy Yoo", "comment_text": "6:40 am"}, {"username": "Heather Ilene Shaw", "comment_text": "How are the lines around 5 pm"}, {"username": "Suzanne Felder", "comment_text": "Yes ,\nWent there Last Tuesday. Got there at 7.45am . Fewer people and small line. Worth it."}]}, {"id": "2208279112904500", "text": "If I am coming from Cannes, how much does it cost to get to Florence by fast train? I get the routes on Google only. When I go on Eurail, it shows me the prices for the passes, which I don't want and just get individual trip quotes. What site can I look at? I see Trent Italia for part of it, but not sure for the France part. I went on Eurail thinking it has railway companies from all over. Are there other sites I can look where I get trip quotes and not a pass quote?", "link": "facebook.com/groups/1373361046396315/permalink/2208279112904500/", "likes": 0, "comments": [{"username": "Brenno Bianchi", "comment_text": "In general there is no high speed railway or train between Côte d'Azur and Italy"}]}, {"id": "2208382646227480", "text": "Hello. I wanted to book a golf cart tour in Rome with Rolling Rome but they are booked for our days. Please recommend a company you loved that has forward facing seats. Looking for a private tour. Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2208382646227480/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nBest-of-Rome-by-\nGolfcart-privat\ne-tour/\nd511-23570P17?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2208327346233010", "text": "Can anyone suggest a good hotel to stay in Florence with my 15 year old daughter September 2024? TIA 💓", "link": "facebook.com/groups/1373361046396315/permalink/2208327346233010/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2307\n23-Reviews-B_B_\nHotel_Firenze_P\nitti_Palace_al_\nPonte_Vecchio-F\nlorence_Tuscany\n.html"}, {"username": "Denia Lanier Rano", "comment_text": "Hotel calzaiuoli Firenze"}, {"username": "Sandy Radican Shikaly", "comment_text": "Hotel Brunelleschi!!"}]}, {"id": "2208498092882602", "text": "How different is the temperature between june and September", "link": "facebook.com/groups/1373361046396315/permalink/2208498092882602/", "likes": 6, "comments": [{"username": "Colleen Dawson", "comment_text": "Snowing in the northern parts, Dolomites and it’s August. You will get different temperatures and weather depending on where you are. Specifying where you will be, gets you better information."}, {"username": "Tanya Bitar", "comment_text": "Temperature right now, today is so cool. You never can plan. Last year this time was extremely hot."}, {"username": "Linda Deciccio", "comment_text": "Last year at this time: very hot in Florence!"}, {"username": "Gloria Maledi", "comment_text": "pretty similar, maybe it's a little hotter in june"}, {"username": "Janine Emma Lucas", "comment_text": "What regions? They vary greatly"}, {"username": "Stephanie Osborn Rushing", "comment_text": "It’s perfect now! Rome was low 60s and high 80s and right now just traveled to amalfi coast and the temp is 69 degrees in positano!"}, {"username": "Heidi Littman Meiers", "comment_text": "packing for our trip from Dolomites to Amalfi and 4 spots in between leaving in 2 1/2 weeks has been quite the struggle ! I shopped all spring and summer for HOT as that's what the weather has been all summer (unbearable by some posts), now its cooling off and i'm practically packed and have nothing for this new cool trend, cannot do this so last minute 😳"}, {"username": "Rich Turnbull", "comment_text": "Google it!"}, {"username": "Marco Brambilla", "comment_text": "20 degrees Celsius"}, {"username": "Tom O'Hara", "comment_text": "Where?"}]}, {"id": "2208553589543719", "text": "Varenna ,Lake Como - North Italy", "link": "facebook.com/groups/1373361046396315/permalink/2208553589543719/", "likes": 223, "comments": [{"username": "Ken Vecchia", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Karol Wolny", "comment_text": "The most beautiful lake I know, just a fairy tale"}, {"username": "Здравко Здравков", "comment_text": "Dimitrina Zdravkova"}, {"username": "Peggy Lozauskas", "comment_text": "Great memories of walking along that path during our visit in 2018."}, {"username": "Shirley Preissler", "comment_text": "Beautiful"}, {"username": "Renae Larcus", "comment_text": "There's our hotel and balcony!"}, {"username": "Daisy Yoo", "comment_text": "I bet very pretty during April spring time"}, {"username": "Kay Begg", "comment_text": "Can't wait til I am there soon"}, {"username": "Rosalie Rusty Armour", "comment_text": "We traveled to Varrena while spending eight days in Bellagio.. Lake Como🇺🇸🇮🇹"}, {"username": "Kylie Fletcher", "comment_text": "Jane Bryant I think this will be the way to go for a day."}, {"username": "Elaine Bowman-Dey", "comment_text": "❤️❤️❤️❤️"}]}, {"id": "2208555049543573", "text": "Is it any grocery to buy gluten free pasta cookies and cereals for kids? In milan verona florence?", "link": "facebook.com/groups/1373361046396315/permalink/2208555049543573/", "likes": 0, "comments": [{"username": "Carmen Capra", "comment_text": "Most grocery stores carry all kinds of wonderful types of food (cookies and pastries, frozen pizza’s, lasagna, pasta)"}, {"username": "Vivien Paulik", "comment_text": "Yes, in shops, supermarkets there are. You can buy gluten free cookies. There are rice cereals. I never bought but I am sure there is gluten free pasta too. Look it gor the local supermarket or coop and conad are good too."}, {"username": "Crystina Barnes", "comment_text": "Follow"}, {"username": "Maria Nikodimou", "comment_text": "Thank you 🙏"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208556312876780", "text": "Hallo,\nWe are planning to travel to Venice in the month of September and planning to stay in fucina camping. What are the cheap and best ways to travel locally and also best way to travel to the hotel from airport? Will we be able to get taxi or boat in the night around 3.00 am?", "link": "facebook.com/groups/1373361046396315/permalink/2208556312876780/", "likes": 0, "comments": [{"username": "Ibbu Mohd", "comment_text": "Water taxi -best bet after 11p right across Lucia station\nLocally- public ferries (vaporetta)"}]}, {"id": "2208557582876653", "text": "Please recommend hotels in Sorrento", "link": "facebook.com/groups/1373361046396315/permalink/2208557582876653/", "likes": 5, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2762\n02-Reviews-Gran\nd_Hotel_Capodim\nonte-Sorrento_P\nrovince_of_Napl\nes_Campania.htm\nl"}, {"username": "Roberto De La Vega", "comment_text": "Parco dei Principi"}, {"username": "Clare Eddington", "comment_text": "Antiche mura x"}, {"username": "Christine Sanci-Gentile", "comment_text": "Hotel Grand President"}, {"username": "Emma Butcher", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Frances Scannapieco", "comment_text": "I only stay at Hotel Antiche Mura. In the center of Sorrento. Stayed there 4 times. Never disappointed. Fabulous and literally less that 50 feet from the Center"}, {"username": "Sasha Childs", "comment_text": "Nastro azurro"}, {"username": "Tamriko Chanishvili", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Geoff Roush", "comment_text": "Imperial Hotel Tramontano Sorrento is the best!"}, {"username": "Aiden Sone", "comment_text": "Grand Favorita"}, {"username": "Dawn Palumbo", "comment_text": "Grand Hotel Capodimonte"}, {"username": "Aaron Uher", "comment_text": "We have just booked (haven’t stayed there yet) Leone Rosso apartments in Sorrento. They had very good reviews and was very reasonably priced."}, {"username": "David Morris", "comment_text": "Grand Hotel Aminta"}, {"username": "John Chris Cooper", "comment_text": "Villa Silvana - boutique hotel that is amazing! We’re currently staying there!"}, {"username": "Rob Wolfe", "comment_text": "Hilton Palace Sorrento"}, {"username": "Dan Trudi Flynn", "comment_text": "Hotel de la Ville"}, {"username": "Tanya Cini-Kirk", "comment_text": "Hotel Rivage"}, {"username": "Nancy Fricke Corsi", "comment_text": "Palazzo Jannuzzi Relais"}, {"username": "Virgz Van Møøre", "comment_text": "Palazzo Montefusco"}, {"username": "Lauren Van Bavel", "comment_text": "Hotel Miramare, looking fwd to our 4th stay next year."}, {"username": "Anthony Long", "comment_text": "Bellevue Syrene."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Recommendations\nare useless unless you state your budget."}, {"username": "Andre Le Huray", "comment_text": "Naomi Murphy"}, {"username": "Kally Trahearn", "comment_text": "Hotel Plaza Sorrento - have stayed there and loved it. Reasonably priced. Next door is the much more expensive Hotel Antiche Mura, so depends on your budget, but if you just want a decent hotel that is clean, good breakfast, close to everything, great staff, rooftop bar and infinity pool, then Hotel Plaza Sorrento fits the bill nicely and you have more $$$ for good food, drink and tours."}, {"username": "Donna Mangone", "comment_text": "Hotel Michelangelo"}, {"username": "David Kennedy", "comment_text": "Grand Hotel Capodimonte"}, {"username": "Jamie Carney Moeller", "comment_text": "A charming accommodation is a b & b in Sorrento with great reviews and reasonable."}, {"username": "William Deluca", "comment_text": "Hotel Meditteraneo"}, {"username": "Julie Atkinson", "comment_text": "Depends on your budget but if you can swing it I highly recommend Grand Hotel Excelsior Vittoria. You won’t be disappointed."}, {"username": "Suzanne Grundy", "comment_text": "Hannah Brxwn"}]}, {"id": "2208558359543242", "text": "Will be staying close to the Rome airport on our last night and looking for recommendations of a good restaurant.", "link": "facebook.com/groups/1373361046396315/permalink/2208558359543242/", "likes": 1, "comments": [{"username": "Annette Mayer", "comment_text": "Following"}, {"username": "Sheryal Shaw Slade", "comment_text": "Following too"}, {"username": "Jerry Kiger", "comment_text": "How far is Rome airport from Rome center major tourist spots? Heard taxi capped at 50 E but not sure actual distance"}]}, {"id": "2208564609542617", "text": "Can anyone recommend a private driver to get to Positano from Salerno… The ferry we booked supposedly had rough seas\nI really need to get there. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2208564609542617/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Salerno/\nTransfer-from-Sa\nlerno-train-sta\ntion-or-port/\nd4736-89317P3?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Kay Rendall", "comment_text": "Try Positano Limousines. Use them yr after yr. Or ask accom to organise something for u. They often have someone special they use."}, {"username": "Dianne Radcliff", "comment_text": "Try GetTransfer.com\n."}, {"username": "Romilly Farina", "comment_text": "Ferdy was great for us. Just Google Cars by Ferdy."}]}, {"id": "2208566572875754", "text": "I know there has been a lot info on train tickets. However now I am trying to book Milan to Bologno on Omio. Business class but it doesn't show that I can reserve a particular seat, facing forward otherwise I get sick. Any advice please\nIn prior year's have just gone to station 2 days before and bought tickets from machine however this time I will be transferring from Como so this is not an option\nAny help appreciated as 1st train on 3 mth trip. All seems very different to pre covid", "link": "facebook.com/groups/1373361046396315/permalink/2208566572875754/", "likes": 0, "comments": []}, {"id": "2208571786208566", "text": "Hello !\nIs anyone currently in Sicily? How is the situation with wild fires? Is it safe to travel there? Thank you !!", "link": "facebook.com/groups/1373361046396315/permalink/2208571786208566/", "likes": 2, "comments": []}, {"id": "2208571176208627", "text": "Hello, i’m visitions Italy at thé end of september Venise, Florence naple and Rome. Is there a lot tourist and do i havé to reserve train or wait there ?", "link": "facebook.com/groups/1373361046396315/permalink/2208571176208627/", "likes": 0, "comments": [{"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We were just there and it was very crowded. However, we booked our trains as we traveled and didn't have any problems. This allowed us flexibility as to the time of day we wanted to leave."}, {"username": "Edoardo Casolo", "comment_text": "Just be careful of saying your name in Venice"}, {"username": "Miyuki Kanno Paul", "comment_text": "September is still in high season. Expect tourists! More cruise ship people will be day tripping as well"}]}, {"id": "2208577096208035", "text": "Just asking for an opinion - we are booked to stay in Praiano for 3 nights due to a few changes we were considering staying 1 of those nights in capri - we are driving down from Matera so plan would be to drive to Sorrento leave car at ferry then go to Capri - stay the night then hopefully be able to do the blue Grotta tour from the island then goआणखी to our hotel in Praiano the following day\n\nWhat would be the best option?\nI’m concerned getting in late arvo from Matera and stuffing around with car and bags etc if it’s worth actually staying in Capri or if just doing a tour the following day would be just as good\n\nSorry for the long post🤷‍♀️🤦🏽‍♀️🤗", "link": "facebook.com/groups/1373361046396315/permalink/2208577096208035/", "likes": 0, "comments": [{"username": "Diane Davis Lawyer", "comment_text": "We were booked for four nights on Capri (using it as a jumping off point to visit the coastal towns) but I ended up canceling our nights there and we're staying on the mainland instead. Reading here about all of the ferry cancelations and delays gave me pause that we might be 'stuck' on Capri and I just didn't want to risk it. It was just a personal choice chalked up to my anxiety issues, lol."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Truthfully, the Blue Grotto is a nightmare at this time of year!"}]}, {"id": "2208574972874914", "text": "Italia Milano", "link": "facebook.com/groups/1373361046396315/permalink/2208574972874914/", "likes": 40, "comments": []}, {"id": "2208578626207882", "text": "Hi everyone, I have 8 days to drive from Torino to a small town South of Napoli at the end of September.\nI want to make the most of it and was thinking of spending\n2 nights in Florence\n2 nights in an agroturismo… आणखी along the way\n3 nights in Rome (I've been before but my husband and kids haven't, so we need some time to see the basics)\nHere are my questions:\nWhat do you think of this plan? Does it make sense overall?\nDo you have any great (but affordable) agroturismo places to recommend?\nAny other place to recommend (not Napoli because we'll have plenty of opportunities to go there when we're at our next location) where we could spend the 8th night? Is Bologna worth a stop for instance? Or any other place that could allow for a great experience (not necessarily history related as we'll be seeing lots of that in Rome and Florence)\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2208578626207882/", "likes": 1, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "About Agriturismo, if you want to go frugal, don’t buy half/full board and dine out elsewhere. We did enjoy our dinner at our agriturismo in Alberobello along with majority of occupations there, though"}, {"username": "Chadd Engel", "comment_text": "https://\nmaps.app.goo.gl/\n4mUAaqTqi5ijpZvs\n8?g_st=ic\n\nAwesome place in Orcia valley southern Tuscany."}, {"username": "Claudia Castellini", "comment_text": "Yes, Bologna worth a visit and it’s on your way: I think it’s a good option!"}, {"username": "Angela Gilmore", "comment_text": "You could also visit Genoa"}, {"username": "Jodi Homes", "comment_text": "Love Bologna"}]}, {"id": "2208580736207671", "text": "Italia Ortisei", "link": "facebook.com/groups/1373361046396315/permalink/2208580736207671/", "likes": 76, "comments": [{"username": "Linda Chagnon", "comment_text": "Looks lovely & easy to get around."}, {"username": "Katie Alexander", "comment_text": "Gorgeous pics ❤️"}, {"username": "MaryLou Capobianco", "comment_text": "Absolutely gorgeous!!! Looks like parts of Germany and Austria."}, {"username": "Rosario Zavala", "comment_text": "Hermosos paisajes"}, {"username": "Helen Stokes", "comment_text": "Looks like Switzerland"}]}, {"id": "2208582139540864", "text": "Hi travelling from Australia, I was just wondering, we are wanting to hire a car in Milan, is it cheaper to book here or once we get there.", "link": "facebook.com/groups/1373361046396315/permalink/2208582139540864/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "book in advance https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Iris Weber", "comment_text": "Depends on when you travel. In high season it might be difficult to get a car once you are there. I always book in advance to be on the safe side."}]}, {"id": "2208588382873573", "text": "Looking for hotel recommendations in Cinque Terre!", "link": "facebook.com/groups/1373361046396315/permalink/2208588382873573/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187819-d2676\n66-Reviews-Arpa\niu-Manarola_Cin\nque_Terre_Itali\nan_Riviera_Ligu\nria.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187821-d2507\n4996-Reviews-Th\ne_Sunset_Line-R\niomaggiore_Cinq\nue_Terre_Italia\nn_Riviera_Ligur\nia.html"}, {"username": "Anna Buchan", "comment_text": "Il collie monterosso"}, {"username": "Lena Leone King", "comment_text": "Just booked EC Luxury Rooms in Riomaggiore. Views look😃 amazing. Does anyone know if you can park a rental car in La Spezia overnight since we are staying one night in Cinque Terre? Thank you!"}, {"username": "Tonsia Keytel", "comment_text": "Stay In Monterosso, easier to navigate luggage, just as nice and easy to get to other villages on the train. Many nice hotels on beach side of village."}, {"username": "Jocelyn Kline", "comment_text": "We stayed at Hotel Stella Della Marina and it was great!"}, {"username": "Lindsey Lobeck Shian", "comment_text": "We are here right now with 2 teenagers. We rented a house in Monterosso, highly recommend. Monterosso is much quieter than the other towns. Food is amazing! Beach is great but recommend reserving beach chairs."}, {"username": "Holly Baldassare", "comment_text": "Hotel Pasquale!"}, {"username": "Lisa DiDonato Hayden", "comment_text": "Albergo Degli Amici! Very affordable, in the center of old Monterosso and a five level garden with stunning views! We loved our stay there!"}, {"username": "Presley Wilkie", "comment_text": "Hotel Porto Roca!"}, {"username": "Alice Engstrom", "comment_text": "Hotel Pasquale"}, {"username": "Bob McCann", "comment_text": "We highly recommended Marinas Air n Bnb .. fantastic location in Riomaggiore !!"}, {"username": "Anne Fisher Olson", "comment_text": "That’s an incredible Airbnb!"}, {"username": "Tash Campbell", "comment_text": "Hands down recommend incanto in manarola. The room was amazing, staff were very attentive, fantastic location and super easy to get to."}, {"username": "Sam Pullin", "comment_text": "Donna Santospirito 🇮🇹"}, {"username": "DerricknCatherine Fejarang", "comment_text": "Out of the 5 villages, I’d stay in Monterosso again. Convenient and easy to get around, especially with luggages. Nice beaches. You can easily visit the other villages. Hotel Pasquale is near the water, between the old and new town with ocean view."}, {"username": "Yuko Y Smith", "comment_text": "https://\nwww.baiahotel.it\n/"}, {"username": "Tammy Wells Mock", "comment_text": "We loved Hotel Pasquale in Monterosso. It was right on the beach and very well located and comfortable."}]}, {"id": "2208603789538699", "text": "Hello from Australia 🇦🇺\nHave loved reading and seeing great pics and advice on this site.\nGoing to Italy in 3 weeks.\nBeginning our trip in Rome for 2 nights, staying beside Piazza Navona.\nLooking for recommendations for restaurants in Trastevere. Traditional family run business, not the touristy type ones.\nWe are a family of 6 adults.\nThank you 🌸", "link": "facebook.com/groups/1373361046396315/permalink/2208603789538699/", "likes": 1, "comments": []}, {"id": "2208607819538296", "text": "We will be in Italy for 2 weeks in September. Can anyone recommend some good restaurants for our 3 nights in Florence, 2 nights in Rome and a week on the Amalfi Coast?\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2208607819538296/", "likes": 1, "comments": [{"username": "Joe Gelardi", "comment_text": "Persus in Florence for bistecca Florentine"}, {"username": "Bill Dest", "comment_text": "Check Stanley Tucci’s website. He has some good insights . There was a good restaurant in the water near Sorrento called Lo Sgolio he recommended"}, {"username": "S Christian Everett", "comment_text": "Positano’s best high end restaurant…that\n’s not a tourist trap is Casa Mele.\n\nWe’ve been 4 times , it’s phenomenal and cost effective\n\nhttps://\nwww.casamele.com\n/"}, {"username": "Gretchen Abee Rombold", "comment_text": "Elle Effe for Carbonara!!"}, {"username": "Jennifer Smith", "comment_text": "Following"}, {"username": "Karrie LeBlanc", "comment_text": "We enjoyed our dinner last week at Oliviero on Via delle Terme in Florence. If you’re in Santo Spirito neighborhood also visit Tuscan Taste Florence for a stop for glass of wine and snack."}, {"username": "Jackie Gotelli", "comment_text": "La giostra in Florence is amazing"}]}, {"id": "2208619022870509", "text": "Does anyone have any experience booking with TripMasters?", "link": "facebook.com/groups/1373361046396315/permalink/2208619022870509/", "likes": 5, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Yes. Twice. No problems."}, {"username": "Christine Byrne", "comment_text": "We are getting ready to take our tripmasters trip to Italy!!\nSeptember 20!! No problems, they were great to work with through COVID"}, {"username": "Kimberly Lampros", "comment_text": "yes, I had a very good experience with them when booking my first European vacation (Rome, London, Dublin). I booked flights, hotels, and tours. They even reached out to me when they realized that I had 2 tours overlapping timeframe."}, {"username": "Joan Adams Schilling", "comment_text": "Yes. Used them for our 2 week trip to Ireland. Was able to customize the itinerary. Everything went without a hitch"}, {"username": "Marion Stadtlander DeZenzo", "comment_text": "I used them once for a trip to the Christmas Markets in Prague, Budapest and Vienna. We had no problems with booking through Tripmasters. It was probably one of the best trips I’ve ever been on."}, {"username": "Renee Tanner", "comment_text": "We have a friend that uses them often. His only advice is just the same for any of the online intermediaries,\nmake sure to contact your accommodation locations to confirm your stay."}, {"username": "Melody Miles", "comment_text": "Good to know I’m looking at their itineraries,"}, {"username": "Romilly Farina", "comment_text": "Worked through them 3-4 times now. Always a great experience. Money saver too."}, {"username": "Diane Clifford Sykes", "comment_text": "We booked vacations with them to China and South America; they were able to customize our trips with our own personal tour guides. Excellent customer service. We highly recommend."}, {"username": "Christine Cassidy", "comment_text": "All the time and they are great. Great customer service. Just make sure you look at the reviews of the hotels and pick the ones that are close to attractions."}, {"username": "Anne Johnson", "comment_text": "I used them for a trip we are about to leave for-rome, venice, split and dubrovnik. The trip was originally cancelled due to covid in 2020, they were great to work with getting all travel credits back for future travel. So far everything seems to be good, I did make sure to call hotels to confirm reservations. I’ll post update after the trip. Can’t wait!!"}, {"username": "Billie Frances Swanda", "comment_text": "No"}, {"username": "Véronique Piercey", "comment_text": "Booked a trip to Hawaii with them. Was perfect."}, {"username": "Heather Abbey", "comment_text": "I’m guessing travel insurance is the best way to go?"}]}, {"id": "2208609096204835", "text": "Byron's Grotto, Portovenere", "link": "facebook.com/groups/1373361046396315/permalink/2208609096204835/", "likes": 2, "comments": []}, {"id": "2208635759535502", "text": "Hi everyone. Trying to book ferry tickets to Capri from Sorrento. Can someone tell me what Grudon means? Is it the name of the ferry?", "link": "facebook.com/groups/1373361046396315/permalink/2208635759535502/", "likes": 0, "comments": [{"username": "Roz Fawcett", "comment_text": "It’ll be the name of the ferry company there are a few different ones"}]}, {"id": "2208636642868747", "text": "Hello! Looking for some advice re: Lake Como\n\n1. Best way to get from Milan Malpensa airport to Menaggio, Lake Como.\n\n2. Any “must do, must see” recommendations for Activites/Restaurants/Sunsets/Sunrises/Lake Views in Lake Como? (Staying in Menaggio, Bellagio, then Como)\n\n3. Is the ferry system fairly simple to navigate if I purchase a day pass each morning? Or should I book them all online now before heading to Italy?\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208636642868747/", "likes": 4, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Ferno/\nPrivate-Transfer\n-from-Milan-Mal\npensa-Airport-t\no-Lake-Como/\nd50509-304082P1?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lake-Como/\nWalking-tour-Tre\nmezzo-Isola-Com\nacina-Villa-Bal\nbianello/\nd26113-191183P8?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lake-Como/\nBoat-Rental-With\nout-License-40c\nv-Motor-on-Lake\n-Como/\nd26113-366838P4?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Angelita Reyes Lara", "comment_text": "From Milan to Cuomo by train, then take ferry"}, {"username": "Renae Larcus", "comment_text": "Don’t forget about Varenna! Charming with some good places to eat. We stayed in Varenna and loved it."}, {"username": "Ibbu Mohd", "comment_text": "If u can rent car do it, if not , direct train from mxp to milan centrale station then to varenna (direct train -trenord)\n\nlakes Ferry system: purchase tickets online , avoid lines at ticket counters. Learn the map/routes\n\nnavigazionelagh\ni.it/en/"}, {"username": "Miyuki Kanno Paul", "comment_text": "Rick Steves Italy guidebook has them all"}, {"username": "Alison de Lisle", "comment_text": "We caught the train from Milan airport to Milan central station and then out to Como. It was pretty straightforward\n.\nWith the ferries, you can only buy the fast ferry tickets on the day in person. The slow ferry I think you can book online but it takes a lot longer."}, {"username": "Eric Lange", "comment_text": "Second the comment about Varenna. There are 2 villas with lovely gardens there."}, {"username": "Gemma Marie", "comment_text": "This is so helpful!! Thank you all ♥️"}]}, {"id": "2208635996202145", "text": "Hello, has anyone travelled by train or bus from Bari to Naples? Then on to Sorrento? Was the bus/train pretty much on time? Thank you 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2208635996202145/", "likes": 1, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "You must take very early morning train at Bari Centrale and transfer in Caserta in order to get to Napoli Centrale. Once arrive at Napoli, go underground, 5 minute walk to Piazza Garibaldi/\nCIRCUMVESUVIANA station. Make sure you get on SORRENTO LINE. It will take you all the way to final destination Sorrento. More than likely your train at Bari is coming from Lecce"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208649086200836", "text": "Can anyone tell me how long The hike from Minori to Ravello is? We are situated at orto Paradiso (b&b) looking down on Minori and consider hiking to Ravello this evening. Is that duable with an 8 year Old? Any restaurant recomandations for dinner?", "link": "facebook.com/groups/1373361046396315/permalink/2208649086200836/", "likes": 0, "comments": []}, {"id": "2208638892868522", "text": "Planning my trip to Italy in few weeks time. What's the best option to get from Milan Bergamo Airport to Lake Como? It looks like I would need to get shuffle bus to the station and then to central train station and go from there. Any other options? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2208638892868522/", "likes": 0, "comments": [{"username": "Chloé Marie", "comment_text": "We are doing the train from Milan to Varenna and then a ferry to Bellagio"}, {"username": "Ibbu Mohd", "comment_text": "From airport to milan centrale to varenna - trenord -train, its direct."}, {"username": "Sheila Grant", "comment_text": "Bus from air to Bergamo station then take Train to Lecco and from there change train and take one to Varenna!"}, {"username": "Liva Klein", "comment_text": "Liva Klein"}, {"username": "Karen Blackmore", "comment_text": "The 1A bus, \"airport bus\" goes frequently from the airport to the station. Tap and pay on the bus, no need to book. Then train to Lecco and change for Varenna. Or for Como change at Monza. Trainline app good for the regional Trenord trains"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Train from Bergamo to Lecco and then train to Varenna. There ferry to Bellagio that seems to be the place you like the more. But visit Varenna!\n\nWhen will you get to Bergamo?"}]}, {"id": "2208670866198658", "text": "We’re due to travel from Venice to Rome - we’re travelling for a couple of weeks so will have suitcases. Will we be able to put them somewhere safe on the high speed train?", "link": "facebook.com/groups/1373361046396315/permalink/2208670866198658/", "likes": 2, "comments": [{"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We found luggage racks at the front of each car and also above the seats as on a plane."}, {"username": "Amy Sandler Riemer", "comment_text": "I’m doing same. Should be luggage racks. We’re using wheeled carry one and personal items"}, {"username": "Melanie Sartuche", "comment_text": "Buy business class seats. They are not that expensive and you have more room for your luggage"}, {"username": "Jenny Payne", "comment_text": "Go Italo fast train and buy second class or business , I watch my case till the train pulls out just to make sure as I put mine in the luggage area at the back of the carriage 🌻"}, {"username": "Devon Grandi Powell", "comment_text": "We just travelled business class from Rome to Venice last week. We had plenty of room for our bags overhead (4 of us, all with rolling carry ons)"}, {"username": "Catherine Johnson", "comment_text": "I do the same- watch my bag till the train leaves. Return to luggage area when stops are made and remain watching my bag till we leave."}]}, {"id": "2208702332862178", "text": "Hello! My wife and I are looking into booking a night tour of the colosseum on September 10th, but it looks like it’s sold out everywhere. I’m going to check coop culture repeatedly this week. Do any third party sites open up tickets this close or are we possibly out of luck?", "link": "facebook.com/groups/1373361046396315/permalink/2208702332862178/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nAncient-Rome-Eve\nning-Tour-Colos\nseum-and-Imperi\nal-Forum-no-ent\nrance/\nd511-55341P15?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Kari O'Brion", "comment_text": "Hey! Looks like you are too early to book via Coop Culture. Tickets become available exactly 30 days prior and then again 7 days ahead. Good luck!"}, {"username": "Ibbu Mohd", "comment_text": "If u dont get english tickets via coop, get italian tickets. Stay close to guide n use google translator app."}, {"username": "Karen Blackmore", "comment_text": "I don't think the coop culture website do nighttime tours on Sundays or Mondays, sorry. Tickets are for sale 30d before. Sometimes more become available 7d before"}, {"username": "Christina Ruckman", "comment_text": "I’ve been checking every day for underground night tickets for September and they haven’t opened up anything past August 31."}]}, {"id": "2208703322862079", "text": "Hi. Going to Verona for 2 days as part of our Italy trip but day trip to lake Garda one day and the other day to explore Verona is a Monday. Says Juliet’s house is closed on a Monday. 😞 Does anyone know if it’s possible to at least walk past and see it from outside?", "link": "facebook.com/groups/1373361046396315/permalink/2208703322862079/", "likes": 0, "comments": []}, {"id": "2208703879528690", "text": "Who is the best to book through for a night colosseum tour ? Viator?? Concerned about not being refundable. Lmk", "link": "facebook.com/groups/1373361046396315/permalink/2208703879528690/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nColosseum-Night-\nTour/\nd511-90364P4?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Victoria Laverty", "comment_text": "Coop culture direct"}, {"username": "Karen Blackmore", "comment_text": "Coop culture website. 30d before. Cheaper than anything else and won't get cancelled. Just tricky to buy!"}, {"username": "Gena Kona-Mancini", "comment_text": "Not sure when you're going but it looks like they aren't offering them as of September for a few months (night tours)"}, {"username": "Pär Wassholm", "comment_text": "Coop culture of course 😊"}, {"username": "Cat Furness", "comment_text": "I book everything through Viator - they are all refundable!"}]}, {"id": "2208704876195257", "text": "Would love suggestions on locations and specific places to stay around Lake Garda in late September earl October", "link": "facebook.com/groups/1373361046396315/permalink/2208704876195257/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187842-d3141\n53-Reviews-Hote\nl_Du_Parc-Sirmi\none_Province_of\n_Brescia_Lombar\ndy.html"}, {"username": "Aine Hefferon", "comment_text": "Lazise"}]}, {"id": "2208708126194932", "text": "Planning our 2024 trip! This group has been so helpful and I’ve made progress but am now getting overwhelmed and not sure if this is a good itinerary. Really considering a travel agent at this point for flights/transportation. Any thoughts and ideas are much appreciated. Fly into Split, Croatia for 2-3 nights. My husband lived there as a baby andआणखी wants to take our daughters. Fly from Split to Rome since only direct flight and then another flight to Florence where we will be for 4 nights. Then train to Naples and private driver to Sorrento and Amalfi coast for 4 nights. I really want to end in Taormina as my family is Sicilian so we would fly from Naples to Catania and drive to Taormina. Is this too much flying while there? Our ideal destinations are so spread out so I’m trying to minimize travel time while we are there.", "link": "facebook.com/groups/1373361046396315/permalink/2208708126194932/", "likes": 1, "comments": [{"username": "Glenn Todd Webb", "comment_text": "It’s a lot. You will spend a lot of the vacation in between sights and at airports. Why not fly to Rome and stay, skip Florence, then go down to Naples from Rome."}, {"username": "Laura Jetton", "comment_text": "Consider the train instead of flights. When you consider the time in an airport- sometimes the train may be faster."}, {"username": "Greg Saba", "comment_text": "I am guessing flights from US to Split likely will involve two planes. A third one from Split to Rome. Another Naples to Catania. And presumably one from Catania to Rome and then back to US. Six planes or so are do-able. One of the bigger issues might be delays and cancellations and how that sets your plans back. For example, we usually go to Rome a day before our return flights to the US, partly because the discount carrier from Sicily isn't going to protect us if we miss our Rome transatlantic connection. This sounds to us like two trips, and there is so much to see and do in Croatia and nearby Montenegro. And, also so much to see and do in Italy and Sicily. We have done many crazy trips (16 countries in 30 days) and last year Greek islands, Croatia, Montenegro, Bosnia, and Sicily and back to interior Greece, but I think that was a month, so if you are going to do it, please travel with only carry-ons and backpacks. We now own a home in Sicily, where we toured 76 places one year ago in May. Too much there too to see in a few days. And a photo of beautiful Montenegro to give you something else to consider."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Try to accept the fact that less is more and try to plan accordingly."}, {"username": "Miyuki Kanno Paul", "comment_text": "Is your family from Taormina? If anywhere on Sicilia works, take an overnight ferry to Palermo!"}, {"username": "Michelle Del Rosario-Brown", "comment_text": "I think your planning way in advance will make this trip exceptionally doable! Enjoy making arrangements, that is half the fun!"}, {"username": "Valerie Collanton", "comment_text": "If I understand your post correctly, you are flying into Rome and immediately going on to Florence. Depending on the timing, you could take the train from Rome FCO directly to Florence. There is one train per day I believe. That would get you right to the city centre and might be faster than a flight. Also the high speed train from Florence to Naples is about 3 hours. So again, it might be faster than dealing with airports. Driver could meet you at train station in Naples. If you want to go to Catania then flying is the way to go."}, {"username": "Kathleen Lunz-Gewirtz", "comment_text": "We are doing Italy and Greece next month.3 week trip just 2 moves\nRome\nTuscany day trip\nGreek isles cruise.. day trip to Messina / amalfi coast. And second day trip to Taormina\nMykonos\nTurkey\nSantorini\nAthens\n\nMaybe a cruise can get you where u want to go and be less expensive ￼￼￼ ￼and food included with less moving around??"}]}, {"id": "2208709219528156", "text": "Viator or get your guide tour operator for a night time tour of the colosseum???", "link": "facebook.com/groups/1373361046396315/permalink/2208709219528156/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nColosseum-Night-\nTour/\nd511-90364P4?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Victoria Laverty", "comment_text": "Coop culture direct site as a lot of third party sites sell this then cancel when they cant get enough tickets"}, {"username": "Marty Harte", "comment_text": "I used Viator “Colosseum by Evening Tour with Arena Floor.” Wound up being with City Wonders. Carlo was great."}, {"username": "Amy French Baillie", "comment_text": "Coopculture is official site…"}, {"username": "Jamie Bly", "comment_text": "For what it is worth…We had a great tour with Walks of Italy of the colosseum, Roman forum, and palatine hill. (4-7pm) tour."}, {"username": "Melissa Hunt", "comment_text": "No night tours offered on Coop Culture after August 31."}]}, {"id": "2208712496194495", "text": "Explore the gorgeous hilltown of San Gimignano in Tuscany! This amazing town was declared world heritage site by UNESCO and walking around through its narrow streets and admiring the beautiful views will giveआणखी you the possibility to feel in Medieval times.\n\nYou will learn about the many Medieval towers that give the town such a distinctive skyline. Churches, squares, alleys and fantastic views, San Gimingnano is not only its towers. The town is also famous for its Vernaccia wine production and its precious Saffron.\nJoin us: https://nextstop-italy.com/virtual-tours/san-gimignano/\n\n#italygram #history #virtualworld #italyiloveyou #italytrip #vacationmood #art #italytravel #VirtualTour #florenceitaly #tuscany #medievalart #tuscanytrail #renaissanceart #medieval #medievalart #medievaltimes #medievalworld #medievalcastle #medievalhistory #medievalarchitecture #sangimignano #sangimignanoitaly #sangimignanotuscany #sangimmy #tuscanygram #tuscanyexperience", "link": "facebook.com/groups/1373361046396315/permalink/2208712496194495/", "likes": 2, "comments": []}, {"id": "2208640486201696", "text": "Best hotels In Sorrento", "link": "facebook.com/groups/1373361046396315/permalink/2208640486201696/", "likes": 8, "comments": [{"username": "Kathy Massicotte Talnose", "comment_text": "Grand hotel ambasciatori"}, {"username": "Andrew Scivoli", "comment_text": "Hotel Ascott. Loved it. Family owned. Very nice people."}, {"username": "Marisa Milanese", "comment_text": "Hotel continental!!"}, {"username": "Tamriko Chanishvili", "comment_text": "Imperial Hotel Tramontano"}, {"username": "Sharron Moon Head Jones", "comment_text": "Grand hotel riviera"}, {"username": "Amy O'Neill", "comment_text": "Craig Chapman"}, {"username": "Sasha Childs", "comment_text": "Nastro Azzuro"}, {"username": "Roberta Higgs", "comment_text": "In my opinion, without doubt Grand Hotel Riviera"}, {"username": "Jill Tingley", "comment_text": "Belle view serene"}, {"username": "Kim Bliss", "comment_text": "Grand Hotel Excelsior Vittoria, Sorrento\nThe absolute best hotel I have ever stayed !!! Simply amazing!!"}, {"username": "Kristie Phelps", "comment_text": "Grand Hotel Ambasciatori was our favorite"}, {"username": "Ann Marie Laface", "comment_text": "La Favorita"}, {"username": "Sameer Karim", "comment_text": "We just left after a week of Hotel Mediterraneo, it was incredible. Staff was fantastic, hotel was top notch."}, {"username": "Lisa Pugliese", "comment_text": "Has anyone stayed at the Lorelei?"}, {"username": "Tara Roed", "comment_text": "Grand hotel la favorita was beautiful! Our room was great, nice size pool, great location and awesome staff"}, {"username": "Rachel Bradfield", "comment_text": "The Grand Capodimonte 🇮🇹"}, {"username": "Joanne Lesley", "comment_text": "Want to know the same 😊"}, {"username": "Tanya Cini-Kirk", "comment_text": "Hotel Rivage"}, {"username": "Darla Ehrhard", "comment_text": "Maison il Conservatorio, super clean, great breakfast, super location, and a most helpful staff!"}, {"username": "Sue Cornish", "comment_text": "Bellevue syrnene"}, {"username": "Hudd Cass", "comment_text": "Anywhere Along the cliff edge with a pool!"}, {"username": "Clelia Marcantonio Vanasse", "comment_text": "Anyone stay at Hotel Minerva?"}, {"username": "Patty Murphy", "comment_text": "We love Hotel La Tonnarella. Lovely hotel with a great view and wonderful friendly staff. The restaurant is fabulous."}, {"username": "Tam Wong", "comment_text": "Why not Salerno?"}, {"username": "Shellie Godden", "comment_text": "Hotel Royal"}, {"username": "Julie Atkinson", "comment_text": "Grand Hotel Excelsior Vittoria. Exceptional from the time you step foot on the property until the time you leave. Best breakfast buffet I’ve ever had. Fouquets is exceptional Michelin star restaurant. Pool and spa are divine. View is incredible. Rooms are well appointed right down to the linen sheets and most comfortable beds. Pavarotti and other celebs stayed here."}, {"username": "Megan O'Brien Kinsella", "comment_text": "We were just at Grand Hotel Riveria! AMAZING stay! We never wanted to leave!"}, {"username": "Betsy McCallum", "comment_text": "Antiche Mura"}, {"username": "Cindy Gallen Barton", "comment_text": "Grand Hotel Cocumella, a former Jesuit monestery"}, {"username": "Vera Hannan", "comment_text": "Catherine Whittard"}, {"username": "Christine Golia Brigida", "comment_text": "We love hotel Mignon, it’s clean close to everything"}, {"username": "Christine Sanci-Gentile", "comment_text": "Hotel Grand President"}, {"username": "Jennifer Vitucci-Rhodes", "comment_text": "Excelsior Vittoria ❤️"}, {"username": "Rob Wolfe", "comment_text": "We enjoyed the Hilton Palace Sorrento. Great Pool. Great restaurant. Easy location to walk to town center."}, {"username": "Danielle Nicole", "comment_text": "HOTEL CORALLO"}, {"username": "Steve Hill", "comment_text": "Yes Hilton Palace"}, {"username": "Kally Trahearn", "comment_text": "Hotel Plaza Sorrento - less than 1 min walk to Piazza Tasso"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2359\n55-Reviews-Bell\nevue_Syrene-Sor\nrento_Province_\nof_Naples_Campa\nnia.html"}, {"username": "Nancy Fricke Corsi", "comment_text": "Palazzo Jannuzzi Relais"}, {"username": "James DiLeonardi", "comment_text": "Parco dei Principi, assuming costs is not an issue"}, {"username": "Roberto De La Vega", "comment_text": "Parco dei Principi excellent choice!"}, {"username": "Sandy Radican Shikaly", "comment_text": "Grand Hotel La Favorita!"}, {"username": "Anita Clayton", "comment_text": "Antiche Mura"}]}, {"id": "2208660146199730", "text": "A fun series to watch on HBO Max is Stanley Tucci's Searching for Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2208660146199730/", "likes": 494, "comments": [{"username": "Joe Rybaltowski", "comment_text": "Lauren Rybaltowski\nCrystal Scarpitti"}, {"username": "Senan Haugh", "comment_text": "His book excellent read too.. especially if any Italians in the family !"}, {"username": "Christa Boles Stonehocker", "comment_text": "Loved it!"}, {"username": "Cindy Neilson", "comment_text": "I love that his connection to Italy is real and not tokenism ... (says I, the daughter of a Italian father 😊🇮🇹) Amore Italia!"}, {"username": "Jacqueline-Tom Quinlivan", "comment_text": "We love the show. Very informative and culturally accurate!"}, {"username": "Kristy Marston", "comment_text": "Leanne Beswick"}, {"username": "Mark Andrews", "comment_text": "🤔. I thought it was on CNN"}, {"username": "Amy Carroll-Saravana", "comment_text": "April Sangalang Richard"}, {"username": "Udo Stolarczuk", "comment_text": "Great show"}, {"username": "Lauri Eirp Gusta", "comment_text": "Great series!"}, {"username": "Megan De Luca", "comment_text": "Virginia Taylor watch this if you haven’t already ❤️"}, {"username": "Dianne Parisi", "comment_text": "Love this show except for all his swearing and taking the Lord’s name in vane. It detracts from the message and is totally unnecessary. The reason I won’t recommend it to others."}, {"username": "Denise Mosby", "comment_text": "It’s so good! I was surprised when my husband watched with me and also got into it."}, {"username": "Angie Weems Uzynski", "comment_text": "One of my favorites!!!"}, {"username": "Helen Stokes", "comment_text": "Is it in Australia"}, {"username": "Frank Hunt", "comment_text": "Stan’s the man!👍"}, {"username": "Phill Goodwin", "comment_text": "Surprisingly good....."}, {"username": "Theresa Skipper", "comment_text": "Makes me so hungry watching it!"}, {"username": "Jo Bourke", "comment_text": "Mark Campbell Scarlett Mcinnes"}, {"username": "Anuradha Ekanayake", "comment_text": "Loved this show!! Wish there had been more!"}, {"username": "Lina Stump", "comment_text": "My favorite ❤️ itson foodbetwork as,well"}, {"username": "Joanne Paladino Caso", "comment_text": "One of my favorites"}, {"username": "Karen Turck", "comment_text": "Bob Hargreaves"}, {"username": "Robert Baumann", "comment_text": "Heard they cancelled future episodes…"}, {"username": "Kerrianne Morris", "comment_text": "Steven Trembath… tonight"}, {"username": "Stephanie Garofalo", "comment_text": "Do you know if there new episodes airing on MAX or repeating episodes from its run on CNN?"}, {"username": "Jennifer Dobachesky", "comment_text": "Loved watching it. Wish I had seen it before going to Italy but I actually found it on the plane home."}, {"username": "Dawn Guest", "comment_text": "Love this!❤️"}, {"username": "Samantha Mann", "comment_text": "We’ve been watching this. Another one for food is Bobby and Giadda. So much yummy food!"}, {"username": "Laura Torres Palomino", "comment_text": "Pasta Grammar and Gino’s Italian Escape on YouTube are waaay better!!"}, {"username": "Ted Niescier", "comment_text": "Great series! On my second time through. Tucci eats his way across Italy. Beautifully shot. Some good recipe ideas, too!"}, {"username": "Danielle Balch Blundy", "comment_text": "We love this show"}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "Loved it!"}, {"username": "Courtney Brown", "comment_text": "Love the show! Watched it on my way to Italy this year on the plane and landed in Venice and went to explore and right away I recognized the guy from the show! So cool!"}, {"username": "Todd Cannon", "comment_text": "Darcy Watts"}, {"username": "Petra Keen", "comment_text": "That’s the reason the entire world 🌎 is going to Italy because everyone watched Stanley Tucci 😬👍"}, {"username": "Pam Villies Trikolas", "comment_text": "Tom Trikolas"}, {"username": "Christian Pyles", "comment_text": "I hope it gets picked up somewhere for it’s 3rd season - I really like it!"}, {"username": "Amy Wedel Prysock", "comment_text": "I loved it! We have already tried to recreate some of the dishes. Great resource to travel too."}, {"username": "Lisa Amellio-Chavez", "comment_text": "I loved this series. So disappointed that they cancelled it."}, {"username": "Lynn Clemens", "comment_text": "Mark Clemens"}, {"username": "Kit Nader", "comment_text": "Yes I saw it...really interesting"}, {"username": "Scott Heran", "comment_text": "It is really good."}, {"username": "Desiree Baker", "comment_text": "Yep! All reruns 🫣"}, {"username": "JoAnn Wheeler", "comment_text": "Fantastic series"}, {"username": "Jenni Vail", "comment_text": "Loves this series. His books as well!!\n\nFun fact: Eva Longoria has the same series for Mexico too!"}, {"username": "Shelly Miller", "comment_text": "Love this show"}, {"username": "David Baillie", "comment_text": "A pastiche of clichés!"}, {"username": "Carol Kozma", "comment_text": "Very informative series."}, {"username": "Lisa Powers", "comment_text": "The best!"}, {"username": "Michelle DiLorenzo", "comment_text": "One of my favorites loved this series we must go back very soon👍🍷🍷💕"}, {"username": "Mary Iuor", "comment_text": "Love this show too"}]}, {"id": "2208662129532865", "text": "We will be arriving in Rome in late September and have 2 1/2 days in Rome before we leave on a cruise. We are booked for the skip the line private tour of the Vatican and Sistine chapel. We are staying in Prati. I thought is to simply do a lot of walking around Rome rather than take additional tours the first two days. I would love any input andआणखी recommendations.\n\nOther questions: my travel partner, and I are flying from two different states. Our arrivals are predicted to be within minutes of each other, but because of potential delays were hesitant to book a private driver because it’s fairly expensive if they have to wait for hours. Staying at Orazio Palace Hotel in Prati Any recommendations on the best way to get there without having to schlep luggage thru the streets?\n\nCan anyone tell me how much time we should countdown to get from our hotel to the port in Civitecchia?\n\nCruise stops in Genoa. Any recommendations we have about eight hours there.\n\nThank you all", "link": "facebook.com/groups/1373361046396315/permalink/2208662129532865/", "likes": 0, "comments": [{"username": "Dr-Jon Warnecke", "comment_text": "Hi Janis! We'll be in Rome for two days mid September, and I'll leave mid October! Maybe our paths may cross!😊"}, {"username": "Robyn Lawson", "comment_text": "We will be in Rome mid September too, from Western Australia. I’ll wave to you all! 😊Hoping the crowds will be less crowded by then! The port is quite a way out. Can take an hour!"}]}, {"id": "2208663726199372", "text": "Planning a trip for June 2024, 8 adults. Looking for recommendations for VRBOs or Airbnbs in the Sorrento, Venice and Rome areas. TYIA", "link": "facebook.com/groups/1373361046396315/permalink/2208663726199372/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Venice https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FVacationRen\ntalReview-g1503\n5619-d19078785-\nLovely_apartmen\nt_at_Rialto_bri\ndge-Cannaregio_\nVeneto.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Sorrento https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FVacationRen\ntalReview-g1959\n355-d24318890-V\nilla_Firefly_wi\nth_panoramic_vi\new-Priora_Sorre\nnto_Province_of\n_Naples_Campani\na.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Rome https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FVacationRen\ntalReview-g1877\n91-d8531798-Ama\nzing_Vittoriano\n-Rome_Lazio.htm\nl"}, {"username": "Jerry Kiger", "comment_text": "Sorry I don’t have any info. I am\nAlso traveling sim areas, diff time, with 6+ group. Curious how you planning on traveling if my train or rental car etc? I’m thinking train start then rental back half but not sure. Appreciate any input."}]}, {"id": "2208663779532700", "text": "Looking for a recommendation for s place to stay in Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2208663779532700/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1213\n0410-Reviews-NY\nX_Hotel_Milan-M\nilan_Lombardy.h\ntml"}, {"username": "Colleen ClarkBurns", "comment_text": "Me too x"}, {"username": "Tony Gesmundo", "comment_text": "IBIS Centro Milan. Close to train station and metro stop. Good vibe at the hotel and we only paid about EUR100 per night (booked well in advance)."}, {"username": "Anita Clayton", "comment_text": "IQ Milano opposite station, book direct with hotel for better rates. Lovely bar on the top floor."}, {"username": "Jay Parekh", "comment_text": "Do a search in this group for key words like “Milan hotel” and you’ll find tons of existing suggestions."}, {"username": "Lara Grom", "comment_text": "Hi I live in Milan it depends on your budget. There are amazing B&b\nWhy don’t you try\nVigna di Leonardo they have apartments overlooking the Amazing vineyard overlooking the last supper area"}]}, {"id": "2208646306201114", "text": "Hi! Trying to book Colosseum tickets via coopculture exactly 30 days in advance of us being there and the tickets are not accessible (but not sold out). Does coopculture release tickets exactly 30 days in advance? Has anyone run into this?", "link": "facebook.com/groups/1373361046396315/permalink/2208646306201114/", "likes": 1, "comments": [{"username": "Karen Blackmore", "comment_text": "Yes, 30d in advance. Although they did have issues and they were delayed for early September. Seems to be ok again now."}, {"username": "Karen Blackmore", "comment_text": "If you want the night time tour, they come out in the evening. Meant to be at the same time as the tour (in Italian time)"}]}, {"id": "2208668316198913", "text": "I have been trying to secure tickets for Tuesday, September 5. Everything I read says tickets are released 30 days in advance, which would have been this weekend. Anyone know why September is still not available? Any insight appreciated, thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2208668316198913/", "likes": 2, "comments": [{"username": "Jay Parekh", "comment_text": "30 days from the date you want the tour. If you don’t see it, it’s not available yet or sold out. If you want to go on tour Sept 8, tickets are available Aug 8th starting 9am local time in Italy. I had to go back and refresh for few hours until I had the quantity available I need."}, {"username": "Jaime Cleek", "comment_text": "They are sold out"}, {"username": "Dianne Novak Iadanza", "comment_text": "First Sunday of every month is free admission. so no tickets available for sale if I understand correctly"}, {"username": "Christina Ruckman", "comment_text": "I noticed on the Italian tour it says the night tour tickets are available “to September.” Wondering if they are only available through August because none have been released for September that I have seen, and I’ve checked way too many times each day lol."}, {"username": "Michele Levesque Semosky", "comment_text": "I just logged in and saw the same thing….it looks like September 1,2,3 is not available as yet….strange"}, {"username": "Vanessa Jimenez", "comment_text": "Adam Jimenez"}, {"username": "Sonya Spiller", "comment_text": "I know I’m wondering the same thing! I’ve been emailing them and will let let you know if they say anything about it. They have been super vague so far just saying tickets open 30 days before"}, {"username": "Ibbu Mohd", "comment_text": "Book italian language tour n use google translate app (stay close to guide)\nRare cases: if all are eng speakin then tour is in english."}, {"username": "Tiffany Shrider", "comment_text": "Try a 3rd party like Get your Guide… I’ve used them plenty of times"}, {"username": "Vasthi Cheddar", "comment_text": "Sold out"}, {"username": "Taylor Fallas", "comment_text": "In this exact same boat! I'm wondering if they're stopping the night tours at the end of August? It seems strange that they haven't made a statement about it though. It's definitely not sold out since that would be red...hope we see some green soon!"}, {"username": "Leesa Martin", "comment_text": "If it’s dark grey they have already sold out. I tried and tried every 30mins until 2am Aussie time and couldn’t get tickets. Had to buy through 3rd party.\n\nWhen tickets did come available by the time I picked how many I wanted, said I was not a local scrolled down to the end and proved I wasn’t a robot, tickets were all gone. Hope you have better luck than me."}, {"username": "Jev Nuredini", "comment_text": "Good luck!They are close to impossible to get.The bots buy them and sell them at a ridiculous price as soon as they are released!We tried for months!We ended getting the Italian tour at night.They give you head phones if you want it translated!Thos\ne tickets were easy to get.The tour was awesome!"}, {"username": "Maicka Palomares", "comment_text": "Reggie hirap pala maka kuha tix"}, {"username": "Adriiana Q. Diaz", "comment_text": "I bought my tickets for septiembre 21, last week in get your guide☺️"}, {"username": "Kylie Robson", "comment_text": "Deidre Clark"}, {"username": "Sian James", "comment_text": "I've read a load of reviews/\ncomments about the ticket process but I'm really confused when people refer to buying English or Italian speaking tours. I've been on the site a few times trying to understand the ticket types before trying to get a ticket for mid September & I can't seem to see any tours with a guide? I can only find what appears to be a self guided tour? 🤦🏻‍♀️"}, {"username": "Altus Menifee III", "comment_text": "Try The Tour Guy. I was able to get last min skip the line tickets to The Vatican yesterday when they were sold out on every other site."}, {"username": "Karen Robertson Fitterer", "comment_text": "Yeah, saw the same thing for the night tour . Glad I’m not the only one to had misunderstood the website. I thought tickets would be available through September. Apparently not😞. I bought tickets for the day tour instead."}, {"username": "Kimberly Bos", "comment_text": "We loved it without a tour. Rick Steves in our ears."}]}, {"id": "2208669676198777", "text": "Traveling to Italy beginning of September. How soon can I purchase my train tickets? ￼", "link": "facebook.com/groups/1373361046396315/permalink/2208669676198777/", "likes": 0, "comments": [{"username": "Diane Wilkerson", "comment_text": "Now."}, {"username": "Ahmad Seafan", "comment_text": "Just when u arrived or couple days before"}, {"username": "Diane Davis Lawyer", "comment_text": "I'm stuck in the same place. I did buy one set of tickets in advance, ended up changing our plans and had to ask for a refund. We received a 90% refund--which was certainly better than nothing. It cost extra to receive that refund as well! We are staying in Florence and need RT tickets to Rome for one day (we have a late afternoon Vatican tour that day) so I have NO idea when it's best to buy the tickets to ensure we have a seat to/from Rome that day! Ugh! You have to pay extra for refundable tickets and to get into a higher class as well. Ugh."}, {"username": "Rachael Richardson", "comment_text": "I’d say when it suits you, if your plans are set in stone then do it now , if you may change plans leave it nearer the time ."}, {"username": "Jason Hobel", "comment_text": "Now. Don't hesitate. Buy early and save."}, {"username": "Greg Baker", "comment_text": "Should be able to get them now or depending on how you want to plan your trip, you can get at train station but best bet is to get them in advance IMO"}, {"username": "Casarine Temple", "comment_text": "I booked my trains … Rome-Florence-V\nenice as soon as they were available . I’m also going in September."}, {"username": "Casarine Temple", "comment_text": "Diane Davis Lawyer Yeah , I booked all refundable tixs and Prima class with Italo at a higher price ."}, {"username": "Miyuki Kanno Paul", "comment_text": "NOW!"}, {"username": "Renae Larcus", "comment_text": "Now. They are usually released 60-90 days in advance"}, {"username": "Line Gregoire", "comment_text": "Now"}, {"username": "Gillian O'Callaghan", "comment_text": "I did 13 train trips in Italy and got mine between 2-7 days out. I used the Trainline app which worked perfectly."}, {"username": "Carole Tarlap", "comment_text": "When you get to the station 🤷"}, {"username": "Jekaterina Valujeva", "comment_text": "Never had a problem to buy tickets directly before departure🤷‍♀️"}, {"username": "Katy LeMasters", "comment_text": "The farther out you buy them the cheaper they are. I created an account with Italo & got a discount code. I booked the fast train from Rome to Florence and then from Florence to Venice for a month away."}]}, {"id": "2208459049553173", "text": "Looking for recommendations for an itinerary in Florence/Tuscany without renting a car. Trying to decide if we should make Florence our base. If Florence was your base and you had 4 days… how would you organize your time seeing the different areas of Tuscany like Sienna, Pisa, Lucca, bologna etc? What would be your top “must see” towns and how would you group them, please?", "link": "facebook.com/groups/1373361046396315/permalink/2208459049553173/", "likes": 7, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nTuscany-Day-Trip\n-from-Florence-\nSiena-San-Gimig\nnano-Pisa-and-L\nunch-at-a-Winer\ny/\nd519-5070TUSCANY\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Bologna by train"}, {"username": "Michael Broadwater", "comment_text": "Trains don't go everywhere, so you're kinda limited unless you're gonna hire a private driver or join some sort of tour. You will only need maybe a half day in Pisa as there isn't much there. Bologna isn't part of Tuscany, it's in the Emilia-Romagna region but I hear the food is amazing."}, {"username": "Jeanne Eliason", "comment_text": "Lucca is about 1 1/2 hours by train one way. Siena is doable. Trains are walkable to walled city of Lucca. Siena one must go up a series of escalors and then turn left. The walled city is a short walk. The trouble with Florence is one must first get to SMN station. That's why we stay in Sinalunga because we can walk to the train station and just buy our tickets from the ticket machine or the tobacco shop which is attached to the train station. Remember a town like Montepulciano is not accessible by train. The bus schedule does nor go at times convenient for us so the lovely place we stay the owner drives us."}, {"username": "Mariya Yankelevych", "comment_text": "Florence hop on hop off bus option pays for itself."}, {"username": "Valerie Collanton", "comment_text": "SMN station is very accessible in Florence so I would not let getting to/from train station deter you. I would consider doing a tour of Chianti area with a private driver. Sienna for sure. Bologna is an easy day trip. Short train ride."}, {"username": "Bethany Rudy", "comment_text": "We loved Lucca! Definitely worth a visit!"}, {"username": "Gina Rovello Keenan", "comment_text": "You can train to most of those places. Hire a private driver to tour Tuscany wineries and towns. Definitely take the train to Bologna! Google day trips from Florence to see what to do and how to get there."}, {"username": "Cindy Sguazzin", "comment_text": "I loved Bologna—for the ambiance—oldest\nuniversity in Italy—absolutel\ny outstanding food—even just a panino will knock your socks off!"}, {"username": "Rose Turdo", "comment_text": "Rent the car, make your time and see it all."}, {"username": "Jenny Payne", "comment_text": "I would stay in Florence, the area I always stay in is Santo Spirito great area it is about 15/20 minutes walk to SMN termini . I would catch the bus to Siena as it drops u right out the front of the town as the station u have to taxi bk to town. Lucca is a wall town and just as beautiful as Siena. I never get tired of starting Florence as I go twice a year and have done for 16 years🌻"}, {"username": "Ashley Martins", "comment_text": "Pisa & Lucca one day by train. Sienna & San Gimi another day with a winery visit (bus probably best for this as San Gimi train station is not in the city). Bologna easy day trip by train."}, {"username": "Max Sorber", "comment_text": "Friends stayed in Lucca\nAnd took trains from there to Florence etc"}, {"username": "Richard Dreo", "comment_text": "im visiting Florence for 10 days in January and will be stopping at the following towns: Bologna, Ferrara, Siena, San Gimignano, Assisi, Perugia, Arezzo. Maybe Lucca and Pisa. Not all in Tuscany but easily accessible and relatively small for a quick walk through and a bite to eat.\n\nFlorence is amazing and has endless things to do as well."}, {"username": "Suzanne Shea-Simpson", "comment_text": "Monterosso, Cinque Terre, Italy"}]}, {"id": "2208686409530437", "text": "Heading to Rome Sept 10 to 14. I know that I’ll have jet lag and haven’t reserved Vatican or anything. What are the must do’s? Never been before. 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2208686409530437/", "likes": 13, "comments": [{"username": "Lori Risley-Rose", "comment_text": "The Vespa by night tour of the city. It was so much fun and we got to see so many sights. I booked it through Viator"}, {"username": "Angela Macias", "comment_text": "A few days before start adjusting your sleep schedule and make sure you get on plane nice and tired so you sleeping the flight.\nPurchase tickets to get full tour of the coliseum. Trevi fountain and the catacombs underneath (need tickets for catacombs) Spanish steps , Pantheon. You don’t need reservations for the Vatican unless you go into the Sistine Chapel."}, {"username": "Leanne Dawn Sutton", "comment_text": "Yes I believe you will need tickets for Vatican and colosseum and both are so amazing, worth every penny. Skip the line and early morning I’ve heard is best for Vatican. My husband and I have booked those 2 but then the rest of Rome is pretty open, a good balance I think."}, {"username": "Fran Fitzpatrick", "comment_text": "Vatican,The Colloseum,Trevi\nFountain,Panthe\non and Spanish steps.Buy tickets in advance(skip the line).I believe the Pantheon is no longer free.\n,"}, {"username": "Mandy Pusateri", "comment_text": "We are going to be in Rome Sept. 12th - 15th!!"}, {"username": "Roseanne Napolitano Dailey", "comment_text": "Sunrise tour of the Vatican book directly on the website"}, {"username": "Nancy Lewis", "comment_text": "Take a city wide bus tour first day. Then decide what you want to go back to see the rest of your visit. I prefer staying near the Spanish steps around Piazza Popolo"}, {"username": "Miyuki Kanno Paul", "comment_text": "Majority of people only talk about Colosseum and Vatican museum. I say Roman Forum and Palatine Hill! Trajan’s market! Appian Way! Bath of Caracalla or Diocletian! Galleria Borghese(advanc\ned reservations required)! Pantheon! Trevi fountain! So many indoor museums to choose from! There are so much more!"}, {"username": "Linda Gershun Landon", "comment_text": "Worried I would not feel great after flying overnight, I hesitated to book tours. But then I realized even 2.5 months out, most yours would already be sold out."}, {"username": "Judy L Jones-York", "comment_text": "As well as just hitting the main sights everyone does, we did several walking tours that were great. One an evening tour of the popular places that started at the Spanish Steps. Also did the catacombs outside town. St Clememt Basilica was a must see. Do the tour and you will learn more about the underground and ancient levels. Literally just wandered around the city. My favorite was spending a day at Ostia Antika, a Roman ruined city, outside of Rome, that was by far the coolest thing I have ever seen. While wandering. I discoveredthe location Julius Caesar was assassinated. Found a cool city market. Many more ruins around the Jewish \"GETTO\". Everywhere you go. You will find something amazing. Just keep your eyes open."}, {"username": "Terry Pisano", "comment_text": "I'm doing a golf cart tour the day we get there. Seems easy enough to manage with jetlag and a nice city intro."}, {"username": "Lina Schmidlin Young", "comment_text": "I honestly would do as others said, just walk around and see what you want to see. Unless you really love museums or are dying to see the Sistine Chapel, I would skip the Vatican Museum and instead, just visit St. Peter’s. I think a lot of people think they have to get tickets to go to St. Peter’s, but you don’t and it takes a lot less time to go through and it is beautiful. Other than that there are so many things you can see by walking around!"}, {"username": "Laura Lvdl", "comment_text": "Food tour in Rome shouldn’t be missed. We couldn’t stay in the Vatican because it was so hot and left early. Someone suggested taking a nighttime tour of the Vatican. Several others said it was incredible. I would do that if I get back to Roma again."}, {"username": "Tiffany Shrider", "comment_text": "My husband and I just stay up until time to go to bed Rome time! It’s worked everywhere we’ve traveled from the states! It’s worked!"}, {"username": "Karen Marie", "comment_text": "Get no jet lag pills on Amazon, they work great!"}, {"username": "Bill Elias", "comment_text": "Wander. Get lost. Eat good food. Download some Rick Steves free audio tours."}, {"username": "Karrie LeBlanc", "comment_text": "Palazzo Doria Pamphilli Gallery on via del Corso you don’t have to prebook. Get the audio guide! https://\nwww.doriapamphil\nj.it/roma/"}, {"username": "Sara Butcher", "comment_text": "I enjoyed the hop on hop off bus. I saw lots, got bearings and decided where to get off next time around! ❤️🇮🇹🇦🇺"}, {"username": "Susan Parker Clifton", "comment_text": "St. Peter in Chains, Michelangelo’s Moses"}, {"username": "Agnes Sax", "comment_text": "I have a nighttime tour of the Vatican booked for late September and I’m thrilled and excited I did the happy hour tour. We’ll go see St. Peter’s prior to going to the happy hour!￼"}, {"username": "Cindy Sguazzin", "comment_text": "The Pieta by Michelangelo in St. Peters, the Sistine Chapel, the Pantheon, the Trevi Fountain, the Colosseum, and a day trip to Tivoli!"}, {"username": "Dana Green", "comment_text": "Borghese Gallery, Vittorio Emmanuel Monument, Pantheon, walk around outside Colosseum, Go to Trevi Fountain and throw your coin in. Trastevere or Jewish Ghetto for food."}, {"username": "Patty Crowther Pearce", "comment_text": "Definitely get tickets for anything you really want to do. The Borghese museum is a must."}, {"username": "Laurafloyd Sheryer", "comment_text": "Do a city bike tour with Star bikes the company is just across the way from the Colosseum , they also do the Appian way tour both brilliant have used them a couple of time you get to see so much this way 😍"}, {"username": "Annette Giovia", "comment_text": "Go to the Fountain of Trevi and toss in a coin, make a wish thatvyou will return. The Spanish Steps are close by, buy a gelato, sit on the steps and just watch the ppl. The Piazza Navona is close by. There you can walk around, take in the music., the artists and have a lite lunch. Go to the Sistine Chapel, the Vatican, the Pantheon, the Colosseum. There are shops to browse in, get a cappuccino, an Italian Pastry at a small cafe. Take in the people, the smells, the food and sounds of a gorgeous destination . Most of all, ENJOY YOURSELF."}, {"username": "Anikó Vadász", "comment_text": "If u buy Rome pass, i think you’ll be able to book at colosseum. If u choose guided tour in the vatican, i think u fill find a ticket for the time ull be there."}, {"username": "Gabby Lafleur", "comment_text": "One of our favorite things we did was a cooking class! It’s called rome with chef and it was so much fun!"}, {"username": "Melissa Rauh", "comment_text": "Book this guide she’s awesome and she handles everything all you do is show up."}, {"username": "Mike Adams", "comment_text": "Vatican Museum ,"}, {"username": "Mike Adams", "comment_text": "Hop on hop off Bus go around twice. See it all then return to what most interests you"}, {"username": "Paraone Gloyne", "comment_text": "We’ll go ahead and reserve then incase the tickets run out."}, {"username": "Marie Cuzzi", "comment_text": "Colosseum is a must … honestly it’s spectacular!!"}, {"username": "Lea Lorraine Nelson", "comment_text": "Just walk and soak in all that is around you..the architecture, the tourist spots like Trevi fountain. The Pantheon, the Typewriter, Spanish Steps. Forum so much to see just walking and they don't cost you anything except time and energy.\nEnjoy a coffee( Italian coffee is fabulous) a gelato, try out some of the salads and food alfresco style, the Colleseum, enjoy sitting enjoying a glass of vino and people watch...you will love Roma"}, {"username": "Gary W Anderson", "comment_text": "Make reservations if possible and skip the line, too."}, {"username": "Tammy Arcieri Lim", "comment_text": "Tickets are scares I am going the 5-14 September and I just purchased them through Vivator because the vatican website is sold out. They were a bit more but I want to get there this time."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208689299530148", "text": "Looking for suggestions of hotels in Rome for June that are not to expensive but clean and safe preferably walking distance to some of the sites…. First time in Italy", "link": "facebook.com/groups/1373361046396315/permalink/2208689299530148/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1378\n735-Reviews-Dom\nidea_Hotel-Rome\n_Lazio.html"}, {"username": "Jay Parekh", "comment_text": "We stayed at Una Hotel Deco near Romi Termini and then again at Novana Colors. Both were nice and walking distance to many places."}, {"username": "Jay Parekh", "comment_text": "Also “walking distance” can mean different things to different people. You can walk to everywhere in Rome if you can do it."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Have you checked a booking site to get an idea of what is available within your budget?"}, {"username": "Shelley Frise", "comment_text": "We used Vrbo and only booked super host. We ate all our meals out but it was nice to have a deck for coffee in the morning and a glass of wine in the evening"}, {"username": "Amanda Rogers", "comment_text": "I stayed at HS311 - reasonably priced, you can pay for breakfast which was great. It’s clean and staff so helpful. Walk everywhere or hop on off bus is great value. A cute little family restaurant across the road - and loads more restaurants and bars all so close."}, {"username": "Kerry Agins", "comment_text": "We enjoyed Hotel Centro Cavour Roma. Reasonably priced and very easy walk (5 minutes) to Colosseum and the Forum. Close to the Metro (also 5 minutes) and some decent restaurants nearby!"}]}, {"id": "2208689869530091", "text": "Constant mention of pickpockets. It has to stop. Been to Italy millions of times never happened. All my friends and clients never had issues.\nBe vigilant as if you were in your country. Same thing. If you Act like a lost tourist and are not paying attention to those around you, it is unfortunately your fault. Same if you went shopping in US or Canada and are not careful.", "link": "facebook.com/groups/1373361046396315/permalink/2208689869530091/", "likes": 218, "comments": [{"username": "Diana Morgan", "comment_text": "Just telling people the facts, go to the train station and tube in Naples, yes Naples, there are 2 women very well trained among many others I daresay. Yes I will recognise them they had me and my friend, so I know from experience . Just warning people that are asking that question."}, {"username": "Carol Brewer", "comment_text": "No I was on a tour in Italy and a few people on the tour got pickpocked on the subway there. Also in Spain a guys camera clipped to his belt got lifted."}, {"username": "Claudio Blizzard Indastria", "comment_text": "I'm local im Roma and it happen to me. I got my car robbed twice.\nI also witness some crimes both on the Fiumicino Roma train and the metro.\n\nNothing wrong telling people to be caution."}, {"username": "Christine Sounes", "comment_text": "I see the comments often"}, {"username": "Sallie Badger", "comment_text": "The fact that you did not experience a loss in no way negates the experience of countless others who have had their vacation ruined by pickpockets. It is a serious problem and this forum is a great way to share that information."}, {"username": "Joanne-Peter Hart", "comment_text": "We are not all American or Canadian - so stop assuming we all. Many of us come from countries where there are no pick pockets, and have no prior experience of this type of crime. I personally saw pick pocketing at both the Coloseum and Trevi Fountain. At the Trevi Fountain it was raining and a man took out his wallet to buy an umbrella, and another man grabbed it and ran off. The Police took chase but he got away. The pick pocketers and scammers didn’t come near me as I got educated and followed advice and had no wallet or bag, only a phone with a metal tether. Nothing else. Refuse to use cash, only my iPhone, much safer as I am not carrying a wallet that could get stolen."}, {"username": "Patty Bardo", "comment_text": "I was cautious in Italy because of the posts. I still ended up with someone’s fingers in my purse on the subway. They are very clever. Thank God I caught her before my wallet disappeared. It’s a real threat - but no different than any other big city in any other country. Just be vigilant and take precautions."}, {"username": "Moira Owens", "comment_text": "No, the comments are a regular reminder that it happens constantly. Keep them coming. Signed, a recently pickpocketed traveler."}, {"username": "Etschi Bruckner", "comment_text": "I always leave my phone on the table - so far I never had a problem with thieves 😁"}, {"username": "Blanca Gil", "comment_text": "Be vigilant- that’s the best tip."}, {"username": "Maureen Rebello Hagerty", "comment_text": "Exactly."}, {"username": "Phyllis Waring", "comment_text": "True....this! Just be alert..and aware and careful and enjoy beautiful..hist\norical..spiritu\nal..awesome..aw\nesome..Italia!!"}, {"username": "Phyllis Waring", "comment_text": "Phyllis Waring"}, {"username": "Susan Antonelle Pauxtis", "comment_text": "Why so judgmental? It’s no one’s fault. It happens no matter how vigilant you are."}, {"username": "Amy Kaye", "comment_text": "Been to Italy once, was vigilant, got pickpocketed. Home now and trying to sort it all out. People should be made aware."}, {"username": "Rebecca King", "comment_text": "Just bc you’ve been lucky doesn’t mean it isn’t happening. Pickpocketing happens constantly and it’s highly organized. It’s always better to err on the side of caution and be realistic about the places we visit."}, {"username": "Rita Bivona Morgan", "comment_text": "Nancy Ann Nancy Ann Paolino I agree. I go at least twice a year and never have had a problem. Any large city you just have to be aware."}, {"username": "Maxine Cunnyngham", "comment_text": "When I was in Paris before COVID, there were signs all over warning about pickpockets, including one in the Eiffel Tower elevator.\n\nMy friend’s phone was stolen out of her purse in Rome, so I intend to be careful there as well."}, {"username": "Kim Geary Keidel", "comment_text": "Seriously? It’s a persons fault that a seasoned thief (or well orchestrated group of thieves) commit a crime against someone? Wow! (A group if men tried to get my backpack unzipped and were unsuccessful.) I was so appreciative of of the warning posts. Without them, I would have had no idea."}, {"username": "Joe-Linda Po Agustin", "comment_text": "As opposed to this happening in our home town, being pickpocketed in a foreign place brings added challenges : the communication barrier, the pressure of a fast passport replacement if it was stolen too ( you will not be able to check in hotels or board your flight without it), the disruption in your travel plans,the gloom and unease it will cast for the rest of the group and the trip, the need to replace funds which you have not prepared for. So naturally, this topic is of great interest to many in this group."}, {"username": "Wendy Spano Bracco", "comment_text": "You can’t teach common sense and street smarts. People are spending more time buying all this ridiculous junk instead of understanding how to avoid these crimes. News flash, stuff will get stolen when you dont pay attention, don’t watch your surrounding, engage in dialogue with people asking stupid questions like “what time is it”. A lot of this stuff can be prevented/\navoided. For me, I simply don’t take metros or busses. This is my choice but as often a solo traveler, I feel safer. I also don’t trust my spouse, he would be an easy target. If you read the majority of the stories, that’s where it happens. If you are that worried, avoid these places or gather some intel so travel better."}, {"username": "Tau Wen", "comment_text": "Well said. It’s insulting. My partners Italian we go regularly no problem"}, {"username": "Tracy Rubenstein Calabrese", "comment_text": "I just came back from Italy on Saturday and I saw with my 2 eyes people get pickpocketed. It’s a huge problem.."}, {"username": "Alicia Cox", "comment_text": "Have your head on a swivel, be aware & cautious, but don’t let it stop you from living life! It’s the same EVERYWHERE! 🤷🏻‍♀️"}, {"username": "Carrie Duffy VanderMolen", "comment_text": "I've been to Europe six times and have NEVER had an issue with pickpocketers. Just be smart and watch your surroundings. You have more of a chance of getting robbed in the US..."}, {"username": "Brenda Posey Simon", "comment_text": "Crime and theft can happen anywhere sure BUT, let's not forget that Rome ranks #2 in the World for pickpocketing. Thieves have mastered their \"craft\" and are highly skilled. Also, they often work in groups making it hard to watch 8-12 hands."}, {"username": "Lois Midkiff", "comment_text": "Lori Potter Farmer Carey Spencer Mooney"}, {"username": "Leonie Abbott", "comment_text": "Same, we have never had a problem. If you are not careless with your belongings then there’s no problem."}, {"username": "Mary Gregory", "comment_text": "👍🏻. Well said!"}, {"username": "Nadine Taylor", "comment_text": "How can it be 'your fault'! Victim blaming is not ok."}, {"username": "Pauline Richardson", "comment_text": "Well we had three attempts at pickpockets in 3 days.And one snuck up so quietly behind even my friend opposite couldnt heat him at milan Station.And I don't think it's my fault if someone pickpockets me. Should be able to leave a phone on a table and have it stay there. So somethings wrong isn't it!!?"}, {"username": "Karen Espinoza", "comment_text": "Agree"}, {"username": "Pauline Richardson", "comment_text": "And had my locker at a hostel broken into."}, {"username": "Marie Cuzzi", "comment_text": "I agree … I’ve traveled to Italy e very year for the last 15 years ( not the last 3) and I’ve never had any issue with pickpockets and the people I’ve traveled with have also had no issue . Just pay attention you’ll be fine"}, {"username": "Trinity Sign", "comment_text": "We were there for a week...my sister in laws purse was stolen and a gang of people came up and patted my husband on his stomach...so yes...it does happen a lot per the police that helped us there! Do not stop to talk to anyone on the street. They approach and try to start a conversation while others pick pocket!"}, {"username": "Amanda Fleming", "comment_text": "This"}, {"username": "Krissy DaRusso", "comment_text": "But maybe the vigilance and guidance from THIS group has helped people travel smarter. Not everyone is a frequent traveler and not everyone knows what “city smarts” are to know how to keep safe."}, {"username": "Carolyn Kiyama", "comment_text": "I think fellow travelers are merely sharing information (isn’t this the reason for this group). I appreciated info on pick pockets prior to my Italy trip. Otherwise, I probably wouldn’t have known to purchase an anti-theft crossbody. So, fellow travelers……keep\nsharing. Both good and bad."}, {"username": "Cheryl Kahn", "comment_text": "I don’t normally comment and keep my opinion to myself but I don’t believe having a crime done to you or YOUR fault. I believe you need to do everything in your power to prevent it from happening and be very aware of your surroundings but to call it your fault is out of line. I was in Italy in May and was very aware and took precautions. It didn’t happen to me thankfully."}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Amen! The constant pickpocketing mentions are exhausting. I’ve been throughout Italy so many times and never had any issues. No need for special purses or crossbody bags. Just be vigilant as one one should in most big cities across the globe."}, {"username": "Matthew Livio Conti", "comment_text": "Agree. There’s enough pickpocket info here (as well as “what cutproof crossbody bag?” and “what shoes?”) to write an encyclopedia. There’s a “search” feature that people should learn how to use. The same 4-5 topics that occupy 75% of this space, people sharing all the minutiae of their travel experience: “the bathroom sink water wasn’t really cold/hot, is this normal?”. It’s absurd at times"}, {"username": "Olga Plitt", "comment_text": "Totally agreed! Well said."}, {"username": "Frances McDonagh", "comment_text": "Jeez it's everywhere from Barcelona to Dublin 🙄"}, {"username": "Karen Trom", "comment_text": "Yet here you are mentioning it 😜"}, {"username": "Debbi Mayfield", "comment_text": "Umm WTH?? Regardless of if you are paying attention or not, a CRIME being committed upon someone—ANYONE—\nis not there fault!\nBoy, Nancy, you missed the mark with this!"}, {"username": "Nydia Bryan", "comment_text": "If you get pickpocketed…it\nis not your fault!"}, {"username": "Eugene Cohen", "comment_text": "I lived in Rome for several years a while ago and all men I knew carried money in their socks. Why? They were not tourists and they knew how to protect cash from being stolen."}, {"username": "Connie Iacozza Brazzoni", "comment_text": "It happened to me in rome mid July. It's bot a great feeling. Fortunately they didn't get anything. They actually unzipped my fanny pack thatwas so secure on me. I caught them in the act. They got blasted from my husband and off the bus he went."}, {"username": "Kyle Wilcox", "comment_text": "The lady on TikTok would disagree. 😜"}, {"username": "Daisy Yoo", "comment_text": "agree!"}, {"username": "Tyffany Tubajon", "comment_text": "I feel like the posts to caution have been very helpful to me. I travel extensively and from those I know who have been to Italy (including my parents), that's what stood out to them, as well. Pickpockets and the fact that these people work in groups.\n\nAs for your comment about Canada & the US being similar....I have NEVER had to worry about getting pickpocketed here. We don't have working groups of pickpockets watching people. Lol. It's just not a thing, esp here in Canada. We can leave our phones/wallets on the table, or next to us on the seat and not worry about it being stolen.\nYour comment about someone being at fault for acting \"lost\" or like a tourise is just ignorant. 🙄"}, {"username": "Brenda Munda Filko", "comment_text": "I appreciate any information that I can learn before my upcoming trip. Because it did not happen to you does not mean it didn’t happen to others. I always have my phone on the table here in the states and would not know to not have it on the table there for fear it will get stolen. So, maybe just move along if you don’t like to read others experiences. I want to know all I can and make my own decisions based on others experiences. Keep ‘em coming!"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Really not someone’s “fault” if they get pick pocketed. It is not productive to blame the victim. Yes, being vigilant is necessary, especially for those coming from places where this is uncommon. Doesn’t mean people should be afraid or overly obsessed with it."}, {"username": "Julia Ruby", "comment_text": "Shame on anyone for blaming the victim. Completely out of line. Furthermore this post contributes to a problem the author abhors."}, {"username": "Lisa Wylin", "comment_text": "We’ll said, Nancy! Maybe too much paranoia. It happens, rarely, have your street smarts👍💕"}, {"username": "Kim Bliss", "comment_text": "It’s a hazard anywhere tourists are… it’s unfortunate and so sad people take advantage of other people.. it’s a society problem… we all need to learn to do better. In the excitement of seeing these wonderful places we still need to be wary… just be smart!! Enjoy these places and be careful… period."}, {"username": "Lori Fisher DeVries", "comment_text": "I'm not commenting on whether there is a lot of pickpocketing or not, but based on so many comments indicating there is, I bought a special bag. I think I'll like it as a regular bag/ purse anyway. However, when is the victim of a crime ever at fault? I think it's fairly common for tourists to act like tourists, especially lost tourists (been there, done that). Do you also believe that any woman who wears shorts is at fault for her own rape? Just wondering, because I personally believe the crime is the fault of the criminal. If I look lost, they still have no right to steal my things, and it's not my fault if they do."}, {"username": "Michele Liggett", "comment_text": "Thank you Nancy. It was making me anxious hearing all the stories about pickpockets."}, {"username": "Cindy Neal Norvell", "comment_text": "Unfortunately, it happens but I certainly wouldnt blame the victim. These thieves are VERY skilled and this is their profession. In crowded places or in instances where people are working together to distract you or enlist your help, it's probably easier than we think. It's even worse in some of our high crime cities in the USA.......they just stab or shoot you. So, a pickpocket is far less scary. Just a HUGE nuisance! You just have to be careful EVERYWHERE anymore😢😢 I hope everyone has an amazing trip! I know I can't wait til our visit in October!!!! Not going to worry about what \"could happen\". I'm just going to follow the advice of being on guard and not laying items down anywhere. Enjoy that beautiful country and culture!!!"}, {"username": "Michelle Broome", "comment_text": "People are just trying to remind others to be vigilant and there is nothing wrong with that. The criminals are the pickpockets, NOT the people complaining about it."}, {"username": "Pao Magnoler", "comment_text": "I agree! I lived there for 6 years. Never been picked pocket not once."}, {"username": "Betty Stilt", "comment_text": "I don’t see pickpocketing mentioned constantly here."}, {"username": "Jen Ashley", "comment_text": "Zero issues in Florence for the entire summer with 60+ study abroad students living in their own apartments too."}, {"username": "Vivien Paulik", "comment_text": "So true. I always feel safer in Italy than in my country\nYes, thieft is everywhere. But some posts say like it is a very dangerous case in Italy 😅"}, {"username": "Arianna Bellesolo", "comment_text": "I live in Verona, I’ve been to Milan and Rome and as you’re saying, you just have to be careful, but not even that much.\nI mean, don’t leave your bag open, watch what you put in your pockets, don’t leave your phones and wallets on the table if your drinking something outside (that goes mostly for Milan).\nAs someone who was born here and have always lived here, don’t worry so much."}, {"username": "Don Dennis", "comment_text": "I agree m it makes me want to cancel my trip. (I'm Not going to) 😊"}, {"username": "Joan Markey Barbero", "comment_text": "Been going for years, never an issue, I usually carry a large handbag. All my cards, ID and passports are in RFID sleeves, my husband uses an RFID wallet, that’s mainly all for issues in the States. Just use city smarts like you would in any city."}, {"username": "Barbara Tabor", "comment_text": "Millions of times? once a day would be 300 years."}]}, {"id": "2208692466196498", "text": "Hiiii need ur suggestions what to pack for September 2nd week Milan Lake Como Lucerne Rome Do we need any light sweater or jacket for evening", "link": "facebook.com/groups/1373361046396315/permalink/2208692466196498/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "I am in Como and the evenings r cool outdoors. In fact walking home after dinner wished I had jacket"}]}, {"id": "2208692919529786", "text": "Some prices of activities in Italy and Greece\nAs of right now 1€ is 1.10USD\nLet me know if yall see a place you want to go ill find pricing but may vary due to time we go or just economy lol\nRome -\nColosseum - from 16€\nVatican Museum - 16€\nPantheon - 5€\nCastel Sant’Angelo - 14,5€\nBorghese Museum and Gallery - 11€\nNational Roman Museum - 16€\nPalazzo Barberini/Corsini - 13€\nCapitoline Museums - 13€\nPiazza Venezia (Terrace) - 10€\nGallery Spada - 6€\nMuseum of Musical Instruments - 6€\nMuseo Delle Cere Di Roma - 10€\nMuseo di Roma/Palazzo Braschi - 17€\nMuseo di Roma in Trastevere - 9,5€\nMusei di Villa Torlonia -\n4-8€\nCirco Massimo - 6€\nCampo de Fiori Market-\n\nNaples-\nNational Archeological Museum of Naples: €15\nFontanelle Cemetary: Free\nCastel Sant’Elmo: €5\nCatacombe di Napoli: €11\nMuseo Cappella Sansevero: €10\nMuseo di San Martino: €6\nWalking & Tours: Free-€30\n\nSicily-\nMount Etna(Volcano); $55\nCastello Maniace(Castle):$8.76\nAlcantara(River in italy):$2\nTeatro Antico di Taormina(Amphitheather); $11.03\nPalermo Cathedral(cathedral): Free\nCatterdrale di Maontreale(cathedral):Free\nRiserva Naturale Orientata dello:$5.51\nCala Pulcino(beach):\n\nGreece-\nAthens-\nBeaches; many are free\nModern art museum:8.82$\nAcropolis museum:16.41$\nParthenon: 21.88$\nAncient Agora of Athens; 10.94$\nMount Lycabettus:Freeeeee\nAthens National Garden: Free\nPhilopappos Monument:Free\n\nSkoploes-\nLots of beaches:\nMamma mia tour-51$ 6hrs long\nMamma Mia: Skopelos", "link": "facebook.com/groups/1373361046396315/permalink/2208692919529786/", "likes": 0, "comments": []}, {"id": "2208693576196387", "text": "Suggestions on how to get from the airport to hotel in Rome …. Easiest possible way, will have a lot of luggage", "link": "facebook.com/groups/1373361046396315/permalink/2208693576196387/", "likes": 16, "comments": [{"username": "Marella Johns", "comment_text": "Taxi 50 euro set price"}, {"username": "Beth Anton Grous", "comment_text": "Welcome Pickups"}, {"username": "Helen Clark", "comment_text": "Rome in Limo or Rome Cabs, the best."}, {"username": "Santo Finocchiaro", "comment_text": "Driver or taxi is you have luggage. Or you can take the train. My advice is driver or taxi."}, {"username": "Debbie DiOssi", "comment_text": "Taxi!"}, {"username": "Shelagh Kosinski", "comment_text": "Hire a car."}, {"username": "Pär Wassholm", "comment_text": "I'll take the train for sure. Much cheaper."}, {"username": "Brian Osman", "comment_text": "Taxi, 50 euro max"}, {"username": "Fiona Cameron", "comment_text": "Ive used RomeCars in the past but not sure if they are still around. Simple online booking. I had to do an emergency last minute booking in 2018 for pick up near midnight after a flight from Spain got changed and it was all perfect"}, {"username": "Lauren Neely", "comment_text": "We had a great experience booking through Welcome Pickups"}, {"username": "Sandy Michelle Duggan", "comment_text": "Taxi is 50 euros max"}, {"username": "Christine Broussard", "comment_text": "Hotel has organised for us for $50 euro\nYou will be tired and overwhelmed so do yourself the favour"}, {"username": "Veronica Schindler", "comment_text": "I am using Welcome Pickups next month. Booked it online. I don’t want to worry about trains or taxis the first day. LOL"}, {"username": "Katie Marie", "comment_text": "Taxi! I took the train and metro with one checked bag and that was the worst decision of my life. Took an Uber on the way back and it was so much better."}, {"username": "Rebecca Yeoh", "comment_text": "Our hotel organised a driver, cost us 60€ (only 10 more than a taxi)."}, {"username": "Katia Taam", "comment_text": "Taxi"}, {"username": "Aimee Baim Vaerewyck", "comment_text": "Our place provided a transfer for an extra fee"}, {"username": "Renee Rundle Stoneham", "comment_text": "Can. Our hotel set it up and he was waiting for us with a sign."}, {"username": "Milinda Jensen Fortune", "comment_text": "Rome Cab Transfer has been highly recommended. We’re booked with them. Easy!"}, {"username": "Dunia Aldyni", "comment_text": "Booked a van 🚐"}, {"username": "Gillian Bissex", "comment_text": "We used transport with driver which was perfect after a 24 hour flight from Australia. It took 20 minutes from wheels down to sitting in the van!\nIt was fantastic to see so many sights as we drove to our hotel! Apart from that, it was walking and train for us!"}, {"username": "Sonia Gorton", "comment_text": "Definitely go the taxi route. Lugging all those suitcases through Rome’s train station will be torture. Trust me, taxi will be your best sanity option."}, {"username": "Steph Kittles", "comment_text": "Our hotel had an option for a driver which was great. There was plenty of taxis out front so that works too! Just have thw address kr directions printed in italian."}, {"username": "Shundel Graves", "comment_text": "Taxi but if you have over I think 3 luggage they will charge an additional\nI think 5 euro for each piece over 3."}, {"username": "Christiana Evripidou", "comment_text": "Booked via Transfeero"}, {"username": "Liza Vega Santos", "comment_text": "We used the Terravision Bus. It’ll take you straight to Roma Termini, 2 min walk to our Airbnb. Only 6euros/person. Fast and easy.\n\nhttps://\nwww.terravision.\neu/\nairport_transfer\n/\nbus-fiumicino-ai\nrport-rome/\nprices-and-timet\nable-fiumicino-\nairport-rome/"}, {"username": "Milana Bubis", "comment_text": "Our hotel arranged transportation for us which was great and 0 hassle at no extra cost"}, {"username": "Eileen Kersul", "comment_text": "Rome Airporter picks you up at airport and will take you directly to hotel. Driver will meet you in terminal and holds a sign a sign with your name.\nThey were priced less than a taxi. Book it on line and just pay when dropped off at hotel etc. I had read that taxis are not always honest so Rome Airporter is my recommendation."}, {"username": "Neville Spargo", "comment_text": "Nice thing about taxi’s in Rome is that the charge To or From Roma FCO airport to the centre of Rome is regulated at $50 euros ! Set price , it is even on the door of each taxi too !"}, {"username": "Jan Lamoureux", "comment_text": "Is there a fixed rate that taxi’s can charge from Leonardo da Vinci–Fiumicino\nAirport to your accommodations or is it just for the smaller airport? Thanks"}, {"username": "Sara Beth", "comment_text": "Taxi"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nPrivate-Transfer\n-from-Fiumicino\n-Ciampino-and-U\nrbe-airports/\nd511-349710P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Gena Kona-Mancini", "comment_text": "There are shuttle busses available depending where you are staying"}, {"username": "Ania Kubica", "comment_text": "There is a train directly to Termini station. I think it takes about 35 minutes, it does not stop anywhere else but Termini."}, {"username": "Mandy Pusateri", "comment_text": "We are struggling with that as well. If we take the train we will still need a Taxi to our AirBnB, so I think we are just going to do a taxi. This will save us the extra hassle of doing two transportations\n. The taxi will be a little more, but in my opinion it's going to be with it."}, {"username": "Colleen Dawson", "comment_text": "Rome2rio app will give you all the information you need, options, mode of transportation,\ntime and approximate costs."}, {"username": "Veronica Glenn Cerimele", "comment_text": "Uber if you have a lot of luggage!\nI was just there last week."}, {"username": "Barbara Dixon Woods", "comment_text": "I just walked out of airport and to line for taxi. It was reasonable to hotel . Be aware people will come up to you and ask if you want a “taxi” . Then head to the garage or parking space .\nThey are not official taxi driver . Might be safe but when I realized what was happening I did a uturn and saw the official line for taxi."}, {"username": "Francesca Campetta", "comment_text": "White regular Taxi - fixed price 50€, Uber or private car (most expensive)"}, {"username": "BatEl Kogman", "comment_text": "Dragonfly tours Italy\nWill assign a driver for you"}, {"username": "Kathy Aquino Chow", "comment_text": "Taxi was so easy"}, {"username": "Dann Hrusch", "comment_text": "We had a group of six and booked a van transfer. Enough room for our bags and dropped us at our apartment near the Pantheon. Was around $150 though as price goes up by number of people."}, {"username": "Lauran Cantwell", "comment_text": "Walk right outside by luggage pickup to Taxi line. Easy as can be and very efficient. Cost is set fee of around $50 per taxi to any Central Rome hotel."}, {"username": "Melissa Pope", "comment_text": "Contact your hotel. They may set up transportation for you. It may cost about 10 to 15 dollars more than a taxi but probably worth it if you have a lot of luggage"}, {"username": "Toni Quatrini Bannister", "comment_text": "Our hotel sent a driver in this huge SUV for just my daughter in law and I!"}, {"username": "Ibbu Mohd", "comment_text": "White taxis outside airport\n\nHotels will charge more"}, {"username": "Darcy Jessen", "comment_text": "We booked Movin Rome for 45 euro. Great service"}, {"username": "Jenny Payne", "comment_text": "Hire a driver, the hotel can arrange them & check how much. I pay €50 from my hotel to airport 🌻"}, {"username": "Carine Brys", "comment_text": "I read that the taxis outside the airport have a fixed fee of 50 Euros to the center of Rome. We had our hotel arrange for transportation.\n4 people, 2 large suitcases + 4 hand luggage in a Mercedes minivan for 60 Euros (Pantheon area)."}, {"username": "Mike Alioto", "comment_text": "Taxi"}, {"username": "Aurora Villegas Flores", "comment_text": "Taxi"}, {"username": "Kris Beacham", "comment_text": "1. Taxi.\n\n2. Car service. They’ll bring a van. Best option if you have at least 4 people."}, {"username": "Vivien Paulik", "comment_text": "If you have so much luggage, car service is rhe best. Taxi has limited space. Traij is good but you have to carry the lot of things 😅"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Taxi. 50€ to the center of Rome."}, {"username": "Kara Bolster", "comment_text": "We used welcome pickups (online) for 6 adults with 6 checked bags and 6 personal items (backpack or tote bag) and it was just under $80 from airport to hotel near Piazza Navona. Waiting for us at the airport - very convenient."}, {"username": "Amy Schmelzle Walsh", "comment_text": "I took a taxi to the city center it was very easy-- $50"}, {"username": "Anna Gambino", "comment_text": "Order a van if you have that much luggage. I just booked a reasonable car for work purposes. Transfeero car service."}, {"username": "Wendy Spano Bracco", "comment_text": "I booked Mary Roma cabs."}, {"username": "Kim Aranha", "comment_text": "Give yourself a break get the hotel to organize a car to pick you up"}]}, {"id": "2208694166196328", "text": "Will be in Rome & Florence the week of Thanksgiving…will Christmas markets be open?", "link": "facebook.com/groups/1373361046396315/permalink/2208694166196328/", "likes": 0, "comments": []}, {"id": "2208694779529600", "text": "Hi everyone! I’ll be in Italy in the middle of September- October! Is the weather still relatively hot? I’ll be in Rome/ amalfi!\n🙂", "link": "facebook.com/groups/1373361046396315/permalink/2208694779529600/", "likes": 7, "comments": [{"username": "Carine Brys", "comment_text": "I've only been in Sardinia around those dates. I think it will be \"Pleasantly warm\". You can also Google the statistics for avg temps for that region."}, {"username": "Chiara Normanno", "comment_text": "If you're lucky you'll get a reasonable weather, but most of the time it's still hot in September (not eccessively, though)"}, {"username": "Renae Larcus", "comment_text": "We love the weather in September. Pleasantly warm. Not too hot."}, {"username": "Marisa Silva", "comment_text": "What about the end of oct to Nov?"}, {"username": "Jeff Gentner EA", "comment_text": "I've been there 4 times, each time between mid September and mid October. Every single time, the weather was perfect. Not too hot, maybe one day of rain, maybe a sweater in the evening during October."}, {"username": "Sherry Gilliam Patrell", "comment_text": "Last year we were there in early October and it was beautiful weather, mid 70's everyday."}, {"username": "Adeline Alex Tanfara", "comment_text": "Yes"}, {"username": "Kellie Dullaghan", "comment_text": "Beautiful time to be there!"}, {"username": "Lisa Adams Robertson", "comment_text": "It's lovely, but bring a raincoat!"}, {"username": "Laura Uribe", "comment_text": "We were in the low 80’s during that time."}]}, {"id": "2208694869529591", "text": "Hubby HUGE football fan. Any place SEC football games on in sept searching for places showing Alabama games. Assuming not on hotel tvs", "link": "facebook.com/groups/1373361046396315/permalink/2208694869529591/", "likes": 17, "comments": [{"username": "Jeanne Eliason", "comment_text": "Oh my goodness. You are in Italy. My only comment."}, {"username": "TJ Williams", "comment_text": "Lol he will be ok missing it"}, {"username": "Scarlet Hutchinson", "comment_text": "My husband is a big SEC fan too. Legitimate question in my opinion lol I wonder if he can stream it on his phone through the ESPN app?"}, {"username": "Teresa Riccitelli Donahue", "comment_text": "RTR"}, {"username": "Joci Gillan", "comment_text": "I think that this is great. See how the game is televised and if there will be a satellite feed. Contact the different bars in the area of where you will be and see if they can show it. My brother was in Europe once and wanted to watch an American football game. He asked the bartender if he could see it and the bartender changed the channel from the soccer game to the football game in mid stream. My brother thought that he was going to be killed by the patrons who were watching the game. Instead, people started watching it and asking him questions about the game and what was happening . Everyone was into the game and my brother was a minor celebrity since he would explain what happened. Do it. It will be a memorable experience. And being a football fan, I understand where your husband is coming from."}, {"username": "Sedalise Hernandez", "comment_text": "ESPN app on your phone!"}, {"username": "Michelle Casillas", "comment_text": "After living here for 2 years I will tell you it will be pretty tough. He may have to get espn app on his phone. Depending on what hotels you’ll be staying at most of them don’t have newer tv’s so screen sharing won’t be possible. Maybne an iPad or laptop? Also if he is wanting to watch them live it’s going to be brutal with the time difference. Sorry that’s not very helpful but thought I would try to answer instead of saying something snarky. Oh wait I will 😆\nGO NOLES >>——>💛❤️"}, {"username": "Kalon Karr Cameron", "comment_text": "It’s an SEC thing! ❤️"}, {"username": "Terry Pisano", "comment_text": "I feel ya! I have YouTubeTV on my phone which carries SEC, so not sure that would work. All games will be DVRd so we'll probably just see them when we get home."}, {"username": "Lee Childs", "comment_text": "I think they only show Auburn games in Italy! 🤣. In all seriousness though, you could probably just stream it. Not the same as watching on a big screen, but better than nothing."}, {"username": "Nikki Nicholson", "comment_text": "We will be in Italy for the Bama game vs MS State and A&M and you can believe we will be watching! I mean look at all the Roll Tides Saban got when he was there! Italians know!"}, {"username": "JoNell O'Connor", "comment_text": "Keep searching. It seems like Saban was recognized everywhere he went in Italy this summer by tourists and locals as well. 🏈"}, {"username": "Giovanni Pianigiani", "comment_text": "I think you may want to check on some expats groups? Not something any place for \"Italians\" would offer but maybe in areas where there are huge American communities?"}, {"username": "Mas Tas", "comment_text": "Sign up for YouTube TV and watch it on your computer."}, {"username": "Terry Hamlet", "comment_text": "Good luck, I watched the Iron Bowl one year from Switzerland, using my laptop and streaming the game from home system. It was the Kick Six game so glad I was watching live. Watching the Georgia Miracle game same way prior week.\n\nTo stream you’ll need to use a VPN so the stream service thinks your back home.\n\nBtw, War Eagle!! 😀"}, {"username": "Anita Reed Matchett", "comment_text": "Roll Tide!"}, {"username": "Amanda Hopkins Wiseman", "comment_text": "Go on Yelp and Google the city you will be in. My husband is a die hard Michigan fan and my kids, rugby. We were able to search “sports bar in Rome” and then read reviews if they play american football. And for all those who say “he will live” obviously does not live with a diehard fan. Go Blue!!!"}, {"username": "निनावी सहभागी", "comment_text": "thanks for all the great comments much appreciated."}]}, {"id": "2208698972862514", "text": "Monterosso #reels #reelsinstagram #instagram #trending #viral #explore #love #instagood #explorepage #reelitfeelit #follow #photography #fyp #reel #instadaily #reelsvideo #like #memes #foryou #आणखीmusic #facebookreels #facebook #facebookviral #reelsviral #reelsviralvideo #reelstrending #trendingnow #reelstrendingvideo #facebookpost #riomaggiore #monterossoalmare #manarola #corniglia #vernazza #cinqueterre #laspezia #reels2023 #ristoranteilgabbiano #paanokumitasafacebookreels #facebookreelssahod #facebookreelsearnings #metaverified #metaverifiedaccount #facebookreelsmonitization #facebookreel #fbreels #facebookreelssettings #facebookreelsincome #facebookreelsplaybonusprogram #facebookreelsvideo #facebookreelseligibility #facebookreelsviral #facebookreelspayout #facebookverified", "link": "facebook.com/groups/1373361046396315/permalink/2208698972862514/", "likes": 0, "comments": []}, {"id": "2191691831229895", "text": "An amazing spot in Riomaggiore for savvy travelers on a budget..Perfect location. Clean, compact apartment on the water's edge, 5 minutes from the station, and a great base to explore the entire area 😍\nDiscoverआणखी more - La Scogliera: https://www.kqzyfj.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187821-d1557420-Reviews-La_Scogliera-Riomaggiore_Cinque_Terre_Italian_Riviera_Liguria.html%23%2Fmedia%2F1557420%2F50266399%3Ap%2F%3Falbumid%3D101%26type%3D2%26category%3D101", "link": "facebook.com/groups/1373361046396315/permalink/2191691831229895/", "likes": 2, "comments": [{"username": "Lena Leone King", "comment_text": "Hi Everyone, Does La Spezia offer over night parking for a rental car? We will be staying one night in Cinque Terre. Thank you."}]}, {"id": "2208552672877144", "text": "Hi everyone! I'm heading overseas in November to visit family and am planning a 2hr stopover in italy - I am beyond excited! My current plan is two nights in florence, a long weekend (thurs-mon) in Rome, beforeआणखी going down to Positano via Naples and spending a night at the isle of capri! I'm trying to do my budget and finding it difficult to know if i've accounted for everything. Is there anything obvious I have missed???", "link": "facebook.com/groups/1373361046396315/permalink/2208552672877144/", "likes": 44, "comments": [{"username": "Sammii Fletcher", "comment_text": "Kristine Walker I also need this for my next trip.. amazing spreadsheet OP. If you could share privately I would be ever so grateful 😘"}, {"username": "Dann Hrusch", "comment_text": "$500 for shopping and another $500 for gifts? I'd reallocate about $975 of that to cappuccinos and wine."}, {"username": "Maureen King", "comment_text": "That's a serious spreadsheet right there"}, {"username": "Becky Messenger", "comment_text": "Is this pp as I remember the Sorrento- capri ferry being around €30 not sure what is in $ also Trevi fountain is free…. I would also recommend paying extra for skip the line tours in Rome so you don’t waste time queuing if u only have a few days, also the knowledge you get from a guide is invaluable xxx"}, {"username": "Deborah Coram", "comment_text": "Alcohol and coffee! 😀"}, {"username": "Fiona Mac", "comment_text": "Have plenty cash for amalfi beautiful but expensive\nSorrento is stunning but when in Naples u must have a pizza best in the world 🌎"}, {"username": "Margaret Pantusa", "comment_text": "Hotels have a city tax you pay when you check out"}, {"username": "Colin Hough", "comment_text": "Well done nice budget , I believe the golf cart tour of Rome is good ! Happy travels."}, {"username": "Cath Woods", "comment_text": "Wow - organised !"}, {"username": "Giu Di", "comment_text": "Well done! I reckon it covers pretty much everything. I would probably round it up to 5500 so that you can account for anything you may have missed 🙂"}, {"username": "Regan Verwey", "comment_text": "I think your attraction amount in Aus dollars is too low. We’re going in September and I’ve spent about 3x that amount but for 2 people. One Aussie $ buys 57c euro in real terms so work on doubling prices. November might be cheaper. But to see Galleria del Academia (Michael statue) in Florence is aus $64 for 2 people."}, {"username": "Kyra Savoie Miles", "comment_text": "Not in your budget but with your time line… reservations?"}, {"username": "Anna Gambino", "comment_text": "You have done a good job on this spreadsheet."}, {"username": "Jill Clary Hilder", "comment_text": "I'm doing that exact trip in October! We're also hitting Venice. I'm so excited! Hope you have a wonderful time!"}, {"username": "Jenny Payne", "comment_text": "Usually €4.50 hotels charged me+ depending on the weather ferries won’t go to Capri if weather is not good as it is the beginning of the rainy season🌻"}, {"username": "Teresa Weaver Milner", "comment_text": "Love your spreadsheet!"}, {"username": "Carrie Renner", "comment_text": "Flights"}, {"username": "Sean Weier", "comment_text": "Get a tour guide for the Vatican, you will skip the line and there is alot of cool stories to be told."}, {"username": "Sonia La Civita Filice", "comment_text": "Sometimes the air B n B also charge you for linens and towels! I was charged"}, {"username": "Robyn L Schmidt-Cali", "comment_text": "city tax 2 a day some places ask for cleaning fee up front and any taxi service positano to or visa versa naples."}, {"username": "Victoria Kouras", "comment_text": "I need this spreadsheet!"}, {"username": "Courtney Walford", "comment_text": "This spreadsheet though 😍😍"}, {"username": "Karinna Theresa", "comment_text": "I’m more excited about your coloured spreadsheet with a matching pie chart! Impressive"}, {"username": "Dana Green", "comment_text": "This is great! What excel template did you use?"}, {"username": "Winnie Lau", "comment_text": "If you can't get the regular tickets from the official websites for Colesseum, Sistine Chapel, etc. Then, you will either need to cancel or purchase the tickets via a third company and pay more. Something to keep in mind."}, {"username": "Carolyn James", "comment_text": "Hi is your spreadsheet in $AUD $USD or £ or €.\nIt’s a great spreadsheet"}, {"username": "Joann Lynn", "comment_text": "The Prada outlets near flornce 5k haha"}, {"username": "Donna Parandes ONeil", "comment_text": "I like your spread sheet! Is it yours or a template from somewhere?"}, {"username": "Kally Trahearn", "comment_text": "Love a spreadsheet ❤\n\nStay in Sorrento as much cheaper than Positano, that will save you $$$. I can highly recommend Hotel Plaza Sorrento - great location, rooftop bar and infinity pool with views of Vesuvious. From there, you can do day trips to Positano, Amalfi, Capri and Pompeii."}, {"username": "Prisca Aroomoogum", "comment_text": "Can I ask you where you got this template please? It’s amazing 😍"}, {"username": "Grace Scinto", "comment_text": "2 hour stopover?"}, {"username": "Ania JL", "comment_text": "Try Wanderlog (app) for planning and budgeting.. will make things infinitely easier for you!"}, {"username": "Andrea Gattini Pennington", "comment_text": "Just make sure they do boat tours in November that water isn’t too choppy. The price seemed low for a boat tour, but I know there are different types of tours. We did a private boat for the day, but it was in July. 🙂"}, {"username": "Elizabeth Yu", "comment_text": "Weather"}, {"username": "Kristine Walker", "comment_text": "Would you mind sharing your spreadsheet with me so I can plug in our Italy budget numbers?"}, {"username": "Angelie Karako", "comment_text": "Maybe tips for your tour guides?"}, {"username": "Miyuki Kanno Paul", "comment_text": "The ferry service to Positano and Capri may or may not run after October 31st as the season ends. It may be operating at reduced schedule, so make sure that it runs. Being said, most hotels shut down mid-late October as the season ends on Capri and Amalfi Coast.\nGood luck!"}, {"username": "Sephora Cutajar", "comment_text": "Please send me the template of this if you can - this looks super !"}, {"username": "Ibbu Mohd", "comment_text": "Amalfi coast ferries -ferryhopper- download this app for schedules."}, {"username": "Bea Kuckens", "comment_text": "You say you are traveling \"overseas\" but I don't see airfare..."}, {"username": "Bernadette Sarmiento", "comment_text": "Love the spreadsheet please share 💕"}, {"username": "Joy Wilkinson Huggins", "comment_text": "Flight cost? I didn’t see it."}, {"username": "Jill Medrano Casey", "comment_text": "Love you color coded spreadsheet!"}, {"username": "Jeff McLellan", "comment_text": "Are amounts actually in USD? Seems low for many things."}, {"username": "Brittany McCloy", "comment_text": "5€ to get into the Pantheon in Rome. Just round the corner from the Trevi Fountain and a phenomenal structure to see, we were in Rome 2 weeks ago and it was one of our favourite sites."}, {"username": "Rachael Richardson", "comment_text": "City tax , flights , is this for 1 person ?"}, {"username": "Betty Bartlett", "comment_text": "Use a currency converter to see Euro $$ also using a credit card with transfer fees free"}]}, {"id": "2208552522877159", "text": "Train tip:\nWhen traveling to other cities, be sure to keep an eye on very last minute track changes. While waiting for a train from Rome to Florence at the platform, we didn’t realize the train on the next track was actually ours because of a change. We were able to get on next train without charge (one time courtesy). Agent said it’s very common and even locals miss trains for same reason.", "link": "facebook.com/groups/1373361046396315/permalink/2208552522877159/", "likes": 12, "comments": [{"username": "DeAnna Pulliam Like", "comment_text": "Yes... this!\nIt happened to us a couple of times. We were waiting at the platform that was on the board, but it switched and we didn't know. Luckily, we realized it was one platform over. When no train was showing up on the platform that had been listed, and it was a minute away from the \"on time\" departure, we looked at the next track over and asked what train it was. Yes... our train! We got on just in time for the doors to close and depart. It happened at another train station, and it was a few platforms over that time. We learned our lesson from the first experience, and would check back at the board to make sure the platform had not changed."}]}, {"id": "2208547446211000", "text": "The BEST decision we made was to sleep in San Gimignano, Vicenza and Venice, instead of visiting them by doing those tiring day trips, where you have to travel there, hike in the heat for hours and then travel back 😒. Nothing better that exploring those beautiful towns at your own pace and enjoying those highly touristy spots in the evening when the crowds are gone for the day. ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2208547446211000/", "likes": 1, "comments": []}, {"id": "2208541199544958", "text": "Italia Lago Maggiore", "link": "facebook.com/groups/1373361046396315/permalink/2208541199544958/", "likes": 26, "comments": [{"username": "Lisa Warman", "comment_text": "Beautiful photos 🤩"}]}, {"id": "2208538252878586", "text": "What travel group packages have you used and how much money per person per day should you allow for? Don’t consider any meals included with tour package. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2208538252878586/", "likes": 0, "comments": []}, {"id": "2208503482882063", "text": "Hi everyone any suggestions for what power adaptors to use in Italy from Australia to plug in a 3 prong / to use for iPhone and also laptop charging. Is a type l and type c adaptor best ? And what is most common in Italy ? 😊", "link": "facebook.com/groups/1373361046396315/permalink/2208503482882063/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/47pxcIm"}]}, {"id": "2208499702882441", "text": "Could anyone recommend a beach in the centre of Rimini please? Planning to go for the day today and hire beds etc but there are so many to choose from! Would like to be in the centre too? Thank you! 😊😎", "link": "facebook.com/groups/1373361046396315/permalink/2208499702882441/", "likes": 0, "comments": []}, {"id": "2208512939547784", "text": "I have limited mobility and stage iv breast cancer. I can walk but if I walk for too far or for too long I have a lot of pain. I’m planning for a rest day inbetween site seeing days to pace myself but how easy is Italy for wheelchair users? Sometimes when my family and I go places, we take my wheelchair so I don’t get too fatigued, especially for aआणखी place that requires a lot of walking. I know some places like Pompeii and seeing the coliseum will require me to use legs instead of wheels but if I can do most of the walking on wheels for most of the time, I think I’d enjoy it a lot more. Has anyone travelled to Italy with health issues and limited mobility?", "link": "facebook.com/groups/1373361046396315/permalink/2208512939547784/", "likes": 1, "comments": [{"username": "Debbie Zornes Ruch", "comment_text": "google\nhandicapped accessible tours of Italy\nThere are tour operators that specialize tour where mobility is limited.\nI hope this helps and you can enjoy your trip."}, {"username": "Stacy Derouin", "comment_text": "I've been to Italy (including the Coliseum and Pompeii) with a wheelchair. Feel free to PM me! It's so much more doable than others will lead you to believe. Just needs some planning!"}, {"username": "Francoise Coupal", "comment_text": "If you are using the trains, look into Sala blue, which is for people who are handicap per or have mobility issues. They will assist you to get to your train on time. There are places in Italy that rent out, wheelchairs or scooters, which you may want to look into. This can be googled. You might find it easier to take your walker with you if you use one. I would also bring the handicap permit. You might have on your current car with you, as this will allow you to park in handicap spaces in Italy."}, {"username": "Raa Austin", "comment_text": "Have you thought about a mini electric mobility scooter"}, {"username": "Karen Miller Morales", "comment_text": "I’ve done Rome in a wheelchair. It’s all possible. Every main site has a way to get in. I use the chair always when traveling to avoid falling, not worth the risk overseas"}]}, {"id": "2208498842882527", "text": "Porto Venere", "link": "facebook.com/groups/1373361046396315/permalink/2208498842882527/", "likes": 6, "comments": [{"username": "Carey Matthews", "comment_text": "Carey Matthews"}, {"username": "Carey Matthews", "comment_text": "Carey Matthews"}]}, {"id": "2208484442883967", "text": "Hi there! We are planning a daytrip of amalfi coast on October 7 th from Sorrento . What will be the best options? Boat trip or road trip considering weather at that time. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208484442883967/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "to be sure road trip https://\nwww.viator.com/\ntours/Sorrento/\nAmalfi-Coast-Dri\nve-Excursion-fr\nom-Sorrento/\nd947-7809P1?pid=\nP00070587&mcid=\n42383&medium=li\nnk&medium_versi\non=selector"}, {"username": "Roland Trego", "comment_text": "I'm all for riding the ferries. I think they offer much better views and sea and sun to boot. I'm not a fan of driving on the Amalfi Coast, and I cannot comment on the traffic in October--only in summer--but here are my views: Should I drive on the Amalfi Coast?\nEveryone has their own opinion about renting cars in the Amalfi Coast area. I have done it twice. The traffic moves at a snail’s pace. You often get stuck, unable to pass, behind a truck or bus, breathing diesel fumes. The roads are narrow—often only 1-1/2 lanes wide. There are many curves. When tour buses come around those curves, they frequently cut the corners and don’t really care about other drivers in the other lane. The winding roads resulted in my passengers getting motion sickness. Parking is very, very difficult to find anywhere near a village. You may think you are going to have great views from the road, but often the bushes are too high and obstruct your view. The few vantage points there are are generally so packed with cars that you can’t stop. Last, but not least, because of the horrendous traffic, the local government is going to restrict rental car use. It is my understanding that it will be something like Mexico City, where you can drive on limited days according to your license plate. If you are adventurous and decide to rent a car anyway, be sure it is a small one with full insurance coverage to cover dings and dents. Also, valet parking through your hotel is a must. I personally love riding the ferries from one village to the next. It is my very favorite thing to do there. They give you sea and sun and a unique view of the coastline.\n\nVideo to watch: Driving on the Amalfi Coast (Take out the spaces to connect to link.)\nhttps: // youtu . be /\nD-pqkdFF7zE?t=45"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208469319552146", "text": "I have a 30 minute drive to drop a car off at the Florence airport and take a taxi to the S. M. Novella train station. The train leaves at noon. What time do I need to leave? I don’t want a ton of extra time at the station but don’t want to risk missing the train. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2208469319552146/", "likes": 0, "comments": [{"username": "Jeanne Eliason", "comment_text": "We do this all the time. Locate the taxi stand. Often we wait in line so depending on the queue add 5 to 10 minutes. Then to SMN station it depends on traffic. Usually takes us 20 minutes. This May the fee was 24 euros for 2 people and 2 pieces of luggage. They charge for pieces of luggage. A very fair price considering I'd never drive in Florence."}, {"username": "Ashley Martins", "comment_text": "Don’t waste money on taxi, take the Tram, super easy & goes from airport to station in 20 min."}]}, {"id": "2208461972886214", "text": "We travel to Rome on Saturday with our 9 year old daughter, staying central. Didn’t think the temperatures through, when I booked it 🙈\n\nOther then the water park 1/2 hour away, Is there any fountains/water/pools the kids can play in ? Any other recommendations for kids would be good too please? X", "link": "facebook.com/groups/1373361046396315/permalink/2208461972886214/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "consider Ostia beach"}, {"username": "Piera Angeletti", "comment_text": "Grand' hotel Gianicolo used to"}]}, {"id": "2208449709554107", "text": "Arrived in Taormina yesterday morning. Our luggage did not!!! The shops here are amazing but looking for more affordable and basic clothing to get us through the next 6 days. Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2208449709554107/", "likes": 1, "comments": [{"username": "Sergio Milone", "comment_text": "There is a weekly market every Wednesday, it should be in porta Catania car park, ground floor. Otherwise you might have to go to Giardini Naxos, Tutto scarpe megastore sell cloths and shoes but there are a lot of small shops there."}, {"username": "Melissa Toro", "comment_text": "Mind me asking what airline and where did you fly out of?"}, {"username": "Jenny Payne", "comment_text": "OVS is a middle of the road department store might be one there"}, {"username": "Wendy Wallin", "comment_text": "Your luggage should catch you up in a couple or days. Do you have AirTags so you can check where it is?"}, {"username": "Deborah Larsen", "comment_text": "Rinascente right on via Etnea."}, {"username": "Elisha Lynn Simon", "comment_text": "Last year it never caught up with us for 18 days. I only had one outfit in my backpack. Since I have only done carry on. We got my suitcase back on United a d we flew American. It was several weeks after we got home."}, {"username": "Karen Robertson Fitterer", "comment_text": "Did you have a direct flight?"}, {"username": "Carla Jane", "comment_text": "Tanya Wyllie🤦🏼‍♀️🤦🏼‍♀️"}, {"username": "Keri Catoe", "comment_text": "OVS has been my go to for inexpensive clothes. There is one not far from Taormina."}]}]