[{"id": "2195511697514575", "text": "Dear all!\nMay I check is it worth to do a day trip from Naples to Sorrento and Positano? As we are visiting in mid of November, I think we just would like to take a look at the place. We will be driving.\nWe would like to do the following from Naples:\n1) A day in Naples\n2) Day trip to Pompeii\n3) Day trip to Sorrento and Positano\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2195511697514575/", "likes": 3, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Yes, very possible. We did 2) and 3) in one day and would not recommend that."}, {"username": "Donna Austin Jones", "comment_text": "Yes! The number of tourists will be low so it should be a great experience."}, {"username": "Alison Ahlberg", "comment_text": "Yes ! Sorrento was one of my favourite cities so beautiful and great shopping"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195535474178864", "text": "We are heading from Venice to Geneva and given the connecting trains, has anyone just winged it and not pre booked trains? Its a train to Milan, change to another and then Geneva via their airport from what I can tell.", "link": "facebook.com/groups/1373361046396315/permalink/2195535474178864/", "likes": 4, "comments": [{"username": "Mik Long", "comment_text": "Do you mean Genova? (Geneva's in Switzerland...)"}, {"username": "Miyuki Kanno Paul", "comment_text": "Then you must go outside once you arrive at Milano Centrale for purchasing Intercity train ticket or buy online"}, {"username": "Connie Wilson", "comment_text": "If you take the Frecciarossa train between Venice and Milano you’ll have to reserve your seats. Other trains from Milano to Geneva are EuroCity and don’t need prior reservations."}, {"username": "Connie Wilson", "comment_text": "If you are having trouble finding the route from Italy, then you can book your ticket through the Swiss Rail site at www.SBB.ch"}]}, {"id": "2195572010841877", "text": "So many places TO visit in Sorrento, but one place to avoid is Daniele’s Club, a karaoke bar/club. Mainly for young adults but tiny place, charges 10 euros to get in. Two of us went, paid cover charge by card,आणखी receipt showed 20 euros but you give to bar for your 2 free shots. Got to hotel, charge processed as 33.75 euros.\nShady. Read reviews now and not a good place. Just fyi", "link": "facebook.com/groups/1373361046396315/permalink/2195572010841877/", "likes": 2, "comments": []}, {"id": "2195572070841871", "text": "I am sure like us many visiting Amalfi walk past this plaque without noticing it at first. It is a quote from Renato Fucini who was an writer and poet.\n\nThe translation I have found of it is:\n\n‘The Day ofआणखी Judgement, for the people of Amalfi who will go into Paradise, will be a day like all the others.'\n\nIn other words those who are lucky enough to call Amalfi home are already in paradise so they do not need to fear the Day of Judgement.\n\nJust a few photos from my morning walk today before the ferries and buses arrive.", "link": "facebook.com/groups/1373361046396315/permalink/2195572070841871/", "likes": 13, "comments": [{"username": "Kay Rendall", "comment_text": "Thank u for sharing. Have been Amalfi many times, but missed it. Always dodging buses and traffic. Will be back September"}]}, {"id": "2195576927508052", "text": "Quick question I’m from Australia and was wondering in Italy, if hotels etc have kettles that you can boil water? I love a tea when I first wake up.", "link": "facebook.com/groups/1373361046396315/permalink/2195576927508052/", "likes": 23, "comments": [{"username": "Phyllis Snyder", "comment_text": "You need to ask when booking. Properly they have a small coffee pot that heats water."}, {"username": "Gem Donghi", "comment_text": "Some did and others didn't"}, {"username": "Laura Bolzic", "comment_text": "Of course they have, if not all you need to go is ask and they will oblige."}, {"username": "Melaine Morrow", "comment_text": "I am from Australia and I bought a collapsible kettle on Amazon to take on my upcoming trip as well as cheap cup, plate, bowl and cutlery from Kmart ☺️"}, {"username": "Shane Hoare", "comment_text": "Go to BCF or similar you can get light weight collapsible kettles for caravans etc - fit in suitcase easy when collapsed"}, {"username": "Rosslyn Patience", "comment_text": "We have a heating tong which we use. We take a couple heatproof cups."}, {"username": "Louise Rixon Matthews", "comment_text": "I’m from Australia we’ve just got back from Italy every place we stayed in had a kettle and tea and coffee 😊"}, {"username": "Dianne McAuley", "comment_text": "I’m horrified with the comments😩 could this really be true. I’ve traveled to many countries and would never had given this a thought at all. I’m hoping to go to Italy next year and I so appreciate all the information from all of the group. Thank you all 🤗🇦🇺"}, {"username": "Sigrid Cormier", "comment_text": "We’re actually booked into apartments, bed/sitting room/\nkitchenette with a private separate bath. Each week we booked an apartment with a washing machine, no dryer but drying rack. This way we can travel light, and with this heat wave we can wash our clothes properly. Some of those tiny sinks you can barely wash your hands. And washing clothes in the shower is not always the easiest. Bring 3-4 plastic coat hangers with you and some clothes pins.. that will help with hanging up some clothes in the shower."}, {"username": "Carol Galvin", "comment_text": "I buy the Nescafé sachets and take a collapsible kettle, travel cutlery and Scotch Finger biscuits…nice to have a little bit of home comfort. Enjoy."}, {"username": "Jocelyn F. Hild", "comment_text": "?????"}, {"username": "Jocelyn F. Hild", "comment_text": "?????"}, {"username": "Linda Tibbles", "comment_text": "Airbnb probably have this, but most hotels I have stayed in do not have them."}, {"username": "Lynette Dine", "comment_text": "Don’t stress you are in Italy 🤣"}, {"username": "Lewis RC", "comment_text": "We had them at each of the five hotels at which we stayed."}, {"username": "Jenny Payne", "comment_text": "Yes, I take my tea bags with me"}, {"username": "Linda Espie", "comment_text": "Yep"}, {"username": "Marshenjew Benji", "comment_text": "Most of the ones we stayed in did not, but the odd one did. I tried asking for one, turns out this isn't a common item in most homes they had no idea what I was talking about, instructed me to go to the nearest espresso bar haha"}, {"username": "Cinzia Bonciani", "comment_text": "Jane Colliver if your accommodation doesn’t have a kettle, get dressed and pop down to “Il Bar Locale” where you can get a tea usually from about 5-6am but not only that, you’ll get to see what it means to live like an Italian and mingle with the people and that’s an experience that a lack of a kettle cannot buy 😊"}, {"username": "Simone Earle", "comment_text": "Some do some don't.....we had to ask maid to bring us kettle, cups etc. We then had to translate a sentence asking to please leave for duration of holiday as she kept removing it each morning when cleaning. Wasn't a big deal tho and they were very accomadating. X"}, {"username": "Cassandra Lenatti", "comment_text": "Not common"}, {"username": "Graham Sherlock", "comment_text": "Go out and buy a culpa, treat yourself"}, {"username": "Alan Simpson", "comment_text": "🤔don’t kettles in Australia boil water 🤔🙄"}, {"username": "Sabrina Francesca", "comment_text": "https://\namzn.to/3OpMZPW\n\nI just bought this for my travels. A travel kettle. I love it. Easy packable🥰"}, {"username": "Lisa Joy", "comment_text": "Jane, we have a tiny foldable kettle we got from anaconda\nIt’s quick to boil and folds down to nothing in your bag.\nThat being said, we are usually tea drinkers first thing in the morning but have decided to embrace the Italian coffee culture while we are there."}, {"username": "Rosa Morabito", "comment_text": "Generally not."}, {"username": "Caroline Costa Leng", "comment_text": "No! Most don’t\nI’m here now and I’ve brought my own kettle🤣\nI got it at Anaconda\nIt’s collapsible so takes up hardly any space\nA life saver\nI tried the water boiler prong but the collapsible silicone kettle is so much better"}, {"username": "Michèle Nardelli", "comment_text": "Many don’t"}, {"username": "Mansha Kapur", "comment_text": "In my experience, hotels in Italy don't have tea/coffee facilities in the room. I always take a travel kettle and tea bags with me."}, {"username": "Jan Fargo", "comment_text": "I never saw one when we were in Italy. My mother was from England and she would have wanted tea in the morning also."}, {"username": "Maureen Buccelli", "comment_text": "Sometimes"}, {"username": "Kristina Ruk", "comment_text": "Some have, some can provide if ask, some doesnt provide ;)"}, {"username": "Brian Osman", "comment_text": "It's 50/50 chance, some did and some didn't, I'm the same way with coffee"}, {"username": "Charleen Siegler Schuss", "comment_text": "Some do but I bring a cup instant immersion heater"}, {"username": "Rochelle Yngks", "comment_text": "Most of the hotels I stay in Europe including Italy have water kettle. Most of these hotels have coffee maker or Nespresso machine. Before I book my hotels I checked the hotel website for their room amenities, such as safe, water kettle, hair dryer etc. If I do not see water kettle as one of amenities, I email the hotel. I make special requests and they almost always provide it."}, {"username": "Krissy Marie", "comment_text": "Get a travel size tea kettle! https://\namzn.to/3pN31tD"}, {"username": "Sally Warren", "comment_text": "Yes, usually"}, {"username": "Eric Parks", "comment_text": "Not all. Check with the place you want to stay...or buy a kettle locally if you have an extended trip."}, {"username": "Hudd Cass", "comment_text": "It depends on the hotel. All are different. Maybe check at the info of what’s available in the room when you book."}, {"username": "Daniele Morani", "comment_text": "Some do, some don't."}, {"username": "Mallorie Mathis McManus", "comment_text": "NO 🙁 I looked specifically for that when I was there two years ago. 🙁 I suppose there are some fancier hotels that do ... but we stayed in nice hotels and there were not kettles in the room 🙁"}, {"username": "Viraf NZ", "comment_text": "Unfortunately not all of them. I struggled for my cuppa tea ."}, {"username": "Carmine Napolitano", "comment_text": "all ours did"}, {"username": "Dayna Scinto", "comment_text": "Most yes, but you can always ask before you check in"}, {"username": "Jo M Davies", "comment_text": "50/50 but that’s a big risk if you are as addicted to tea as I am."}, {"username": "Nadia Filice", "comment_text": "Not all hotels"}, {"username": "Diane Leesmith", "comment_text": "By a mini travel kettle"}, {"username": "Kim Hull", "comment_text": "I just got to Italy after two weeks in France. It was hit & miss whether a place had a kettle, mini fridge or air con. Now when I’m booking places as I go, I put in the filter the things I def want, and book accordingly (via bookingdotcom that is….)"}, {"username": "Jenny Larsen", "comment_text": "Not one I’ve been here five weeks and am dying for a good cuppa"}, {"username": "Jenny Martin", "comment_text": "Every hotel we stayed in did and some were 3 star only. It should say on their website"}, {"username": "Grace Monaghan", "comment_text": "Yes they do"}, {"username": "Julie Norris", "comment_text": "My hotel in Rome had a kettle but only a plastic cup 😲 I borrowed a real one from the breakfast room"}, {"username": "Mary Anne", "comment_text": "We’re not long home from Italy. We stayed in four star hotels and all but the one in Venice had kettles, but some only had paper cups. I bought two souvenir coffee mugs and used those for our early morning hot drinks."}, {"username": "Ann Caruso", "comment_text": "I’ve stayed in lots of hotels and if they didn’t have a kettle I just asked for one and they supplied it for me xx"}, {"username": "Douglas Martin", "comment_text": "Of course in most hotels or apartment"}, {"username": "Annette Eadie", "comment_text": "Yes"}, {"username": "Joanne Nacson", "comment_text": "Best to reach out to your accommodation directly is this is important to you. Or pack one of those elements you put in a mug"}, {"username": "Frank Hunt", "comment_text": "Probably not, it’s isn’t a thing over there."}, {"username": "Shelby Musselman Dickman", "comment_text": "I don’t understand why every damn post on this page gets laughing emoji’s. Why are some so miserable? Stop trying to bring everyone down to your pathetic level 🙄"}, {"username": "Anna Cappeluti", "comment_text": "I’ve also struggled with my tea addiction too. we stayed in 4/5 star hotels and I was surprised there wasn’t a kettle supplied in all of them, London, Nice, Rome and Lake Como yes. Sorrento, Milan and Molfetta (Puglia ) No,\nunlike me you may want to check if it comes included with the room you book 🫖☕️🇨🇮\nHave a great holiday 🙂"}, {"username": "Dee Scandone", "comment_text": "Not usually. I bring a travel kettle with me."}, {"username": "Toni Green", "comment_text": "They usually offer continental breakfast which includes tea, coffee, croissants, toast etc. no kettles in the room that we were in."}, {"username": "Gillian O'Callaghan", "comment_text": "It will be in the room description for each place......most\nif mine didn't."}, {"username": "Alessandro Iannelli", "comment_text": "Unlike in many (maybe most) other developed countries, in Italy kettles for boiling water aren't common. I have no idea why. I'm not saying no hotel will have it but it certainly is not standard."}, {"username": "Sigrid Cormier", "comment_text": "Go to Amazon search for travel water heating coil or travel kettle. I use the coil as it takes hardly as space, mine does need a voltage converter."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "If you’re staying in 4 or 5 star hotels you might have it. It’s not consistent. I won’t use hotel kettles any more after hearing about people using them for cooking noodles or urinating in. 🤢"}, {"username": "Rita Sanza", "comment_text": "I had one"}]}, {"id": "2195581500840928", "text": "What are people must see towns on the east coast and southern Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2195581500840928/", "likes": 1, "comments": [{"username": "Maria Ek", "comment_text": "Ischia ❤️"}, {"username": "Laura DeCicco", "comment_text": "Southern-Tropea\n, Scilla and Reggio Calabria, Amantea"}, {"username": "Paul Vincent", "comment_text": "Lecce, Bari..Alberabel\nlo, Ostuni, Monopoli.....ju\nst follow coast round.."}, {"username": "Mary Nelsen", "comment_text": "Lido bari la marche"}, {"username": "Keith Piccirello", "comment_text": "All of thsm"}, {"username": "Carole Tarlap", "comment_text": "LOCOROTONDO ❤️❤️ MATERA ❤️❤️"}, {"username": "Theresa Salerno Adams", "comment_text": "I enjoyed Otranto & Lecce"}, {"username": "Rich Garcia", "comment_text": "visit the region of Puglia, for the east (Bari or Lecce). I have not been to the southern most area, no suggestions."}, {"username": "David Baillie", "comment_text": "Termoli in Molise, San Benedetto del Tronto in Le Marche."}, {"username": "Larry Reinier", "comment_text": "Matera, water Buffala making mozzarella, Alberobello"}, {"username": "Joe Anastasi", "comment_text": "Polignano a Mare, Matera, Alberobello, Gravina."}]}, {"id": "2195602830838795", "text": "We will be travelling by train and bus to move around Italy. Is there a place to store luggage when travelling by bus?", "link": "facebook.com/groups/1373361046396315/permalink/2195602830838795/", "likes": 0, "comments": [{"username": "Janet Messanelli Bozzone", "comment_text": "Yes. All over. Google luggage storage at wherever you are stopping."}, {"username": "Connie Wilson", "comment_text": "You can carry on a small backpack, but larger bags will go underneath the bus in luggage compartment."}]}, {"id": "2195603717505373", "text": "For anyone in Venice who needs to get to the train station, I just found a Porter service that will take you suitcases for you.\n\nWe’re a family of 5 and I was dreading the thought of getting to the station by 630am, I’ve just hired someone with a trolley who will meet me at my apartment and take all our luggage yo the station, we’ll worth it for me!\n\nThey were just hanging around the station.", "link": "facebook.com/groups/1373361046396315/permalink/2195603717505373/", "likes": 3, "comments": []}, {"id": "2195603840838694", "text": "Recommendation for hotel in Florence, the Hotel Executive, 10 minutes from train, walkable to everything. We booked early under 200 euros a night for 2 room suite.", "link": "facebook.com/groups/1373361046396315/permalink/2195603840838694/", "likes": 0, "comments": []}, {"id": "2195604530838625", "text": "Does anyone know if flights are leaving catania today?", "link": "facebook.com/groups/1373361046396315/permalink/2195604530838625/", "likes": 1, "comments": [{"username": "Alessandro Iannelli", "comment_text": "Some certainly will, probably none or very few from Terminal A. The airport was supposed to be fully operative by 14.00 today. It is not, it will take longer to restore the normal functionality of Terminal A, which according to corriere.it (one of the most important news outlets in Italy) will stay closed or at least in part closed up to the 25th. Some flights have been redirected to Comiso, trapani and Palermo. It's an evolving situation, if you have a flight from or to Catania I suggest you keep in touch with the airline or follow the updates on their website."}]}, {"id": "2195613314171080", "text": "Hi everyone, how can you get to Burano pri Murano from Venice? And how much is the ticket? Thanks so much 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2195613314171080/", "likes": 2, "comments": [{"username": "Shannon Stanton King", "comment_text": "Talk to your hotel concierge - they may have an arrangement with the factories on Murano and Burano for a free water taxi there. We then took a public taxi back / bought tickets at ferry ticket office."}, {"username": "Janet Ciantar Sultana", "comment_text": "With the traghetto service very easy. Burano is one of my favourite places"}, {"username": "Jennette Riches", "comment_text": "here is information about ferry/waterbus information. it's a lovely trip from Venice to Burano, although we did not visit Murano due to time restraints. https://\npublic-transport\n.tickets-venice\n.com/\n?gclid=EAIaIQobC\nhMI5vnXzf-agAMV\nkRitBh0hzwe-EAA\nYBCAAEgLEzvD_Bw\nE"}, {"username": "Joyce Calderon", "comment_text": "The ferry will take you to both. Just there in May and we bought a $20 ferry pass good for 24 hrs. We used to to go to both islands."}, {"username": "Rhona OConnor", "comment_text": "Check Google maps..... They will give you options"}, {"username": "Mary Anne", "comment_text": "And Torcello is worth a visit while you are out that way."}, {"username": "Jessica Chiu", "comment_text": "We just did the public ferry between Venice , Murano and Burano today and really easy! 7 of us and no problem even when it was pouring and thundering!"}]}, {"id": "2195616707504074", "text": "Looking for suggestions for mainland beaches in Italy. Any gorgeous suggestions where to go for a 1 week retreat (not islands tho)", "link": "facebook.com/groups/1373361046396315/permalink/2195616707504074/", "likes": 0, "comments": [{"username": "Jennifer Walker", "comment_text": "We really enjoyed Sestri Levante! We stay there for several days in 2016 and really enjoyed the slower pace."}, {"username": "Marina Belardo Johnson", "comment_text": "I go to\nFormia every year for a nice lay back retreat with a small b&b and also a all serviced beach ! We love it. I can give you the details"}, {"username": "Pietro Di Sorbo", "comment_text": "Choose some places in Apulia Region among Otranto, Vieste, Porto Cesareo, Rodi Garganico, Torre dell'orso, Santa Maria di Leuca and so on, there're hundred of beaches whit crystal water there.\nMy suggestion is to searching on web for images and video.\nMaybe is better to avoid some towns as Polignano a Mare because in July and August they are overcrowded.\nI see you could be interested in Formia, for my taste is not a place good as many others but maybe is cheaper, before going there take some additional information about quality water and vibe."}]}, {"id": "2195630030836075", "text": "We need to rent a car to get to Abruzzo. We don’t want to pick up in Rome city center (for obvious reasons). Has anyone rented a car just outside the city on the opposite side of the airport (already searched previous posts for that info) but not as far as Tivoli? Any advice would be appreciated. 😌", "link": "facebook.com/groups/1373361046396315/permalink/2195630030836075/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Where in Abruzzo are you going?"}, {"username": "Andy Blackwood", "comment_text": "You might want to consider taking a bus to Abruzzo and then renting a car there. There are lots of companies offering competitive prices to go from Rome to Pescara - Flixbus, Prontobus, Itabus, Clikbus, diCarlo bus"}, {"username": "Simone Pfenninger", "comment_text": "At the Airport"}]}, {"id": "2195629257502819", "text": "Travel tip: It's hot. Traveling with kids, it feels hotter. Buy some wash clothes, soak in water with a slight wring [roll it up] and freeze them. Buy a little insulated lunch box with a reusbale ice pouch, pack them in there and use them as needed on your adventures! cycle them out so they stay cold...", "link": "facebook.com/groups/1373361046396315/permalink/2195629257502819/", "likes": 3, "comments": []}, {"id": "2195644787501266", "text": "Our dream vacation family of 5 has ended and we are on our way back to the states. I wanted to recommend a fabulous private driver company that took care of us our entire stay. Rainbow Limos, they were recommended to me by a friend as well.\nPrivate transfer from Naples train station to Sorrento: stop in Pompeii (2.5 hrs, held our luggage)\nPrivateआणखी Amalfi Coast day Positano, Amalfi, Ravello (8hrs). Driver was very nice, professional and knowledgeable of the area.\nPrivate transfer to Naples airport from Sorrento.\nAlways on time for all departures 😊", "link": "facebook.com/groups/1373361046396315/permalink/2195644787501266/", "likes": 57, "comments": [{"username": "Debbie Grant", "comment_text": "Can you attach his contact number ?"}, {"username": "Fleur de Liz", "comment_text": "Thanks for the tip.How much did they charge for whole day Amalfi Coast?"}]}, {"id": "2195645444167867", "text": "Is water safe to drink in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2195645444167867/", "likes": 73, "comments": [{"username": "Debbi Beston", "comment_text": "The water is safe to drink but the difference in minerals can sometimes cause tummy upset. I can go to different parts of this country (England) and because the water is softer I can have an upset stomach for a day or so."}, {"username": "خليفة خديجة", "comment_text": "THE BEST water i've ever tasted was in #tisens #southtyrol"}, {"username": "Samantha Pavanello", "comment_text": "Si se bevi l acqua del rubinetto di qualsiasi casa"}, {"username": "Ghada HM", "comment_text": "Absolutely"}, {"username": "Ed Trevis", "comment_text": "Order a bottle of Acqua Panna is you want still water in Italy. It’s a Tuscan water served all over the country and very common in restaurants. I wouldn’t drink tap water when traveling anywhere in the world. Not a safe thing to do. Why take a risk of ruining your vacation? Bottled water in Italy are one of the best in the world. Try Pellegrino Frizante carbonated water as well. Very refreshing."}, {"username": "Sherri Leis Dillavou", "comment_text": "Yes"}, {"username": "Cindy Neilson", "comment_text": "The water in Italy and Germany is more drinkable than my home country"}, {"username": "Mary Gregory", "comment_text": "Yes"}, {"username": "Joanne Ferreira", "comment_text": "Yes and hell yes"}, {"username": "Pao Magnoler", "comment_text": "Is the purest water ever! Don't worry about it."}, {"username": "Pao Magnoler", "comment_text": "You shouldn't drink tap water in USA."}, {"username": "Sara Beth", "comment_text": "My husband and I both were drinking a lot of it then our tummies were upset. To rule out the fountain water being the culprit-we both stopped drinking it and sure enough we were okay after that."}, {"username": "Nancy Lewis", "comment_text": "Maybe. But don’t. I saw a chef cooking with bottled water. That was enough for me. One day my friend asked the water for regular water. He didn’t want to pay for bottled water anymore. The waiter had no idea what he wanted. It took 5 minutes to convince the water that my friend really did indeed want to drink the city water! Ugh!!!"}, {"username": "Gregory Hawkins", "comment_text": "Yes it’s safe in a lot of places and may not be in some, but bottled water is not expensive! Don’t listen to the sarcastic arrogant a-holes on here!"}, {"username": "Scoun Drell", "comment_text": "With gin"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Yes!"}, {"username": "Virginia Mastrogiovanni", "comment_text": "Absolutely some of the best water there is. Just returned and we drank the water the entire time."}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "Yes!"}, {"username": "Cindy Breneman Hattrich", "comment_text": "I will find out in august. Can’t wait!"}, {"username": "Diane M Rizzo", "comment_text": "I’m an International Flight Attendant and I NEVER drink tap water while laying over in other countries."}, {"username": "Joyce Studman Wishner", "comment_text": "If tap water is safe why isn’t it offered as an option at a restaurant in Italy?"}, {"username": "Heather Bren", "comment_text": "Yes been drinking it all for the last week"}, {"username": "Maureen Rebello Hagerty", "comment_text": "No. Stay home."}, {"username": "Felicia Landis", "comment_text": "YESSSSSS 💦and fill up at ever fountain with a water bottle helps tremendously"}, {"username": "Junko Osaki", "comment_text": "Yes, especially from fountains. I wouldn’t recommend drinking tap water from hotels though, especially in large cities"}, {"username": "Lea Lenderman Shappell", "comment_text": "Yes"}, {"username": "Live Laugh Love", "comment_text": "Yes"}, {"username": "Oscar Badillo Acevedo", "comment_text": "I drank the water in Sorrento and got sick."}, {"username": "Ani Ortiz", "comment_text": "yes!"}, {"username": "Katherine Record", "comment_text": "Mine was fantastic….well\nmine was mixed with wine….\ntechnically it was water, because you have to have water to make wine.\nOkay, it was wine. But I drank a lot of it and it was delicious!!"}, {"username": "Rosaria Bishop", "comment_text": "I understand why you made sure you are anonymous 🤦‍♀️"}, {"username": "Rosaria Bishop", "comment_text": "Do you know why Italy has the best pasta because of its water!"}, {"username": "Teresa D'Alessio", "comment_text": "Yes"}, {"username": "Anthony Parisotti", "comment_text": "We have donkeys and wells"}, {"username": "Viv Bitar", "comment_text": "I prefer bottled water but the tap water is safe."}, {"username": "Michelle L. Fought", "comment_text": "No"}, {"username": "Scott Taylor", "comment_text": "Yes. The water in Italy is far better than most places in the us."}, {"username": "Poulami Saha Roy", "comment_text": "Yes.. I carry chlorine tablets.."}, {"username": "Paul Wilson Ibrahim", "comment_text": "Yes"}, {"username": "Adeline Alex Tanfara", "comment_text": "Yes"}, {"username": "Flavius Hanes", "comment_text": "No..no...only prosecco"}, {"username": "Sheley Bressler", "comment_text": "WTF is a first class country? 🤔🤦🏻‍♀️"}, {"username": "Simone Anna", "comment_text": "Ich wohne nicht weit von Italien weg und trinke das Wasser nicht aus der Leitung in Italien. Das machen die Italiener auch nicht. Wasser bitte in Flaschen kaufen 🙏"}, {"username": "Anny Manīe", "comment_text": "I guess you have lots of insecurities in life 🙂 just don't worry go for it 🙂 eat, drink and Stay blessed 🙌 Italy🇮🇹 is beautiful in every aspect"}, {"username": "Diana Wilson", "comment_text": "Yes"}, {"username": "Remo Innamorati", "comment_text": "Why wouldn't it be???? 😡😡😡"}, {"username": "Claire Lewis", "comment_text": "American?"}, {"username": "Laura Torres Palomino", "comment_text": "Why did so many people laugh at this innocent question?? So rude 🤦🏻‍♀️🤦🏻‍♀️"}, {"username": "Vanessa Luciani", "comment_text": "For the people attacking for such question,you should really find a new hobby in your life.\n\nI live in a small town in nord italy and we can drink it safely. But I travel in italy and it happened to me a few times that \"l'acqua non è potabile\",that means you can do everything with it but not drink it. Usually you get warned about it,or if you want to be extra safe just ask! If you read \"non potabile \" just dont drink it. It really varies from places"}, {"username": "Graham Sherlock", "comment_text": "I drink it every day."}, {"username": "Jerry Cowper", "comment_text": "Add whiskey, and you’ll be fine.😳😂"}, {"username": "Julie Harumi", "comment_text": "Drink what?"}, {"username": "Claire Rush McMillan", "comment_text": "I hear the Aperol spritz is great 😉"}, {"username": "Urfi Omer", "comment_text": "Yes it is, but it's a pity. I prefer wine"}, {"username": "Sandra Maldonado", "comment_text": "Why do people talk about Italy as if it was some third world country? Is the water in Flint safe to drink?"}, {"username": "Luigia Gray", "comment_text": "Yes!"}, {"username": "Kristina Samuelsson", "comment_text": "Yes"}, {"username": "Sally Ann Tanasi", "comment_text": "The first time I went to Italy by myself I bought San Pelligrinio and used it to brush my teeth!!!! Lol\nNow I drink Agua Frizzante when I go.!!!!"}, {"username": "Cheree Petersen", "comment_text": "Nope bottle water is good"}, {"username": "Eric Coetzee", "comment_text": "Drink from the fountains! They are everywhere!!! We came back now from Italy."}, {"username": "Karoline Bakker", "comment_text": "The drinkwater fountains are safe but most people drink bottle water"}, {"username": "Jo Ann Perrotta Solimando", "comment_text": "Yes. Even from the random fountains"}, {"username": "Archie Lefkakis", "comment_text": "Yes"}, {"username": "Donna Webster Hoffmann", "comment_text": "Yes. Restaurants serve bottled water though."}, {"username": "Anna Osborne", "comment_text": "I believe you can but my family who live in Montecatini always have bottled water. One of my cousins has a third tap that filters the water . 🤷‍♀️"}, {"username": "Elizabeth Crombie", "comment_text": "Hey negative people who like to make others look stupid for asking a question- stop it. If you think the question is not up to your standard then scroll on."}, {"username": "Chad Michael", "comment_text": "Why are there so many rude people in this group who feel the need to laugh at posts?\nI get it, you all hate yourselves and you want everyone else to be at your level of misery. Just a sad, pathetic existence to lead."}, {"username": "Catherine Tero", "comment_text": "Yes 👍"}, {"username": "Jan Schiffner", "comment_text": "It depends. If you are staying have it tested. My village has arsenic traces. All use bottled but other areas are ok."}, {"username": "Âmr Âmr", "comment_text": "Yes, unless it was poisoned 😶"}, {"username": "Mimi Mary", "comment_text": "Great water,and free places it refills,very cold water"}, {"username": "Sally Warren", "comment_text": "Yes. The Romans invented aqueducts."}, {"username": "Paula Bennett", "comment_text": "Here come the haters!!!!!"}, {"username": "Jami van Wezel", "comment_text": "Tap/fountain water is great but courtesy to just order a bottle when eating out since you don’t tip servers in Italy."}, {"username": "Rosa Carrara- Chovan", "comment_text": "I always drink the water when I go and it’s perfectly fine."}, {"username": "Sue Savage", "comment_text": "Ridiculous"}, {"username": "Kit Nader", "comment_text": "Of course!!!"}, {"username": "Giovanna Bontempi Ness", "comment_text": "Honestly... where do you think you are going!?!"}, {"username": "Monica Ramos", "comment_text": "Yes!"}, {"username": "Lucrezia Folger", "comment_text": "100%"}, {"username": "Mary Ann Meyer", "comment_text": "safer than here. Drink out of the public springs. Best water ever"}, {"username": "Lisa Baglio Garrison", "comment_text": "Yes very safe and clean. No worries!"}, {"username": "Soc Cer", "comment_text": "The water dripping down the mountain is safer than the water we drink from plastic water bottles. The only water I would be cautious about is the water in Venice....."}, {"username": "Joseph Guerrero", "comment_text": "Unfortunately it’s toxic ☠️ there’s high levels of olive oil and mozzarella in the H2O 💦 lmfaooo … just kidding it’s good to go"}, {"username": "Debra Rigler-Arsenault", "comment_text": "Yes."}, {"username": "Ann Barrett", "comment_text": "I didn’t drink the water while￼ I was there, just to be safe! I got sick from an ice cube in Mexico City—it isn’t fun!"}, {"username": "Dorothy Sarnelli", "comment_text": "Yes yes yes when we were out and about walking and seen the water running down the rocks we drank that too it was so cold and fresh beautiful on a hot day"}, {"username": "瘋乳銅怒", "comment_text": "they drink wine"}, {"username": "Nadia Filice", "comment_text": "Yes"}, {"username": "Elizabeth Grafel", "comment_text": "We tip. When we rent an apartment for a week or longer in Sicily we purchase water by a six liter pack from the local supermercato."}, {"username": "Anthony LoBue", "comment_text": "Best water ever from fountains. Even the fountains near the ruins."}, {"username": "Jo Ann Di Giamo", "comment_text": "Yes"}, {"username": "Alessandra Bonafè", "comment_text": "Prosecco is better"}, {"username": "Jenny Larsen", "comment_text": "Yes everywhere and the water from the water fountain things is cold and clean"}, {"username": "Teresa Heran", "comment_text": "It’s a valid question. Our AirBnB host in Tropea told us to drink bottled water. That is what he did personally. I drink bottled or filtered water at home so felt more comfortable doing that during my month long trip.\n\nNot sure why people just can’t scroll past posts that they find annoying……."}, {"username": "John Mazurek", "comment_text": "Yes!!!"}, {"username": "Frances McDonagh", "comment_text": "Yep drank last week and not dead yet 😄"}, {"username": "Frances McDonagh", "comment_text": "Wine windows safe too"}, {"username": "Melissa McCormick", "comment_text": "We drank it even out of the fountains. We are from US and all was well! I’m sure their water is better then ours anyways."}, {"username": "Sandra Keyser", "comment_text": "Their water is great! We probably have more problems with water in the US than Italy."}, {"username": "Lena Albinsson", "comment_text": "Yes but not everywhere! Me personally don’t do it cause it’s not good, maybe at a local water source, spring water I could maybe\ndo it 😅I am spoiled with the best water up here in northern Sweden so🤷‍♀️"}, {"username": "Daniela Besseghini", "comment_text": "No its not! Beer is better!"}, {"username": "Russell Weidner", "comment_text": "Seriously? Do you think you are in Chicago, Detroit, Baltimore……."}, {"username": "Brenda Cox", "comment_text": "We were told from our tour guide. If you aren't use to it.. I wouldn't drink it.. I have stomach issues.. So I difently didn't drink it.. I'm picky.."}, {"username": "Laura Schellberg Conroy", "comment_text": "Yes! Bring a water bottle as there are water stations all over. Took me a bit to use, I’ll admit, but it’s all good"}, {"username": "Danielle Baca", "comment_text": "Been there. Done that. Don’t take everyone’s fufu dreams. Where are you going? Many places yes, many places no!"}, {"username": "Donna Dougherty", "comment_text": "Yes!!"}, {"username": "Allison Mir", "comment_text": "No wine beer & coffee only. 🤦🏻‍♀️"}, {"username": "Larry Trent", "comment_text": "They are everywhere and delicious spring water.."}, {"username": "Annabella Pojer", "comment_text": "Of course I can’t believe some of these ? Just enjoy the adventure 😀"}, {"username": "Marie Malone", "comment_text": "Bottled water now contains graphene oxide."}, {"username": "Adriana Rodriguez-Argueta", "comment_text": "And here we go; again !! 🤦🏻‍♀️🙄"}, {"username": "Steve Wolfrom", "comment_text": "Google please to avoid all the politics here"}, {"username": "Kathy Kattic McKee", "comment_text": "Absolutely"}, {"username": "Ivette Lugo", "comment_text": "My rule of thumb, drink bottled water the first 24 hours there, doubt that Europe is a 3rd world Country, it’s better to be safe than sorry, i’ve been to Italy and drank water, it definitely tastes different but I didn’t get sick"}, {"username": "Jolie Carbone", "comment_text": "No, there’s crocodiles in the water. You can drink but be quick"}, {"username": "Luigi Antonelli", "comment_text": "No you must only drink wine"}, {"username": "Cindy Wilhelm", "comment_text": "No"}, {"username": "Olga Olga", "comment_text": "Terrible! Taste like pasta 😂"}, {"username": "Tanzia Samad", "comment_text": "Umm just buy water , it’s 1 euro !"}]}, {"id": "2195645900834488", "text": "Ok I've decided to a mini trip to Italy with my kids and Husband, never been before. Any tips of where to go and what to do. We want to do the obvious tourist bits like Rome but advice on what order and where to go would be most welcome, places people gave stayed. Very flexible and open to any ideas!", "link": "facebook.com/groups/1373361046396315/permalink/2195645900834488/", "likes": 7, "comments": [{"username": "Scott Heran", "comment_text": "Mini trip? How many days?"}, {"username": "Tracy Piko Lawniczak", "comment_text": "How long in Rome? Look for skip the line tickets/tours for Vatican tour etc.\n\nI’m staying right by the coliseum haven’t stayed in that area before. I’ll try to remember to get on here and post review."}, {"username": "Starla Dawn", "comment_text": "Sorrento as a base"}, {"username": "Kristina Ruk", "comment_text": "Florence, Venice if you have time"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "When?"}, {"username": "Miyuki Kanno Paul", "comment_text": "Where are you coming from, and what airport are you using?"}, {"username": "Doug Burke", "comment_text": "With that short of a time just Rome and Florence. I know there will be a HUGE temptation to cram in more but don't. As with most things in the wacky thing we call \"life\" an increase in QUANTITY usually results in a decrease in QUALITY. It's no different with trips. Go for trip quality."}, {"username": "Elisha Lynn Simon", "comment_text": "If your kids aren’t old enough to remember the trip , don’t bring them."}, {"username": "Phyllis Snyder", "comment_text": "How old are the children? And can you travel in the fall? Summertime is scorching hot 🥵! Or spring time?"}, {"username": "Jerry Lyubelsky", "comment_text": "1 week? Do Florence and Rome. 3 and 3"}, {"username": "Dave Colleen", "comment_text": "Is this a one and done or will you be back? 5 days is not much time. Florence and Venice would be my pick."}, {"username": "Alice Francesca", "comment_text": "Venice and Rome."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "5/6 days I would stick to Rome and fully explore it, with maybe one day trip to Tivoli or to Naples."}]}, {"id": "2195654214166990", "text": "Hello there!\nMay I know\n1. The best way to see lake Como? Take a cruise or go around?\n\n2. If one can take lake Como cruise from Varenna?\n\n3. I want to cover Bellagio, lake Como And varenna in one day. Is it possible?\n\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2195654214166990/", "likes": 2, "comments": []}, {"id": "2195663870832691", "text": "My wife and I will be in Italy late Sept through to mid Oct. Is it best to book required train tickets, tours etc before we leave Aust? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2195663870832691/", "likes": 0, "comments": [{"username": "Steve Grossman", "comment_text": "Book your tours in advance. The Crowds will be a lot less at the time You're going so you can get your train tickets at the station. It shouldn't take long"}, {"username": "Lisa Valdovinos", "comment_text": "We did everything in advance. If you book tours in advance you can skip the long lines. Check out Avanti"}, {"username": "Jerry Lyubelsky", "comment_text": "We used Viator for most our tours. Some have their own websites like the pantheon and Santa Croce in Rome. Train tickets as soon as they are available"}]}, {"id": "2195673444165067", "text": "Hello! Can someone recommend a wine tour from Florence please?", "link": "facebook.com/groups/1373361046396315/permalink/2195673444165067/", "likes": 2, "comments": [{"username": "Gayle Moores", "comment_text": "We took a tour with Get your guide tours from Florence.It was the Chianti in the afternoon half day tour. You are taken to two wineries in the Chianti wine region by van for wine tasting with Tuscan food samples and given a guided tour of the winery and production.It’s\na great way to also see some of the towns in the Chianti region."}]}, {"id": "2195674030831675", "text": "Hello Solo travelers 😀, I’m traveling to the beautiful Italy next week by my own and I’m afraid of the pickpockets 😱, so I need your tips & tricks to keep safe, specially if I want to enjoy the beach and swim , what should I do with my pocket. Thanks in advance 🌹", "link": "facebook.com/groups/1373361046396315/permalink/2195674030831675/", "likes": 18, "comments": [{"username": "Harris Dee", "comment_text": "Fear not, be vigilant and don’t seem vulnerable, lost or afraid… stand tall be confident and beware but mostly be aware"}, {"username": "Elaine King", "comment_text": "I purchased a purse with steel mesh plus steel mesh in the strap,"}, {"username": "Lydia Springer", "comment_text": "Don't be afraid. Just keep your things where you can see them and pay attention. It's the same everywhere."}, {"username": "Don Bentivoglio", "comment_text": "The pickpocket fears are over-hyped. Italy, and its large cities, are no different than any other country. Take the same precautions that you would take in your own country. Just be aware of your surroundings."}, {"username": "Vera Feeny", "comment_text": "Put your wallet in a zipped pocket in your purse. A lot of places let you pay with tap (I uploaded my cards via Google wallet) so you don't need to take out your wallet. I have a ring shaped holder on my phone for extra security when holding it."}, {"username": "Allan Olexa", "comment_text": "We use Loctote cut proof/lockable backpacks attached to a secure object like a pipe."}, {"username": "Steve Grossman", "comment_text": "Leave everything in the safe in your hotel if they have one."}, {"username": "Shari Benyousky", "comment_text": "Don’t sit near a corner if you’re waiting. Too easy for someone to grab and run around away from your visual line of sight"}, {"username": "Jules Earl-Rossiter", "comment_text": "I've visited Venice 11 times and lv never come across a pickpocket....I\nalways take cash and leave my card's in the hotel safe....I just take enough out for the day...the notes l put in my shoes and the coins in my pocket... Never had any problems....🙃"}, {"username": "Jerry Lyubelsky", "comment_text": "Get a Fanny pack we used that had one hand in it the whole time. We saw pickpocketing attempt on the metro in Rome when going to Ostia but other than that we were ok"}, {"username": "Soc Cer", "comment_text": "if you're that worried, buy a money/bag belt that you can wear under your clothes."}, {"username": "Graham Sherlock", "comment_text": "Also have another person's contact name and number written on your phone on a label, in case you lose your phone, or put it down and leave it."}, {"username": "Graham Sherlock", "comment_text": "You can also leave your stuff with someone else on the beach, just ask them if you can leave your bag with them whilst you swim. I'd pick a family setting for this."}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "Depends on where you are. Bagnos have large locker type rooms to lock your things in"}, {"username": "Sara Kyle Hargett", "comment_text": "Dry bag"}, {"username": "Maria Brozou", "comment_text": "Waterproof pouch for the beach"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I really don't think Italy is worse than any other country. Be aware of you surroundings. I like a crossbody bag and I keep it in the front of me. You will be fine. I was just there with my daughter and didn't have any issues. Enjoy your trip"}, {"username": "Romina Lauretig Toscano", "comment_text": "Where do you go in Italy?"}, {"username": "Hannah Catherine", "comment_text": "I’m travelling in Italy solo just now. I’ve not had any issues and not seen any (not to say there isn’t) and I’ve been to different areas a few times. My advice is keep your belongings close to you in crowds - a crossbody bag is reassuring as you can see/feel it all the time, try not to take too much out with you - if you can leave things in your accommodation there’s less to worry about, and try not to flash your phone/cash about too much. I don’t take a lot of cash with me as nearly everywhere accepts card after covid. One lost card can be cancelled but a wad of cash is hard to get back. I would get a waterproof pouch for the beach. I got one from Amazon called a phone and key pouch. Otherwise have a great trip and don’t worry about it too much 😊"}, {"username": "Jane Eichhorn", "comment_text": "Use your hotel room safe. Don’t just leave things in your room."}, {"username": "Jenn Bildersee", "comment_text": "Little waterproof pouch I wear around my waist when I go in the water. Holds phone, credit card, hotel key. Nothing on the beach but a towel and hat"}, {"username": "Ellie Smythe-Jones", "comment_text": "I’ve just returned and to be honest, I experience the same behaviour in the country that I live, not just Italy. I took a carabiner and clipped it through the zip and clasp on my crossbody bag. We left everything behind when we swam and if we were further away, carried a waterproof pouch for our mobile, and he swam with it. We also got to take some stunning pics from the water. We were just vigilant, didn’t take purses out of bags, rather put my hand inside. Kept a €1 in our pocket for bathrooms and tried not to open my bag frequently. Don’t take flowers or bangles from people on the street unless you want to. Be confident in saying no."}, {"username": "Jade Morgan", "comment_text": "Leave everything where you're stating when you go swimming. I'm on my own and this is what I'm doing. As for pick pockets I don't think it's any different to anywhere else just be careful with your bag. Have fun :)"}, {"username": "Rose Anderson", "comment_text": "We were told to not wear rings or jewelry (other than inexpensive costume type) because it makes you a target. Carry only minimal things with you when you leave hotel- use your safe- on beach put your phone and any necessary money or credit card in a pouch that seals out water and keep it on your body in water etc. avoid crowded places- be aware-\nWe were in several places in Italy that felt unsafe- Trevi fountain- packed with people- observed a man following and watching people- and then followed us until my husband looked him in the eye and he turned away. There were times in Palermo like this also in crowded areas. Our friend had a phone stolen in Palermo while talking on it! But we didn’t feel unsafe all the time- mainly in crowds.\nI carried very little in a crossbody sling bag-"}, {"username": "Margaret Wallace", "comment_text": "I have been pickpocketed, I was standing, filming a street performer with my iphone. A crowd was watching then I put it in my hold all, which was over my shoulder. As I walked away, went to get my phone out, gone!\nwent to Police. They asked me what I do for a living, I replied Security and they laughed 😂"}, {"username": "Fannie Liu", "comment_text": "Waterproof bag you wear around your neck, I use one to bring my phone into the ocean for pictures."}, {"username": "Jennifer Walp Rydholm", "comment_text": "The best things we did on our last trip to Portugal was purchasing phone tethers which could be attached to a zipper on the inside of your purse or any other part of the purse or belt loop so that nobody can actually runoff with it without taking you with them. It also prevents you from dropping it or leaving it anywhere."}, {"username": "Linda Safstrom Humphreys", "comment_text": "You could use an empty sunscreen container put loose coins or folded notes and fill with dry ingredients, could work"}, {"username": "Alex Bader", "comment_text": "Go with me in September and you be safe"}, {"username": "Corina Mateu", "comment_text": "Buy an anti theft bag like this one from Sherpani. It has a ton of pockets and you can’t cut through the material with a knife. The zippers are made so that they don’t easily open therefore making it really difficult for anyone to try and take anything out. I have the backpack and also a crossbody and they’ve been all over the world with me with no issues."}, {"username": "Linda Boardman", "comment_text": "Leave everything where your staying when you go to the beach. Do you need your phone or money? You can get a waterproof pouch to put your phone etc in if you have to take them. You can wear them around your neck or put them under your hat."}, {"username": "Lucrezia Folger", "comment_text": "Many, many, many past posts on this. Crossbody purse, at the beach, leave valuables in your hotel safe."}, {"username": "Brice Blosser", "comment_text": "Just be alert and vigilant. Don’t make yourself an easy target."}, {"username": "Gayle Moores", "comment_text": "Wear a money belt at all times if your are not swimming or on the beach.You can keep them in the safe in hotel if on the beach.However wear a money belt when you are in public,on the trains and in restaurants especially. We carry our passports on our money belts in case we are asked by the police to check our identification.\nIt is the law in Italy and you are asked to show your passports at hotels as well!Put passport in a plastic bag to protect them from getting dirty or wet and keep them safe in your money belt hidden just below your waist inside your clothes."}, {"username": "Claudia Castellini", "comment_text": "When you go to the beach take only few money and leave your passport at the hotel (take with you just a copy, if police should ask you).\nOnly if you drive you need your original driving license.\nThen you can take a bath, leave your stuff on the beach, putting everything under a towel: probably the beach will be pretty crowded and so safe enough!"}, {"username": "Linda Brecher Bekoff", "comment_text": "Crossbody bag. Careful on crowded buses, subways, historic sites. Don’t accept things or help from strangers (flowers, rings, help with ticket machine). It’s nothing to fear. Just be aware as you should be in any metropolitan city. Don’t underestimate anyone (school children, elderly, backpackers). I’ve seen many innocent looking people pickpocketing- it’s a vocation."}, {"username": "Jennifer Larese Taylor", "comment_text": "I have never ever had a problem with pick pockets or theft in Italy. Just be sensible. I don’t use a special bag, just a nice quality handbag. Only take what you need to the beach. You’ll be fine"}, {"username": "Manuela Bonazzi", "comment_text": "Non credo che in Italia ci siano più borseggiatori che nelle altre grandi città. Le accortezze sono le stesse ovunque.."}, {"username": "Miyuki Kanno Paul", "comment_text": "Be vigilant. Be aware of the surroundings. Don’t leave your phone on the table. Never get distracted. It’s nothing different from being in London, Paris, Sydney, etc"}, {"username": "Andrea Kroposki", "comment_text": "They sell waterproof phone case lanyards. I used one in the Bahamas to not only take pictures but keep my credit card and cash on me when we were swimming. For regular site seeing you can get a anti theft purse, crossbody, garters that hold your phone and pasport ect under a dress, hidden bra pouch or strap it around your underwear depending on your clothing. So many choices."}, {"username": "Alicia Cox", "comment_text": "Crossbody that zips. Carry it on your right front side - away from street - same with you phone - carry it in your right hand away from street & have your head on a swivel & don’t sit anything down unattended."}, {"username": "Chris Vilsack", "comment_text": "If you go to the beach by yourself, just bring a towel. Nothing else. Maybe a little money for a beer/water"}, {"username": "Ann Romanowski", "comment_text": "Waterproof phone case can also hold a card & your hotel key. Swim with it around your next & be worry free!"}, {"username": "Eric Parks", "comment_text": "At the beach specifically, don't bring anything you don't mind getting stolen or can't get wet."}, {"username": "Enrica Palla", "comment_text": "Would you be afraid of pickpocketing in New York? Just be aware as usual. I've lived in Italy (various cities and regions) and travelled all around and never be pickpocket."}, {"username": "Irene Oda", "comment_text": "What do you do normally.when you travel?"}, {"username": "Voula Ladas", "comment_text": "Have a crossbody bag which you wear across your chest (sling bag) and always keep it locked/closed . Never leave your phone on a table . Use Pay wave to purchase things with your phone to lessen the amount of times you need to get your purse out of bag . As others have said , be alert to people hovering close to you , or trying to sell you something . It’s often a distraction . Be especially careful at the airport and train stations . Also please be aware of people posing as police ,who aren’t in uniform ,and asking to see your passport . They are trying to steal your passport . (Of course you must show it to real police . ) With the beach and protecting items, invest in a dry bag to place your phone and some money in . Leave your passport and other valuables that day in hotel safe . Enjoy your trip !"}, {"username": "Phyllis Snyder", "comment_text": "Crowds are mainly where a thief might single out a person- tourist. If you are distracted or in a hurry or look lost or confused or carrying several bags- then you might be prime target. And a thief may not look like a criminal- could be a child, teenager, older person, a well dress person, or even a fellow tourist. Italy is safe and pickpocketing is actually rare- but does happen. By not being a victim of theft- be vigilante and not vulnerable. Put valuables in a secure anti theft money belt carried under clothing- use a crossbody anti theft purse or bag- zipped up always! Don’t luge around a lot of bag’s around, don’t wear expensive jewelry, don’t put your items down in a unsecured place like the floor. Be prepared and confident. Mostly relax and enjoy your trip!"}, {"username": "Carol Brewer", "comment_text": "Safety pins, attach to the holes in the end of zippers or place under the zipper track/. Guys can put their wallets in front pockets and safety pin pockets close ."}, {"username": "Samantha May", "comment_text": "there are waterproof beach mobile pouches,"}, {"username": "Paula Brink", "comment_text": "If you go to a beach club they often have lockers but leave most valuables in your hotel room."}, {"username": "Sandra Desmond", "comment_text": "I wouldn’t leave your bag of any sort unattended while swimming you will definitely be zoomed in on. Have your bag in front of you hold it"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195675434164868", "text": "Our cooking class got cancelled last minute. Does anyone have any recommendations? We will be in Sorrento, 7.22.23-7.30.23. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2195675434164868/", "likes": 0, "comments": [{"username": "Giuseppe Placi", "comment_text": "Check Quanto Basta"}, {"username": "Lauren-Jade Roberts", "comment_text": "Cooking Mama Sorrento - it's in Piano Di Sorrento but easy to get to on the train, some buses or €40 in a taxi"}]}, {"id": "2195690804163331", "text": "Finishing a cruise then train to Milan and want to extend our stay in Italy by 4 days before flying back to Australia. Can’t decide if we stay in Milan or travel somewhere close, your thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2195690804163331/", "likes": 0, "comments": [{"username": "Beth Heys", "comment_text": "Verona! It was gorgeous and either Lake Garda or Lake Como. Milan is nice but a day there is enough to see the Duomo etc. It's just a big city when all is said and done! Verona has a lot of charm and it's own mini Colosseum. Garda is nice and relaxing and on the water (though if you've been on a cruise, that may not be as big a deal!)"}]}, {"id": "2195691097496635", "text": "Omg! I found my perfect hotel in Venice for March but it is a “pay now” and non-refundable hotel.\nWould you book this far in advance?\nI never do nonrefundable.", "link": "facebook.com/groups/1373361046396315/permalink/2195691097496635/", "likes": 25, "comments": [{"username": "Jill Bear", "comment_text": "There’s so many great places to stay in Venice 💚🤍❤️ personally, I wouldn’t risk non-refundable that far out but every bodies risk tolerance is different. Have a great trip!"}, {"username": "Malone Liberata", "comment_text": "Nope"}, {"username": "Patty Ham", "comment_text": "Yes. Sometimes you get 20-30% off by booking in advance nonrefundable. Get travel insurance."}, {"username": "Rosanna Hardeman", "comment_text": "No."}, {"username": "Linda Miller", "comment_text": "No way! I don't book anything that isn't refundable."}, {"username": "Frances Scannapieco", "comment_text": "I would book this far in advance but I never prepay for a hotel and never a non refundable one"}, {"username": "Susan Levine Solomon", "comment_text": "It’s worth the extra for refund! If u book directly, a lot of the time, u can cancel within a certain amount of time."}, {"username": "Joseph Pisaniello", "comment_text": "Absolutely not buy trip insurance."}, {"username": "Patti Porter", "comment_text": "No….."}, {"username": "Diane Lebel", "comment_text": "I booked a non refundable in Venise and Rome and it worries me .Hoping everything goes well . My other reservations in Amalfi coast and Tuscany will be with a travel agent for sure"}, {"username": "Jace Michaels", "comment_text": "I only book refundable rates, regardless of any type of savings that may be passed on."}, {"username": "Rita Bivona Morgan", "comment_text": "no"}, {"username": "Tina Bellitto", "comment_text": "No"}, {"username": "Jonna Dean Barrier", "comment_text": "Either do refundable, get travel insurance that covers it or last option (hardest work, I still haven’t done mine) use a credit card that will cover it. You never know what will happen. I was supposed to go on a trip to Paris, Italy and Greece on June 5th with my newly graduated from high school daughter. I found out on May 26th that I had a stage 4 brain tumor. Surgery on May 28th. I’m still trying to get my money back using my credit card for some of my trip, but it’s a bit tedious and I can’t seem to get to it after my daily cancer treatments. That’s why I think the credit card approach should be the last resort. 🙂"}, {"username": "Maria O'Callaghan", "comment_text": "I only book accomodation where I can pay on arrival and has free cancellation. I do give my credit card as security."}, {"username": "Pauline Murray", "comment_text": "Try other websites, I always do that and find one that's pay on arrival."}, {"username": "Suzanne Mills", "comment_text": "No"}, {"username": "Joanne Nacson", "comment_text": "Have you tried looking on another medium? Some places on my computer were pay now non refundable but the place on my phone they were refundable pay on day (or vice versa)."}, {"username": "Linda Espie", "comment_text": "Na"}, {"username": "Lucrezia Folger", "comment_text": "Remember, you’ll only be sleeping in your hotel room, you’ll be out all day and evening."}, {"username": "Suad Oraivej-Morassi", "comment_text": "I don’t book the non refundable that long in advance"}, {"username": "Maria LoSurdo", "comment_text": "No!"}, {"username": "Robyn Lawson", "comment_text": "No definitely not!"}, {"username": "Annette Tamminga", "comment_text": "If you don’t care about losing the money go for it. If it would be a large financial hit, do not do it."}, {"username": "Sue Holden", "comment_text": "I wouldn’t risk it!\nThere will be lots of other hotels around march time available ."}, {"username": "Renee Rundle Stoneham", "comment_text": "Nope. I never book anything that’s not refundable.\nI prefer if it’s refundable within a week of my stay, and I’ll pay higher price to get that. I’ve done refundable 2 weeks out too.\n\nOnly time I’ve done a totally non refundable is a last minute book, usually a day or 2 before I stay and I know I’m staying!\n\nAt the very least you want credit at the hotel etc…"}, {"username": "Maryjane Mucciolo Barbaris", "comment_text": "Refundable ONLY!"}, {"username": "Alice Francesca", "comment_text": "On booking.com most fares are refundable.You can find non refundable too and they are cheaper of course"}, {"username": "Evan-Sue Wilson", "comment_text": "Since Covid I don’t book any without free cancellation. Insurance is great but it was such a lot of work getting the documentation organised for the Insurers when our trip was cancelled.\nOnce bitten, twice shy!"}, {"username": "Michelle Solak", "comment_text": "I did this for a hotel in Positano bc I think it was the only option though usually I try to book the safer rate if possible. I think mine was more like 6 months in advance. We thankfully didn’t have any issues but I’m not sure I’d do it again in the future lol! Proceed with caution!"}, {"username": "Billie Begley", "comment_text": "If it was a reputable hotel that was well known. Yes. Otherwise. No."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Nope. I always pay extra to make it refundable. Just in case. 🙃"}, {"username": "Janette YesPlease", "comment_text": "See if you can find the same hotel on booking•com, which usually allows for cancellations. However, it can be slightly more expensive."}, {"username": "Miriam Griffin Woods", "comment_text": "Look at the reviews first"}, {"username": "Karen Schmidt", "comment_text": "There are lots of beautiful places. I would pass on this one and only get one that’s refundable."}, {"username": "Jeanette Amoroso Harrigan", "comment_text": "No"}, {"username": "Carla Johnson", "comment_text": "Trust me you do not want to book non refundable, I learned the hard expensive way. I had every thing booked and paid for for my vacation and BAM covid shut everything down. I lost a few thousand dollars. Never again will I book in advance without the guarantee of refund. Been 3 years and still fighting with travel insurance on some of the flights"}, {"username": "Jennifer Tarin", "comment_text": "I would never book a non-refundable anything travel related these days because you never know what can happen, especially this far out. I'd bookmark this location and see if you can find a comparable hotel that's refundable for your chosen dates"}, {"username": "Claire Henderer Haughney", "comment_text": "I would do."}, {"username": "Lisa Valdovinos", "comment_text": "I would not do that. Too risky."}, {"username": "Jean Bennett O'Reilly", "comment_text": "No, definitely not."}, {"username": "Diana Smith", "comment_text": "Absolutely not!"}, {"username": "Susan Marten", "comment_text": "It’s a no from me."}, {"username": "Phyllis Snyder", "comment_text": "How many nights? If it’s more than 1 or 2 I’d look into another one."}, {"username": "Dianne PorŦer Wilson", "comment_text": "My husband booked two non-refundable rooms for us to meet our son & family in North Carolina twelve years ago. Month before trip, I was diagnosed with leukemia. We've never booked non-refundable since then."}, {"username": "Walter Horan", "comment_text": "So what’s the name of the hotel in Venice ?"}, {"username": "Charleen Siegler Schuss", "comment_text": "The Venice experience isn't from the Hotel."}, {"username": "Kirsten Bock", "comment_text": "No I would not. I pick Airbnb’s with a good cancellation policy."}, {"username": "Barb Beyerhelm", "comment_text": "Yes"}, {"username": "Debi McGrath", "comment_text": "I wouldn’t, I’m making so many changes already to my trip in sept/oct. I’m not a fan of prebooking and when I do I make sure it’s one I can cancel for full refund."}, {"username": "Virgz Van Møøre", "comment_text": "No"}, {"username": "Amy So", "comment_text": "I would not book non refundable. There are so many hotels in Venice. At first I wanted canal view but we stayed at hotel Campiello for 3 nights and loved it. No view but great breakfast. No bridge from the vaporetto stop. We walked out and turn left. In about 10 seconds, there is the Grand Canal. It was perfect for us. Also, depends on your other destinations and timing , you may want to cut and spend it somewhere else."}, {"username": "Laurie Monique", "comment_text": "When you really want to stay somewhere, you just pay it."}, {"username": "Sharyn Lockwood Allan", "comment_text": "I have booked all mine for May and all are non refundable… I will have travel insurance if anything goes wrong to cover"}, {"username": "Mindy Jo", "comment_text": "All of my stuff is non refundable. To gamble or not to gamble....."}, {"username": "Catherine Elizabeth", "comment_text": "NOOOO!"}, {"username": "Robin Burrell", "comment_text": "No"}, {"username": "Pearl Lucero", "comment_text": "I say yes if it’s a good deal and a great hotel. Just make sure if you cancel all but first night will be refunded. If on booking site, check their parameters."}, {"username": "Tammy Hull", "comment_text": "No"}, {"username": "LC Willis", "comment_text": "Nope"}, {"username": "Jacqui Hodge", "comment_text": "No, I would only book hotels that are refundable. We had to cancel my “50” birthday vacay last year to Italy due to my mom getting sick & passing away (happened in a two month span, so very quickly).\n\nThank goodness everything we booked was refundable. You never know what can happen."}, {"username": "Rasha Za", "comment_text": "No"}, {"username": "Anne Dickie", "comment_text": "Yes I have many times and been extremely lucky so far. However I do worry in the run-up to the trip and sometimes think the stress is not worth it."}, {"username": "Elena Boetel Sutton", "comment_text": "If you buy trip insurance you would be refunded as long as cancelled for covered reason. And when paying thousands for an Italy trip what’s a few more hundred to make sure you are covered? Your USA health insurance will not cover you there most likely so should have insurance any way IMHO. My aunt got a GI bug and dehydration in Caribbean. Wouldn’t let her leave hospital without paying$3000. Don’t know if Italy that severe but not worth the risk for me. AIG and Allianz are good ones to look at."}, {"username": "Laura Uribe", "comment_text": "We seldom do it but every now and then, a place is worth it. Trip insurance would cover your loss if you buy a policy."}, {"username": "Sarah Emerson Nelson", "comment_text": "Not me - my travel plans change too much."}, {"username": "Cris Wimer", "comment_text": "Book and buy travel insurance."}, {"username": "Joe-Linda Po Agustin", "comment_text": "Pre COVID, I always booked the non refundable option because it was cheaper. But now, booking refundable only."}, {"username": "Brenda Posey Simon", "comment_text": "if I had the cancel for any reason travel insurance I would"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "See if it’s available thru booking com website"}, {"username": "Aiden Sone", "comment_text": "Maybe your credit card has cancellation insurance."}, {"username": "Lori Ann", "comment_text": "Which hotel?"}, {"username": "Lauren Swanteck Myler", "comment_text": "I would never book non refundable this far out."}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Absolutely not"}, {"username": "Roland Trego", "comment_text": "I wouldn't book it unless I had travel insurance to cover it."}, {"username": "निनावी सहभागी", "comment_text": "This far in advance I don’t have a set itinerary so something can change.\nHeck I don’t even have the time off yet!"}, {"username": "Miyuki Kanno Paul", "comment_text": "How bad do you want to stay at the particular hotel?"}, {"username": "Alexandra A Welker", "comment_text": "Don't do it! It's too far out and you never know what will happen."}, {"username": "Gail Dial Harris", "comment_text": "Allianz"}, {"username": "Cindy Gallen Barton", "comment_text": "Might not be as big of a risk if you have trip insurance"}, {"username": "Nancy Vahl Raske", "comment_text": "Nope! But I book and leave a week later lol"}, {"username": "Yvonne Donnellan", "comment_text": "Nope."}, {"username": "Bob Cinquini", "comment_text": "Oh, what the heck. Go for it! It’s part of the adventure! ￼"}, {"username": "Jerry Lyubelsky", "comment_text": "Get travel insurance this way of something g happen you can recover it"}, {"username": "Jenny RV", "comment_text": "Not a chance"}, {"username": "Mallorie Mathis McManus", "comment_text": "nope."}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "Is there an option for a higher price that’s not “pay now”? I never feel comfortable with non-refundable!"}, {"username": "Pat Cray", "comment_text": "No I would not book."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I only book hotels directly and pay on check out, never in advance."}, {"username": "Susan Lowry Lamb", "comment_text": "Normally they all offer a higher rate that is refundable."}, {"username": "Kimberly Zammit", "comment_text": "I would not, and I am from Europe."}, {"username": "Maja Vidmar", "comment_text": "I’n also from Europe (Italy’s border country) and I never ever book a non-refundable no matter where I go"}, {"username": "Kimberly Lynne", "comment_text": "If first night arriving internationally\n, keep in mind that delays happen. Weigh your risk."}, {"username": "Jolene Ens", "comment_text": "How many nights? Would you lose 1 night or 6? In this day and age when 99% of places have some sort refund policy (even if it's 30 days out), I would not book non-refundable.\nThings happen and plans can change."}, {"username": "Casarine Temple", "comment_text": "I only book refundable because who knows what could happen . Edit to add : And that’s 8 months out so no , I wouldn’t risk it ."}]}, {"id": "2195708104161601", "text": "we are going for 5 days to visit amalfi, poseidano sorento, and they tall as to stay in salerno we are going to have a car.. you thing its going to be easy? thank", "link": "facebook.com/groups/1373361046396315/permalink/2195708104161601/", "likes": 0, "comments": [{"username": "Iliana Zlatareva", "comment_text": "You can stay in Sorento, with car it will be difficult.Via bus or boat, I recommend bus you can visit Pisitano, Amalfi and Ravello.Why bus-amazing road and views."}]}, {"id": "2195697770829301", "text": "Over the years our small family has stayed at many vacation rentals around the world with that “wow factor” - those accommodations that we’ll always remember, and tell stories about how wonderful the trip was - and the place we stayed is a large part of that story!\n\nNow retired and planning a “surprise” trip with my wife (hence the anonymous post),आणखी and looking for one of these memorable accommodations for 1-2 months in central-northern Italy for early next year. The ideal would be a villa/house (luxurious, but not ridiculously expensive), private, but within a 30-45 minute walk of a lively town/village.\n\nAny recommendations???", "link": "facebook.com/groups/1373361046396315/permalink/2195697770829301/", "likes": 0, "comments": [{"username": "Briana McDougall", "comment_text": "It's a hotel, not a vacation rental, but Palazzo di Varignana outside of Bologna might fit the bill."}]}, {"id": "2195708524161559", "text": "BBC News - Europe heatwave: Nearly all major Italian cities on red heat alert\nhttps://www.bbc.co.uk/news/world-europe-66242277\n\nPlease be careful... drink lots of water and look after yourselves 😊 xx", "link": "facebook.com/groups/1373361046396315/permalink/2195708524161559/", "likes": 2, "comments": []}, {"id": "2195709514161460", "text": "Looking for recommendations\nfor transportation never been to Italy and going in August( 🥵) I’m going to Rome, Capri and Naples. Is it easier to take the train, Ubers, boats? Also, any restaurant recommendations\n🇮🇹 TIA", "link": "facebook.com/groups/1373361046396315/permalink/2195709514161460/", "likes": 2, "comments": [{"username": "Brooke Heneghan", "comment_text": "I’ve found trains to be very reliable and not too pricey x"}, {"username": "Alex Betancourt", "comment_text": "Trains are the best way to go. Make sure to download the apps and you can do it all on your phone! First class is a little more, but worth it! Especially on longer rides."}, {"username": "Paul Vincent", "comment_text": "Definitely need a boat to get to capri !"}, {"username": "Chris Landry", "comment_text": "From city to city? Or within a city? Can only get to Capri by boat. It’s an island. In Rome, it is a small area so mostly walk. Occasionally take taxi but must go to designated taxi stand or use FreeNow app. Train between Rome and Naples. But be prepared for both stations to be overwhelming and lots of pickpockets."}, {"username": "Julie Fabrico", "comment_text": "By boat 🛥️ or hiring a personal driver they have many that are quite reasonable"}, {"username": "Elizabeth May La Duca", "comment_text": "Google Maps/directions"}, {"username": "Elizabeth May La Duca", "comment_text": "From Roma Fiumicino airport take bus to Termini train station, then metro"}, {"username": "Elizabeth May La Duca", "comment_text": "August=agosto is the worst month to go to Italy 🇮🇹 imho…Feragosto.\n.Italians go on vacation; lots of low budget foreign students/\ntourists and petty thieves"}, {"username": "Mike Ball", "comment_text": "Rome to Naples by train and then take the ferry to Capri ,\n\nVery reliable train and ferry services plus much cheaper than taxis or private drivers."}, {"username": "Angela Macias", "comment_text": "Train and/or boats"}, {"username": "Miyuki Kanno Paul", "comment_text": "Get a copy of Rick Steves Italy guidebook. It will be your survival guide"}, {"username": "Jerome Burdi", "comment_text": "We are going in September. Radda, In the Chianti region. This is our third time. We rent a car in Florence when we arrive. Best way to get around! Use gps . Have fun."}, {"username": "Diane Angelovski", "comment_text": "Thank you for the information Everyone"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I would fly into Rome, then take a train to Naples and Ferry to Capri. On your return you can fly right out of then Naples airport"}, {"username": "Phyllis Snyder", "comment_text": "In Rome the metro & tram are good, train to Naples - capri boat."}, {"username": "Renee Rundle Stoneham", "comment_text": "Rome to Naples by train easy\n\nNaples to Capri by ferry"}, {"username": "Andrea Daguerre", "comment_text": "Train! Download the app Italo Treno and get the hours and stations."}, {"username": "Frank Hunt", "comment_text": "Trainline App and always eat away from tourist hot spots."}, {"username": "Michele Sica Selesky", "comment_text": "Oh my goodness. Get ready for the heat."}, {"username": "Russell Weidner", "comment_text": "Train"}, {"username": "Isabella DeAngelis", "comment_text": "Bullet trains"}, {"username": "Kimberly Pex", "comment_text": "We did taxis all over Rome, walked all over Rome, took the train to Naples, ferry to Capri and taxi on Capri.\nIn Naples, take bus or a taxi to Pompeii.\nWhen you get to Capri, get taxi asap and go to the blue grotto.\nWe just got home and it was a family of 5."}, {"username": "Valerie Collanton", "comment_text": "Train from Rome to Naples. Ferry from Naples to Capri. You can check ferry schedule and buy tickets on Capri.com. Be sure to get a ticket for each piece of luggage. I think the luggage was 1 to 2 euro per bag."}]}, {"id": "2195712230827855", "text": "“Misting Fans” were a blessing in my trip to Italy. Worth every penny for the heat!!", "link": "facebook.com/groups/1373361046396315/permalink/2195712230827855/", "likes": 7, "comments": [{"username": "Vera Feeny", "comment_text": "We didn't have fans, but I brought some facial mist in spray bottles and they were very helpful too!"}]}, {"id": "2195714317494313", "text": "Is Pompeii an all day thing?", "link": "facebook.com/groups/1373361046396315/permalink/2195714317494313/", "likes": 14, "comments": [{"username": "Jamie A White", "comment_text": "It’s more than half a day, as others have said and if you want to see a lot, would recommend the whole day. It’s certainly bigger (in surface area) than we anticipated."}, {"username": "Denise Tenn", "comment_text": "No - 3 hours at Pompeii & 2 hours at Herculean was about right for us."}, {"username": "Samantha May", "comment_text": "we did Pompei and Vesusvius in one day !! but could depend on temps"}, {"username": "Erminia Pedata", "comment_text": "it could well be if you want to do it properly and with a guide. 🙂 It depends on you"}, {"username": "Brian Osman", "comment_text": "A good half day easy"}, {"username": "Alex Kovacs", "comment_text": "We did 2 hours. It’s whatever you want it to be."}, {"username": "Anthony Sperduti", "comment_text": "Yes"}, {"username": "Renee Rundle Stoneham", "comment_text": "We spent 4-5 hours.\nWandering a lot way out etc, the Colosseum (which I didn’t know there was one!)is very cool. We felt we really covered a lot it.\nDefinitely get the audio guide."}, {"username": "Caroline Basford", "comment_text": "Plenty of water and a sun hat gets very hot their and not much shade"}, {"username": "Rose Oliver", "comment_text": "We did it in half a day"}, {"username": "Carole Tarlap", "comment_text": "It is BIG....takes as long as it takes YOU 🤷"}, {"username": "Lisa Abrams Argento", "comment_text": "Yes"}, {"username": "Anthony Taylor", "comment_text": "We did Pompeii and then went up mount versuvius In the same day"}, {"username": "Ettore de Vita", "comment_text": "NO"}, {"username": "Heidi Stokes", "comment_text": "No in the heat in July. Wear good shoes and stay as long as you want but you can taste it without spending a long time."}, {"username": "Tango As", "comment_text": "Did about 2 hours with a guide. That was enough. It was crazy hot and even that seemed a lot."}, {"username": "Don Mchugh", "comment_text": "A week wouldn’t b enuf"}, {"username": "Don Mchugh", "comment_text": "U mite get an opportunity to c actual archeologists work live"}, {"username": "Bobbie Lane Hausherr", "comment_text": "No half day"}, {"username": "Roland Trego", "comment_text": "2.5-3 hours in normal weather. With the heat now, any longer will be unbearable. There are very few covered areas."}, {"username": "Martinez Martin", "comment_text": "Yes"}, {"username": "Jim Hash", "comment_text": "It’s a good half day. You need to take a couple of hours for Ercolano (nearby). Pompeii was buried in ash, Ercolano was buried in the pyroclastic flow from the eruption."}, {"username": "Luigina Lecei", "comment_text": "To see actual site 2 hours is plenty I feel"}, {"username": "Tracey Sadiq-Butz", "comment_text": "Yes it definitely is we spent 6 hours and didn’t see everything"}, {"username": "Sara Hagen", "comment_text": "We did morning Pompeii and afternoon archaeological museum in Naples with Rafaele from withlocals.com. The private tour was great!"}, {"username": "Anthony McClure", "comment_text": "Yes"}, {"username": "Beverly E-j", "comment_text": "We went in April and we're there all day and still didn't see the whole site. So plan to go back there one day. I recommend the audio guides as they are really informative but you can go around at your own pace."}, {"username": "Ronald Clement", "comment_text": "Definately, what a place."}, {"username": "Bill Palizzolo", "comment_text": "If you go to Pompeii are there guides for hire when you arrive?"}, {"username": "Jackie Severi Hansbury", "comment_text": "Yes, also in hurculamium(spe\nlling)"}, {"username": "Mone Nordahl", "comment_text": "I would say about half a day. Enjoy☀️👍"}, {"username": "Sabrina Tjoelker", "comment_text": "Following"}, {"username": "Sam Passante", "comment_text": "For me it’s a yes 👍"}, {"username": "Mike Ball", "comment_text": "To be honest you could probably spend more than one day, depending on how deep your interest in archaeology and Roman history is ,\n\nI think for most people a day would suffice especially if you are in the heat of high summer."}, {"username": "Lynn Francisco Casella", "comment_text": "Pretty much a good hike around"}, {"username": "Marie Cole", "comment_text": "No. 2-3 hour"}, {"username": "Jordan Schmale", "comment_text": "Nope. We booked a “luxury tour” only to find out it was a “luxury car” and no tour guide provided. Left within 30 minutes"}, {"username": "Summer Christensen", "comment_text": "If you’re interested in history yes! Definitely recommend a private guide. They are packed with so much great info"}, {"username": "Paolina Lamb", "comment_text": "Love that place...but not in the heat!"}, {"username": "Jill Giura DeRamo", "comment_text": "We had a tour guide for 2 hours and that was enough for us. It was really hot!"}, {"username": "Brianna Mercer Leary", "comment_text": "For sure"}, {"username": "Richard Clancy", "comment_text": "Yes, I think so. But not in extreme heat."}, {"username": "Miyuki Kanno Paul", "comment_text": "Only if your legs can handle uneven Roman streets and can tolerate the heat/humidity."}, {"username": "Romana Svítková", "comment_text": "We did a half day tour and I thought we just barely touched the surface."}, {"username": "Madeline Caporale", "comment_text": "Rather depends from what your base city is. For example, from Naples it is a several hour drive one way, plus time at site. But yes, it is usually a full day excursion."}, {"username": "Neville Spargo", "comment_text": "We did Pompeii and the Herculaneum two days ago ! It was extremely hot ! Had a guided tour by a local archaeologist. The tour lasted just over two hours at each site , you could spend hours wondering around but not in these extreme temperatures! It was very uncomfortable. Tour booked with ASKOS TOURS . We opted for the private driver to and from Naples and between the two sites . Thank goodness we did as others chose the rail option which would have made the day very long and a hot journey on the train . Car shared with 6 others and us (2)"}, {"username": "Larry Reinier", "comment_text": "No but that’s more up to the individual"}, {"username": "Rachel Bradfield", "comment_text": "Yes !!"}, {"username": "Eric Parks", "comment_text": "I did 3 hours at Pompeii and 3 hours at Herculaneum and it was a great day. You could do more time at Pompeii but after a while it all blurs together. It's a massive site. Doing the two was good as there was enough diversity between the sites we could make good comparisons between them. We had the same awesome guide for both and would recommend him if need one.\nhttps://\nwww.tourpompei.c\nom/alex/"}, {"username": "Stefano DiSorbo", "comment_text": "Yes"}, {"username": "Sherry Shannon", "comment_text": "A tour guide is a must. It’s a fascinating place that you can’t really grasp the importance of without someone explaining what you’re looking at."}]}, {"id": "2195715967494148", "text": "Looking for restaurant recommendations in Capri please 🤞🏻", "link": "facebook.com/groups/1373361046396315/permalink/2195715967494148/", "likes": 0, "comments": []}, {"id": "2195723480826730", "text": "Hi All\nFamily of 5 adults travelling to Italy in Aug/Sep.\nWe are staying in Praiano first week of Sep and wondering the best way to get from town to town?\nWe have a boat tour booked at 9am departure from Amalfi one of the days, best guaranteed way to get there on time?.\n￼", "link": "facebook.com/groups/1373361046396315/permalink/2195723480826730/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "The bus, however it is very, very crowded. There is a bus just to Positano buy ticket at a bar or tabachi. Or to Amalfi u will use the blue Siti bus. Can be very crowded and may not stop if full, check where stop is and get timetable they can run late from Sorrento because of traffic"}, {"username": "Laura Lee Hickman", "comment_text": "Take the bus that goes just to Positano and then a boat to Amalfi.You can catch boats almost anywhere from Positano. Or maybe you could even get a boat from Praiano...steep\nhills down to the water! Loved the restaurant Il Pino in Praiano ( which is also a hotel)\n\nWe found using that great Positano-Praian\no bus to be very convenient and not as crowded as the Sita buses."}]}, {"id": "2195742584158153", "text": "Hello, beautiful travelers. I have a question, especially for those who have traveled with their T-Mobile phones. I heard that you can use T-Mobile's SMS and web browsing services, but not call and text, to avail of its 'free roaming' services when roaming in Italy. Have you ever used the calling and texting features? If so, were you charged? Thank you 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2195742584158153/", "likes": 0, "comments": [{"username": "Bill Shafer", "comment_text": "We were in Rome. A couple months ago. The Magenta Plus plan gives you free messaging and internet in Europe (and on the plane)\nThey charge you for cell calls, but we used FaceTime or Facebook audio to make phone calls."}, {"username": "Jerry Lyubelsky", "comment_text": "If you have magenta plan it’s unlimited text and data. They give you 5gb then throttle after that. If you call it’s 25c per minute. I used maps and surfed on the train rides and got the you reached your 5gb limit on the last day of our 10 day trip use Wi-Fi where u can to prolong full speed"}]}, {"id": "2195741327491612", "text": "Hello everyone! I am planning to visit Rome from Milan and was thinking to train it instead catching a flight. Will it be cheaper? Could you advise of any apps and websites where I can book the train tickets.\nI also need to book a day return ticket from Rome to Florence.\n\nAlso need some advice what attractions to see in Florence and Milan for day visits.\nThank you! 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2195741327491612/", "likes": 0, "comments": [{"username": "Tahera Begum", "comment_text": "Also, is everything open on Sunday in Florence? (It’s for my day visit)."}, {"username": "Miyuki Kanno Paul", "comment_text": "Trains are not only cheaper but also easier. You can bring a “kitchen sink” suitcase with no weight restrictions! Use Trenitalia and Italo apps/websites."}, {"username": "Pietro Adami", "comment_text": "Trenitalia or Italo run fast trains from Milan and Rome; first, or business class, and you will enjoy the ride"}, {"username": "Rochelle Yngks", "comment_text": "Milan to Rome by Trenitalia Frecciarossa about 3.5 hours from city center to city center. I've done a day trip to attend a mass at the Vatican."}, {"username": "Yvette Pavone", "comment_text": "YES! Train"}]}, {"id": "2195747110824367", "text": "We have two nights in Rome before our cruise. Any hotel recommendations? A lot of reviews we’ve read people are complaining about noise.", "link": "facebook.com/groups/1373361046396315/permalink/2195747110824367/", "likes": 2, "comments": [{"username": "Shannon Stanton King", "comment_text": "We loved Navona Queen Rooftop\n\nhttps://\nwww.kayak.com/\nRome-Hotels-Navo\nna-Queen-Roofto\np.705907.ksp?r9\nck=iq&a=bingads\nsearch&encoder=\n7_1&enc_mt=b&en\nc_bmt=bb&enc_oi\nid=232965898106\n9416&enc_aid=12\n45747323055283&\nenc_adid=778593\n71741503&enc_pi\nd&enc_tid=dat-2\n329658981069416\n%3Aloc-190&enc_\nd=c&enc_n=o&enc\n_cmpid=69804958\n8&r9.a=bingadss\nearch&r9.e=7_1&\nmsclkid=ddbe764\nf55881ba270ad12\nf8a3b2fd49&utm_\nsource=bing&utm\n_medium=cpc&utm\n_campaign=US+-+\nHotel+-+DSA+-+A\nll+URLs+Feed&ut\nm_term=hotel+st\natic-hotel-deta\nil+unknown&utm_\ncontent=Hotel+T\nheme+Test"}, {"username": "Billie Begley", "comment_text": "We will only stay at Hotel Barocca. Great hotel. Been there multiple times."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Always travel with ear plugs just to be safe."}, {"username": "Dave Colleen", "comment_text": "We book a two night stay at one hotel and we’re unhappy. Now at Kolbe Hotel and love it. No issues with noise. Very welcoming and big rooms."}, {"username": "Penny Bellofatto Westberry", "comment_text": "We enjoyed the W"}, {"username": "Kathy Flood", "comment_text": "I loved our hotel. The breakfast was amazing. After a long day the bar was perfect. The staff is very helpful. I would stay here again..https://\nwww.hotelbarocco\n.com/\n?gad=1&gclid=EAI\naIQobChMI7Pfy-9\n2bgAMViLjICh3c6\nAerEAAYAiAAEgKM\nN_D_BwE"}, {"username": "Reshma De Cruze", "comment_text": "We liked A.ROMA Lifestyle HOTEL large room, quiet and 20 min to the city"}, {"username": "Maureen Rebello Hagerty", "comment_text": "Omg it’s Italy. Rome. For two night. Bring on the noise!"}, {"username": "Jane Rump Moreschi", "comment_text": "Hotel Forum!"}, {"username": "Tammy Jess Mercer", "comment_text": "We stayed at Damaso Hotel and it was great! Excellent walkable location too!"}, {"username": "Alex Kovacs", "comment_text": "Noisy hotels are my worst nightmare - we loved our 3 night stay at hotel damaso. We heard nothing from the outside and the only noises we heard from other rooms were sometimes like a bathroom like water running etc. loved it!"}, {"username": "Regina-Rich Krett", "comment_text": "Hassler"}, {"username": "Romina Lauretig Toscano", "comment_text": "Italy and Italians are noisy. Be patient :)\nI can recommend hotel Aventino which is not far from Colosseo and is located in a \"calm\" area. Look up Aventino group hotels in Google."}, {"username": "Connie Iacozza Brazzoni", "comment_text": "BEAWARE OF PIC POCKETS. I had it happen to me on the bus yesterday in Rome. The guy actually had his hand in my fanny pack which I had in front of me. He didn't take anything but he got blasted from my husband. They are very quick so please everyone be cautious."}, {"username": "Daniella Giannone", "comment_text": "Rome life or rome times"}, {"username": "Romana Svítková", "comment_text": "When we were in Rome, the worst noise was from the hotel itself, from the corridors, rooms etc. Outside was nice and quiet. We stayed near the Colosseum."}, {"username": "Lisa Boyes Cooper", "comment_text": "Really enjoyed our stay at hotel Navona"}, {"username": "Tanya Ramsey", "comment_text": "No noise from where we stayed... great location too"}, {"username": "Mia Catalano", "comment_text": "We stayed at Hotel Della Conciliazione, couldn’t fault it. Not noisy and there were a few restaurants to choose from on the same street"}, {"username": "Karon Patterson", "comment_text": "We were around St Peter’s with no noise at night and wonderful Band B"}, {"username": "Anwen Ingram", "comment_text": "Hotel Canada. Double glazed windows, didn't hear a thing. A hotel with a lot of character, very clean and super friendly staff"}]}, {"id": "2195747250824353", "text": "I realize I will need to get a SIMs card for my iPhone, doi need to do anything special for my I watch?", "link": "facebook.com/groups/1373361046396315/permalink/2195747250824353/", "likes": 0, "comments": []}, {"id": "2195757810823297", "text": "Any recommendations for some good travel apps, preferably free?", "link": "facebook.com/groups/1373361046396315/permalink/2195757810823297/", "likes": 0, "comments": [{"username": "Scott Heran", "comment_text": "TripIt is great. Keeps all reservations, flight info, airport info, and lots more."}, {"username": "Erika Clinton", "comment_text": "I just found out about and really like Wanderlog"}]}, {"id": "2195757860823292", "text": "When planning any trip overseas, I highly recommend registering with the step (smart traveler enrollment program) program! ￼ you can list the dates of your trip, your itinerary and even addresses and emergencyआणखी contact information should you have any issues while traveling abroad. They will also alert you if there is terrorist activity or any alerts. You never know. Better to be safe than sorry. Happy travels!￼\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2195757860823292/", "likes": 0, "comments": []}, {"id": "2195761670822911", "text": "FYI: APPLE PAY IS THE WAY TO GO, exchanging cash is only making some else rich and if you get robbed cash isn’t replaceable!", "link": "facebook.com/groups/1373361046396315/permalink/2195761670822911/", "likes": 33, "comments": [{"username": "Robert Lawshe", "comment_text": "Huh??"}, {"username": "Charlie Trippick", "comment_text": "You are making someone else rich anyways. Where do you think that 3% transaction fee is going??"}, {"username": "John Salami", "comment_text": "John Salami"}, {"username": "Heath Ullman", "comment_text": "You will still pay for conversion from the US dollar to Euros with your credit card. And if your phone gets stolen then how are you going to call the police?"}, {"username": "Heather Nixon", "comment_text": "Why not just get a card that doesn’t charge foreign transaction or bank fees. Schwab has one. Free."}, {"username": "Nick Trostel", "comment_text": "Most places my card was giving me 90-91 cents euro to usd. Every bank I talked to said 83-86 cents. It’s a no brainer to use a credit card"}, {"username": "Vasthi Cheddar", "comment_text": "Hmm I think you got that one backwards. Using cc or any form of digital payments IS making someone else rich 😉"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Yes but sometimes the connections do not work e. g in the mountains , remote villages etc"}, {"username": "Frank Hunt", "comment_text": "Wise card is fine, and a better exchange rate."}, {"username": "Lee Say Lor", "comment_text": "You still need to carry some cash. For eg u could lose ur credit card."}, {"username": "Keri Catoe", "comment_text": "I agree if you have a card attached that does not charge any foreign exchange fee's. My husband and I each got the Apple Credit Card so we have the digital card and a titanium card to carry if needed (but we NEVER need it). Tap, go. Pay only the exchange rate as long as we pay off the card before any interest hits. I literally pay it every couple of days. We have been in Italy for 43 days and LOVE using our Apple cards on Apple Pay. Saves us SO much money, time and effort. We have needed cash for a few small things like the tourist tax at our Airbnbs. But other than that, no need to carry a bunch of cash."}, {"username": "Michelle Thorpe", "comment_text": "There’s lots of cards with foreign transaction fees just get one of those."}, {"username": "Anita Grzeszkiewicz", "comment_text": "My advice is use whatever your comfortable with, whatever is giving you the better outcome or options, there is no one size fits all when it comes to money, cards etc."}, {"username": "Lisa Minichini-Dowty", "comment_text": "Agree! Used it 95% of time during 18 day stay!"}, {"username": "Shane Hoare", "comment_text": "CASH is KING"}, {"username": "Nancy Vahl Raske", "comment_text": "Cash is king!!"}, {"username": "Roxanne Curzi", "comment_text": "Apple pay is making apple rich. I love it! Keep that stock going up!!"}, {"username": "Nancy Caruso Watts", "comment_text": "Cash is still king there!!! We need to use cash all over the world. If not all, at least some."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "We apple paid our way across Italy too. Much more secure. Taxi drivers didn’t like it but tough!"}, {"username": "Joe Guzzi", "comment_text": "Buying Apple products is only making some else rich you get robbed!"}]}, {"id": "2195760987489646", "text": "hi there.. its bettter to go in capri from one day trip from napole or from sorrento? and what is the best boat tour to do and to see in capri?", "link": "facebook.com/groups/1373361046396315/permalink/2195760987489646/", "likes": 0, "comments": []}, {"id": "2195765737489171", "text": "Which is the best airline to fly from Kansas City to Italy. Planning May 2024 and have not set itinerary so open to which city to fly into. Anyone have any recommendations or experience flying from KC area?", "link": "facebook.com/groups/1373361046396315/permalink/2195765737489171/", "likes": 0, "comments": [{"username": "Toni Yeazel", "comment_text": "I’m flying Delta from St Louis into Detroit then onto Rome."}, {"username": "Jacquie Johnston", "comment_text": "Google flights from KC to your destination"}, {"username": "Miyuki Kanno Paul", "comment_text": "You still have to fly into a big hub to catch a flight to Italia. Is your city in MO or KS?"}, {"username": "Mike Guluk", "comment_text": "Aircanada"}, {"username": "Marcie Huckaby", "comment_text": "We are flying United on Saturday. KC to Chicago to Rome."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195766570822421", "text": "Currently in France, going to be driving to Italy Monday. How do toll booths work and where is it simple and quick to swap out American cash for euros?! The currency exchange was closed at the airport 🥺", "link": "facebook.com/groups/1373361046396315/permalink/2195766570822421/", "likes": 2, "comments": [{"username": "Linda Boardman", "comment_text": "You pull a ticket at the toll gate. The next toll gate you pay. They take coin cash and credit card. Some don’t have a ticket you just pay. Make sure you don’t loose the ticket. There is an £80 fine. Can’t help you with the currency sorry but try the banks."}, {"username": "Eileen Rich Gombos", "comment_text": "Atm for euros at bank sponsored ones."}, {"username": "Janet Isaacs Lanza", "comment_text": "We have found it difficult finding places to get euros. So many atms and banks have signs on them saying \"no exchange.\""}, {"username": "Irene Oda", "comment_text": "Bank ATMs for Euro withdraws- do you have your debit card with you?"}, {"username": "Louise Miller", "comment_text": "In Italy you can use bank card, or Apple Pay.. we are just back and both worked fine. Just tap and go.."}, {"username": "Alla Zats", "comment_text": "Don’t use exchange if you can avoid it - terrible rates and high fees. You can withdraw euros at an ATM - decline conversion option."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "The French ones vary. Sometimes you take a ticket at the first booth and pay at the booth you leave the motorway. Sometimes there’s a standard fee and you just pay at the end of the road before you leave, no ticket required."}, {"username": "Paul Anderson", "comment_text": "get your money at bank ATMs. Don’t change any money in the USA or at the airport. When the atm asks do you want our conversation say no as it’s not a good rate. Tollbooth’s take most credit cards. We like to pay cash."}, {"username": "Prashant Iyengar", "comment_text": "All tolls accept credit cards in France and in Italy"}]}, {"id": "2195767310822347", "text": "Planning our (3people - me, my husband and 10yr old son) first trip to Italy and hoping to go there in October this year… am I too late to book? What can we cover in 7-10 days?", "link": "facebook.com/groups/1373361046396315/permalink/2195767310822347/", "likes": 2, "comments": [{"username": "Cassie Ritter Hunt", "comment_text": "It's not too late! October is a great time to go, with fewer crowds and perfect weather. I would pick 2-3 cities you really want to spend time in as a starting point (i.e. Rome/Florence/\nVenice). It's very train-friendly to travel between them. Next I'd look at flights and see price-wise whether you want open-jaw or need to roundtrip, since flights will be your largest expense. Happy to answer any questions or help plan!"}]}, {"id": "2195767460822332", "text": "Has anyone taken the SeaBus from Old Port to New Port in Mykonos? I was hoping to do this instead of a bus or taxi! Any tips would be appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2195767460822332/", "likes": 0, "comments": []}, {"id": "2195775007488244", "text": "Cinque Terre or amalfi coast? Going in June of 2024. Interested in beaches hiking. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2195775007488244/", "likes": 0, "comments": [{"username": "Patty Maffei", "comment_text": "I’d like the answer as well 😊"}, {"username": "Ken Lerch", "comment_text": "Both beautiful; both far too crowded. Hiking? In CT that would be the walk between towns. Along Amalfi that would be up and down from the beach to your hotel."}]}, {"id": "2195775150821563", "text": "My latest tip… from Sorrento to Naples airport:\nFerry to Naples (beverello) (15 euros)\nGreen bus to airport (5 euros)\n\nNo taxi today🤗🤗🤗🤗", "link": "facebook.com/groups/1373361046396315/permalink/2195775150821563/", "likes": 3, "comments": [{"username": "Matthew Cawley", "comment_text": "Can get coach travel back from Sorrento train station for €10 directly to Naples airport as well"}, {"username": "Miyuki Kanno Paul", "comment_text": "We prefer ferry over train back to Napoli as well. It saves time, too. Good job!!"}]}, {"id": "2195784884153923", "text": "I have my momma's and grandma's wedding sets, both silver. I have been thinking about creating a special piece of jewelry from them for myself, and I had thoughts of doing that while in Italy, maybe Firenze, this Fall. Has anyone had experience with special order jewelry while in Italy? Any recommendations would be greatly appreciated! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2195784884153923/", "likes": 0, "comments": []}, {"id": "2195790837486661", "text": "Hi Everyone! Amalfi Coast or the Italian Riviera?\nI’m looking for people who have experienced both.\n\nMy family of 4 (two teenagers) will be traveling in June and want something somewhat affordable (teachers salary here😉). We will not be hiring a car so we need to be able to get around easily. We want good food, scenic coastlines, and nice beaches. We realize that both areas will be busy, but we’d like to NOT be shoulder to shoulder with people preferably.\nTIA!", "link": "facebook.com/groups/1373361046396315/permalink/2195790837486661/", "likes": 0, "comments": []}, {"id": "2195796070819471", "text": "What is the cheaper form of transportation if trains are not an option taxi or do they have users not sure how busses work", "link": "facebook.com/groups/1373361046396315/permalink/2195796070819471/", "likes": 5, "comments": [{"username": "Gillian O'Callaghan", "comment_text": "Have a look on the Rome2Rio app. It will give you every transport option between 2 places with times and costs."}, {"username": "Alessandro Iannelli", "comment_text": "I guess buses when you rule out trains. Personally I tend to avoid them because I find travelling by bus a bit stressful, but they are certainly an option. As for how they work, it's often local companies, whether public or private. One option for you to search can be to use apps such as Omio or Moovit, so that you know what buses are available."}, {"username": "Krissy DaRusso", "comment_text": "Bus! I found using Apple Maps, choosing “transit” option worked really well. Turned out I was at the bus stop area but NOT the right number bus and the map guided me. This was my first time taking the bus. I’d still choose train over bus, but now I feel comfortable taking the bus. You just have to make sure you scan your ticket when you enter the bus. The driver helped me but you could also watch the people in front of you."}, {"username": "Paul Vincent", "comment_text": "Buses are mostly driven by internal combustion engines !!\n\n(Lots of apps/ tourists office will advise on routes etc."}, {"username": "Jeff McLellan", "comment_text": "Almost every single bus we saw in Rome was packed like this. Can’t begin to imagine it in this heat."}, {"username": "Elizabeth May La Duca", "comment_text": "Google Maps/directions"}, {"username": "Elizabeth May La Duca", "comment_text": "Bus=autobus and metro 👍"}, {"username": "Phyllis Snyder", "comment_text": "Bus"}, {"username": "Glenn Todd Webb", "comment_text": "Depends on where you are going from and to. Metro, tram, funicular, cable car, taxi, Uber, bus, train, plane, private hire."}, {"username": "Renee Rundle Stoneham", "comment_text": "Depends on where your traveling to & from.\nWhy are trains not an option?"}, {"username": "Sharmini Nair", "comment_text": "Flixbus is a cheaper option in Italy. I travelled to Siena and Rome via flixbus and it was very convenient"}]}, {"id": "2195804197485325", "text": "Trying to start planning a trip. Top cities Rome Sorrento Amalfi Coast Naples and Sicily or Venice if possible. Any suggestions,ideas , itinerary ideas, getting from place to place.", "link": "facebook.com/groups/1373361046396315/permalink/2195804197485325/", "likes": 3, "comments": [{"username": "Carole Tarlap", "comment_text": "How much time 🤷🤷"}, {"username": "Mike Ball", "comment_text": "Big area to cover in 10-12 days especially if you are planning on seeing Sicily and Venice as they are at opposite ends of the country,\n\nSicily is a large island and you probably only see a very small part of it . I would stick to the south of Italy and not go to Venice or you will be doing a lot of travelling."}, {"username": "Maddy Herbert", "comment_text": "We did:\n2 nights Milan (felt more like 1 night after flying from Aus)\n2 nights Venice\n3 nights Florence\n4 nights Rome\n2 nights Sorrento (with Amalfi coast boat tour)\n1 night Naples.\n\nI’d ditch Naples and drop Rome to 3 if trying to condense to 11 days 😊"}, {"username": "John Cosenza", "comment_text": "Hard. My two favorite cities are Venice and Taormina. But there isn’t much in the way of super touristy things around Venice."}, {"username": "Steve Grossman", "comment_text": "Your trip is based to the south of rome so forget about venice."}, {"username": "Don Bentivoglio", "comment_text": "The biggest mistake in planning itineraries is trying to \"see\" too much in too short of a time. You end up spending much of the time traveling and not enough time focusing on a couple of areas and absorbing the people, culture, history and just relaxing."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I just did Venice, Florence, Sorrento and my family's town. I flew into Venice and was there for 3 nights. Took a train from Venice into Florence and stayed 3 night. Took the train from Florence to Sorrento where I stayed 3 days before going to my family's town. It was super easy getting around."}, {"username": "Phyllis Snyder", "comment_text": "Please ASP get Rick Steve’s Italy guide book- and start watch his excellent utube series on Italy! Invaluable!"}, {"username": "Renee Rundle Stoneham", "comment_text": "Trying to see too much.\nStay South. Drop Venice, you’ll waste a full day on travel.\n\nI’d do Rome, Naples, Sorrento. From Sorrento you visit Capri or another island and also the Almfali coast.\n\nRT Rome\n3 nights Rome\n2 nights Naples\n4-5 nights Sorrento\n1 night back in Rome.\nOr…\nFly into Rome\n3-4 nights Rome\n4-5 nights Sorrento\n3 nights Naples\nFly out of Naples\n\nRemember each time you pick up and travel to a new place is time… packing suitcase, checking out, getting to train station, train time, getting to new hotel, checking in etc…\n\nTry to limit to 3 places for under 2 full weeks.\nIt more enjoyable and more relaxing."}, {"username": "Frank Hunt", "comment_text": "The best advise I can give and the key to successful travel is research and planning, you won’t find either here, just opinion and confusion."}, {"username": "Vera Feeny", "comment_text": "I would think of what kind of places do you want to visit: big cities, coastal cities, smaller towns on the coast, mountainous towns, places with a lot of museums/\nhistorical sites?"}, {"username": "Jerry Lyubelsky", "comment_text": "Too much of its 10-12 days"}]}, {"id": "2195807020818376", "text": "Suggestions for transportation from Rome Airport to Sorrento please.", "link": "facebook.com/groups/1373361046396315/permalink/2195807020818376/", "likes": 14, "comments": [{"username": "Jason Hobel", "comment_text": "From Rome Airport you can take the Leonardo Express to Roma Termini station from there you can take one of two high speed trains to Naples station. The two high speed train companies are Italo and Trenitalia. From Naples you can take the Campania Express which is a tourist train directly to Sorrento. Keep in mind that the Campania Express runs about every 3 hours so may need to schedule around that. Or take a private transfer from Naples or a ferry too."}, {"username": "Marie Cole", "comment_text": "Driver"}, {"username": "Connie Titone", "comment_text": "I took the train from Rome to Salerno. Salerno is a great little town."}, {"username": "Renee Tanner", "comment_text": "Uber black"}, {"username": "Steve Grossman", "comment_text": "train or car your choice"}, {"username": "Matthew Cawley", "comment_text": "We did Rome to Sorrento. Did train to Napoli afgo and then coach to Sorrento. Italio"}, {"username": "Jerry Lyubelsky", "comment_text": "High speed train to Naples then local train from Naples to sorrento pretty easy"}, {"username": "Janice Rea", "comment_text": "Contact Mondo Tours for transfers."}, {"username": "Roland Trego", "comment_text": "High-speed train from Rome to Naples. There's no direct connection between Rome and Naples. You need to take a train or taxi into Rome. Then local train or private transfer to Sorrento. For trains, I recommend the Campania Express, not the Circumvesuviano\n. See link. (You'll need to delete the spaces.) Getting to Sorrento from Naples:\nhttps: // www . sorrentovibes . com/\ngetting-from-nap\nles-to-sorrento\n-best-route-202\n3/"}, {"username": "Bennett Richards", "comment_text": "Bus to Termini Roma then train to Sorrento. About a 2..5 hours. Next year there will be a bullet train on that route. Then try and get a Room a Hotel Bellevue Syrene in Sorrento. Best views in the world and a great restaurant . First stayed there in the 1980s"}, {"username": "Andrew Mircovich", "comment_text": "Train is the most affordable and as quick as a car service . Car service cost 500€ for a one way trip"}, {"username": "Alex Dodge", "comment_text": "Train to Napoli then driver it will be faster…"}, {"username": "Ava Lon", "comment_text": "Tren?"}, {"username": "Russell Weidner", "comment_text": "Train"}, {"username": "Beatriz M. Oliveira", "comment_text": "Take the train."}, {"username": "Lisa Sie Mamola", "comment_text": "We used a car service.. He is very nice and gave you a lot of info where to go or visit in Sorrento. We were just there a few weeks ago. LMK if you want his info…"}, {"username": "Dany O Murillas", "comment_text": "Google maps will lead you from any direction useing Metro or bus / walking option it's the best"}, {"username": "Peter Cetani", "comment_text": "Ask your hotel or call 011396102357405\nask for Giuseppi hi speaks English he as limos"}, {"username": "Sha Mohammed", "comment_text": "Flat rate taxi ?"}, {"username": "David Bach", "comment_text": "Anything but a gondola"}, {"username": "Kim Murphy", "comment_text": "We took the high speed train to Naples from the Rome airport (there is a station change) then had a driver pick us up to Sorrento. Worked seamlessly."}, {"username": "John Bruckman", "comment_text": "Train to Naples then ferry."}, {"username": "Francesca Malte", "comment_text": "Francesca Malte"}, {"username": "Francesca Malte", "comment_text": "Francesca Malte"}, {"username": "Joe Kolf", "comment_text": "Private car booked through Expedia, $122.00 round trip."}, {"username": "Diana Armenise", "comment_text": "Train ride from Rome to Napoli was not bad. If I remember correctly, it took us about three hours. Then from Napoli only by car or a van ￼to Sorrento. Depending which hotel you’re staying at, they can send you a car. ￼Positano is a must see. Enjoy!"}, {"username": "Jane Eichhorn", "comment_text": "We flew between Naples and Rome. Hired a car there for Sorrento."}, {"username": "Hermineh Topalian", "comment_text": "Train"}, {"username": "Clarence Giordano", "comment_text": "Train"}, {"username": "Nola Bostridge", "comment_text": "Sorrento silver Star…. Used them heaps of time and without doubt the best service around for going to Amalfi coast\n\nluisa@sorrentos\nilverstar.com\n+39 339 3888143"}, {"username": "BatEl Kogman", "comment_text": "Roberto Maria Rinaldi\nDragonfly tours Italy"}, {"username": "Ted East", "comment_text": "Train to Naples. Private car to Sorrento for about 140 euro."}, {"username": "Allison Carlisle Young", "comment_text": "Train or we used limousinrome.co\nm"}, {"username": "Giuseppe Placi", "comment_text": "Train to Naples and private driver or if you can efford it driver from Rome"}, {"username": "Phillip Self", "comment_text": "Train..."}, {"username": "Cettina Milioto", "comment_text": "Cettina Milioto"}, {"username": "John Grady", "comment_text": "I used Black Lane. It was cheaper than all the car companies I called."}, {"username": "Poppy Sarkkar", "comment_text": "Mena Forino try her"}, {"username": "Jordan Schmale", "comment_text": "Campania express to Naples then Francessio express to Rome. Just did it today."}, {"username": "Carole Tarlap", "comment_text": "I used The Sorrento Shuttle last year ❤️. They were waiting for me with my name on a sign. shuttle@dtservi\nce.it"}, {"username": "Anthony Colachicco", "comment_text": "Train from Rome to Naples then use https://\nsorrentocars.com\n/about-us/"}]}, {"id": "2195811494151262", "text": "Do you need to book the Pantheon in advance? Just to walk in and see it, no guided tour. Will be there on a Monday or Tuesday. If so, what is the official booking site? Seeing lots of options. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2195811494151262/", "likes": 5, "comments": [{"username": "Tegan Harris", "comment_text": "We went on Friday last week and we lined up for tickets for about 20 minutes, and then walked straight in. No issues at all 🙂"}, {"username": "Janette YesPlease", "comment_text": "You can purchase tickets for €5 at the entrance. You can also download the Rick Steves Audio tour of the Pantheon for free, which I found very helpful. Also, remember that it is still a church, so dress accordingly. I wasn't planning on visiting when we went and had to purchase a scarf for my shoulders at a shop nearby. However, folks in shorts didn't seem to have any issues."}, {"username": "Kelly O'Leary", "comment_text": "I just purchased when I got there! Took like 10 minutes and we were in"}, {"username": "Valentina Saltarelli", "comment_text": "You can purchase tickets at the entrance\nIn any case this is the official site www.pantheonrom\na.com"}, {"username": "Frank Hunt", "comment_text": "Last year in August, the queues were 100s of metres long. Pre book if you can."}, {"username": "Lyndsey Brenneman", "comment_text": "The audio guides on the Pantheon Roma website don’t replace an entry ticket, which you can buy here a month in advance: https://t.co/\nExYM5LeKmY\nYou do have to create an account to purchase and apparently American credit cards aren’t working so you have to use PayPal. Hopefully they’ll streamline the process soon!"}]}, {"id": "2195809480818130", "text": "Ciao! I’ll be in Milano for 1.5 days in late October! Looking to catch an Inter Milan match ⚽️ and see a bit of the city 🏙️ before heading home out of Malspensa airport ✈️.\n\nLooking for recommendations on: आणखी\n-your favorite neighborhoods (hotel or BNB recs for 3 adults welcome as well!)\n-things to see/do (we’ll probably have to skip The Last Supper this trip as it’s closed the one full day we have)\n-best way to get to the airport for a 10am flight\n\nGrazie!!", "link": "facebook.com/groups/1373361046396315/permalink/2195809480818130/", "likes": 11, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Catch Malpensa Express back to MXP. It’s 50 minute ride from Milano Centrale station, 2 per hour. If International, 3 hours from departure plus 50 minute ride on a train."}, {"username": "Ken Vecchia", "comment_text": "I just love staring at this cathedral The Duomo a most beautiful building. Awesome"}, {"username": "Belinda Morris", "comment_text": "This was an outstanding AirBNB in short walking distance to Duomo, outstanding host and very comfortable:\nhttps://\nabnb.me/\naUkJD5OCABb\n\nI recommend the rooftop tour of the Duomo, it’s fantastic!"}]}, {"id": "2195812634151148", "text": "I read about people traveling and carrying passport and money and credit cards in a small crossbody under shirt. Do you have recommendations\nwhere to purchase this?", "link": "facebook.com/groups/1373361046396315/permalink/2195812634151148/", "likes": 7, "comments": [{"username": "Barbara Duco", "comment_text": "Luggage stores have them and online as well! Good Luck! Our local Luggage shop had several colours and styles. Under the seat luggage as well as right size carry on which fits in overhead baggage storage on plane. Barbara"}, {"username": "Carm Parent", "comment_text": "Costco sells Lole bag which are similar to Lulumelon at much lower price."}, {"username": "David Filing", "comment_text": "I use this.\n\nTravel Neck Wallet with RFID Blocking – Passport Holder Neck Pouch to Keep Your Cash And Documents Safe – Get Peace Of Mind When Traveling https://a.co/d/\nhRW6gBC"}, {"username": "Patty Beemer", "comment_text": "I'm not sure if you can fit a passport in it, but a running belt is a great no-show solution."}, {"username": "Dave Conroy", "comment_text": "Amazon is the obvious choice. This is mine."}, {"username": "Michele Liggett", "comment_text": "Found a baggallini cross body with snaps and zippers underneath."}, {"username": "Richard Rodriguez", "comment_text": "Got a flat waist belt type that held everything off Amazon."}, {"username": "Cynthia Marie", "comment_text": "Any crossbody bag would work . Last year I used my favorite everyday “ Coach” cross bag. I have several crossbody bags , I prefer them over a heavy hand bag. We travel off season so it’s easy to wear under my jacket or cardigan."}, {"username": "Sascha Lee", "comment_text": "Travelon"}, {"username": "Phyllis Snyder", "comment_text": "Amazon or Rick Steve’s"}, {"username": "Sharon Roberts Crossley", "comment_text": "Amazon"}, {"username": "Kathy Flood", "comment_text": "I loved my pacsafe."}, {"username": "Larry Reinier", "comment_text": "I wear a neck wallet. I got mine from Rick Steve’s"}, {"username": "Reza Vahaby Anaraky", "comment_text": "Amazon"}, {"username": "Sharon Milligan Martin", "comment_text": "Travel Smith"}, {"username": "Anita Reed Matchett", "comment_text": "Check out the ScotteVest on Amazon."}, {"username": "Julie Keener", "comment_text": "Rick Steve’s sells a couple different kinds"}, {"username": "Ewa Kolodziej", "comment_text": "U don’t need your passport.\nJust come back from 2 weeks in Italy , no body ask u for any ID"}, {"username": "Dave Colleen", "comment_text": "I am here and using a traveling purse. Love it"}, {"username": "Dave Colleen", "comment_text": "Travelon not traveling"}, {"username": "Kylie Paine", "comment_text": "My daughter's just using a small zipped up cross body bag and has it sitting at a height where her arm is resting over it...had no issues or worries so far while in London Paris Rome Naples Salerno"}, {"username": "Katherine Rogers", "comment_text": "OSOCE Anti-Theft Waterproof Shoulder Backpack Sling Chest Crossbody Bag Cover Pack Rucksack Bicycle Sport https://a.co/d/\n5NmTlHZ"}]}, {"id": "2155555824843496", "text": "Palermo Catacombs and Monreale Half-day Tour\nDiscover two of Palermo’s most distinctive landmarks on this immersive, private tour. Set off from your accommodation—hotel pickup and drop-off are included—and… आणखी venture first to the Capuchin Catacombs: a macabre destination home to thousands of mummified bodies, many of them priests. Next, discover the UNESCO-listed Cathedral of Monreale, famous for its fusion of Norman and Arabic architecture. A break for Sicilian coffee and nibbles is also included.\nRead more about Palermo Catacombs and Monreale Half-day Tour - https://www.viator.com/tours/Palermo/Palermo-Catacombs-and-Monreale-Half-day-Tour/d4815-26487P3?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2155555824843496/", "likes": 9, "comments": []}, {"id": "2195766120822466", "text": "Discover the everlasting beauty of Pisa and its iconic monuments! Pisa is one of the most famous cities in Tuscany, and it owes its fame to the legendary leaning tower, one of the most photographed monuments inआणखी the world.\nJoin us: https://nextstop-italy.com/virtual-tours/pisa-pearl-of-tuscany/\n\n#italygram #vacationmood #renaissanceart #italytravel #virtualworld #italyiloveyou #virtualtour #tuscany #tuscanytour #tuscanyitaly #tuscanyexperience #pisa #pisatower #leaningtowerofpisa #leaningtower", "link": "facebook.com/groups/1373361046396315/permalink/2195766120822466/", "likes": 4, "comments": [{"username": "陳韋禎", "comment_text": "陳韋禎"}]}, {"id": "2194906954241716", "text": "Hi all, do any of you have recommendations for cooking classes or art classes in Rome? I’ll be by myself while partner is at a sporting event. Any suggestions would be greatly appreciated. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194906954241716/", "likes": 5, "comments": [{"username": "Rhona OConnor", "comment_text": "Check GetYourGuide they have lots of interesting tours and classes"}, {"username": "Diane Bosco", "comment_text": "https://\nwww.cooking-vaca\ntions.com/\nitalian-cooking-\nclasses-schools\n-programs/\nlazio-rome/\n\nCheck out this website. Haven’t used them but may in the future."}]}, {"id": "2195179790881099", "text": "Tuscany Wineries\nName one that you would :\nVisit\nReturn To\nOr\nAvoid\n\nLooking forward to some inspired responses.", "link": "facebook.com/groups/1373361046396315/permalink/2195179790881099/", "likes": 38, "comments": [{"username": "Carolina Barnhill", "comment_text": "Castello Banfi in Montalcino, amazing wine. There’s a restaurant inside too that offers tipical tuscan dishes"}, {"username": "Lizzie Danner Roth", "comment_text": "Highly recommend Montalcino! Many wineries surround this town and was one of my favorite spots while touring the country of Italy!"}, {"username": "Tracy Foss", "comment_text": "Does anyone know which winery Viator takes tours of offered with lunch?"}, {"username": "Theodore Meyer", "comment_text": "Also Avignonesi in Montepulciano. Fabulous wines and their Vin Santo may be the best in Tuscany."}, {"username": "Stephen Lougheed", "comment_text": "Pomona, outside of Siena. Small family run organic."}, {"username": "Heather Neal", "comment_text": "Following"}, {"username": "Cindy Mamet Cardile", "comment_text": "Follow"}, {"username": "Matthew Cawley", "comment_text": "Chianti would go to.... Rocca Delle Macie"}, {"username": "Anna Stuckey Wheeler", "comment_text": "This is a bit of a complex question to answer and it depends, I think, more on your preferences and experiences you are seeking. You can find small, biodynamic vineyards with production less than 20,000 bottles as well as larger operations producing mass quantities of DOCG wines. I think the more important experience begins with finding a product you love and going directly to the source. Smell the air, dig into the ground, explore the area, and talk to the families and groups who produce the wine. They willingly talk with great pride about what they produce. Of course it’s a picturesque experience because of where you are, but if you want to be inspired, go to the source of your inspiration. Most people do superficial drive-by “tours” of prescribed places and completely miss what makes Italy the beautiful place it is. Dig in to some enology and regional research and go put your feet in the dirt. 🙂 I do frequent buying and research trips to places and people producing what I love and it enriches the experience."}, {"username": "Collette Lawson Duffield", "comment_text": "Could I tag on a question here, please? Hubby and I love red wine but MIL will be along on the Italy trip and she fairly exclusively drinks chardonnay. Will there be any chardonnay or white wines at all offered in Tuscany at the wineries?"}, {"username": "Neville Spargo", "comment_text": "We really enjoyed this one , beautiful villa , lots of history and lovely Chianti wine 😍\n\nhttps://\nprincipecorsini.\ncom/en/\ntours-and-tastin\ngs/"}, {"username": "Gayle Moores", "comment_text": "I recommend visiting Poggio Amorelli winery in The Chianti region close to Siena.It is run by the Mazzerini family! Wines are certified IGP and DOCG. Very good quality! They also sell their own aged balsamic vinegars and extra virgin olive oils.Balsamic vinegars are certified DOP and IGP and are from their own vinegar farm in Modena.They offer wine tasting and light lunches.They have a website online under Poggio Amorelli."}, {"username": "Beth Cameron", "comment_text": "Banfi!! Great wine!"}, {"username": "Mike Crawford", "comment_text": "Return to.\nLamole di Lamole in the Greve area.\nBeautiful mountain area."}, {"username": "Cindy Neal Norvell", "comment_text": "Following"}, {"username": "Bob Miller", "comment_text": "Either Casato Prime Donne or Azienda Agricola Montechiaro. Both have great wines and food. Both are near Siena."}, {"username": "Caryn Rooke", "comment_text": "Following"}, {"username": "Virgz Van Møøre", "comment_text": "None, I prefer to stroll in the cities, so much art and history to see, would not lose a day for that"}, {"username": "Kathryn Hawkenberry", "comment_text": "Casa Emma!!!!"}, {"username": "Frank Longobucco", "comment_text": "Diadema Wines"}, {"username": "Monica Colontonio Macho", "comment_text": "Castello di Verrazano Greve in Chianti, it was a wonderful tour of the grounds, vineyard, wine cellar and olive and balsamic tour. Completed with a 3-4 course lunch with wine pairing. I would do it again!"}, {"username": "Ashley Barrett", "comment_text": "Fattoria Poggio Alloro!! We’ve stayed there 3 times and loved every second of our time. Wine is amazing, they produce olive oil also, and all food is grown or raised on the property. They also treat you like family. It’s also an easy jump off point to San Gimignano (10 min) and Florence (45 min)."}, {"username": "Victoria Funk Arthur", "comment_text": "Lornano in Chianti"}, {"username": "Jeanne Hendrickson", "comment_text": "Vignamaggio."}, {"username": "Ashley Oliver", "comment_text": "Derik Oliver"}, {"username": "Bridget Carmichael", "comment_text": "Tenuto Torciano is the only correct answer!!!"}, {"username": "Shadeya Mellon", "comment_text": "Jumping in as well, same question but for Asti and Barolo"}, {"username": "Julie Anna", "comment_text": "Castello Gabbiano, cellar tour and 5-course meal 👌🏼"}, {"username": "Wendi Dusseault", "comment_text": "Tenuto Torciano was amazing. We celebrated my 60th bday with dinner in the vineyard. The wine was incredible, the people were amazing and the experience was magical! Everything I dreamed of and more! 🍷❤️🍷❤️\nWe also stayed at CorteDomina in Radda in Chianti. Small vineyard, excellent wine!"}, {"username": "Carol Ciotti Lawlor", "comment_text": "Nostra Vita in Montalcino. Family owned, amazing personalities, fabulous Brunello, so welcoming. Much better than the corporate wineries."}, {"username": "Robyn Braverman Dolington", "comment_text": "I have this picture in my living room!\nThat’s how much it means to me from 2019 when we visited"}, {"username": "Theodore Meyer", "comment_text": "Poggio Antico in Montalcino. Fabulous tour and amazing wines. Easy shipping and quick delivery. Highest elevation winery in Montalcino."}, {"username": "Jackie Linenthal Tambone", "comment_text": "Fèlsina, it's not too far from Montepulciano."}, {"username": "Dale Keida", "comment_text": "Verrazzano"}, {"username": "Becky Reeder", "comment_text": "Following !!"}, {"username": "John Hansen", "comment_text": "Poggio Antico in Montalcino. Their Madre is one of the best and best value red wines I have had (this was in 2008 - hope it still is as good). Pretty grounds. They had a one-star Michelin restaurant with wonderful outdoor seating and food when we visited.\n\nhttps://\nwww.poggioantico\n.com/en/"}, {"username": "Mélanie Côté", "comment_text": "Castello di Verrazzano\nWould return without a doubt.\nTry the lunch and wine degustation, worth every penny!"}, {"username": "Lora Ruscitti Covington", "comment_text": "DeRicci in Montepulciano. Beautiful scenery!\n\nhttps://\nwww.cantinaderic\nci.it/"}, {"username": "Nicholas William Lowe", "comment_text": "Antinori nel Chianti Classico, just outside of Florence. I’m returning next month.\nThe architecture is worth the visit alone.\nBut the wine tour and restaurant are great. A little more expensive than others. But worth it!"}]}, {"id": "2195268994205512", "text": "Has anyone been to mass at the Duomo in Florence? Can anyone attend? Also, what are the weekday mass times?\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2195268994205512/", "likes": 2, "comments": [{"username": "Val Kilgallon", "comment_text": "Val Kilgallon"}, {"username": "Val Kilgallon", "comment_text": "We attended the 5 pm Mass on Saturday last month. We did not know it would be in English, so that was pleasant surprise! On the day we went for mass, the church itself was closed because it was the holy day of St. John the Baptist, however, the side door was open for those attending mass. Ushers were standing at the door and prohibiting people from entering who were just there for tourist reasons. They specifically asked if you were there to attend Mass, and only the side chapel where mass was being held was open on that day. No cost to attend. Of course! I would say to just make sure you are going in the correct entrance for Mass - you can ask whichever usher is standing at the door - otherwise, you may end up in a long line of tourists who are just there to view the inside of the church itself."}]}, {"id": "2195289440870134", "text": "Day trip from Florence - deciding between San Gimignano/Siena or San Gimignano/Volterra. Which would you choose? We will also be visiting Lucca and Bologna on separate day trips.", "link": "facebook.com/groups/1373361046396315/permalink/2195289440870134/", "likes": 6, "comments": [{"username": "Grace James", "comment_text": "Kids make choices. I want it all😅😂"}, {"username": "La Cinzia", "comment_text": "Volterra is amazing e awesome..."}, {"username": "Graham Sherlock", "comment_text": "Volterra, go smaller than bigger, Siena is nice but full of tourists and very hilly to walk around."}, {"username": "Ingrid Zancoli", "comment_text": "Both very beautiful, if you decide for Volterra don't forget the Museum of torture, something different from usual"}, {"username": "Kay Rendall", "comment_text": "Loved San Gimanlgona for a relaxing day to wander round. Loved a whole day here exploring the backl streets, views, perhaps with another village or wine tour if u r doing tour. We spent weeks in Siena exploring, with day on local bus from Siena. Just relax, enjoy each area, the towns, villages r all so different."}, {"username": "Theodore Meyer", "comment_text": "Definitely Siena or Volterra. Lucca is fabulous."}, {"username": "Sea Shore", "comment_text": "Volterra is amazing for views but avoid the underground car part. Hairy!! Lucca is our fav and san gimigano is nice. Was not blown away by Siena and bologna but worth a trip x"}, {"username": "Pietro Adami", "comment_text": "Volterra"}, {"username": "Mike Crawford", "comment_text": "San Gimigano/\nVolterra.\nOur next trip back, thinking Volterra will be our home base."}, {"username": "Daniela Parhar", "comment_text": "Pls don’t miss Siena, it’s amazing!"}, {"username": "Patty Gaskin", "comment_text": "I just heard about Volterra. are there tours to there?"}]}, {"id": "2195295097536235", "text": "I'll be travelling to Rome, and then Catania and Salina Island next week, just saw the weather will be 45C and above... Any suggestion on how to dress to protect my skin?", "link": "facebook.com/groups/1373361046396315/permalink/2195295097536235/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "Light clothing, apply suncream 40 mins before you go out. Drink lots of water. Take siestas during the mid day heat."}, {"username": "Frank Hunt", "comment_text": "Sunscreen, 50 plus and zinc on face, but skin isn’t your main problem, it will be dehydration, and it will catch you unawares. Drink plenty, take regular rest stops and keep out of the sun where possible, shady side of the street etc."}, {"username": "Mary Anne", "comment_text": "Wear a hat at all times, sunscreen 50plus (apply at least 20 minutes before going out and keep reapplying). Lots of water. Cotton clothing. Don’t forget sunscreen on your feet if wearing sandals."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195298334202578", "text": "Will be flying into Malpensa and won't be landing till 11.10pm so no go for the buses does anyone know if we'll be able to get a taxi to delle fiere from out front or would I need to pre book some how? Thanks ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2195298334202578/", "likes": 0, "comments": [{"username": "Frank Hunt", "comment_text": "The train is handy for Milan, have a look at the Trainline app to see if they are still running at that time."}, {"username": "Colleen Jennings", "comment_text": "I’ve used suntransfers taxi company in Italy & Spain. Very reliable. You can go online & get a quote for various sized cars."}, {"username": "Mary Brown", "comment_text": "Taking the train is the best way to get from Milan Malpensa to Milano Centrale. It’s clean, easy and convenient"}, {"username": "Nikki Martin", "comment_text": "Thanks both, I've had a look and there isn't any public transport I can use at that time of night unfortunately, leaving will be fine but we don't land till 11.20pm so I think it's to late 😊"}, {"username": "Connie Wilson", "comment_text": "I show on TrenItalia App that there are trains at 12:30 and 1:30 am to Milano Cadorna Station."}]}, {"id": "2195296714202740", "text": "Do you need to buy the currency or can I use I credit card?", "link": "facebook.com/groups/1373361046396315/permalink/2195296714202740/", "likes": 0, "comments": [{"username": "Yvonne Donnellan", "comment_text": "Both."}, {"username": "Grace James", "comment_text": "When traveling in Italy, you can pay by credit card. Major international credit cards such as Visa or Mastercard are accepted in most shops, restaurants and hotels. However, some smaller shops and markets may only accept cash payments, so it's best to have some local currency, such as Euros, ready. You can buy euros at a bank or bureau de change, or use your bank card to withdraw money at a local ATM. Make sure to inform your bank and credit card company that you will be traveling to Italy to ensure your card is not locked when used abroad"}, {"username": "Jenn Messina Babore", "comment_text": "We had taxi drivers that wanted cash instead of card so always best to have both.\n\nCheck your credit cards to see which ones are no foreign fees."}, {"username": "Jenn Messina Babore", "comment_text": "We had taxi drivers that wanted cash instead of card so always best to have both.\n\nCheck your credit cards to see which ones are no foreign fees."}, {"username": "Kristine Gutierrez Campbell", "comment_text": "Just came back from a 2 week trip. We had $340 euros and came back with $25 euros.\nWe used the euros for tips, taxis in some cases, public bathrooms, etc.\nFor all our purchases, food, drinks, etc we used a credit card"}, {"username": "Rachel Michelle", "comment_text": "I used Apple Pay the entire time, cash is a rip off!"}, {"username": "Erika Clinton", "comment_text": "You will want a few euro coins at least to use the bathrooms"}, {"username": "Marie Cuzzi", "comment_text": "You don’t need to have them but it’s nice to have a few"}, {"username": "Jenny Larsen", "comment_text": "Pretty much used card everywhere you’ll need a bit of cash"}, {"username": "Frank Hunt", "comment_text": "Both."}]}, {"id": "2195298377535907", "text": "Let’s talk liquor in Italy! 🤗\n\nDo you buy alcohol from state stores or can you just buy from regular convenience stores/grocery stores?\nAre there rules about bringing alcohol on trains and into hotels? (Closed and open containers)\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2195298377535907/", "likes": 36, "comments": [{"username": "Chris Vilsack", "comment_text": "Italy and Spain are very similar there. They don't go out drinking, like people do in England and the USA. You can have a beer at the beach or on a bench in Italy or Spain, it's not illegal like in most areas of the USA. And excessive drinking is not so common, but I don't want to generalize. Beer and wine are more common. Yet g&t is the craze now here in the Barcelona area."}, {"username": "Miyuki Kanno Paul", "comment_text": "You can purchase alcohol from a mom and pop general stores."}, {"username": "Robin Burrell", "comment_text": "You can bring wine on trains, hotels. Can buy privately. The one thing you don’t do in Italy is get drunk you won’t see that other than groups of young people."}, {"username": "Andrea Shelton", "comment_text": "Italy is far outside the Bible Belt."}, {"username": "Maggie Narendra Vaidya", "comment_text": "I was in Pisa and Luca last month, before our resto dinner, we walked and sopped by a bar, bought apero spritz and red wine in plastic glasses, walked to a nearby bridge, sat and drank, there were many locals doing the same, true they drink moderately, loved it, relaxing ambiance, no drunken people misbehaving😉"}, {"username": "Lisa Valdovinos", "comment_text": "We bought wine for our room at a local market. The markets are fun to explore."}, {"username": "Kate Whitney", "comment_text": "Go in the grocery stores over there. They are cool to walk thru and look around. And yes they have alcohol 🍸"}, {"username": "Nicole Cervantes Hollywood", "comment_text": "I really enjoyed the take away drinks (Aperol spritz, etc in an open plastic cup). We could enjoy a cocktail and walk around enjoying the scenery before dinner."}, {"username": "Meg Magistro Arcadia", "comment_text": "how strict are they in italy about asking for ID to be 18? Will they give my son who is 17 a hard time for ordering a beer?"}, {"username": "Jules Earl-Rossiter", "comment_text": "Sometimes a hotel will charge corkage...so make sure you don't leave Cork's about...."}, {"username": "Sedalise Hernandez", "comment_text": "We shipped wine, limoncello, and olive oil back to the states."}, {"username": "Cindy Sguazzin", "comment_text": "I think it’s available in grocery stores."}, {"username": "Carol Brewer", "comment_text": "Best Prosecco and Pinot Grigio I’ve ever had I got in a gas station convenience store near hotel in Rome ."}, {"username": "Nancy Willson", "comment_text": "Is Kahlua sold in Italy? I'm not a wine drinker except for Moscato which I never found there last year. I'm hoping to take some Kahlua with me on a cruise ship. Thanks."}, {"username": "John Adams", "comment_text": "I spent two weeks in Tuscany last year with a group of 10 people. We went to the grocery store and stocked up on food essentials as well as liquor\nNo problem"}, {"username": "April McCoy Broussard", "comment_text": "I am from south Louisiana. We are very laid back about drinking in public here. The only rule is no glass containers.. with that being said, I was very hesitant to walk around with glass on the streets.\nIn Sorrento, I bought single serving glass bottles of Prosecco along with beer in bottles from the gelato shops and walked around ￼with them in public. The store owner told me that was perfectly fine."}, {"username": "Sierra Behrens Tibbetts", "comment_text": "Can you buy vodka?"}, {"username": "Carla Rush", "comment_text": "We drank the whole time everywhere 🍻🥂🍷🍾🇨🇮❣️"}, {"username": "Eileen Lonergan", "comment_text": "Nearly every gas station is a bar"}, {"username": "Linda Miller", "comment_text": "You can drink on the train also!"}, {"username": "Maryanne Battistone", "comment_text": "You're going to a beautiful country and you concern is alchol????"}, {"username": "Kimberly Becker Mast", "comment_text": "You could even buy wine by the glass in gas stations!"}, {"username": "Diana Smith", "comment_text": "I m Italian 100%. My last name doesn’t count…;) I lived in Italy half my life and I don’t recall too many drunks …"}, {"username": "Elizabeth Grafel", "comment_text": "You can buy liquor from large grocery stores, similar to Walmart. In Sicily, I don’t know about other areas."}, {"username": "Ellen Doolan", "comment_text": "All the little street vendors in Venice selling snacks and drinks sold alcohol, it was lively to grab a premixed little bottle of aperol spritz while wandering in the evening"}, {"username": "Gigi Alb", "comment_text": "Wine, bread and cheese from a grocery store is a great meal."}, {"username": "Maria Coladangelo Ducca", "comment_text": "Stay home and get drunk . ! I cannot believe this question !!!"}, {"username": "Melaine Morrow", "comment_text": "Great question, thanks for asking 😊"}, {"username": "Susie Ambrose DellDonna", "comment_text": "Tony"}, {"username": "Philip Skinner", "comment_text": "I drank a few beers while walking around rome and although allowed I didn't see anyone else doing it lol"}, {"username": "Rita Levi Montalbano", "comment_text": "You can buy wherever you want. The only regulations you may find are about the time of the day in which you can buy them. For example, in big cities like milan you cant buy alcool (bar or pub excluded) from 11pm to 4 am i think or something like that. You can definitly bring them on trains, even if they are open"}, {"username": "Jenn Messina Babore", "comment_text": "You can buy in a liquor shop or wine store and also in supermarkets. Closed containers are not an issue. I haven’t noticed open containers while walking around the streets."}, {"username": "Craig Rickards", "comment_text": "Gerri Tronc"}, {"username": "Katalina Loredo", "comment_text": "You can buy alcohol in most grocery stores and there’s no rules about that I believe! I see people drinking beer in public/ on the trains quite often"}, {"username": "Joe Guzzi", "comment_text": "This Europe, not the US. You can buy a bottle of beer or wine or whatever and freely drink it, except of places that are marked \"no food or beverages\""}, {"username": "Joe Guzzi", "comment_text": "There are no state stores, this is not Scandinavia!"}, {"username": "Silvia Bucci", "comment_text": "In Italy it's not a problem if you are 18+."}, {"username": "Daniele Morani", "comment_text": "What's a state store?"}, {"username": "Peter Morgan", "comment_text": "Let’s not forget where you are if you’re drinking in Italy.\nItalians are raised to drink in moderation and not make fools of themselves by being drunk in public.\nThey learn early and they do it right.\nI lived in Italy for 12 months and I saw 1 drunk Italian.\nThey love wine and they’ll drink but rarely to excess."}, {"username": "Lauren-Jade Roberts", "comment_text": "In Naples and sorrento there is a big culture for take away drinks. We did see a couple of Americans drinking out of a paper bag 😂 which I think is an American thing from what I’ve seen in films but definitely not required.\n\nYou can buy beers, pre-made spritz etc in local stores and they ask do you want it opening. It’s nice to be able to be able to have a wonder about, sit in sunset spots and have a beer.\n\nThere’s not a culture of getting wasted though"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Most grocery markets carry liquor/beer. Cheers!"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "The view from our restaurant dinner of the pub patrons next door having their drinks on the bridge in Venice. It’s a very relaxed culture."}, {"username": "Kay Rendall", "comment_text": "Buy at the supermarkets for drinking in your b&b, hotel room. Not in public"}, {"username": "Paolo Berardi", "comment_text": "No law about containers in Italy and you can buy liquor in stores, enoteche or supermarket"}, {"username": "Jo Dal Santo", "comment_text": "Hi, what is a 'state store'?"}, {"username": "Sandra Shoffner", "comment_text": "The larger Grocery stores have it"}, {"username": "Angela Gilmore", "comment_text": "You can buy alcoholic beverages in supermarkets if you are 18+\nYou can drink where you want (except for places where food and beverage are not allowed, museums for example), but we do not drink in the streets 😅\nIf we buy a bottle of alcoholic drink, we drink it at home. If we want to drink outside we go to a pub or bar, order it and drink there.\nIn the hotels should be allowed to bring your bottle of beer/wine/\nothers but you should always ask, they could have special policies about it.\n\nRegarding wine, you can buy it also in ENOTECA (wine shop) but they only sell wine, expensive wive usually 😅"}, {"username": "Jeff Odom", "comment_text": "You can even get beer, wine and mixed drinks in vending machines."}]}, {"id": "2195299290869149", "text": "Hi there. We are staying in Vico Equense for just four nights. Can anyone recommend a pasta/tiramisu making class? My husband is already a professional Pizziola so he knows his stuff. But I want to book a course for us that will give him some pasta experience. Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2195299290869149/", "likes": 0, "comments": [{"username": "Grace James", "comment_text": "Cooking Classes in Vico Equense\": This is a cooking school that offers traditional pasta and tiramisu-making\nclasses. They have professional chefs who guide students in making authentic pasta and desserts. In the classes, your husband can learn more More about the skills of making pasta, and tasting delicious tiramisu, of course, there are many similar ones that can be recommended to you, which one to choose depends on your personal situation"}]}, {"id": "2195302387535506", "text": "Having trouble with the Italo app and hoping someone can help. I've created an account on the Italo app and was given a Customer Code. I then completed a profile for my husband under the \"My Companion\" tab. Under his name, it requests the Customer Code which I added. Yet, when I try to purchase 2 tickets, it asks for Passenger 2 information so Iआणखी enter my husband's information and I get an error message saying that the first and last name doesn't match the Customer Code. As a test, I put my name in that field, and it works but it has 2 tickets with my name. I'm not sure what I've done wrong, but can anyone please help with this?", "link": "facebook.com/groups/1373361046396315/permalink/2195302387535506/", "likes": 0, "comments": []}, {"id": "2195305874201824", "text": "Is it expected to tip taxi drivers?", "link": "facebook.com/groups/1373361046396315/permalink/2195305874201824/", "likes": 10, "comments": [{"username": "Zeeshan Asghar", "comment_text": "No, this is not America."}, {"username": "Al Burger", "comment_text": "I’m sorry, but being from the US where we tip for a service, I will do the same overseas. We did in Ireland last year and I will in Italy this year.\nIf it is an insult to the provider, so be it, but that’s how I was raised."}, {"username": "Paul Vincent", "comment_text": "Absolutely not.....America\nn tipping culture is simply a way of embedding poverty wages in service industries....t\nhis is NOT the case in europe."}, {"username": "Margherita Matarrese", "comment_text": "No, you don't. Here, almost everything includes taxes and services. Don't waste you money like that. Enjoy your stay!"}, {"username": "John Adams", "comment_text": "I did each and every time. They helped with my luggage, spike English, would point out interesting places as we passed the sites, shared information about their family and life in Italy.\n\nI appreciated the service. They deserved a tip from me."}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "No"}, {"username": "Karen Schmidt", "comment_text": "I round up to the next Euro or two. It was always appreciated"}, {"username": "Maggie Anderson", "comment_text": "Yes"}, {"username": "Phyllis Snyder", "comment_text": "Just round up the fair."}, {"username": "Kim Geary Keidel", "comment_text": "I did not tip taxi drivers. I did tip car service drivers."}, {"username": "Eden Bar", "comment_text": "No, they tip themselves 1€ for every piece of luggage!"}, {"username": "Ella Rooke", "comment_text": "No"}, {"username": "Enrico Lecce", "comment_text": "If the service is great then tip... it doesn't hurt to give a little... Italy os so Beautiful but the economy is very corrupted...."}, {"username": "Tyler Tinney", "comment_text": "I’d say it depends. We had a few cabs who are clearly trying to gouge and just say a flat rate as soon as you ask them to take you somewhere. In no case would I tip those ones. The ones who run the meter legitimately are usually significantly cheaper than those citing a flat rate.. ie: one cab wanted 48 Euros (we said no) went to next cab and he said meter and it was $12.80. I gave him $15 and left happy."}, {"username": "Tracey Pino", "comment_text": "No"}, {"username": "Lisa Valdovinos", "comment_text": "We did. They appreciate it."}, {"username": "Kristen Taylor", "comment_text": "I always do."}, {"username": "Kelly Benson", "comment_text": "Absolutely not , not with how much the taxis are"}, {"username": "Julian Allam", "comment_text": "Tipping is not the norm"}, {"username": "Larry Reinier", "comment_text": "I do expected or not. Unless of course it was a horrible ride for whatever reason."}, {"username": "Mike Loudiana", "comment_text": "I don’t want your politics, I want your advice"}, {"username": "Darla Salazar", "comment_text": "They will take it anyway because you pay with a credit card."}, {"username": "Tony Chow", "comment_text": "I always tip when they help with luggage..."}, {"username": "Rasha Za", "comment_text": "No"}, {"username": "Bobby Jo", "comment_text": "No not at all"}, {"username": "Ky Bean", "comment_text": "NO 😁"}, {"username": "Toni Quatrini Bannister", "comment_text": "My daughter in law and I tipped everyone in Italy from Gondoliers, private shuttle drivers that our hotels sent to us to all the waiters! They were very appreciative!"}, {"username": "Marie Butler", "comment_text": "How do you pay for taxis in Italy pls- credit card or cash ??"}, {"username": "Steven Fletcher", "comment_text": "Do whatever you want it’s your money 🤷🏻‍♂️\n\nAs far as “expected”. No, there is no expectation to tip, however, people know Americans like to tip and they will take advantage of you if you allow it. They do it in Korea they see your American they will literally tell you to tip them so don’t let yourself be played"}, {"username": "Natalie Adams", "comment_text": "This kind of question gets asked daily. I would like to hear from drivers, servers and tour guides on their feelings about tipping and if they do make enough without the extra tips."}, {"username": "Paula Luca", "comment_text": "No"}, {"username": "Elena Innocenti", "comment_text": "No. But often in Rome if you pay cash rounded up the change in cent. ex 12,50€ / 13,00€"}, {"username": "Erica Verde", "comment_text": "No tip"}, {"username": "Amelia Romanus", "comment_text": "Not nice people. Tip your driver. If the car is clean inside and out, then that means your driver washed the car, vacuumed out the interior, and wiped down the inside. If they are courteous and get you to your destination safely, then you should tip."}, {"username": "Robert Mayfield", "comment_text": "No"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "We did & probably way too much because it just felt normal to give cash🙁"}, {"username": "Rhona OConnor", "comment_text": "No.... But many do."}, {"username": "Kay Rendall", "comment_text": "I dont,however, gave a taxi driver in Naples a few years ago 50 euro for a 20 euro trip and he just drove away. My tip have small bills and just tip small amounts between bill and cash u have.\nAlso often ask for price, meter before heading off. Not a bad idea to take photo of license, photo, in case u end up somewhere u dont want to be. Does happen. Same with Uber driver just to be on safe side\nWith uber I don't in Australia at night"}, {"username": "Miklos Verdes Kovacs", "comment_text": "Yes ! 😎😉"}, {"username": "Alessandra Pasteris", "comment_text": "We did for each cab and Uber. They are actually pleasantly surprised when you do. It doesn’t have to be much but the thought is very appreciated."}, {"username": "Luca Tocci", "comment_text": "No."}, {"username": "Simone Mori", "comment_text": "No"}, {"username": "Alessandro Iannelli", "comment_text": "No. Don't listen to fellow country people who gave you advices based on their experience home and not based on how it works here. You are already paying for the service, why would you pay an extra? That said, of course you can do what you want with your money but the answer to your question is no, it's not expected."}, {"username": "Jerry Lyubelsky", "comment_text": "Not expected but we did a few euros"}, {"username": "Desiree Jimenez", "comment_text": "I do with exceptionally kind drivers. We have had some wonderful ones who tell us so much history. It's like a personal tour! 😊"}, {"username": "Giuseppe Placi", "comment_text": "According to me yes"}, {"username": "Peter Guzman", "comment_text": "Peter Guzman"}, {"username": "Hassan Ali Maki", "comment_text": "I paid in CC but asked the driver to put extra amount as a tip"}, {"username": "Bonnie Qn", "comment_text": "I tipped one driver and the other driver added his own tip (ride was 13 he charged me 15) so I considered that his tip."}, {"username": "Christine Sounes", "comment_text": "No"}, {"username": "Lisa Citrowske", "comment_text": "If you have to ask"}, {"username": "Jim Painter", "comment_text": "Don't ruin Europe with American tipping culture...."}]}, {"id": "2195306660868412", "text": "Is Hotel A La Commedia a really good location?", "link": "facebook.com/groups/1373361046396315/permalink/2195306660868412/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "It depends what are your expectation and walking strength (thsts what you need in Venice anyway)Check on google maps and decide ;)"}]}, {"id": "2195308377534907", "text": "Any recommendations on a small group tour to see Sienna and San Gimignano with lunch?", "link": "facebook.com/groups/1373361046396315/permalink/2195308377534907/", "likes": 0, "comments": []}, {"id": "2195309897534755", "text": "I’ve heard people say, yes have your passport with you at all times…..and others say, no just leave it in your hotel room. Does it really matter? I know we should have ID with us everywhere and is it fine if it’s your driver’s license? I do plan on having a photo copy of my passport. What are your recommendations for carrying/where to keep my passport, copy of my passport, my driver’s license? Thanks all!", "link": "facebook.com/groups/1373361046396315/permalink/2195309897534755/", "likes": 47, "comments": [{"username": "Ruth Olivia Yanes", "comment_text": "Is a personal choice , I carried ours all the time, right on my chest 😉 I was very confortable."}, {"username": "Cari Berdut", "comment_text": "I would never, EVER, leave my passport behind especially if staying in a VRBO. You don’t know who has keys or other access to that home/apartment."}, {"username": "Linda Stockley", "comment_text": "We were asked for it on the train and at the Vatican and the colosseum. I think you can show an ID like a drivers license, but I’m not 100%"}, {"username": "Madelline Lugo", "comment_text": "I wouldn’t trust leaving important documents in a hotel. I prefer to carry them with me all the time."}, {"username": "Mira Elezovski", "comment_text": "Tyson Ak"}, {"username": "Miyuki Kanno Paul", "comment_text": "Your Driver’s License is NOT a valid identification once you leave your home country. Your passport is the only ID. Police does random ID check even on the platform at the train station. I know it because we were checked several times at various locations. Carry your passport! We do have photocopies of our passports at the hotel. Leave your DL in your room"}, {"username": "Paolo Berardi", "comment_text": "Strctly by law the copy of you passport means nothing.\nIf you are found without proper identification the politecnico can bring you in for controls.\nAs a tourist this happen rarely, but can happen."}, {"username": "Lucille Leblanc", "comment_text": "Travelled to Florence from Rome for a few days..we had left the originals in a safe @ Rome condo…Hotel in Florence demanded them for our stay saying it was mandatory"}, {"username": "Marisa DePalma", "comment_text": "Make a copy\nCarry copy\nLeave original in safe in hotel"}, {"username": "Janice Finn Clemans", "comment_text": "I just got back from Italy. I made 8.5 x 11 copies of mine, my husband's and 2 daughter's passports. We had to show them a few times throughout the trip. Entering the Colosseum, at a couple of hotel check ins, buying train tickets at depot, entering St. Peter's while on a Guided tour, entering the Roman Forum... not once did I get any resistance to the photo copies in place of the actual passport. Just make copies and leave the actual passport at your hotel."}, {"username": "Zeeshan Asghar", "comment_text": "I have friends who are from EU countries and look more acceptable according to european society never have the need to keep their ID with them. (no random stops by the police, or by the supermarkets security)\n\nHowever, for me, I MUST keep it with me 24/7.\n\nI have been stopped dozens of times for random checks, sometimes lasting to an hour even after having legal documents.\n\nI'd really say it depends how you look, what is your color and where you come from.\n\nGood luck."}, {"username": "Esther Peeters", "comment_text": "I carry my valuables like passport and money in a pouch underneath my shirt."}, {"username": "Bonnie Qn", "comment_text": "I had copies on my phone AND in my mobile passport control, I was too nervous with the pickpockets that it might get stolen. We were only asked to show it at our hotel check in."}, {"username": "Andrea Shelton", "comment_text": "It’s the law in Italy to have it with you at all times.\nIf you are in an emergency situation away from your hotel room safe, a photocopy of your passport will not help you."}, {"username": "Debbie Perriccioli", "comment_text": "So I’m finishing up two weeks in Italy. I have been to Venice, Florence, Naples and Rome all via high speed trains. Have also been on boats and buses. I have seen with my own eyes people being stopped in the train station and asked for ID. I was never asked so I don’t know all the details of whether a picture or whatever will suffice."}, {"username": "Sondra Knap", "comment_text": "I had my original on me at all times and it was requested only when we wanted a VAT form completed for purchases."}, {"username": "Renee Rundle Stoneham", "comment_text": "Have your IS ID on you, have a copy paper or digital of your passport with you. (I now take a picture of the stamp as well)\n\nLeave passport secured in hotel.\n\nHave done this for years and never had any issues. Many trips to Europe and Italy.\nUsed to live in Germany.\n\nI have NEVER read or heard about any tourist arrested or fined etc because they didn’t have passport on their person.\nItaly is having issues with illegal immigration etc.\n\nPetty Theft is big in many large cities, bags purses backpacks etc.\nIf you want to risk your passport being stolen that’s your choice. I’m not risking it."}, {"username": "Lisa Valdovinos", "comment_text": "I was at a high end store and they wanted my passport to make the transaction. It’s a world famous store. A picture on my phone wouldn’t do. Other places did not require it when I was purchasing things. I think we also may have needed it when we went to the Vatican."}, {"username": "John Green", "comment_text": "At the Colleseum today only asked for passports for younger than 18"}, {"username": "John Green", "comment_text": "Carried a paper copy. But vatican tour may require the original"}, {"username": "Lee Say Lor", "comment_text": "No one asked or checked mine."}, {"username": "Julio Suarez", "comment_text": "We didn’t have our passports. The cops checked us twice on the train and at the station. Not an issue."}, {"username": "Katie Hardman", "comment_text": "We just carried our licence and left passports at our hotel.. no problems"}, {"username": "Susan Donlan", "comment_text": "We've never had ours checked in Europe, but I can't even imagine the uproar if the police in tourist cities in the US checked ID's and passports."}, {"username": "Heather Milotich", "comment_text": "I was just there. I carried our passports every time we went out. I was never once asked to show them."}, {"username": "Amanda Willard Leloudis", "comment_text": "We were asked for it at the Colosseum to prove the ages of my kids (copy of passport was acceptable) and to exchange money ( copies were not accepted, we needed the actual passport)"}, {"username": "Anne Mc Namara", "comment_text": "We left our passports in hotel when we were there"}, {"username": "Taffy Adams", "comment_text": "Why would anyone visit a foreign country and knowingly ignore their laws? Italy requires EVERYONE to carry approved identification,\nnot copies. For Americans, that is your passport. There are many items available to secure them to your body if necessary. If you are detained for any reason and cannot produce your original passport, you can be fined. This whole process can be very unpleasant and possibly take previous vacation time away. Why risk breaking the law? As for safes in hotels? They are not safe. I know this all from experience. If you plan on traveling to destinations outside of the US, please abide by their laws. Just because you didn't get caught before, perhaps many times, doesn't mean it won't happen."}, {"username": "Clarissa Lopez Angel", "comment_text": "We had a printed copy and a picture and not once were we asked for it anyone throughout France or Italy (except for airport)"}, {"username": "Peggy Frain", "comment_text": "I always keep with me. Use for identification.\nIt’s not that big & fits in all my purses. No big deal. Have never used hotel safes. Heard too many stories of people forgetting them or not being able to open."}, {"username": "Shirley L Jones", "comment_text": "I found this which explains it well."}, {"username": "Elizabeth Dancy", "comment_text": "In London- kept it in my air BNB, copy on me.\nHavent needed it at all."}, {"username": "Nataliia Carlton", "comment_text": "Never took passport with me and don’t plan too.Been robed in Italy once and was ready happy that I didn’t have passport with me. Travel to Italy often and never been asked to check Id. Only places like train stations, airports etc"}, {"username": "Frances McDonagh", "comment_text": "I'd be worried about my bag getting snatched with passport in it so I keep in room and bring a photocopy with me"}, {"username": "Rose Stolarek", "comment_text": "I had ours with us but in all our trips to Italy have never been asked. Our last visit my husband lost his passport and even though I had photocopies/ photo on my phone as well our embassy ( Australia) was absolutely not interested in the photo and the photocopy at all. They wanted another form of ID Government issued-with his photo , as luck would have it he had his drivers licence so he had an emergency passport within 24 hours"}, {"username": "Nina Churchill", "comment_text": "Do people take their passports to the beach? I’ve never carried it, unless the activity of that day says I need ID."}, {"username": "Irene Oda", "comment_text": "I keep passports with me. But in the future once my present passport expired I'm going to order a passport ID card as well renewing my passport book. Can't wait."}, {"username": "Lucia Evangelista", "comment_text": "Copy of your passport and other ID is fine just in case the carabinieri stop you. They do random checks."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "I carried copies with me. Was never asked for them anywhere or on any tour. Even used the copies at the hotel. They just make a copy anyway."}, {"username": "Kay Rendall", "comment_text": "Also have a photo on my phone. A photocopy in my wallet. Was enough when in Sardinia I was locked out hotel at 1.00 am by military police. Never Carry passport and I have travelled to many world countries, including Africa, Cambodia etc\nAlso another photocopy somewhere in your locked luggage on your room. Much easier to replace with all details, if worst came to worst u lost wallet, phone, passport. Even copy emailed to yourself as backup."}, {"username": "Gabriel Zurlo Sconosciuto", "comment_text": "As an Italian citizen, I tell you that Italian law provides that: 'A foreigner who, at the request of public security officers and agents, fails to comply, without a justified reason, with an order to produce a passport or other identification document and a residence permit or other document certifying lawful presence in the territory of the State shall be punished by arrest of up to one year and a fine of up to €2,000.'\n\nSo, find a way to keep it safe, but take your passport with you. If you really do not trust it, bring another identity document.\nPhotocopies are no good: if you find a particularly accommodating agent they will let you go, otherwise they will detain you at the police station for investigation."}, {"username": "Sharmini Nair", "comment_text": "I carried my passport with me at all times and police stopped me at the bus station in rome and spent 10 mins looking at my passport"}, {"username": "Jocelyn F. Hild", "comment_text": "It is all up to you."}, {"username": "Gillian O'Callaghan", "comment_text": "On FB when you get different opinions and ideas in the middle just do what you want."}, {"username": "Corey Walther", "comment_text": "For everyone high on their horse, you can be arrested for failure to identify. Just grab the little booklet and keep it with you."}, {"username": "Richelle Trezise", "comment_text": "It does say to carry photo ID. Our TA has said they are fine with a copy plus your photo driver license is enough. But on the rare occasions you get an cocky police officer he might just fine you. So it is your call"}, {"username": "Maria Sulsona", "comment_text": "I always keep my passport on me in my cross body purse."}, {"username": "Michelle Solak", "comment_text": "I’m not sure where you’re traveling from, but the US embassy recommends carrying a copy of your passport and not the actual thing! Def worth googling if you’re not from US. In my opinion there’s a big peace of mind from carrying just a copy and not the real thing, but everyone does their own thing! My mom *only* carries her passport and would never put it in a safe, for example"}, {"username": "Kate Squillacioti", "comment_text": "Just got back from Italy and the one and only time we were asked for it was the Colosseum and we were told ahead of time they would check it when we booked our tour, otherwise I carried around a copy and left them in the safe in the room"}, {"username": "Desiree Dube", "comment_text": "The photo copy is sufficient for carrying daily, usually they allow you to bring the physical copy to a police station afterwards/\naccompany you back to your accommodations if you explain that you are afraid of pickpockets and have the physical copy at your accommodations."}, {"username": "Brad Beckett", "comment_text": "I refuse to carry my original passport while out in town. It's too risky and risks of it being lost vs temporary arrest are too great. If the police really want to see it they can drive me to my accommodation. I've never been asked in any country I've visited."}, {"username": "Viraf NZ", "comment_text": "We kept a copy on our phone at all times without any problems. Originals were locked up in our bags . Unless specific places which required the originals"}, {"username": "Phyllis Snyder", "comment_text": "I know it’s confusing- but I believe a drivers license isn’t an international identification-\na passport is. It seems that a good photocopy is sufficient- but would carry the real pp while traveling on trains- that apparently where officials check for id the most."}, {"username": "Peggy Fisher", "comment_text": "Waist belt holds everything. If stopped they don’t want copies. I would never leave valuables in a hotel safe."}, {"username": "Sally Amatelli Millaway", "comment_text": "We were asked for ours during a random check in the train station. When moving from one hotel to another we carried it on us. While in each city, we had a copy on us and left it in the safe."}, {"username": "Carla Vee IsMe", "comment_text": "A copy is sufficient. I have paper and on my phone"}, {"username": "Ruth Lindsey", "comment_text": "Exchange a copy of passport with your traveling partners for well being"}, {"username": "Marisa Dilieto-Brenner", "comment_text": "Leave it in the safe at Hotel nobody asked us for it we were just there last week! We did have a copy in our phone just in case !"}, {"username": "Lisa Martinson", "comment_text": "Use a Copy. I’ve never carried mine when out & about."}, {"username": "Kit Nader", "comment_text": "I tend to leave my passports in my room. Money and cards with me. I do have a photo of my passport on my phone ... just in case it's needed...but never has been."}, {"username": "Madeline Caporale", "comment_text": "Italy law to have passport with you, can be a copy. Police do perform checks, especially on trains. There is a fine for not having it to show when asked."}, {"username": "Sarah Bullen", "comment_text": "Our tour guide said that you can leave it in the safe if you really want to but the chances of you forgetting it there are far greater than if you just have it on you. I found a zip pocket in my bag and put it in there. I had copies in my suitcase as well as in my travel companion’s suitcase, just in case anything happened to my handbag"}, {"username": "Judy Hayward", "comment_text": "It is Italian law to have ID on you at all time a foreign drivers licence is not ID. When travelling your passport is your ID, respect the law of the country you are in."}, {"username": "Marnie Houghton", "comment_text": "We were just in Italy for 3 weeks and were asked by police for our passports twice, once on arrival at Naples train station and again as we were leaving Naples train station 4 days later"}, {"username": "Michelle Prince", "comment_text": "we are just back from Italy and had our passports with us whenever we were outside of hotel if that helps x we were never asked to show them though"}, {"username": "Gail Santangelo Brown", "comment_text": "Will the passport card that we ordered when renewing our passports meet the passport requirement?"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Spent a month in Italy. Had my photo ID with me at all times - which also has to be left with the audio guide people when we hired them - but carried paper and electronic copy of my passport with me too. Never asked for it. Seems the police might ask at train stations, but if you’re traveling you’d probably have it with you then anyway unless it’s just a day trip. Losing your passport causes all manner of grief."}, {"username": "Maxine Cunnyngham", "comment_text": "I always keep my passport with me."}, {"username": "Angela Macias", "comment_text": "You are in Italy not the US! Carry your passport!!! Keep the copy in your room."}, {"username": "Grace Scinto", "comment_text": "Carry it with you wherever you go. Then you won’t have a problem"}, {"username": "Noelene Cameron", "comment_text": "I can never leave mine in hotel room safe, but that’s me. Do what you are comfortable with. Make sure though that you have some form of official ID on you if not your passport. Have a copy of passport (on phone or paper)."}, {"username": "Frank Hunt", "comment_text": "I was asked to show a passport by armed police when entering a railway station. I’m not sure a copy would have cut it on the day."}, {"username": "Jenn Messina Babore", "comment_text": "We have had photocopies of our passports on my phone and that has been perfectly fine whenever requested."}, {"username": "Maria Al", "comment_text": "The only place we have needed it has been at Pompeii. They wanted photo ID for the teens. I have no idea why. No one else has asked for it beside the front desks at check in. So far, we have been to London, Paris, sorrento."}, {"username": "Kristine Gutierrez Campbell", "comment_text": "We just got back. We had our passports on us at all times."}, {"username": "Gina Johannes", "comment_text": "I am in Italy now and just have a picture of the passport on my phone. You need it if you buy something that you want to claim the VAT tax on. Otherwise no one asks for it."}, {"username": "Nicole Condemi", "comment_text": "I’m in Italy now and gone on some tours that have asked to have it. I’ve been asked once, and that was upon arrival at my Airbnb due to the tax you have to pay. I do have my passport electronically just in case"}, {"username": "Rachael Richardson", "comment_text": "The only time I needed ID up to know was Pompeii I had to leave ID to take the audio phone guide and got it back on return !"}, {"username": "Joanne Danforth", "comment_text": "In Naples now I have photocopies of our passport we’ve not been asked yet but saw plain clothed police asking ppl to see there’s ."}, {"username": "Rachael Richardson", "comment_text": "Also they ID 18-25 year olds if you want discount tickets to enter museums etc\nI carry mine all the time in a secure pocket in my cross body bag at the back"}, {"username": "Sarah Stiltner", "comment_text": "I was stopped at the train station randomly by Italian police and asked to show it"}, {"username": "Kristy Sonicz", "comment_text": "Helen Ireland"}, {"username": "Carlene Reader", "comment_text": "I just recently spent 3 weeks in Italy, I’m from Australia. Never carried our passports with us; just a photocopy and drivers license. Was asked for ID by police, on the very first train we caught and that was sufficient."}, {"username": "Neville Spargo", "comment_text": "We have been asked for passports twice on railway stations , did have them with us , but I believe they will accept a quality photo on your phone ."}, {"username": "Em Marie", "comment_text": "We were never asked for our passports, except for at the hotel"}, {"username": "Krissy DaRusso", "comment_text": "This is by far the most dividing question in this group! 😂\nEach side feels very strongly on “passport carrying”. Hope you feel comfortable with your decision after reading comments.\n\nPersonally, I’m a passport carrier at ALL times. Never leaves me. However, years ago I was a “leave in the safe” traveler."}, {"username": "Donna Ley Mitchell", "comment_text": "Im not chancing loosing my passport.\nA copy is what i carry whenever i travel\nLeave passport in safe"}, {"username": "Selin Demirci", "comment_text": "I dont care a police does a random check and asks for my passport. Im not carrying my passport with me. Cant risk it being snatched. I would carry another form of ID like my driving license. If they have a problem with it, it is their problem really. They can drive me to my hotel for me to show the passport if it is so urgent lol."}, {"username": "Giulia Hardacre", "comment_text": "My mum is Italian and I've been going to Italy for 31 years and for as long as I remember we've never had ID on us, we've always left it at home. I've just got back from two weeks in Italy and the only real ID we had on us were our drivers licences, but occassionaly these were left behind as well. Our passports stayed in our accomodation"}, {"username": "Mary Palazzolo", "comment_text": "This is what I found when I looked it up"}, {"username": "Kristina Ruk", "comment_text": "I carry it with me (and all the kids passports). Doesnt look safe in a hotel there maids can come everymoment. Copy it just for cases your passport is beeing lost/stolen, but I dont see the point carrying it with me as anyway copy is not a document ;)"}, {"username": "Ryan Shearer", "comment_text": "10 photocopies. Plus pictures on my phone. Just leave them at your accommodation in your locked suitcase."}, {"username": "Jayne Dawson Meyer", "comment_text": "Never asked for ours. Had US drivers license with us. We went everywhere."}, {"username": "Susan Donaldson-Hopwood", "comment_text": "Have been traveling here for a few weeks, have taken trains ect. The only time I've been asked for passport ID is when we are checking into accommodations."}, {"username": "Carol Watson", "comment_text": "I only ever had to produce it on check in at hotels and even then most would accept the photo on the phone."}, {"username": "Charlene Noll", "comment_text": "Italian law. Have it on you. Not a copy. Am a US citizen living in Italy. Was asked in the train station by police doing random spot checks."}]}, {"id": "2195322740866804", "text": "Anyone that has used Costco travel, can you answer some questions? For their packages, is there any ability to change a location or are they pretty set? I know you can adjust the number of days in a location, but wasn’t sure about changing a location. Second, did you find that the hotel options were in good locations and nicer options? We aren’tआणखी looking for absurd luxury but we prefer nicer hotels. Third, if you have or considered booking everything yourself, did you find Costco to be cheaper overall?\n\nWe don’t have a Costco membership (no locations in our area), but would consider if it using their travel made sense.\n\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2195322740866804/", "likes": 4, "comments": [{"username": "Jenn Messina Babore", "comment_text": "We have used Costco for booking a cruise. They had great return in terms of Costco cash card (Cashback, but only usable at Costco). On our recent cruise, we found a TA that beat Costco’s rates and onboard credit. The downside to Costco is there is no personalized service and they are not experts in any one avenue of travel. You get a different rep each time you call or need assistance. The pro at the time was the same price as the cruise line with more money back. For our recent trip, I booked all the accommodations separately and prefer that route. But realize everyone travels differently so just depends on if you want to do it yourself or have someone book it for you. Cruise TA slightly different as they can make all the calls with the cruise line and based on wait times it can certainly be a blessing (in addition to the savings)."}, {"username": "Alyce Henry", "comment_text": "Love it,2 yrs in a row for Europe."}, {"username": "Terry Pisano", "comment_text": "Are you asking about Costco's Costsaver tour?"}, {"username": "Heidi Littman Meiers", "comment_text": "yes you can totally customize, they are awesome, that being said, i did find it easier to do on my own as we wanted a car and they dont do european car rentals, they did tell me the drivers can be unreliable which i thought was a nice tip, i used their drivers last sept in Aruba and also didnt care for them, i did however.... so far , find booking myself to be cheaper and was able to find a bit nicer hotels for the same price"}, {"username": "Tricia Brittingham Neff", "comment_text": "I start there to get an idea on hotels, itinerary etc. But I always book it myself way cheaper!!"}]}, {"id": "2195323240866754", "text": "I was able to purchase Pantheon tickets from the US. I made several attempts the past few weeks and it seems the official website kept rejecting US credit cards.\nI just tried now but paying via PayPal and it worked!!\nGood Luck!!!", "link": "facebook.com/groups/1373361046396315/permalink/2195323240866754/", "likes": 4, "comments": [{"username": "Jeff McLellan", "comment_text": "Had the same issue with Canadian credit cards gave up in the end. Will have to hit it next time."}, {"username": "Sophie Toms", "comment_text": "It didn’t work for me on internet explorer but when I used google chrome it worked perfectly 😊"}, {"username": "Eric Maurer", "comment_text": "We ended up going to mass there since we could never get it to work. It was free and we could walk around and take pictures when it was over."}, {"username": "Kristi Brennan", "comment_text": "How far in advance are tickets available?"}]}, {"id": "2195324860866592", "text": "Hello! Where is a safe central area in Rome that isn’t too far for walking to the main attractions or close to public transportation? Airbnb preferred but hotel suggestions are welcome as well.", "link": "facebook.com/groups/1373361046396315/permalink/2195324860866592/", "likes": 4, "comments": [{"username": "Trish Heymer", "comment_text": "Have a look for air bnb around San Giovanni. 20 min walk to colosseum. Close to Metro train line a and b. Will get you to the colosseum, Trevi fountain, the Vatican and termini stations."}, {"username": "Carolina Barnhill", "comment_text": "The area around Piazza Barberini is safe, central and you can arrive in a few minutes to the main attractions"}, {"username": "Kay Rendall", "comment_text": "We stayed appartment close to Campo Fiori. Close to bus to City pantheon, walking distance. Lots local restaurants close by. Very reasonable compared to in city area. Very safe"}, {"username": "Lauren-Jade Roberts", "comment_text": "We stayed in one in Monti which was fine and really reasonable"}, {"username": "Amy Sandler Riemer", "comment_text": "That’s exactly what we’re trying to figure out. We found one in Vatican area, one in monteverde Novello and one in Salario near villla Borghese"}, {"username": "Mary Brown", "comment_text": "Piazza Navona area"}, {"username": "Janet Messanelli Bozzone", "comment_text": "All of the centro storico is safe. We like Hotel Mozart, but there are plenty of options."}, {"username": "Matthew Cawley", "comment_text": "Residenza B we stayed in"}, {"username": "Dave Colleen", "comment_text": "We are currently staying at Kolbe Hotel and love it."}, {"username": "Meg Touhey Schulz", "comment_text": "We stayed at Hotel Alexandra, loved our location!!"}, {"username": "Larry Reinier", "comment_text": "Hotel Smeraldo."}]}, {"id": "2195442930854785", "text": "Any recommendations for kids (youngest 6) cooking classes in Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2195442930854785/", "likes": 2, "comments": []}, {"id": "2195536180845460", "text": "Anyone experience a mosquito problem in Tuscany.Also any problems with large luggage on trains?", "link": "facebook.com/groups/1373361046396315/permalink/2195536180845460/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "Once you can carry your own bag up the train steps the you won't have a problem. Just make sure you can lift it yourself. As for bugs, I just use a spray each evening and had no problem. There were very few where we were I think."}, {"username": "Miyuki Kanno Paul", "comment_text": "Mosquitoes are notorious there! Your hotel room may have a plug-in repellent. If not, go get one at a supermarket.\nAs for luggage, move yours as quickly as possible"}]}, {"id": "2195325117533233", "text": "😍😍", "link": "facebook.com/groups/1373361046396315/permalink/2195325117533233/", "likes": 20, "comments": []}, {"id": "2195331070865971", "text": "If you get to Turin and you like Egypt history remember to book a visit to Museo Egizio, it's the second Egyptian museum in the world, second just to Cairo Museum", "link": "facebook.com/groups/1373361046396315/permalink/2195331070865971/", "likes": 8, "comments": []}, {"id": "2195419030857175", "text": "Looking for a good B&B with 3 bedrooms and 3 baths in Sorrento in October. Any suggestions? Looking at booking Bella Sorrento .", "link": "facebook.com/groups/1373361046396315/permalink/2195419030857175/", "likes": 0, "comments": []}, {"id": "2195339140865164", "text": "Taking the train from Rome to Florence. What are the differences in the types of tickets and what do you recommend? We want to take the fast train.", "link": "facebook.com/groups/1373361046396315/permalink/2195339140865164/", "likes": 13, "comments": [{"username": "Grace James", "comment_text": "Express trains (Frecciarossa, Frecciargento, Frecciabianca):\nThese trains are part of Italy's high-speed rail system and are fast and comfortable. They are usually the fastest option, offering nonstop service between Rome and Florence. We recommend buying tickets for these trains."}, {"username": "Erica Verde", "comment_text": "Fast trains are Frecciarossa (Trenitalia) and Italo. Both offer service between Rome and Florence"}, {"username": "Jenn Messina Babore", "comment_text": "The differences in tickets are based on the train car, the number of seats, and the service included. TrenItalia will tell you the different types of fares from Basic to Premium to Business. Business for example only has 3 seats across (1 then wide aisle then 2 seats) and includes a snack and drink. Standard fare will have 4 seats across (2 seats then aisle then 2 seats) and no included snack or drink, but you can purchase in the bar car)."}, {"username": "Mary Anderson Jenkins", "comment_text": "Check out the Man in seat 61 website. https://\nwww.seat61.com/\nindex-mobile.htm"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Different prices reflect the conditions of the fare and the class of travel. Discounted fares are cheaper the further out you book. You can save a lot by choosing fare which aren’t refundable or changeable."}, {"username": "Carol Taylor Tisdale", "comment_text": "Business class is worth it."}, {"username": "Rhonda Baynard", "comment_text": "Following 😊"}, {"username": "Michelle Robertson-Leathley", "comment_text": "Tony Leathley"}, {"username": "Phyllis Snyder", "comment_text": "Take fastest one. Not that much different In cost- worth it."}, {"username": "Lyn Wise", "comment_text": "No need for business class. The basic tix include seat selection, comfy seats, luggage in the overhead storage above your seat."}, {"username": "Roseanne Marie", "comment_text": "Use the Trainline app. I used it for all my trains. It was a life saver"}, {"username": "Casarine Temple", "comment_text": "We booked with Italo Prima class. Traveling Rome ~Florence~Venic\ne ."}, {"username": "Renee Rundle Stoneham", "comment_text": "If the difference in fare isn’t much go for First or Business.\n\nI like having an assigned seat, especially on trains longer than 1-2 hours.\nUsually it’s quieter and has less foot traffic etc as they are usually in the front of the train."}, {"username": "Linda Miller", "comment_text": "Trenitalia or Italo"}, {"username": "Peter Kim McDonald", "comment_text": "Omni will compare the two high speed trains for fares and schedules."}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Gayla Faye Bell"}, {"username": "Sue Swail Bang", "comment_text": "Kristopher Bang"}, {"username": "Jim Hash", "comment_text": "Go with business class. So much nicer for only a few €uros more."}, {"username": "Ellie Smythe-Jones", "comment_text": "We bought second class and it was great, comfortable with a little snack."}, {"username": "Barbie Phillips", "comment_text": "We just did that train trip on Tuesday. I HIGHLY recommend the Biz class…e even received a drink and yummy snacks! Who worth it!"}]}, {"id": "2195335034198908", "text": "This site has been wonderful! I am leaving tomorrow for Italy for the 1st time. Europe for the 1st time. Please give me a run down of things I need to pack - not forget. Please 😀🍷", "link": "facebook.com/groups/1373361046396315/permalink/2195335034198908/", "likes": 142, "comments": [{"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Izzie MacDonald", "comment_text": "We've just done 5 weeks here with carry on bag only..don't overpack..too hot to be lugging suitcases..brin\ng lotsa money...I also only had 1 x pr sport sandals..wore them everyday no problem..if you use trains DON'T forget to validate ya ticket..have fun..we have..from Arona in the N diwn Taormina in Sicily..all on trains or buses.\n."}, {"username": "Graham Sherlock", "comment_text": "Battery pack for your phone, long charging cable for your phone, power point adaptor. photocopy your passport and licence and cards. Linen clothes are best. Remember it is extremely hot day and night, no jumpers, no coats, no long pants. Pack as little as possible. Throw in some pegs. Beach shoes are a must (reef shoes). Any medications you might need. Socks and shoes work better than sandals or thongs. A hat. Bug spray. Fold up umbrellas. Carry bags that zip up. Also bring lots of resilience, patience and humour with you."}, {"username": "Marina Belardo Johnson", "comment_text": "Bug spray and after bites !\nPack super light you do not need that many clothes!\nYou can wash it and dry it same day and travel with a backpack !\nEat in local restaurants not on main touristy sites or get panini at a salumeria ! Super cheap and super good !\nTravel with bus or train and save on the private taxi can be super expensive!\nComfortable shoes ! You walk walk and walk !!!\nBring 2 port table batteries your phone will die for taking pictures ! We had one and it did not last all day … lol"}, {"username": "Monique Swanner", "comment_text": "A small fan!! Portable phone charger, conditioner! Also if you tend to be bug food in the states, the mosquitoes will eat you alive! I have 8 bites, my husband has none."}, {"username": "Melissa Doran", "comment_text": "Me too! Leaving on Saturday for my first trip to Italy! Have fun and safe travels!"}, {"username": "Heather Carey Roper", "comment_text": "Ann Grigsby Williams 👀"}, {"username": "Joann Lademan", "comment_text": "Cooling towels were helpful with the heat. Do not take much room and wash & dry easy. Also a multi use item.\n\nSome Euro to use restrooms.\n\nWe all used our sun hats daily!\n\nChewing gum to help with ear popping for take off and landing. Many air ports do not sell this.\n\nSome Laundry sheet soap to do laundry in your room. It is very hot.\n\nSmall fan\n\nCrossbody bag"}, {"username": "Rosanne Messineo Mills", "comment_text": "Swear by Mission cooling towels. Available on Amazon. Bought these for my kids that look like bandannas."}, {"username": "Diane Bicknell Cooper", "comment_text": "We walked 8,3422 steps in the airports alone!"}, {"username": "Jess Galasso", "comment_text": "Pack less stuff and more money so you may shop.\n\nPassport, comfy clothes for the plane, snacks, phone charger, and your sense of wonder.\n\nPlease come back and post about your trip!"}, {"username": "Dawn Reed", "comment_text": "Wow, lots of great tips here, going to Rome early September, hope there’s a cool down soon 😀"}, {"username": "Christina Falcone Thorsted", "comment_text": "Pack extra Advil, Tylenol and benadryl. They have it in Europe but it is very expensive there."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "Adapter and portable phone charger"}, {"username": "Sharon Hickey", "comment_text": "Best beach front hotel in nicest part of Sardinia??"}, {"username": "Cathy Powell", "comment_text": "If you have a “cooling” hat or t-shirt, TAKE it. It is currently 118.4 degrees Fahrenheit in Rome. 😢"}, {"username": "Patty Ham", "comment_text": "Flexibility and a sense of wonder. And your passport."}, {"username": "Kylie Forrest", "comment_text": "A small umbrella was great if had to wait in any queues."}, {"username": "Kylie Forrest", "comment_text": "I’ve just been and comfy sandals ( as it’s hot) as well as good newish pair of walking shoes were great. You need to be able to wear different shoes to give feet a break. I felt most comfortable in dresses. Cooler for me. Good shade hat essential. Light water bottle."}, {"username": "Brenda Keeter", "comment_text": "Passport, wallet, Rxs, phone and chargers. Most obvious, but most important! Ciao 🤗"}, {"username": "Linda Devin", "comment_text": "Converter plugs. Light clothing. Small amount of detergent, Very hot may want to wash out clothes. Peeled off clothes 3 times a day because of the heat. Hope you have a great time."}, {"username": "Susan Modeva", "comment_text": "Antihsan bite and sting cream .. works a treat if you get a mosquito bite and basically what Doug Burke said in the comments x Have a great trip x"}, {"username": "Angela Valentine", "comment_text": "a small spray bottle of water or even better caused ice and a fan........spra\ny water in your face and fan it. It's a really fast cool down. Used it in unbelievable heat in Marrakech. Bug spray, tinted moisturiser with 50 SPF."}, {"username": "Jenny McGhie", "comment_text": "Deet for the mosquitos!"}, {"username": "Kathy Sommer Garibay", "comment_text": "Compression socks. I never take long flights w/o them!"}, {"username": "Anna Alves-Regalado", "comment_text": "Danny Regalado"}, {"username": "Rosemary Vaccaro- Dutra", "comment_text": "Gina Stang"}, {"username": "Anne Vincent", "comment_text": "Livia Koloamatangi"}, {"username": "Enas Mourad", "comment_text": "Insect spray, allergy medicine, pain killer, muscle relaxer spray , high protection sun screen , a cap or hat thermal battle to keep water cold and don’t waste your money buying water there are public taps everywhere light clothes don’t carry tons you will use half what you will take, once u arrive get some change and get the Rome week pass it will save a lot of money and don’t skip the hop on hop off bus specially at night make the colosseum night tour you will love it, portable charger and a power bank is a must have, upgrade your iCloud memory for the photos 😂 leave all the bad energy and bring the positive vibes as it will be a trip to remember Italy is magical and I hope you enjoy it to the max ♥️"}, {"username": "Sophia Yager", "comment_text": "Yes on the small fan!"}, {"username": "Alexandra A Welker", "comment_text": "Use a vacuum seal bag, brinf handheld fan, dresses, linens, plug adapters, hat, some Euros so no rush on getting your money exchanged upon arrival. Take lots of photos! Have a blast!"}, {"username": "Kathy Holden Reams", "comment_text": "Enjoy yourself! We are on our way home now back to the states but had a great time. Line up your taxis ahead of time or Uber. We had to walk yesterday from the Vatican over 2miles before we could find a taxi. The heat was brutal."}, {"username": "Nancy Venetta", "comment_text": "Pack linen!! And easy to wash things. We just got back and had to stay in Rome 2 nights cause of our flight. But it’s HOT!!\nIf you’re sightseeing dress cool"}, {"username": "Irene Oda", "comment_text": "Take Pepto Bismal chewable ( summer diarrhea in this heat is real), ibuprofen, aloe, hydration powder, cortisone cream for mosquito bites."}, {"username": "Brenda Cox", "comment_text": "Grab some electrolytes...\nGatorade togo. Powder . Bought some on amazon.. You will need this in the heat ."}, {"username": "Connie Titone", "comment_text": "Umbrella for the sun"}, {"username": "Connie Titone", "comment_text": "Cooling neck wraps."}, {"username": "Isa Van Wyk", "comment_text": "It’s very hot !!!"}, {"username": "Lori Johnson Hilton", "comment_text": "Lori Johnson Hilton"}, {"username": "Phyllis Snyder", "comment_text": "Pack light- buy what you need there- fabulous clothes & beauty products in Italy. If you fly into Rome the airport is a treasure trove of stores- & tax free zone!"}, {"username": "Yolandé van der Westhuizen", "comment_text": "Have a wonderful time!"}, {"username": "Daniela Besseghini", "comment_text": "Melinda just bring with you credit card only!! You can buy whatever you need 😂😂 enjoy your stay!"}, {"username": "Douglas Martin", "comment_text": "Just enjoy the history and do what the locals"}, {"username": "Diane Petonito Giordano", "comment_text": "Enjoy Italy 🇮🇹 I know it’s hot there now so don’t pack heavy clothes. Keep is light. Sneakers always."}, {"username": "Maryjo Zappia Jeffries", "comment_text": "If your coming from the states try to take just a carry on. The flight cancellations and delays have been awful for international passengers. We got rebooked so many times and Iveas thankful to have my luggage with me"}, {"username": "Theresa Cline", "comment_text": "Laura Caruso Pratt Dawn Morey Mollica Dana Zorn Machelle Matthews Stewart Sounds like we need to take toilet paper!"}, {"username": "Cindy Thynne", "comment_text": "Just take one carryon suitcase and a back pack. It’s all you need."}, {"username": "Christine Broussard", "comment_text": "Travel adaptors and chargers\nA wrap for cooler nights, don’t take a heavy jacket or pants… doubt you’ll wear them"}, {"username": "Christine Broussard", "comment_text": "Face cloths"}, {"username": "Laura Schellberg Conroy", "comment_text": "Bug spray…lots of mosquitoes"}, {"username": "Lisa Hedenberg Nichols", "comment_text": "Cooling towels have saved my life. After 2.5 weeks we are on our last 2 days (just arrived in Venice) and the heat is awful. According to our AirBnb host, heat should be worst next week!! So glad we’ll be back in SoCal by then! Cross body, cooling towels, incredibly good tennis shoes (I went with Hoka), ThighSociety cooling undershorts, and almost all sundresses. I’m so grateful we had the last 5 days in the French Alps (where it’s still in the 80’s) before coming back to Italy. Heat is truly awful! Have loved our almost 20-day trip but am so ready to go home. Next time I’m coming in the fall or winter!"}, {"username": "Dolores Gomez Barrios", "comment_text": "Linen dresses, baby wipes to freshen up...u will sweat all day, comfortable trek sandals...I did not end up wearing sneakers at all... Rome was way too hot...collapsib\nle water bottle, and collapsible wine cups, and laundry sheets if you are doing COO...easy laundry!! You can buy good wine at any local store and they will uncork it for you...enjoy in front of any tourist site...you're welcome!!"}, {"username": "Marge Miller", "comment_text": "Make a list! Using these suggestions along with anything else you know you need, make a list of each item (I also make a list for my husband.) Lay everything out ahead of time and as you pack, check them off your list, including checking off any items you can’t pack until the day you leave, if you have any (like for me, it’s my curling iron). This way you won’t forget anything. Packing early will also give you the reality check of what fits in your suitcase and what you have to rethink and eliminate. Also check weight of your suitcase. That can sometimes be another challenge for me, especially for the return trip and all the things I’ve purchased."}, {"username": "Lisa Brindley Warner", "comment_text": "Don’t take a big suitcase! Minimalistic in packing."}, {"username": "Lisa Brindley Warner", "comment_text": "I went for the first time end of April. I was made fun of by the taxi drivers. Asked if I was staying for a long time. Plus if your using the trains/\npublic transportation you will wish you had a smallernsuitvase. I only used about 1/3 of what I had packed and was there for 10 days"}, {"username": "Cynthia King", "comment_text": "An outlet converter to charge your devices. Has to use it in every hotel we stayed at and comes in handy at airport during layover"}, {"username": "Louise Turner", "comment_text": "Not much"}, {"username": "Angela Zavattieri", "comment_text": "Lucy Deiana Kylie Barrow Lucia Dileva"}, {"username": "Beckey Hjaltalin", "comment_text": "Following"}, {"username": "Beckey Hjaltalin", "comment_text": "Sherlyn Bessette"}, {"username": "Carol Taranto Johnson", "comment_text": "Liquid Bandage (after last trip I decided this is a \"must pack\")."}, {"username": "Christine Verbeek", "comment_text": "Toilet paper, small bar of soap and an umbrella ( for the heat, and a rechargeable handheld fan) . True! It’s beyond hot there right now."}, {"username": "Amy Somera Fanale", "comment_text": "Power adapter; Euro’s - good to have cash on hand; travel pillow for plane; easy to slip on shoes for plane ride; pack clothes that you will wear 2-3 times to reduce the amount of clothes; bring a light jacket; be able to dress in layers, but expecting Italy to be quite warm; small cross body purse; comfortable shoes; sunglasses; hat; suntan lotion;\nENJOY!!"}, {"username": "Lisa Valdovinos", "comment_text": "Dresses, hat, and good shoes."}, {"username": "Chelou Jamoral Hsia", "comment_text": "I see water bottle in most lists. I read that water in Rome’s fountains are drinkable. Anyone had any problems drinking from them? What about fountains in other cities-drinkabl\ne too?"}, {"username": "Lydia Springer", "comment_text": "Don't forget electrical adapter/\nconverter, portable fan, portable phone charger, cool light clothing and good walking shoes. Passport and copy of passport. Enjoy!"}, {"username": "Frances McDonagh", "comment_text": "I'm back since Sunday factor 50, sunglasses, sunhat, fan, eu adapters, meds, runners, culottes not jeans too hot, aftersum, deet, flip flops for slippers linen shirts or shawls for churches or you'll have to pay for one, day pack, get your train tickets online saves time. Sanitiser keep your bottles when there handy to refill for water fountains"}, {"username": "Amanda Ower Williams", "comment_text": "Have a wonderful time! We just returned from our first trip to Italy/Europe and loved it! My advice is take something cool to wear around your neck and take ibuprofen, or any other medicines/\ndrugs you would typically take because it’s hard to get them over there.\n\nAlso, after having our bags stolen, I would recommend leaving an extra credit card and a copy of your drivers license in your room Just in case. Also, don’t carry your passports, just a copy. Not trying to be a downer, just practical advice.\n\nEnjoy every minute! ￼"}, {"username": "Laura Nausadis Bieber", "comment_text": "A really good camera for all those amazing places you’ll see! Have a wonderful time!"}, {"username": "Amanda Elias", "comment_text": "I just returned and bc of the intense heat and lack of USA grade ACs 😆 I kinda wish I would’ve packed a table size mini fan for next to my bed to sleep…..\n\nCrossbody\nHandheld fan\nPortable charger\nComfyyyyy shoes (only brought 1 pair for my entire 2 week trip!)\nDresses\nLUME deodorant worked wonders\nMega Babe thigh rub bc… dresses and all the walking!\nMotrin/ Tylenol\nA tinted spf moisturizer for face- I wore zero makeup - too hot!"}, {"username": "Milinda Jensen Fortune", "comment_text": "Copies of your passport and credit cards in case they’re lost or stolen. I recommend bringing two credit cards in case there’s a problem with one. Electronic adapter AND a converter. Washcloths if you want them. Umbrella for sun protection, sun hat with SPF, flashlight, baby powder, bandaids, moleskin for blisters, neosporin, sunscreen and something for sunburn, bar soap, hand sanitizer, surface sanitizer wipes, spare eyeglasses if you wear them and eyeglass repair kit, lightweight long sleeve shirt and lightweight long pants in case of mosquitoes, two copies of your itinerary, ziplock bags, AirTags for luggage, handbag, backpack, your contact info taped inside your luggage (no address), OTC medicine like Imodium, Aleve, cold pills, cough drops, vitamins, snacks, travel toilet paper and toilet seat covers, baby wipes (so many things you can use for), small notepad, pen, take a photo of your luggage in case it’s lost or stolen, COVID vaccine card. Notify your credit card companies of your upcoming travel, secure international phone plan…. Have paper copies of everything in case your phone is lost or stolen."}, {"username": "Dixie Kotylak", "comment_text": "European wall plug converter and power bank charger!!!"}, {"username": "Chris Vilsack", "comment_text": "Air conditioners"}, {"username": "Brenda Posey Simon", "comment_text": "-collapsable water bottle w hook\n- micro flat umbrella (sun and rain)\n- Purell mini pack wipes\n- Travel micro towel (if staying in airbnb)\n- packable hat\n- mole skin patches\n- sunglasses w leash\n- travel size medicine\n- hair clips\n- foldable, soft extra bag (for return. I put dirty clothes in it and then use my suitcase for purchases)\nHave fun! If you forget something you can find a substitute there!"}, {"username": "Mary Paron", "comment_text": "Just came back. Definitely a fan, money, converter, washcloths if you use them, soap, some kind of water bottle that keeps your water cold, good shoes, crossbody bag or purse, a backpack, hat."}, {"username": "Carla Oliver Brown", "comment_text": "Bath cloths!"}, {"username": "Dyron Provost", "comment_text": "While we’re on the topic of extreme heat, what is usually the temperature third week of May to the middle of June? ￼Venice and Florence at the beginning, Sorrento, Salve Rome area at the end. Just curious if the fan and cooling towels is as necessary as it is now. ￼"}, {"username": "Theresa Pagan-Alvarez", "comment_text": "Hat and comfortable walking shoes 😊."}, {"username": "Marilyn Caladine", "comment_text": "You won’t need clothes it’s so hot and not much air conditioning🤣"}, {"username": "Kim Swenson", "comment_text": "Washcloths (if you use them at home)."}, {"username": "Tracy Lata Gale", "comment_text": "Clothing that is cool like linen. We are here now and it’s HOT and humid! Enjoy!"}, {"username": "Allison Coltart", "comment_text": "A FAN!! The accordion style type. It’s HOT, but that will help and give you some shade as well!! Comfortable shoes, detergent to wash undergarments in the sink, and a front carrying Fanny pack or purse. You will absolutely LOVE IT!! ❤️"}, {"username": "Teresa Marina", "comment_text": "It is boiling here. I’m\nIn Italy and started out in Spain. I have never been so hot in my life. Pack light clothing and comfy sandals."}, {"username": "Gillian Dansie", "comment_text": "Channe Moore Tricia Dansie Justin Dansie .... cooling towels 🤣🤣🤣\n✔️"}, {"username": "Basia Szokarski", "comment_text": "Use your cc as much as possible....whi\nch is most places. Just make sure your cc bank doesn't charge high foreign transaction fees. Always choose to pay in euro with the card instead of USD. Dont use Euronet ATM's and when withdrawing at a bank atm , if asked always choose the \"unknown\" rate rather than the rate they are offering yoy"}, {"username": "Sandi Van", "comment_text": "Battery pack , plug converter"}, {"username": "Julie Pulzone", "comment_text": "It is super hot here! We r finishing week 3 and I have never went through so many clothes and managed to wash some while in transit. I would try to take very cool clothes that will dry quickly when hand washed."}, {"username": "Joy Crawford", "comment_text": "Safe travels ❤️ Be hot"}, {"username": "Patricia Turner", "comment_text": "Omg you haven’t packed yet! I would be freaking out. I started laying out my clothes a month before and slowly weeded out things and had it all sorted and in a suitcase a week before we left. Drink lots of wine tonight and enjoy!"}, {"username": "Margorie Madrid", "comment_text": "I just came back 3 weeks ago and heat was horrible 😣 take enough clothes as you will need it due to the heat and sweating 😓"}, {"username": "Sue Higgins", "comment_text": "Muesli bars or snacks for when you wake up starving hungry in the middle of the night on your first night after a long haul 😊"}, {"username": "Miriam McNally", "comment_text": "plug adaptor. And sense of adventure. Don’t worry if you forget anything, we have lots of shops here in Europe! Buon viaggio"}, {"username": "Stephanie K. Cox", "comment_text": "Following"}, {"username": "Michelle Cotoni", "comment_text": "Enjoy!!"}, {"username": "Kathy Brooks Taveira", "comment_text": "Have a great time! Enjoy every bit."}, {"username": "Phyllis Snyder", "comment_text": "Are you checking a bag or carrying on only?"}, {"username": "Karen Brown", "comment_text": "Probably too late if leaving tomorrow, but I was glad to have hat clips…\nAnd in Florence in April there are no window screens and no ac was on, so mosquitos DID bite while we slept.."}, {"username": "Alexis DeMelfy", "comment_text": "A hand held fan!!! The heat is no joke. They sell them on the streets here too if needed"}, {"username": "Doug Burke", "comment_text": "Lay out all your clothes and money on your bed. Then take half the clothes and twice the money."}, {"username": "Chic Ciccia", "comment_text": "Pickpockets are everywhere here in italy just be carefull."}, {"username": "Sam Clarkson", "comment_text": "Foot scrub and foot moisturiser, after all that walking about your feet will need a little tlc."}, {"username": "Gale Robertson Vantrease", "comment_text": "Just got back from our 3 week trip. Besides what others say above bring lots of underwear! We had several 3-shower days due to walking and heat, and I washed clothes once but didn’t want underwear drying all over our room when the cleaning staff came in. Also bring at least 3 pairs of comfortable shoes so you can mix them up, your feet will thank you."}, {"username": "Sue Taylor", "comment_text": "A fan - very warm in Italy!"}, {"username": "Carmela Tortora Coppola", "comment_text": "Water bottle, they sell water everywhere. Pack light clothes at least 2 per day. Just got back heat will melt you away. Food great best places to see. People are wonderful. AC they have different standards. They keep on minimum except hotels they do pretty good with AC. Safe travels"}, {"username": "Maria Al", "comment_text": "Neck fan from Amazon. Saving my life right now."}, {"username": "Kay Rendall", "comment_text": "Always carry some gastro stop in case, hard to find at 12pm"}, {"username": "Rhonda Hope", "comment_text": "A sunhat, European plug, chargers and portable phone charger, download maps for destinations and the fork for dinner reservations"}, {"username": "Krista Missons", "comment_text": "Isabel Isidro Collings"}, {"username": "Liesl Haas", "comment_text": "European plug adapter ."}, {"username": "Miyuki Kanno Paul", "comment_text": "PASSPORT."}, {"username": "Lina Mercuri-Caminiti", "comment_text": "Anything and everything to keep you cool. It's scorching atm."}, {"username": "Valerie Collanton", "comment_text": "An adapter to plug in your electronics"}, {"username": "Antonella Borraccino", "comment_text": "Here it's really hot. Don't forget sunscreen, hat and wear lightweight, loose-fitting clothing."}, {"username": "Randy Steinberg", "comment_text": "Smh"}, {"username": "Janet Isaacs Lanza", "comment_text": "We're here now, also first time. Mini battery operated fans and cooling towels. It's the hottest I've ever experienced in my life.\nHopefully you got your euros from where you are coming from. In our experience, they're not easy to find here, unless you want to pay sky high fines. We're on the Amalfi Coast and haven't felt uncomfortable about pick pockets at all. Just use common sense. We also haven't seen one mosquito 🤷‍♀️"}, {"username": "Sophie King", "comment_text": "Marie Simpson Demi Quinn"}, {"username": "Denise Benincasa", "comment_text": "Have a fabulous time! My advice is good walking shoes and a hat!"}, {"username": "Melissa Riddle", "comment_text": "Umbrella more for shade than for rain."}, {"username": "Ruth Olivia Yanes", "comment_text": "This is a MUST"}, {"username": "JoLynn Waters", "comment_text": "Portable laundry detergent, you can buy on Amazon. It is hot and humid.\nWe ended up washing our coolest clothes. Also, portable fan"}]}, {"id": "2195340230865055", "text": "For all the Italy lovers and people who might be going there this summer. What us the situation with the air and train strike?", "link": "facebook.com/groups/1373361046396315/permalink/2195340230865055/", "likes": 3, "comments": [{"username": "Karl Wilder", "comment_text": "The situation changes dat by day. Now all is normal"}, {"username": "Cat Furness", "comment_text": "Get the Trenìt! app it shows all upcoming train strikes."}, {"username": "Rita Levi Montalbano", "comment_text": "Actually there is no heat wave here, just the usual italian summer as i had experience 23 years of my life. If you are afraid of the heat please dont come in the summer or at least do not complain about it, italy gets hot, accept it"}, {"username": "Jenn Messina Babore", "comment_text": "It has not impacted our trip at all. 🙏🏼 We’ve taken the train to/from Florence and Venice. We did hear one train had been cancelled when we were in Genoa (to Santa Margherita), so just be aware of any train strikes and plan accordingly."}, {"username": "Irene Oda", "comment_text": "For sure on the strike days people were impacted."}, {"username": "Tatiana Aciu", "comment_text": "What I meant was Italys nationwide air traffic strike that has resulted in thousands of cancelled flights lately. This is happening all over Europe from what I hear. What I wanted to know if this was just a temporary thing or will these strikes continue to happen in August/\nSeptember. Does anyone know?"}, {"username": "Frances McDonagh", "comment_text": "It can be hit and miss there was train strike on 13th we got the train to Florence on Florence Airport trouble on 15th we flew out on 16th we were lucky. Its like in France they can just announce a strike. You really can't arrange sometimes there could be a delay sometimes not on buses/train"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195344857531259", "text": "Has anyone actually received thier lost bag back? It's been a month so far. Still waiting for Luftansa to reimburse for items purchased. Yes I have travel insurance but would honestly just like my bag back", "link": "facebook.com/groups/1373361046396315/permalink/2195344857531259/", "likes": 0, "comments": []}, {"id": "2195346540864424", "text": "Has anyone found a nice hotel/air b n b or villa in Ischia with a pool and maybe a play area for children?", "link": "facebook.com/groups/1373361046396315/permalink/2195346540864424/", "likes": 0, "comments": []}, {"id": "2195347790864299", "text": "Which has the more stunning beaches and more appropriate for children? Puglia or Calabria ?", "link": "facebook.com/groups/1373361046396315/permalink/2195347790864299/", "likes": 0, "comments": [{"username": "Grace James", "comment_text": "Both are very good, the specific choice is more appropriate, you should ask your child's opinion😅"}, {"username": "Carolina Barnhill", "comment_text": "Puglia, on the Ionio side, but it is very busy in the summer so be careful. If you are interested I can suggest you two places that have their own sand beach"}, {"username": "VF Schimmenti", "comment_text": "Puglia"}, {"username": "Phyllis Flowers", "comment_text": "Calabria is gorgeous too"}, {"username": "Anthony De", "comment_text": "Tropea.."}, {"username": "Magdalena Tutak-Bik", "comment_text": "Puglia"}, {"username": "Kim Paetsch", "comment_text": "Is it sand or rock?"}, {"username": "JoLynn Waters", "comment_text": "Tropea, Calabria, Cefalù, Sicily. Otranto, Puglia"}]}, {"id": "2195349974197414", "text": "Im looking for a hotel recommendation in Naples for the last night of the trip close to the airport (6:00 am flight) , possibly near some good restaurants or something to do to wrap up the trip.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2195349974197414/", "likes": 0, "comments": [{"username": "Giuseppe Placi", "comment_text": "Hotel Piazza Bellini"}]}, {"id": "2195355290863549", "text": "Hi, just wondering if there are any storage lockers or somewhere to place luggage in or near Cinque Terre? I will be near and I want to spend the day but I will need to keep heading north unfortunately.", "link": "facebook.com/groups/1373361046396315/permalink/2195355290863549/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "If you google luggage storage cinque Terre, you will find what is available. We just did it for Rome based on where we wanted to drop our bags and got several options to pick from. Usebounce.com is a standard one that you can check as well. We used stowyourbags.co\nm for ours."}, {"username": "Steph Craddock", "comment_text": "There is a place in Riomaggiore. As you come out of station instead of turning right through the tunnel, go straight on past the bar on your left. On right there is a place to store luggage."}]}, {"id": "2195356610863417", "text": "I am looking for some advice on car service options. We will be staying in Monevarchi in Tuscany. It’s our 20th anniversary in late September and I have dinner planned in Florence for the actual night. While we have a rental car, I would prefer to have a car service so we can enjoy wine and drinks. It’s about a 35 mile, 50 minute drive. I know Uber is not really an option and looking online has been a mix of outrageous prices and cheaper, but possibly dodgy options. So does anyone have experience, advice, or suggestions? Thanks you!", "link": "facebook.com/groups/1373361046396315/permalink/2195356610863417/", "likes": 0, "comments": [{"username": "Marie Barré", "comment_text": "I don’t know exactly when you are going but you can try this guy. He’s who we used and were very pleased. He books out quickly though.\n\nhttps://\nalessandrocammil\nli.wordpress.co\nm/"}, {"username": "Jim Hash", "comment_text": "If you drive use Google or Apple Maps and set your location to SMN train station. It’s outside the ZTL areas and has good parking."}]}, {"id": "2195367640862314", "text": "Best tours in Venice without Gondola ride?", "link": "facebook.com/groups/1373361046396315/permalink/2195367640862314/", "likes": 0, "comments": [{"username": "Brian Osman", "comment_text": "Just wander around and enjoy 😉"}]}, {"id": "2195358637529881", "text": "Does anyone know if tours/boat trips from Sorrento to Ischia are offered in first week of October? We've been searching but seems it may not be offered after September. Any help is appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2195358637529881/", "likes": 0, "comments": [{"username": "Carine Brys", "comment_text": "They must be. We did a private boat tour to Capri early October."}]}, {"id": "2195360840862994", "text": "Looking for a good cooking class for family of 6 in Rome. The one we were quoted was 1200 Euro for a 4 course pasta making class which seemed a little high (200 per person for the food we make?)", "link": "facebook.com/groups/1373361046396315/permalink/2195360840862994/", "likes": 6, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Did you look at Viator or Get Your Guide? They aren’t cheap but you can find less expensive ones. The one we did was about $60 pp. it was a pizza, pasta, and gelato making class in Florence. A better class will likely cost closer to $100pp. If you can find one of the ones in a farmhouse that is a great experience."}, {"username": "Stacy Prestigiacomo", "comment_text": "We just did this one and it was great ! Took a short train ride to this town , was a very cute town . Fun class, delicious pasta"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "In Rome Cooking"}, {"username": "Nhora Andrea Holmes", "comment_text": "Rimessa Roscioli"}, {"username": "Soumya Jonnalagadda", "comment_text": "Pastamania"}, {"username": "Yvonne Dionne-Parks", "comment_text": "Following"}, {"username": "Rita Levi Montalbano", "comment_text": "Come to milan i will teach you how to make pasta at home for a fifth of that price lol"}, {"username": "Kathy Flood", "comment_text": "Check with air bnb experiences. We did one in Florence and it was amazing. Ours had unlimited wine!"}, {"username": "Joy Buenaflor", "comment_text": "Is this a private cooking class? May be the reason why $200/person."}, {"username": "Kelly Huntley Clark", "comment_text": "We just did one through Riccardo Cooking Class! It seemed reasonable and was so much fun."}, {"username": "निनावी सहभागी", "comment_text": "Yes private is preferred but it would be fine with a little more people"}, {"username": "Jaime Webber", "comment_text": "In Rome was great for our family of 4, $89 pp"}, {"username": "Janice Rea", "comment_text": "We paid 110 euros per person"}, {"username": "Paulinha Cã", "comment_text": "We will try RIMESSA ROSCIOLI - Via del Conservatorio 58\n\nPrice: 125 euros pp, Weekdays at 12pm and Saturdays at 10am.\n(IF children or non drinker - price is 110 euros)\n\nFresh handmade pasta - 2 types\nMeatballs\n3 Pastas (Amatriciana, Carbonara and Cacio e Pepe)\nTiramisu\n5 wines paired\nThis is not just a cooking class, but also includes a wine tasting and pairing."}, {"username": "Linda Brecher Bekoff", "comment_text": "Cooking in Rome/\nTrastevere. Chef Andrea. Classes 10 people, hands on, amazing lunch. Book directly with him. Deposit required."}, {"username": "Paige Montecalvo", "comment_text": "Did you check Airbnb Experiences? There are tons on there"}, {"username": "Friedemann Diederichs", "comment_text": "Yeah a ripoff."}, {"username": "Claire Seears", "comment_text": "Can everyone put up links to the ones that they have done so I can book also please"}, {"username": "Stephanie Cristiano", "comment_text": "https://\nwww.facebook.com\n/\nConvivioRome?mib\nextid=LQQJ4d"}, {"username": "Shawna Mcdonald Sapp", "comment_text": "Look on www.cesarine.co\nm we booked our in Florence in there but they have other locations"}, {"username": "Susan Marie", "comment_text": "I love this idea! If anyone has done this, would you please also post the links to book or get information. 😊"}]}, {"id": "2195368127528932", "text": "Am taking the fast speed train from Rome to Napoli Afragola station and then have to quickly find bus italo 1001 to Pompeii, where can i find this bus? Have less than 15 mins to exchange 😫", "link": "facebook.com/groups/1373361046396315/permalink/2195368127528932/", "likes": 5, "comments": [{"username": "Dottor Peppe Insigne", "comment_text": "the bus you need to take is always run by Italo, it will surely be outside waiting for you, don't worry"}, {"username": "Paolo Mittiga", "comment_text": "They just created a fast train from Rome to Pompei"}, {"username": "Lisa Jones", "comment_text": "Or, you could catch the Pompeii train from Napoli train station"}, {"username": "Ros Birch", "comment_text": "The train to Pompeii (Circumventia) leaves from the underground platforms in Napoli Station."}, {"username": "Rhona OConnor", "comment_text": "Use Google maps and you will get directions"}, {"username": "Tony Di Ruocco", "comment_text": "Are you sure Napoli Afragola?\nI never seen buses there\nNapoli Centrale is way easier"}, {"username": "Colleen Jennings", "comment_text": "Use google maps on your phone - set it up while you’re on the train then press “go” as you get off the train."}, {"username": "Carina Watson", "comment_text": "You shouldn’t be going to Afragola, that’s out in the sticks. Go into Napoli Stazione Centrale and jump on a train to Pompeii.. they are extremely frequent."}, {"username": "John Salami", "comment_text": "Check Rome2Go.com , it will show you several options."}, {"username": "Jaime Cleek", "comment_text": "Make sure you're in the right station too. It may leave out of Napoli centrals and not the one you're coming into"}, {"username": "Matthew Cawley", "comment_text": "Should be right outside the front. We did Rome to that station and then bus to sorrento. We came out and was directly in front of station"}, {"username": "Antonella Piccolo", "comment_text": "Check the app it will tell you"}, {"username": "Gilles Laplante", "comment_text": "À la gare de train de Naples, prendre le tram vers Pompéi… pas cher, pas de bus…"}, {"username": "Carolyn Esposito", "comment_text": "We got out of that station and the bus was right at the end and we double checked with them and that was it. ￼ Bus took us right to Pompeii."}, {"username": "Marianna De Maio", "comment_text": "That does not seem like a solid plan, 15 minutes isn’t enough, trains do collect at least some small delayes more often than not and even if it didn’t it could take u 10 minutes just to unboard the train. It would be easier to just catch the train to Pompei from the Naples station instead of getting off in Afragola, where if something goes wrong u don’t have lot of options, Naples would make way more sense"}, {"username": "Marika Dimitriu", "comment_text": "Napoli Afragola is a different station you have to stop in Napoli centrale!"}, {"username": "Salvatore Giardina", "comment_text": "I would hire a taxi"}, {"username": "Lauren-Jade Roberts", "comment_text": "Stay on the fast train to Napoli Garabaldi. From there get the local train toward sorrento - get off at Scavi Pompeii after about 30 mins and then you’re at the entrance to Pompeii - 15 mins is tight though but the local trains are every 15 mins or so so get on the next one"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Take an earlier train from Rome. 🤷🏼‍♀️"}, {"username": "Frank Hunt", "comment_text": "I thought a train ran to Pompei??"}, {"username": "Elizabeth Grafel", "comment_text": "Never on time!"}]}, {"id": "2195374940861584", "text": "Best wine country tours?", "link": "facebook.com/groups/1373361046396315/permalink/2195374940861584/", "likes": 0, "comments": []}, {"id": "2195374794194932", "text": "Best tours in Florence", "link": "facebook.com/groups/1373361046396315/permalink/2195374794194932/", "likes": 3, "comments": [{"username": "Maureen McCall Bradley", "comment_text": "We had a wonderful city tour with Vanessa Tonarelli! Then we booked a couple museum tours with her as well. Amazing!!\nMessage Vanessa direct.\nWe also did the pizza and gelato tour with Walkabout Florence. We did the full day Sienna, San Gimignano and Pisa with a wine tasting lunch too.\nwww.walkaboutfl\norence.com"}, {"username": "Kristine Gutierrez Campbell", "comment_text": "Chianti region tour was great!"}, {"username": "Mariana Chaves", "comment_text": "Following"}, {"username": "Michael Westlake", "comment_text": "Fun in Tuscany, vespa wine tour"}, {"username": "Jeff Gentner EA", "comment_text": "Check out Walks of Italy. We took some wonderful tours in Florence with them."}, {"username": "Kim Geary Keidel", "comment_text": "We did private all day tour with Belitaly. It was amazing! Beki will adjust the tours as you want and/or make suggestions. I got his name from a FB post here."}, {"username": "Kath Milburn", "comment_text": "Fat Tire Tours - Segway tour is brilliant. Also food tasting tours - Florence Food, and Wine Walking Experience led by a Local Food Expert see Trip Advisor. Both excellent."}]}, {"id": "2195377344194677", "text": "Is it worth it to take a day trip from Florence to a beach? Where would you recommend and how would you travel there?", "link": "facebook.com/groups/1373361046396315/permalink/2195377344194677/", "likes": 3, "comments": [{"username": "Jenn Messina Babore", "comment_text": "I think it depends on how long you are staying in Florence. You could go to Viareggio."}, {"username": "Anne Brooks Easter", "comment_text": "We did a day trip to Viareggio! It was great! Quick train ride and pay for private beach. We walked from train station and stayed at Bagno Maurizio, with wonderful concierge Stefano."}, {"username": "Linda Schauer", "comment_text": "Sarah Marie"}]}, {"id": "2195378307527914", "text": "Best and most fun cooking class in Sorrento or Rome and why?", "link": "facebook.com/groups/1373361046396315/permalink/2195378307527914/", "likes": 0, "comments": []}]