[{"id": "2210896182642793", "text": "Can some one recommend a good hotel in Florence and not expensive ?\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2210896182642793/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2334\n91-Reviews-Hote\nl_Orto_De_Medic\ni-Florence_Tusc\nany.html"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "How much is not expensive for you?"}]}, {"id": "2210898479309230", "text": "Hello! Can you recommend me some regions in Italy to spend the next summer? I’ m looking for a agritourism guesthouse we can have all meals there. I’ m planning to stay 2 weeks with my child and my husband.", "link": "facebook.com/groups/1373361046396315/permalink/2210898479309230/", "likes": 0, "comments": []}, {"id": "2210903145975430", "text": "Does anyone know where I can buy compression footie socks? I am heading to Venice from Florence tomorrow. My feet are swelling something awful!", "link": "facebook.com/groups/1373361046396315/permalink/2210903145975430/", "likes": 0, "comments": [{"username": "Tina Norris", "comment_text": "Any pharmacy"}]}, {"id": "2210909319308146", "text": "Need advice on how to get from our hotel in Venice to Marco Polo airport for our 6:30 am flight?", "link": "facebook.com/groups/1373361046396315/permalink/2210909319308146/", "likes": 1, "comments": [{"username": "Jackie Macleod", "comment_text": "Private water taxi. Your hotel can book for you if you prefer."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nVenice-Marco-Pol\no-Airport-Link-\nDeparture-Trans\nfer/\nd522-2495VENHTLA\nPT?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}, {"username": "Colleen Robinson", "comment_text": "If you are close to the train station/bus station, taxis have a spot where they come every 15 min to pick you up. Cost was 40 Euros.Our flight was at 6, we thought we needed to get to the airport 3 hours ahead..... Noone was at the counters until around 4."}]}, {"id": "2210910142641397", "text": "Any wine tasting tours not far from the Port of Livorno? or the Pisa Area?", "link": "facebook.com/groups/1373361046396315/permalink/2210910142641397/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Tuscany/\nWinery-Tour-and-\nTasting-at-The-\nWinery-near-Liv\norno/\nd206-17024P1010?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2210803042652107", "text": "Stop going to the academia just for david when there's one for free if you're in a pinch choose uffizzi over accademia!\n\nEdit.\nI think a point a lot of you are missing is the fact I said in a pinch, this is a solution for people who are wanting to see a lot of art but don't have a lot of time or a specific interest in sculptures.\nIf you loveआणखी sculptures and casts you'll love the Accademia.\nIf you don't have a lot of time you want to see a mix of both paintings, famous paintings at that, you have a chance to see Leonardos, and of sculptures, because they do have a vast collection of statues too, the Uffizi is the best choice.\nI'm also saying this because a lot of people just go in for the David maybe realize that there's another couple Michelangelos but they are there for the David and then they kind of leave, I understand being in a rush but at that point you're wasting your money and time.", "link": "facebook.com/groups/1373361046396315/permalink/2210803042652107/", "likes": 7, "comments": [{"username": "Cindy Shore", "comment_text": "The statues of David outside in the piazzas are replicas only, not the original. You must go to the Accademia if you want to see the real David carved by Michelangelo."}, {"username": "Gena Diaco Penland", "comment_text": "Those arent the originals….they\nare replicas. The Academia is definitely worth the trip!"}, {"username": "Wendy Spano Bracco", "comment_text": "Not everyone wants to see a ton of art. Going to the Academia makes sense in this case. Especially if you are short on time."}, {"username": "Anna Gambino", "comment_text": "Seeing David in person took my breath away. Had been waiting to see him since I studied History of Art in college. Worth the 40 year wait."}, {"username": "Marina Rosa Moni", "comment_text": "I think a point a lot of you are missing is the fact I said in a pinch, this is a solution for people who are wanting to see a lot of art but don't have a lot of time or a specific interest in sculptures.\nIf you love sculptures and casts you'll love the Accademia.\nIf you don't have a lot of time you want to see a mix of both paintings, famous paintings at that, you have a chance to see Leonardos, and of sculptures, because they do have a vast collection of statues too, the Uffizi is the best choice.\nI'm also saying this because a lot of people just go in for the David maybe realize that there's another couple Michelangelos but they are there for the David and then they kind of leave, I understand being in a rush but at that point you're wasting your money and time."}, {"username": "Luanne Carey", "comment_text": "There's a big difference if you're actually interested in Michelangelo."}, {"username": "D'Anna Hohe", "comment_text": "I think that unless people are fairly interested in art, they should skip the Uffizi if they are short on time. It is huge and overwhelming unless you have some knowledge and a lot of interest. The Academia takes much less time, and seeing the original David is impressive for most people. If you are just going to look at a replica, you might as well skip the trip and look at photos on the internet!"}, {"username": "Ruth Hackert", "comment_text": "Thanks for the tip….I still want to go to Accademia 😊"}, {"username": "Bill Elias", "comment_text": "Michelangelo, one of the world's most famous Gay artists."}, {"username": "Romana Svítková", "comment_text": "Don't go to Paris to see the Eiffel tower when there's one in Las Vegas!"}, {"username": "Stacey Cohen Sturner", "comment_text": "My husband, who is not much of an art aficionado, reallllllly appreciated seeing the original David. It was his fav part of visiting Florence, which honestly surprised me... in a good way. We skipped the Uffizi, even though I love La Primavera. (I had studied art in Florence, so personally have seen it all many times.)"}, {"username": "Ken Lerch", "comment_text": "This is bad advice; I don’t care if she is an “art history student.” How many copies of Rodin’s “Thinker” do you suspect there are? Besides, some of my favorite Michelangelo’s are the emerging slaves in the gallery in front of the David."}, {"username": "Michelle Laird", "comment_text": "You can't compare the replica David to the original. The original is stunning and a must see if you're there."}]}, {"id": "2210915902640821", "text": "Restaurant recommendations in Bellagio for September 2023? Looking for authentic not tourist trap. Also any hiking recs?", "link": "facebook.com/groups/1373361046396315/permalink/2210915902640821/", "likes": 0, "comments": []}, {"id": "2210917019307376", "text": "Thinking of visiting the Cinque Terra and wanting advice for accommodation location on the coast and what is the best town/village should we stay in.\nWe only have about 3 night on the coast all up so should we stay in one place for 3 nights and just visit the other towns as a day trips (this option would be more relaxing) or should we stay in difference towns each night?\nWe will be coming from Milan through Cinque Terra to Florence via train.\nThanks in advance for advice.", "link": "facebook.com/groups/1373361046396315/permalink/2210917019307376/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187819-d6173\n21-Reviews-B_B_\nand_Apartments_\nDa_Baranin-Mana\nrola_Cinque_Ter\nre_Italian_Rivi\nera_Liguria.htm\nl"}, {"username": "Dianne Smith Durham", "comment_text": "We stayed in Manarola at an Airbnb. & then took the train to visit the other cities. Bought CT train pass online & very easy to use. Monterosso is the least hilly if that’s a consideration. Our Airbnb had a pretty steep 10 minute climb but also an incredible view. We left our suitcases in luggage storage in La Spezia & just took backpacks to CT."}, {"username": "Rosa Zordan", "comment_text": "Stay in one place and visit others."}, {"username": "Renae Larcus", "comment_text": "Monterosso is bigger with more options. And a beach. Train or ferry or hike to the other towns"}, {"username": "Kimberly Lampros", "comment_text": "We stayed 3 nights in Riomaggiore. There's no need to move around since it's so easy to visit the other villages."}, {"username": "Marian Van Soelen Hand", "comment_text": "We stayed at Hotel Porto Roca in Monterosso for 3 nights and went by train to other towns. It was lovely!"}, {"username": "Terri Bradford", "comment_text": "We’re staying 3 nights in La Spezia. Plan to take the trains to the villages"}, {"username": "Anna Buchan", "comment_text": "Stay in monterossa you can do a ferry or train to the other towns"}]}, {"id": "2210917885973956", "text": "Hello I am looking to fly to Italy and carry a small personal item bag with me. On the way back I want to check a bag. I would like to buy the luggage bag in Italy to bring back wine olive oil and basalmic vinegar. What would be equivalent to a Walmart over there to buy cheap luggage?", "link": "facebook.com/groups/1373361046396315/permalink/2210917885973956/", "likes": 21, "comments": [{"username": "Anthony Martini Jr.", "comment_text": "Any shop or street vendor, they are everywhere"}, {"username": "Line Gregoire", "comment_text": "You can buy one on the street( souvenir) that's what i do."}, {"username": "Fetchin Gretchen", "comment_text": "Those things require special packaging it is better to have a specialist do. Gets a box with a handle."}, {"username": "Deborah Larsen", "comment_text": "You can find suitcases at a common store Scarpamond it s called Shoe World I’m Italian. Think DSW shoe."}, {"username": "Costero Home", "comment_text": "Any of the shops/\nmerchants that you buy from will typically ship your purchases anywhere in the world. An easy and simple solution."}, {"username": "Caren Murray Kleinman", "comment_text": "Here is what we use. We’ve used both the bubble wrap and air types. Both work fine. We almost always bring back something liquid. Usually wine. We have never had a bottle break…. We just put them in our luggage and pad with our clothes."}, {"username": "Jaime Cleek", "comment_text": "They are all over the streets and not that expensive"}, {"username": "Lucy Teneyuque", "comment_text": "I would buy a hard sided checked suitcase and use Wine Angels(Amazon).\nWe brought back wine, olive oil, vinegar & honey. Everyhing was intact when we got home."}, {"username": "Lucrezia Folger", "comment_text": "Buy at any of the flea markets. Bring wine envelops for your oil and balsamic , plus extra bubble wrap & tape. I do it all the time."}, {"username": "Tara McCloud Odebrecht", "comment_text": "My experience doing this wasn’t great. I found most of the places we had access to were very expensive (tourist traps) and the suitcase was actually garbage making it difficult to navigate to the airport. Can you take something with you? foldable duffle with you to use as a carryon on the return trip and use your original carryon to check?"}, {"username": "Laura Irmina", "comment_text": "Chinese shop or Globo"}, {"username": "Janet Messanelli Bozzone", "comment_text": "I bought 1 at the markets. I think I paid 25€."}, {"username": "Shelagh Kosinski", "comment_text": "Monoprix"}, {"username": "Stuart Parnell", "comment_text": "I remember bringing back wine from France in my checked bag. It was really special when it burst open."}, {"username": "Pam Kimak", "comment_text": "There were plenty of small carry on bags for sale reasonably priced when I was there last month in the outdoor market area."}, {"username": "Cugina Jax", "comment_text": "Go on their equivalent of Marketplace and buy used."}, {"username": "Sue Morgan", "comment_text": "If you can check a bag at no charge going over, just check an empty one that your carry on will fit into. You can merge them till you need to use them. Also, pack empty amazon used bubble bags in the empty suitcase and maybe some smaller boxes. I have used them to pack breakables. I also pack a small roll of packing tape. Anything I don’t need I can trash."}, {"username": "Tracey Fairbrother", "comment_text": "I always take a roll of bubble wrap it's lightweight takes hardly any room and you can use it for allsorts of fragile purchases."}, {"username": "Prisca Aroomoogum", "comment_text": "Do what my best friend does. She packs a suitcase and then fits it into an empty suitcase, to fill up on her return.\nYou’ll save money and space on the second suitcase.\nIsn’t she a genius ?"}, {"username": "Bianca Zuvic", "comment_text": "Why don't you just take one over empty if you already have one. Check it in. Done."}, {"username": "Aaron Swain", "comment_text": "Thank you for all the responses!!!"}, {"username": "Aaron Swain", "comment_text": "I really like the idea of bring the carry on with me with the stuff I would need in it to protect my wine. Can I keep it locked up at the train station till I need it? What would that cost?"}, {"username": "Maria Al", "comment_text": "We ended up checking our carry on on the way back and put some stuff in a duffel I had brought with us to use as a carry on. The wine was in that checked bag, cushioned by our clothes, in vaccuum bags just in case of breakage."}, {"username": "Lisa Roth", "comment_text": "I think “wine,” “vinegar,” and “cheap suitcase” don’t belong together. It sounds like a recipe for regret."}, {"username": "Melissa Buck Martin", "comment_text": "Use sturdy checked bag on way there plus bring an extra packable/ fold up backpack to put your clothes into as a carry on for the plane ride on the way back. Use your study checked suitcase for your purchases."}, {"username": "Theresa Vinciguerra", "comment_text": "I would pack a duffle in your suitcase. Pack your oil and liquids well in your suitcase and the duffle with your clothes..shoes etc . I've done several times with no breakage"}, {"username": "Dana Disiena Medina", "comment_text": "Following"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We only used carryon luggage but did shopping for gifts while there. We bought a good size tapestry bag from a street vendor, put dirty clothes in it and put our souvenirs in our carryons to bring them home and put the dirty clothes in the new bag. Worked out great."}, {"username": "Sherry Somers Willome", "comment_text": "Florence has outside second hand sales -- you could check when they are..."}, {"username": "Jan Wallace", "comment_text": "I purchased a cheap bag for $65 , the shops are all over, I also shipped olive oil and got screwed, told me it would be $59, got back home and sent me an invoice for $300 more!"}, {"username": "Claire Buccini", "comment_text": "Dependant where you are going.you can buy luggage in many little souvenir shops in Rome, what do you think is cheap? We have also bought stuff from globo as well."}, {"username": "Kejdi Okej", "comment_text": "Dependat where you are going . You can buy luggage in many little souvenir shops in rome what do you think is cheap we have also bought"}, {"username": "Chiara Normanno", "comment_text": "Not sure about Walmart quality but here in Italy most of us buy cheap luggage in chinese-owned shops (\"dai cinesi\"). If you want a slight better quality look for shops such as Carpisa, Scarpe & Scarpe etc but most banally even Primark in Milan Center is ok (or other chains like Tedi, Kik, Action etc)"}, {"username": "Joe Guzzi", "comment_text": "Chinese shops, they are everywhere. And yes, we have bought good quality luggage in such shops."}]}, {"id": "2210930355972709", "text": "My husband and I will be in Rome in October. I really want to take a day trip to Pompeii, but I want to figure out the best way to do it. I’d like to just take the trains, but they don’t have a lot of returning trains listed online right now. Do they post more as it gets closer, or are they just that limited? I figured we’d go from Rome to Naples and Naples to Pompeii and back. I’ve seen guided tour options but they seem to be buses and I’d like to avoid that if possible. TIA 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2210930355972709/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "have a look here https://\nwww.viator.com/\ntours/Rome/\nPompeii-Day-Trip\n-from-Rome/\nd511-3731VESUVIU\nS?pid=P00070587\n&mcid=42383&med\nium=link&medium\n_version=select\nor"}, {"username": "Edith Nagy-Villi", "comment_text": "From Naples take the circumvesuviana\ntrain either from Porta Nolana or Garibaldi. Although I recommend porta nolana, less crowded. You get off at Pompei cross the street and you are at the entrance. I recommend to have the full day for Pompei and get the audio guide."}, {"username": "Rosa Zordan", "comment_text": "Yes travel by train, check returning times when you get there and don't be late. Pompei is just wonderful. I've been 4 times each for 7 hours and would go back there in a heart beat. Just grab a tour book and off you go, no need to go with a tour."}, {"username": "Tony Foti", "comment_text": "Take frecciarossa from Rome termini to napoli centrale. Then go down stairs and take three circumvesuviano\ntrain and get off at pompei scavi stop."}, {"username": "Fetchin Gretchen", "comment_text": "I suggest you book with the trainline app.\n\nAccording to a google search, here are a few ways to get from Rome to Pompeii by train. You can take a direct train from Rome Termini to Pompeii Scavi station, which is the closest train station to the ruins of Pompeii. This train is only available on Sundays from July to October, and there is only one train per day. The journey time is about 2 hours and 15 minutes.\n\nIf you are not traveling on a Sunday, you can take a train from Rome Termini to Napoli Centrale station in Naples. From there, you can take a regional train to Pompeii Scavi station. The journey time from Rome Termini to Napoli Centrale is about 1 hour, and the journey time from Napoli Centrale to Pompeii Scavi is about 30 minutes.\n\nThere are many trains available from Rome Termini to Napoli Centrale, so you should be able to find a train that fits your schedule. The regional trains from Napoli Centrale to Pompeii Scavi are less frequent, but you should still be able to find a train that works for you.\n\nI checked the train schedules for October, and there are a few returning trains listed from Pompeii Scavi to Rome Termini. The number of returning trains will probably increase as it gets closer to October.\n\nIf you are not comfortable taking the train, you can also take a guided tour to Pompeii from Rome. There are many different tour companies that offer guided tours to Pompeii, and some of them even offer transportation from Rome to Pompeii.\n\nHere are some tips for taking a day trip to Pompeii from Rome by train:\n\n* Book your train tickets in advance, especially if you are traveling on a Sunday.\n* Allow plenty of time for travel, especially if you are taking the train from Rome Termini to Napoli Centrale and then the regional train to Pompeii Scavi.\n* Wear comfortable shoes, as you will be doing a lot of walking at Pompeii.\n* Bring sunscreen and a hat, as it can be hot in Pompeii in October.\n* Pack a water bottle, as there are no water fountains at Pompeii.\n* Be prepared to wait in line, as Pompeii can be very crowded, especially in October.\n\nI hope this helps!"}, {"username": "Dann Hrusch", "comment_text": "I randomly picked 10/17 and there's at least one return train every hour until 9:00pm. Try Google Maps, and switch from car to train and it will let you choose date and time and show the options within that hour."}, {"username": "Alicia Burno", "comment_text": "We are doing that now and by trains"}, {"username": "Lisa Martin", "comment_text": "I have just booked a tour from Rome to pompei found that a better alternative as it includes train, bus lunch and other places to visit."}]}, {"id": "2210922645973480", "text": "My good friend and I will be staying in Salerno when we're in Italy in September. I'd love to do a day trip to Naples. I've never been so wondering which area would be good to see and what are the best options for getting around. Thanks for any help.", "link": "facebook.com/groups/1373361046396315/permalink/2210922645973480/", "likes": 2, "comments": [{"username": "Chiara Normanno", "comment_text": "How long are you staying in Salerno? There's stuff to see here too. As for Naples, you will need a train plus metro or bus tickets to explore the center of Naples"}]}, {"id": "2210939365971808", "text": "I heard of the night tour of rome- which did you like and how do I book it. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210939365971808/", "likes": 5, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nnaples-royal-pal\nace-caserta/"}, {"username": "Stephen Henn", "comment_text": "We booked Viator’s Rome by Night with Pizza & Gelato for our day of arrival. It was a good way to see major sites lit up at night. Driver took us up to each location and we had time to walk around. Pizza or pasta meal was at a restaurant in Piazza Navona."}, {"username": "Michael Stevens", "comment_text": "I done ot last night, I would highly recommend it. Go onto Sightseeing Rome then select 'night tour' booked and pay online"}, {"username": "Christine Sanci-Gentile", "comment_text": "Loved it! Mybesttour.com"}, {"username": "Joel Minter", "comment_text": "Alicia Thompson Minter"}, {"username": "Sandra Monacelli McNall", "comment_text": "Meredith Bradley"}, {"username": "Iman Nazaran", "comment_text": "Following"}]}, {"id": "2210918592640552", "text": "What is the age limit for jet skiing around Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2210918592640552/", "likes": 3, "comments": [{"username": "Anthony Martini Jr.", "comment_text": "90 🤣🤣🤣"}, {"username": "Sergio Milone", "comment_text": "Sergio Milone"}]}, {"id": "2210925435973201", "text": "To see the ruins of Pompei which ticket should I buy? I want to see the ruins and Mt. Vesuvius in one day. And should I go to Herculaneum as well?", "link": "facebook.com/groups/1373361046396315/permalink/2210925435973201/", "likes": 1, "comments": [{"username": "Inger Karin Røe Ødegård", "comment_text": "I will realy recomend Herculanum👍"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Pompeii/\nPrivate-Tour-Day\n-Trip-Excursion\n-to-Herculaneum\n-Mt-Vesuvius-an\nd-Pompeii/\nd24336-16006P5?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Chris Fowler", "comment_text": "I recommend not doingPompei and Herculaneum in the same day."}, {"username": "Ewa Kolodziej", "comment_text": "Expectation and reality it’s completely different story"}, {"username": "Michael Barnes", "comment_text": "You will not enjoy yourself if you try to do two, much less three in one day.\nPompeii is an all day experience if you include eating an transport."}, {"username": "Edith Nagy-Villi", "comment_text": "I did Pompei and Vesuvius in one day but do not recommend to do the same. You can do Vesuvius and Herculaneum in one day and Pompei another day."}, {"username": "Wendy Wallin", "comment_text": "Are there plenty of trains returning to Naples if we train to Herculaneum? Seem plenty going down but not sure about returning."}, {"username": "Andrea Corey Andrews", "comment_text": "Way to much in 1 day"}, {"username": "Paul Anderson", "comment_text": "You should visit Herculaneum as it is much better persevered. The beach bath there is amazing. Opalants is the most amazing of the three sites. If I only could go to one it would be opalants as is is perfectly preserved and was a royal residence on the beach with an Olympic size swimming pool! If you you to Pompeii don’t miss the house of mysteries. It is outside of the town going north from the marina gate on the old Roman road."}, {"username": "David King", "comment_text": "We’ve done Pompeii a couple of times. ￼\nIt is not the kind of place you just run through. If you do that, and you’ll miss the point all together!!\n\nEach time we’ve gone (fall and spring), the crowds were massive, squeezing into houses or points of interest, which are indeed with the 2-5 minute wait to walk into some of them.\n\nOur day at Pompeii last year was basically a morning train from Naples to Ercolano, then we walked to the entrance. Did the morning and mid day in Pompeii and then took the train back to Naples for a late lunch. By the time our lunch (pizzas) and coffees concluded it was 4 PM, which was perfect. Had zero energy or interest to do anything else before dinner time.\nThe sun was brutal and draining… umbrellas and hats were almost pointless so be prepared if it’s warm when you go (bring drinking water!!!)"}, {"username": "Crisandra Giorno", "comment_text": "We found the most amazing lil room at a place called Francos Villa, it was right down the street from Pompeii, the family made an amazing authentic Italian dinner for all the guests and they had a pool and we woke up to a delicious breakfast, it was the best meals we had in all of Italy. We walked to Pompeii and spent the day there then went to herculeum and headed to sorrento and Capri for a cpl nights. On our way back we found another family owned lil hotel right on Mt vesuvius, we woke up and they made a big breakfast with the most amazing view, and hiked vesuvius before heading back to Rome. Those 2 small family hotels were the best stays in all of Italy. We didn't plan those stays ahead of time, because of the weather we had to leave Rome a day early so we just found it online on our way driving to Pompeii."}, {"username": "Pooja Patel", "comment_text": "I think it depends on how much of Pompeii you want to see. I don’t think I’d be able to spend more than 3 hours there and don’t want to take a tour.\n\nWe’re planning to take the first train from sorrento to Pompeii, take the bus up to mt Vesuvius, do the hike, take the bus back to Pompeii. Explore Pompeii. Depending on how long we spend in Pompeii, we’ll either take the train back to sorrento or take it up to Herculaneum and then the last train back to sorrento. Planning for lunch in Pompeii and dinner in either Herculaneum or sorrento!\n\nThe Rome to rio app has been helpful to gather train times!"}, {"username": "Debra Quinney", "comment_text": "Much prefer Herculaneum to Pompeii it’s smaller so easier to navigate and much better preserved it would be way to much to try and do all 3 even2 will be a push"}, {"username": "Max Perletta", "comment_text": "Guided tour 41 € fo person, without 21€, about Pompeii ruins."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2210933575972387", "text": "Beauty of Rome 🤩\n#romeitaly", "link": "facebook.com/groups/1373361046396315/permalink/2210933575972387/", "likes": 30, "comments": []}, {"id": "2210935879305490", "text": "Planning a trip for my daughter's High school graduation gift. She wants to do authentic not touristy. She's a foodie and loves coffee. Recommendations. This will be her first trip out of the country. Planning on 2 weeks.", "link": "facebook.com/groups/1373361046396315/permalink/2210935879305490/", "likes": 7, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Puglia"}, {"username": "Lean Ni Chleirigh", "comment_text": "Italy is a hard place to avoid tourists. I’d either focus on smaller cities, or go to the south, and if possible go in May.\nMy favourite thing about Italy is going to food markets and using the local ingredients. If she likes the idea of this, then get somewhere with a kitchen.\nYou can also specifically google food routes of Italy. There’s a UK paper called The Guardian and they have really good travel articles."}, {"username": "Kejdi Okej", "comment_text": "Puglia"}, {"username": "Emily LeaTh", "comment_text": "Check out Bologna. There are tourists, but it’s not as popular a destination as other cities. There are lots of foodie tours, but I just watched a lot of videos and chose places that looked good."}, {"username": "Pia Reilley Loughin", "comment_text": "This place in Rome has the best espresso. A local told us to try it out. It was so delicious.\n\nhttps://\ncaffesanteustach\nio.com/"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "It depends. Would she rather visit museums and churches or go to sea cities?"}, {"username": "Ike Simoncini", "comment_text": "BTW indeed avoid places full of tourists look for the restaurant up the mountain or in quit places and ask locals where they eat"}, {"username": "Lucrezia Folger", "comment_text": "Winter is when to avoid tourists. Since she’s in High School it would be a good idea to get her involved in the planing and researching what her interests are. People are online so much anyway, include her in the research of places."}, {"username": "Emma Chadwick", "comment_text": "Bologna 👍🏻"}, {"username": "Elena Innocenti", "comment_text": "you can have authentic experiences in every city, even the most touristic ones. the important thing is choose the right places where eat and not those made only for tourists."}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "Cooking school at Casa Gregorio in a beautiful little hill top town between Rome and Milan. Not touristy at all. Daily cooking and food related field trips. Amazing coffee/\ncappuccino/\nespresso machine in common room of villa for any time of day coffee breaks. Check out their website. Can often find a good sale. One of our favorite trips of all time!"}, {"username": "Matthew Livio Conti", "comment_text": "Stay in a city/town you've never heard of to avoid tourists - make sure it has a train station. Take the train to Rome during the day - and return for dinner to your place. To go to Italy the first time and not-see the historical \"touristy\" sites will be a regret if she doesn't get to return."}, {"username": "Barbara Bastianini", "comment_text": "If it’s her first time I think she should at least experience a bit of Rome and Venice in spite of the crowds. After that I’d look at small towns or villages. The towns of the Veneto are great plus they’re near Venice.\n\nEveryone loves to be near the sea but if you don’t want touristy crowds I’d avoid both the Cinque Terre and the Amalfi Coast. The town of Camogli is a very pretty seaside village that provides a more authentic experience. There will be other visitors there, yes, but mostly those visitors will be Italians.\n\nTuscany is high on the radar of most tourists but if you want uncrowded snd suthentic I’d look into the still beautiful but less visited Tuscan towns. Pitligliano and Massa Marittima are both wonderful but are more authentic places. We’ve actually been the only foreigners in them on a few occasions.\n\nYou’re in for a treat no matter where you go!"}, {"username": "Valerie Collanton", "comment_text": "If you want to spend one week doing an authentic Italian small group tour check out the Bluone website. I have done all of these tours and they are truly fantastic."}, {"username": "Nicola Nts Donelli", "comment_text": "Out of which country?\nBtw, an Italian opinion. The 2 cities with the best coffee tradition in Italy are certainly Trieste and Napoli. Compaired to these two cities, every other espresso in Italy kind of sucks.\nI would suggest a trip from Trieste to Napoli. You would pass in different parts of the country, most of them non touristic, but it would be a very interesting trip.\nI would personally do 2 days in Trieste, one/two in Venice if you want to, one/two in Padua, two in Bologna, three/four around Perugia (Spoleto and Assisi, all these cities are small and close to each other).\nAnd the end in Napoli. You can also visit the wonderful island of Procida.\nAll these places are wonderful. Extremely beautiful. There is a lot of beautiful countryside too, and you would avoid all the tourists for the main part. Food is great and compared to the main tourist spots it would be cheap and more authentic imo. I would actually do this trip myself.\nAlso, all of this is very feasible by train."}, {"username": "Julia Salmon", "comment_text": "Florence can be touristy but it was really beautiful and my favorite from where we went. It is a popular city but didn’t feel very touristy at all. Rome felt way too touristy to us. As well as Positano. Florence didn’t feel that way to us"}, {"username": "Alison Roberts Yeh", "comment_text": "When in Rome, we always stay in a place called Hotel Golden. It’s in a neighborhood, out of the way, near Villa Borghese. It’s a walk, but we love it! The neighborhood is quiet, there are few tourists, and restaurants are great. Run by a family, who always give us fantastic suggestions."}, {"username": "Sande Ricci", "comment_text": "Florence is amazing! Maybe somewhere a lot of tourists don't go? We loved Genoa so much we are coming back next year and spend 10 days there. People also say to skip Milan but it is amazing as well."}, {"username": "Francesca Giovanelli", "comment_text": "Every place in Italy has a different food and a different wine, not even we Italians know the infinite specialties of our country. You can choose to visit the small villages (Tuscany for example)"}, {"username": "Steve Wolfrom", "comment_text": "Let her do her own research and suggest the excursions. Then you decide. It’s your trip too."}, {"username": "Amber Pena", "comment_text": "Italy!"}, {"username": "Dr-Jon Warnecke", "comment_text": "Umbria and Tuscany have many authentic towns with low tourism, along with great food, abundant history, and views unlimited"}, {"username": "Carol Taylor Tisdale", "comment_text": "I just took my granddaughter on a graduation trip end of May/first part of June. We were gone about 16 days. We spent 3 full days Rome then trained to Venice for 3 full days. Train to Florence for 2 full days then flew to Paris for 3 full days. I did not count the days we traveled. She loved the trip. We didn’t try to do too much. Only the most major sights. We shopped, ate fabulous food, drank delicious coffee, indulged in gelato, strolled. ♥️"}, {"username": "Kristen Rozansky", "comment_text": "I just came back from time in the Piedmont region. The food was incredible. Our time was spent visiting small towns and exploring restaurants and wineries and small farms making incredible cheese and other lovely, gourmet products. It was truly delightful and not overrun with tourists. We stayed in the region around Acqui Terme. I would highly recommend staying at an agriturismo and visiting small villages like Cessole, Bubbio and Barolo, and larger towns/cities like Alba. A really magical experience."}, {"username": "Diana Smith", "comment_text": "I don’t think you can skip Rome, first coffee in the airport with fresh brioche… 😋 The city is beautiful and the food is Amazing. I would visit the hills around the city and then go to Naples, best coffee, pastries and pizza! Beautiful city to visit.\nNot sure if you want to do the Amalfi Coast or go up North. Visit Umbria, Tuscany, Bologna, Milan…Venice…Ju\nst stop in random towns , you will be surprised by how every towns has something different to offer, food, churches, beautiful views… Have fun!"}, {"username": "Cindy Sguazzin", "comment_text": "PLEASE don’t let her miss Florence and Rome!"}]}, {"id": "2210936632638748", "text": "Any recommendations to stay in Milan.\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2210936632638748/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1213\n0410-Reviews-NY\nX_Hotel_Milan-M\nilan_Lombardy.h\ntml"}, {"username": "Muhamed El Sayed", "comment_text": "Keep near Milano Centrale train station, to do day trips easily"}, {"username": "Tony Foti", "comment_text": "Ibis milan is a very well positioned near metro stop. clean and won't cost the earth. Buffet breakfast is sensational"}, {"username": "Miklos Verdes Kovacs", "comment_text": "Stay! 💖"}, {"username": "Giovanni Caligula", "comment_text": "Airbnb. I fly there on Monday. I got a nice Airbnb."}, {"username": "Gary Fossaceca", "comment_text": "Hotel Berna"}, {"username": "Courtney Rey", "comment_text": "Hotel indigo Milan\nJust got back ⭐️⭐️⭐️⭐️⭐️"}, {"username": "Kristína Polovková", "comment_text": "Milan Retreats Duomo Suites"}, {"username": "Paula Debattista", "comment_text": "World Hotel Casatii 18, very clean,friendly staff and central"}, {"username": "Tiziana Haberthur", "comment_text": "Be Mate Via Tivoli in Brera...great location"}, {"username": "Gricel Guerra", "comment_text": "Gracias!!!!! Por la information los voy a checkear. Feliz día!"}, {"username": "Ann Moore-Pak", "comment_text": "Older part if the city. Dei"}, {"username": "Massimo Della Vita", "comment_text": "Budget?"}, {"username": "Kim Spencer", "comment_text": "Pepe Verde Italian\nBeautiful couple with delicious food!"}, {"username": "Ahmed Nashaat", "comment_text": "Star hotel front of station"}, {"username": "Yolanda Mena", "comment_text": "HD8 Milano cerca central station frente"}, {"username": "Toni Gmln", "comment_text": "Hotel Rio near Duomo Milan and train station"}]}, {"id": "2210941469304931", "text": "We will be in Sorrento from October 30th till November 5th. We are hoping to travel to all towns along Amalfi coast.. Will the ferries be running and will the restaurants and stores still be open? What can we expect at that time?", "link": "facebook.com/groups/1373361046396315/permalink/2210941469304931/", "likes": 0, "comments": [{"username": "Jenny Payne", "comment_text": "Depends on the weather if ferries are running , not much might be open as it is getting colder?🌻"}]}, {"id": "2210944982637913", "text": "Planning a trip for end of May or beginning of June. Going to Norway for a few days first, so will only have 7 days in Italy. This is our first trip to Europe and we’ll be traveling with our 2 sons who are in mid 20s. Thinking about visiting Rome and Florence. Thoughts?\nAlso, I really want to shop for purses (both LV and locally made), leather jacket, sandals and clothes. Should we plan a shopping day so we don’t have to carry stuff while sightseeing? Which location is best for shopping?", "link": "facebook.com/groups/1373361046396315/permalink/2210944982637913/", "likes": 0, "comments": [{"username": "Rosa Zordan", "comment_text": "Florence best place for leather goods and gold jewellery, Rome great place for designer clothes. But just take your time, don't forget to barter with local manufacturers, enjoy and take in the views which are the best in the world. Lots of coffee and Italian pastries are a real treat in both cities."}]}, {"id": "2210947712637640", "text": "I will be in Naples in September and I would like to go to Pompeii. What reliable methods of transportation are there available and what are some pros or cons?\nIt would be just me, as my traveling companions have other plans and won't be accompanying me.\nIs taking an Uber better than a taxi, or how would one take a train? What do you advise? I feel like a deer in the headlights almost to the point of not going to the place I've been fascinated with for 60 years.", "link": "facebook.com/groups/1373361046396315/permalink/2210947712637640/", "likes": 1, "comments": [{"username": "Luca Lookone Ferrentino", "comment_text": "Circumvesuviana\ntrain, next to the central station, direction Sorrento, the stop to Pompeii ruins is \"Pompei scavi villa dei misteri\" it takes 30-45 min depending on the train. Ticket i think is around 3-4€"}, {"username": "Tami Whittlesey", "comment_text": "As a solo traveler, a cab will be very pricey. We paid 80 euro for one way but splitting between three was okay. Circumvesuviana\nis usually packed but it isn't too hard to do. I prefer to have a tour guide when I go to Pompei and recommend that to anyone wanting the best experience. You can do this! Have fun :)"}]}, {"id": "2210610832671328", "text": "Hey everyone, me and my partner are traveling for the first time too Europe next year! We are both 20 and looking for an affordable place to stay, close to the main city in Florence. Does anyone have any recommendations? 🙂\nAlso any recommendations on things to do and see in Florence and bolonga?", "link": "facebook.com/groups/1373361046396315/permalink/2210610832671328/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\ntuscany-arezzo/"}]}, {"id": "2210948435970901", "text": "We will be traveling to Rome, Florence, day trip to Naples and Mt Vesuvius and Pompeii ruins, Venice, Udine, possibly Cinque Terre and Tuscany wine tour. We have 12 days (plus two days for travel there and home) arriving end of February into March. We are looking for mainly the arts, especially Michelangelo, Caravaggio, and Tiepolo works. Willआणखी there be outdoors markets and events happening this time of the year in any of the locations? Also what should we know? Any tips and tricks? Any particular tours that are a must and any that aren’t? What type of gifts are authentic and worth bringing home for ourselves and our adult daughters? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2210948435970901/", "likes": 2, "comments": [{"username": "Anthony Martini Jr.", "comment_text": "Too many stops. Cut them in half and actually SEE a good portion of what's to see instead of running like chickens"}]}, {"id": "2210954072637004", "text": "What is the differences/advantages booking train tickets directly on train site vs Omni/Rome2Rio?", "link": "facebook.com/groups/1373361046396315/permalink/2210954072637004/", "likes": 0, "comments": [{"username": "Gillian O'Callaghan", "comment_text": "I used Trainline for 13 trips in Italy. I loved that it included all trips from both companies. Kept all tickets in chronological order, QR codes, you can also check final destination and changes are clear."}, {"username": "Sam Mah", "comment_text": "If you buy a ticket from Trenitalia for instance and there is a problem with the trip, they will know about the problem and will immediately be able to help you with an alternative option or a refund. The other sites are 3rd party sites, they don't know and don't particularly care about the fact that there is a problem and you need a refund immediately or an alternative travel option."}, {"username": "Fetchin Gretchen", "comment_text": "I see zero advantages to booking on a website unless you can still access the booking and tickets easily by phone. I swear by trainline myself though have used omio before for other transport. Plus the apps give price point differences among multiple carriers."}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Gayla Faye Bell"}, {"username": "Leslie Goodland", "comment_text": "I used Rome 2 Río and Omio and had no issues with either one."}, {"username": "Laura Uribe", "comment_text": "Third party sites charge additional fees so you will pay more for the same ticket."}, {"username": "Ian Fawkner", "comment_text": "After using all I found Omio the ‘go to site’ - easy to use and gives all travel options between your required routes"}]}, {"id": "2210969459302132", "text": "My friends and I are going to Italy on September 7 for two weeks. We have everything booked except for our return from Siena to Rome. Our options are to hire a driver (much more expensive) or take the train. It appears that we need to go from Siena to Florence to Rome. We have pre booked our other train rides but I am thinking we could just buy our tickets on each train station. Any advice or suggestions would be welcome.", "link": "facebook.com/groups/1373361046396315/permalink/2210969459302132/", "likes": 4, "comments": [{"username": "Ted Cabot", "comment_text": "You can surely get between those places pretty easily by train and most likely do not need to book in advance if your timing is flexible. Download the Trenitalia app and the Italo app(nicer more business style trains) and just keep an eye on the schedules on the apps to make sure you don’t have to wait around or rush."}, {"username": "Alessio Esposito Inchiostro", "comment_text": "If it's regionale or regionale veloce trains, you can book/buy tickets up to half an hour before the trip.\nIf it's frecciarossa/\nfrecciargento/\nitalo (private alternatives to freccia) it's like with plane tickets, the sooner the better"}, {"username": "Deborah Schroeder", "comment_text": "You can go from Siena to Rome. Just go to Orvieto then change to Rome."}, {"username": "Suzanne Mills", "comment_text": "Buy as you go as delays are common."}, {"username": "Terri Bradford", "comment_text": "Use Rome2Rio and input your two destinations. It gives you all the options to go from A to B."}, {"username": "Renae Larcus", "comment_text": "We have done this several times. Local train from Siena to Florence and then the fast train to Rome. Book the fast train in advance if you want, but not necessary."}]}, {"id": "2210974072635004", "text": "Suggestions hotels in Milan", "link": "facebook.com/groups/1373361046396315/permalink/2210974072635004/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1213\n0410-Reviews-NY\nX_Hotel_Milan-M\nilan_Lombardy.h\ntml"}]}, {"id": "2210978905967854", "text": "We are regular Italy travelers. Been there many times, visited most regions north of Rome. One place we haven’t gone to yet is Marche. Any recommendations where to go there, what to see? Our interests are nature, local culture, food, wine. Not so much beaches, however we like coastal driving, hiking for views. Favorite place so far is Tuscany.\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2210978905967854/", "likes": 3, "comments": [{"username": "Silvia Bindi", "comment_text": "Marche, Numana, look for 'spiaggia della due sorelle' , through 'passo del lupo' for hiking and best views of the see. Enjoy🤗"}, {"username": "Pietro da Rimini", "comment_text": "I love the Marche and there are so many great towns, both on the coast and inland. Driving between them you will see wonderful views. Ascoli Piceno is one of the larger towns. I recently saw a promotion for a festival going on there now (mid-August) for the delicious local specialty of stuffed olives, called olive Ascolane. Fabriano is another lovely town with an interesting museum about the local production of paper. A not-to-miss hilltown is Urbino, which has a fabulous Ducal palace to visit and the views are great. San Benedetto del Tronto is a seaside town where we had amazing seafood. While I have not been to any wineries there, there is a fantastic white, Verdicchio, produced in the area around Jesi. The region is incredibly varied geographically,\nwith beaches and mountains and lots of small charming towns—and most are far less crowded than other regions."}, {"username": "AgAnne Chrzanowska", "comment_text": "Recanati, Grotte di Frasassi (a must!), Valadier's temple of Frasassi, Monti Sibillini"}, {"username": "Gianna Onesi", "comment_text": "Best place to visit!"}, {"username": "Rosa Zordan", "comment_text": "Time to travel south - Naples, Pompei, Sorrento, Sicily."}, {"username": "Valerie Collanton", "comment_text": "Le Marche is absolutely beautiful. And not touristy at all. You will love it there."}, {"username": "Aaron Peterson", "comment_text": "Urbino, Loreto, Fano to name a few"}, {"username": "Laura Piccinini", "comment_text": "In Marche i love to go to Fermo and Ascoli area.\nMy fav spot Is Torre di Palme"}, {"username": "Manuela Bassetti", "comment_text": "Urbino is really beautiful, Grotte di Frasassi, Monti Sibillini"}, {"username": "Rose Turdo", "comment_text": "Alberobello"}, {"username": "Rose Turdo", "comment_text": "Spiaggia di Vignanotica, Vieste, Foggia, Gargano, Puglia, Italia\nPh.miss.taniala\nurenm"}, {"username": "Nina Rovinelli Heller", "comment_text": "We’ve been to Fano many times and head there in a few weeks for almost 3 months. Easy to visit other places via train. Not crowded and it is gorgeous."}]}, {"id": "2210981239300954", "text": "Question for the Aussie members 😊\n\nI’m flying from Perth to Rome (16 hours 😜), I want to try and plan my sleep schedule 💊\nRoughly what sort of times do the Qantas crew serve meals?\nThanks 😃", "link": "facebook.com/groups/1373361046396315/permalink/2210981239300954/", "likes": 12, "comments": [{"username": "Melanie Izzy", "comment_text": "What time of day are you leaving?"}, {"username": "Sandy Michelle Duggan", "comment_text": "So,,, I flew perth to Venice, stop over in Dubai, we left at 11pm, they served food approx 1 hr into service, then breakfast approx 2hr prior to landing, this was 11hr flight"}, {"username": "Sandy Michelle Duggan", "comment_text": "by service I meant flight."}, {"username": "Sandy Michelle Duggan", "comment_text": "are you doing a direct flight?"}, {"username": "Sally Aubrey", "comment_text": "Following as I am doing the reverse direct flight"}, {"username": "Gillian O'Callaghan", "comment_text": "What time do you leave? Generally \"dinner\" then another meal before you land \"breakfast\" maybe. It's fine to refuse meals to keep your body's equilibrium....\nhad to do that from Sydney to Dubai as we'd just been fed Auckland to Sydney. I set my watch to the destination time when I leave even though I will try and sleep. Have fun in Italy"}, {"username": "Kejdi Okej", "comment_text": "Following as l am doing the reverse direct Flight"}, {"username": "Maryann Collidge", "comment_text": "What date?"}, {"username": "Ingrid Morris", "comment_text": "I did the 16hr early this week. Left Perth 22:50 and dinner was within an hour. They then offered snacks all night - endless snacks. Breakfast was a 2hrs before we landed."}, {"username": "Tynesha Tenamu", "comment_text": "Get the app timeshifter, it tells you when to sleep and when to have caffeine to reduce jet lag. I flew 13hrs + 6hrs to get to Rome from SA and I didn't get any jet-lag!"}, {"username": "Courtney Pybus", "comment_text": "Following! We are also flying Qantas to London"}, {"username": "Karen Cotogno-Young", "comment_text": "My girls just did this flight plus connection to Sydney and they found the trip back from Italy much easier than on the way there.\nThey were offered limited water bottles on way there which was very frustrating but they said plenty of food."}, {"username": "Kathryn Thomas", "comment_text": "We did this flight last week Perth to Rome Qantas. Dinner about an hour after takeoff, we were a bit delayed so around 12.30 am. Then snack service as required, everyone seemed to sleep for various durations of course. Breakfast about 2hours before landing. Landed and stayed awake all day in Rome. Hope this helps."}, {"username": "Alanna Dawes", "comment_text": "F"}, {"username": "Robyn Lawson", "comment_text": "We are doing the same flight in 5 weeks. Dinner usually served after about an hour into flight. Try to get to sleep as soon as possible after dinner. Then breakfast is served about 2 hours out of Dubai. Enjoy ! 😊"}, {"username": "Kim Comerford", "comment_text": "I did that flight last year. Dinner almost straight away and breakfast 2 hours before landing. Snacks available all night."}, {"username": "Rosa Zordan", "comment_text": "What time are you leaving?"}, {"username": "Allana Frank", "comment_text": "We downloaded time shifter app to plan our sleep schedule for flight"}, {"username": "Sharon Currie", "comment_text": "We were told one of the carriers adjusts to the local time as soon as your on, can’t recall which one though 😂 thinking emirates over Qantas at the moment but not sure, we’re going next year from perth as well so everything helps 👍"}, {"username": "Louise Maree", "comment_text": "I’ve always found it always depends on what time you arrive at destination re jet lag. I always look for flights that arrive mid to late afternoon or early evening. Morning arrivals are terrible for jet lag. Also unless I break the return flight for a day or two, say Singapore, or HK,I find jet lag much worse on the return trip."}, {"username": "Gemma Beekink", "comment_text": "Time shifter is an excellent app to use to minimise jet lag."}, {"username": "Rossella Rossi", "comment_text": "It's about two/ two and half hours after taking off from Perth, you will have snacks that you can get throughout the night (self serve) and then again the meal I think it's about 3 hours from landing."}, {"username": "Cathy Hayes", "comment_text": "Good luck 🤞\nNever slept the whole flight to Italy ,just cant with such discomfort in those seats !\nHope you do"}]}, {"id": "2210987929300285", "text": "Driving from Venice to Puglia in March 2024. We would like to take it slow to see things. Trip is about 8 hours. Any ideas of a town to stay overnight, somewhere half way. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2210987929300285/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187770-d1229\n2269-Reviews-G_\nHotel_Pescara-P\nescara_Province\n_of_Pescara_Abr\nuzzo.html"}, {"username": "Rhona OConnor", "comment_text": "Pescara is a nice town. We stayed in this place it was lovely and central."}, {"username": "Sandra Kingsley", "comment_text": "Pescara right on the beach is Hotel Esplanade, we stayed there last month. You have to book and pay for parking in their inside garage, great cafe , gelato shop across the road and walking distance to shops, restaurants. Can highly recommend!"}]}, {"id": "2210992229299855", "text": "Hi we are going to Genoa for two days before we go on a cruise . What do you recommend to do near or in Genoa? Maybe also restaurants in Genoa ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2210992229299855/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Genoa/\nHomemade-Pasta-C\nlass-with-a-Loc\nal-Chef-in-Geno\na/\nd805-17024P831?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Ely Elisa", "comment_text": "Don't miss the ferry boat to San fruttuoso, Camogli and portofino"}, {"username": "Ely Elisa", "comment_text": "Where are you staying while in Genoa?"}, {"username": "Sandy Todd", "comment_text": "I will be doing the same, getting on MSC for two cruises out of the same port. Flying into Milan and taking the train to Genoa."}, {"username": "Francesca Giovanelli", "comment_text": "https://\nwww.visitgenoa.i\nt/en/homepage"}, {"username": "Francesca Giovanelli", "comment_text": "https://\nmappe.comune.gen\nova.it/\nMapStore2/#/\nviewer/\nopenlayers/\n1000007394"}, {"username": "Emma Chadwick", "comment_text": "Il genovese for food 👍🏻"}, {"username": "Emma Chadwick", "comment_text": "And the aquarium is amazing"}]}, {"id": "2210995229299555", "text": "I’m going to Italy for 3 weeks next May-June and then going to Greece for 12 days but now I’m thinking of not doing Greece and just staying in Italy for that time. I do Milan 3 nights, Venice 3 nights, Florence 4 nights, cinque Terre 2 nights, Rome 8 nights. If I were to stay I would be wanting to head south.\nIs it worth extending my trip in Italy?\nPlease note I can’t extend any of those places apart from Rome as they are already booked.\nI’m also a solo traveller and don’t really have a budget.", "link": "facebook.com/groups/1373361046396315/permalink/2210995229299555/", "likes": 58, "comments": [{"username": "Tami Glispey Calabrese", "comment_text": "That ec"}, {"username": "Tami Glispey Calabrese", "comment_text": "We have the sane itinerary only rome is 4 and naples 4"}, {"username": "Sheyla Enrich", "comment_text": "You are so fortunate to have all that time!! I'm doing Italy this year and Greece next year!"}, {"username": "Mazzeo Diane", "comment_text": "South is totally unique, very different from the North. I would love to have seen Greece while we were in Europe so I would choose to do both."}, {"username": "Jess Ica", "comment_text": "Definitely go to Greece"}, {"username": "Alex Bader", "comment_text": "I have a similar itinerary for next month, I’m also solo traveler\nIf you want to joint ?"}, {"username": "Lisa Roberts O'Neil", "comment_text": "Extend Italy!! The Amalfi Coast is beautiful. You can stay in Sorrento and do day trips to the other coastal towns. Positano is beautiful.\nTuscany countryside is beautiful and a must.\nAlso, 8 days for Rome is too long. 4 will do. Italy is my favorite. I hope you enjoy it!!"}, {"username": "Adrienne McGilvery", "comment_text": "I say do Greece as a separate trip. Plenty of stuff to see in Italy. Capri, Sorrento, Positano and Naples to visit Pompei."}, {"username": "Teresa Whitehouse", "comment_text": "Personally I'd suggest Calabria after Rome"}, {"username": "Rosalia Ciminella Caramanica", "comment_text": "Fly to Sicily, Magna Grecia"}, {"username": "Georgina Mcauliffe", "comment_text": "Where in Greece? I love the Greek Islands but I really love Puglia, Sicily and the Eolians as well so probably if you have been to neither I would keep Greece for another trip, cut Rome by a few days and go south."}, {"username": "Leonie Williams", "comment_text": "We loved Sorrento in Italy . So many great restaurants , swimming was superb . Did a day cruise (about 8 people on the boat only ) to isle of capri stopping at the blue grotto on the way back and went swimming . Such a magnificent day .\nAlso did Greece with main stay on Santorini . Expensive but it was worth it ."}, {"username": "Tracy Perez Abreu", "comment_text": "Sounds amazing. Personally I didn’t enjoy Milan, but you could get a train to Como which is very beautiful.\n\nIf you think you will get the opportunity to go to either in future I would go to Greece this time for contrast. Beautiful in a different way.\nThen next time Amalfi coast (Puglia- never been, yet…) and then Sicily , especially Cefalu 😊\n\nI’m so jealous - you will have a wonderful time"}, {"username": "Mary Evans", "comment_text": "Greece is fabulous but so is southern Italy. If budget isn’t an issue I’d extend Italy and save Greece for another time. Don’t skip it. Santorini is stunning but expensive to stay."}, {"username": "Sally Sharkey", "comment_text": "We did one week in Tuscany area and one week on the Amalfi coast. Sorrento was one of my favorite towns. Stopped in other towns (Positano ) but Sorrento had a great vibe - people extra friendly, cafes were different, shopping from souvenirs to designer.\nAlso Pompeii is worth it alone. Just my opinion!"}, {"username": "Deborah Gold", "comment_text": "I have questions-why have you booked almost everything so very far in advance? And why, with 11 months notice, can’t you change those bookings?"}, {"username": "Miriam Robyn Roy", "comment_text": "Greece is gorgeous! Go to Zakinthos!!!!!"}, {"username": "Michele Maurice", "comment_text": "Im going end of this month and beginning of next to Italy and Greece. Partially land, partially cruise. Im a solo traveler. Get more bang for your buck. Hotels and food can eat up your budget quick. On a cruise food, transportation and entertainment is included. You can dock and explore. Remember hotel fares triple on weekends and holidays . You can easily do both this way . Im seeing several cities in Italy and a couple in Greece. Next time Ill stay longer when I know the area better. Friends of mine do it this way also."}, {"username": "Meryl Blank Lewis", "comment_text": "Puglia is wonderful; direct flight to Bari."}, {"username": "Linda Garrett Miller", "comment_text": "Yes, go down to Sicily"}, {"username": "Lisa Akira", "comment_text": "I’d recommend getting out of the big city tourist traps and get to know some smaller towns."}, {"username": "Eva Salas", "comment_text": "If you’re going to Milan consider Lake Como and/or Turin."}, {"username": "Sue Levy Avinir", "comment_text": "I would definitely not skip Greece."}, {"username": "Mary Passeri", "comment_text": "Of you're staying in Rome for 8nights, take the opportunity to explore the small towns and villages in the surrounding Lazio area. Frascati is one of my favourites 20 (€2 each way ) train ride from Termini. Also Castel Gandolfo for the pipes summer palace and beautiful lake Albano."}, {"username": "Barbara Powell", "comment_text": "NO!!! Go to Greece!!!"}, {"username": "Elizabeth Eddy-Kaufman", "comment_text": "I would plan another stop and not do 8 days in Rome."}, {"username": "Cheryl Eickhorn Jorgensen", "comment_text": "Don’t skip Greece! Very budget friendly!"}, {"username": "Marla Guffey Tapia", "comment_text": "I would say less time in Rome for sure and I wouldn’t skip Greece!"}, {"username": "Shelly Kentner Lehman", "comment_text": "I love Sorrento and Capri but your trip Greece would be cool to but maybe do it another time"}, {"username": "Nikki Blosser", "comment_text": "You can spend the extra 12 days in Italy for sure. Lots to see. BUT I would go to Greece for 12 days if you have the chance. We did a Greece and Italy trip before!"}, {"username": "Susan Cantafio", "comment_text": "We are doing Puglia this Sept and wish we were going there for more then 5 days we are in Rome and Naples and Capri 1st 12days in Italy then to Spain and Paris wish we were just staying in Italy longer"}, {"username": "Margaret Cachia", "comment_text": "Yes stay in Italy you won't regret it mark my words"}, {"username": "Holly Hamm", "comment_text": "DONT SKIP GREECE!!"}, {"username": "Margaret Fanelli-Granger", "comment_text": "Go to the Amalfi Coast and Capri. It’s very beautiful there. There is a lot to see and do in Rome, if you’re there for several days you will be able to see and experience a lot of the amazing history and culture. Greece is beautiful too, but I really love Italy. Enjoy your trip!"}, {"username": "Alicia Cox", "comment_text": "Greece is equally as beautiful. Either way you will have a fabulous trip."}, {"username": "Laura Uribe", "comment_text": "You could spend several days in Sicily and finish with Greece."}, {"username": "Claire Dowson", "comment_text": "Keep your eight nights in Rome. I’ve done seven before. If the city gets too much hop on a train to the coast or into the countryside. Greece is wonderful. Don’t get caught in all the tourist hype of Santorini and Mykonos. Many better and cheaper places with less tourists."}, {"username": "Marie Ray", "comment_text": "8 nights is way too much in Rome’ 2-3 nights max! If you want to cut Greece head down South to Puglia but I would not cut Greece!! Just amazing. No matter which Island you go to you will love it!"}, {"username": "Suzanne Mills", "comment_text": "Positively WAY too much transit. You need to map out a geographical strategy so you’re not hopping all over the place. Let m you honk about it I’ll get be suggestions. I lived in Europe for many years and did a lot it travel. You need to be able enjoy destinations without worrying about the trip, relax!"}, {"username": "Tony Mancini", "comment_text": "Visiting Sicily, Almafi coast, Puglia, Sardinia. So much."}, {"username": "Jason Esposito", "comment_text": "That’s a lot of time in Roma. Sorrento is wonderful. Greece though has sand beaches nightclubs if that’s you’re thing. Enjoy either way."}, {"username": "Sam Monty Sigler", "comment_text": "dont skip greece! 🙂 went last june and it was pure magic.."}, {"username": "Christine Matthews", "comment_text": "oh they are all gorg. its like picking between your kids."}, {"username": "Patti Bauman Widener", "comment_text": "Always worth staying in Bella Italia.!"}, {"username": "Kitty Boothroyd", "comment_text": "Will you have time in future to do Greece as a separate trip? If yes then I would add the 12 days onto Italy. The South is a must see.. stay in Sorrento as a base for the Amalfi Coast, stay on Capri 2-3 nights at Marina Piccola, it is magic once the day trippers have gone. If you want to avoid crowds you could do Sardinia, here you will need to hire a car to get the full experience- we had 8 days exploring the North and wish we had more time. Another option is Sicily. You can do a lot in 12 days! I’ve been to Rome a number of times, I wouldn’t extend the time there as 8 days will give you ample time to see the sights of Rome and add day trips to places outside of the city like Lake Bracciano and Tivoli Gardens if you want to.. the train system is safe and efficient and a great way to move around. We were there in May/June this year and it was a great time to travel, we just missed the rain and beat the heat wave.. although for me heat is good 🌞🌞🌞"}, {"username": "David King", "comment_text": "Depends on what you really want to do/see.\n\nI think Greece is far more enjoyable and fun, but both are filled with history and good.\nBUT, from just a nature perspective, Rome can never beat sunrises and sunsets on a Greek isle. Never."}, {"username": "Regla Cuky Reglas", "comment_text": "Don’t forget Mykonos."}, {"username": "Rebecca Korpershoek", "comment_text": "Don’t skip Greece, Athens and Mykonos, Rhodes my favourite, Santorini is a bit overrated. It’s so much different to Italy"}, {"username": "Helen Louise", "comment_text": "Absolutely. Head down to Puglia…do Italy this time, do Greece next. I am of the opinion that if you try to do the two together you will do neither justice. However I am based in uk and it is not too difficult for me to do either….may be different if you are coming across the pond"}, {"username": "Bobi Baran", "comment_text": "Hello. I m in Munich, do you have any plan for traveling in next year?"}, {"username": "Joya Nicastro Cherry", "comment_text": "I did a cruise this year Italy &\nGreece\nMy heart is in Italy but Greece is very magical- don’t miss it"}, {"username": "Kimberly Lianne Mariscal", "comment_text": "I’d say skip Milan or do one night there. Maybe road trip it going from north to south.\n\n-lake como (2 nights)\n-Dolomites (2 nights)\n-venice (2 nights)\n-Portofino (2 nights)\n-cinque terre (2 nights)\n-Florence (2 nights)\n-Rome (3 nights)\n-positano/\nPraiano/Amalfi (3 nights)\n-matera (2 nights)\n-puglia (2 nights)\n\nThis would be my ideal 3 weeks and would add Sardinia if I had more time (specifically la maddalena and costa smeralda)"}, {"username": "Andrew Mircovich", "comment_text": "Yes extend your stay in Italy and head south . My recommendation would be stay in Sorrento , Ravello and Capri . Possibly Taormina in Sicily"}, {"username": "Lisa Wanecek", "comment_text": "I would not extend your time in Italy as you have allotted ample time in each place to explore and Greece is beautiful. Also, I’d recommend to anyone to get off the tourist path for at least part of your trip. The crowds get to be a lot to deal with. Visit some hillside towns in Tuscany and visit islands in Greece that are less touristy. There’s beauty in that!"}, {"username": "Janis Belkin Sowell", "comment_text": "Don't skip Greece....reduc\ne your time in some places like Milan, venice"}, {"username": "Margaret Mackenzie", "comment_text": "100% although I would love to see Greece also. More time Tuscany, and a week on Amalfi coast"}, {"username": "Nancy Lewis", "comment_text": "Add Lake Como at least 3 days."}, {"username": "Kristie Flynn", "comment_text": "Don’t skip Greece!!! Go straight to Paros!"}, {"username": "Bellafab Fabrizio", "comment_text": "8 days im rome is along time. If your going down south go to tropea! Amazing. I liked Italy more than Greece but greece is amazing"}, {"username": "Linda Brookings Hull", "comment_text": "You all are so fortunate to be able to see any of these places…"}, {"username": "Jeanette Ramos-Gonzalez", "comment_text": "Yes !!! Go south !! Extend Italy !!"}, {"username": "Lorraine Marie Zalepa", "comment_text": "Why not try amalfi"}, {"username": "D Rochelle Milton", "comment_text": "Hmm two breathtakingly beautiful countries…. but do you 🌎🫒!!"}, {"username": "Etschi Bruckner", "comment_text": "why not sticking to the original plan - you´ve got plenty of time in Italy and you´re not rushing things, which gives you the chance to actually enjoy the places! where in Greece do you want to go afterwards? People suggest Santorini - which is quite an expensive tourist-trap these days ( unless you know exactly where to go there... I know the island very well, used to work there and sometimes go back to visit old friends... I can give you more advice about it, if you want!) - Greece has got lovely places!"}, {"username": "Elaine Catino Tsangarides", "comment_text": "It’s hard enough to see Italy in one trip, adding Greece is too much"}, {"username": "Barbara Bastianini", "comment_text": "I disagree with a lot of people here in that I think 8 days in Rome would be wonderful. I’ve been to Rome many times over 40 plus years and can never get enough of it. There’s just so much to see and do there that no amount of time could ever be too\nmuch!\n\nIn my opinion more time in Italy is always better. But that’s personal preference. I like Greece too, but it just doesn’t speak to me the way Italy does. So going South in Italy after 8 days in Rome sounds perfect to me. I love the Puglia and Basilicata areas so 12 days there after 8 in Rome sounds like heaven!"}, {"username": "Julia Salmon", "comment_text": "This summer just did Italy and Greece.\nVenice 3 days\nFlorence 4\nPositano 3\nRome 4\nSantorini 4\n\nOur flight got canceled so never made it to Venice. Florence was amazing but I wish we spent more time in Santorini over Positano. We didn’t really like it there. Maybe other places would’ve been a better choice. We didn’t care for Rome either. I will say out of every place Santorini was by far our favorite I’d go back there in a heartbeat and wish we went to more islands."}, {"username": "Shirley Lewis", "comment_text": "I think only you can answer this question: I've spent months at a time in Florence and was never bored or lacked for something to do, not sure why you say you can't extend any of your bookings ... know that northern and southern/\nSicily Italy are very different in every way. I would do all of Italy and save Greece for another time ... but only you know what you like!"}, {"username": "Lucrezia Folger", "comment_text": "Is it \"worth it?\" I go yearly for 3 months at a time, however if you don't have a budget, I don't know what to tell you. It's not like traveling around Bali or Thailand where $$ goes a long way."}, {"username": "Rhonda Hope", "comment_text": "You can go south to Sicily or puglia"}, {"username": "Nydia Bryan", "comment_text": "I vote you also go to Greece"}, {"username": "Katherine Azcue", "comment_text": "Rome 8 nights is ALOT!! Go elsewhere!! And do Rome for 3-4 nights!!"}, {"username": "Barbara Beer Brown", "comment_text": "Go to\nThe Amalfi coast. Stay in Positano and visit capri 1-2 days by boat."}, {"username": "Tina Norris", "comment_text": "Sicily, Sardinia"}, {"username": "Erica Senes Tombesi", "comment_text": "Don't cut Roma, is amazing and in one week you can realy enjoy the place."}, {"username": "Toni Marie", "comment_text": "I think 8 days in time is too much. Greece to rome I believe is a two hour flight so so that. Love Florence and Venice and amalfi coast just came back"}, {"username": "Debi Sicurella Krulisky", "comment_text": "Amalfi and Capri"}, {"username": "Toni Marie", "comment_text": "Also I don’t think u need 3 days in milan"}, {"username": "Diana Smith", "comment_text": "I love Milan but I think 3 nights are a lot, unless you visit the lakes, may be see Lugano( Switzerland) one hr away by train. Venice and Rome if you love art are fine, I personally would get bored. Visit Verona, Bergamo, Bologna, Lucca, Siena… you pick. And on the way down if you have time stop in Umbria, a beautiful region totally overlooked. Rome, Naples… also if you stay in Italy go to Sicily but if you like the beach Sardinia would be my destination. I know is a lot but those are just ideas. Whatever you pick you will have a great time…:)\nNext time you can go to Greece."}, {"username": "Susan Monaghan", "comment_text": "Why not plan another trip to Greece and Turkey? We have enjoyed both many times, particularly Istanbul, Ephesus, and a relaxing few days in Bodrum."}, {"username": "Julie Pulzone", "comment_text": "Sardinia is an amazing addition if you decide too another trip to Greece. I would add the lakes in Italy as others suggested. You can definitely use the additional time in Italy and the beaches in Sardinia are amazing. A nicer area than Amalfi coast for beaches. Just returned from sailing Amalfi coast which was nice but Sardinia is spectacular and where Italians vacation."}, {"username": "Corinne Scarfo", "comment_text": "Are you using these places as your base? You need max 3 days in Rome, Milan and Venice 2 days...depends on what sites you are doing. In milan you can head to places like Bergamo and such."}, {"username": "Celeste Germany", "comment_text": "There is never enough time in Rome. But if you would like to extend to other parts of Italy do Rome in 5 days - no less. I would continue to other parts of Italy and leave Greece for another trip."}, {"username": "Shelton McBride", "comment_text": "I would be sure to spend some time Lake Como or Lake Garda. Add Sorrento, Matera. Palermo, Sicily too. I am in Italy in October and will have more ideas. I have been to Greece and much prefer Italy."}, {"username": "Angela Ortiz Gayao", "comment_text": "Go to Greece 🇬🇷 it’s amazing!"}, {"username": "Maria Borg Costanzi", "comment_text": "Make sure you go to day trips from Rome as 8 days is alot but there is Tivoli Gardens, Orvieto, also Naples, Pompei and most important Bagnoregio 💙 Believe you can do all by train. There is also Flixbus which is cheap but need to check where it goes to. From Florence there is San Gimignano, Lucca, Siena, Pisa for day trips. 2 days Florence then chose w days for day trips. I use Google maps or www.Rome2Rio.co\nm to chr k cheapest ways to get anywhere"}, {"username": "Angie Harrop", "comment_text": "I would head down to the amalfi coast for sure, just a couple of hours on the train from Rome to Napoli- you could spend the day in Naples and then head down to Sorrento which is the perfect base to explore Amakfi, positano, Ravello, capri, ischia, Pompeii, Herculaneum, Procida, Nerano - the list goes on and on."}, {"username": "Pat Cray", "comment_text": "Yes! Say in Italy! Do the Amalfi coast!"}, {"username": "Roxanne Perrone", "comment_text": "I’d skip so many days in Rome and add other destination cities"}, {"username": "Peter Pisani", "comment_text": "3 to 5 days is enough in Rome. I would use 2 - 3 days in Lake Como"}, {"username": "Rosa Zordan", "comment_text": "Include Sorrento and Palermo"}, {"username": "Mary Agozzino Derrick", "comment_text": "Yes! Sicily is a must see for sure! Taormina, Ortigia, Noto Valley of the Temples, Palermo, Mondello, Cefalù, Monreale, Trapani, etc it's stunning"}, {"username": "Kejdi Okej", "comment_text": "8 night in Rome too much also 4 in florence. Anyway you can go to puglia at that time will be awesome l"}, {"username": "Lisa Nordby Robilliard", "comment_text": "Sicily is well worth a visit, lots of history, beautiful scenery, food and people. Lovely beaches too if that’s your thing."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Chiara Normanno", "comment_text": "If you include places like Sicily, South of Amalfi Coast (Cilento) or Apulia then it's worth it, those were places belonging to Ancient Greece. I would cut your nights in Milan unless used to explore the lakes areas (Como, Garda) or Cinque Terre."}, {"username": "Giulia Cardamone", "comment_text": "It's always worth extending a trip to Italy!"}, {"username": "Aaron Jonathan", "comment_text": "Cut Rome to like three days. Fly to Athens, do a day or two there and the rest on the island of Santorini."}, {"username": "Gary W Anderson", "comment_text": "Always worth spending more time in Italy but Greece is also lovely, I would visit realistically just as you’ve planned."}, {"username": "Ted Cabot", "comment_text": "Don’t skip Greece!!"}, {"username": "Lucy Casado-Martinez", "comment_text": "Don’t skip Greece! I’ve been to Italy three times and I’m in Greece for the first time right now."}, {"username": "Robyn Lawson", "comment_text": "Absolutely worth it😊💙"}, {"username": "Susan Hagy", "comment_text": "Extend in Italy Too many places to recomend. Start googling x#of days itineraries in Italy and see what works best.\nAnother option, do a small group tour in the mix, use Italia Sweet Italia. We are touring with Fabrizio in October. He has a number of options, all off the beaten track and immerses you in qith the culture. It's less touristy."}, {"username": "Joanne Wright", "comment_text": "Umbria or Tuscan countryside! Relax and unwind at an agriturismo! Heaven on earth!"}, {"username": "Nicola Nts Donelli", "comment_text": "Absolutely go to Napoli. One of the most wonderful cities in the world, and you can have 1-2 days in the Amalfi coast or the island of Capri or (less touristic and I like it more) Procida.\nI like Napoli way more than Florence or Milan, so I'm a bit biased 😂"}, {"username": "Rebecca Yeoh", "comment_text": "Yes, extend and stay in Italy. That’s also a perfect time of year to visit (for the weather). I’d head south to Amalfi or Puglia."}, {"username": "Deborah Schroeder", "comment_text": "I think you have a wonderful trip set up. 8 nights in Rome is perfect. You can take your time and see so much of the hidden treasures instead of being pushed to see the main sights. I did 7 nights solo last fall and am going back next year to see more. Do Italy well and you will have an amazing memory."}, {"username": "Fetchin Gretchen", "comment_text": "Yes extend Italy and go to Amalfi Coast based in Sorrento or Sicily. From Rome you can take some day trips to Pompei etc."}, {"username": "Rose Turdo", "comment_text": "8 Nights in Rome ??\nStop @ Bolsena Lake from Florence 1 night.\nGo to Alberobello for a night.\nCheck out Albiani area !!!\n3 weeks you can get a 5 course meal of all of Italy.\nThen go to Greece ? How long ? OR Sicily is incredible.\nAre you driving ?"}, {"username": "Leanne Wisbey", "comment_text": "Go to Greece, it’s so beautiful. we did Italy and Greece and so glad we did"}, {"username": "Allan Olexa", "comment_text": "Our favorite destinations in Italy are Napoli and Catania. We spend over a week annually. We also enjoy Athens and Santorini very much."}, {"username": "Paula Rosati", "comment_text": "Take me, take me!"}, {"username": "Robert Knowles", "comment_text": "Pisa/ Tuscany/ Puglia might be other great options"}, {"username": "Glenn Todd Webb", "comment_text": "Cut 4 days off Rome, go to Naples. Day trip to Casertes Palace, day trip to Herculaneum."}, {"username": "Avril Samuel", "comment_text": "Puglia is often regarded as the real Italy."}, {"username": "Lena Tomaino", "comment_text": "Go south. So beautiful.\nEspecially the coast on either side"}, {"username": "Joellen Baltimore Leo", "comment_text": "Yes! Amalfi Coast"}]}, {"id": "2210999005965844", "text": "Just found out that our cruise port was changed from Chioggia to Ravenna Passenger Terminal. We are planning to stay in Venice for 2 nights before our cruise. Looking for transportation recommendations from Venice to Ravenna. Thanks in advance for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2210999005965844/", "likes": 0, "comments": [{"username": "Rebecca Martin", "comment_text": "We just did this. On the morning of our cruise, we took the train from Venice to Ferrara, then Ferrara to Ravenna. But…on the second train we had to switch to a bus bc the track was flooded (I think meaning damaged from the May floods). Once at Ravenna train station, cabs were hard to find. Eventually a local bus took us all to the cruise port (it’s maybe 10m from the train station).\nWe got there in the end, but if the uncertainty bothers you, maybe book the cruise transfer from Venice."}, {"username": "Lynne Begnaud", "comment_text": "We will be on a cruise this fall that ends in Ravenna. Group of 35 staying in Venice (San Marco)for a few nights after. We have a motor coach taking us from Ravenna to Tronchetto. Arranged by Celebrity Cruise. Then our hotel is sending a water taxi to Tronchetto to pick us up. Check out Rome2Rio online, type in your to/from destinations, it will give options with price & approx travel time."}]}, {"id": "2210999152632496", "text": "In the past I was recall it was cheaper to book w the hotel directly instead of thru a booking company", "link": "facebook.com/groups/1373361046396315/permalink/2210999152632496/", "likes": 0, "comments": [{"username": "Bobi Baran", "comment_text": "I like to traveling there from Munich, just I m looking for a travel partner in Germany or Europe ..."}, {"username": "Kristina Ruk", "comment_text": "Sometimes..alwa\nys check all opportunities ;)"}, {"username": "Tanya Bitar", "comment_text": "I have found that it varies. I would say look on Booking and then call hotel directly. Just my experience"}]}, {"id": "2210999595965785", "text": "Trying to book a half day tour in Milan for August 24th on Viator but it is not allowing me to since the date does not appear. Any reason for this?\nThe tour is for The Duomo, La Scala and The Last supper.\nHelp!", "link": "facebook.com/groups/1373361046396315/permalink/2210999595965785/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Milan/\nHISTORICAL-TOUR-\nOF-MILAN-skip-t\nhe-line-LAST-SU\nPPER/\nd512-33060P2?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Gillian O'Callaghan", "comment_text": "If it's not an option on Viator they won't have any tickets left on their site. Try Get your Guide or different companies."}]}, {"id": "2210999732632438", "text": "Is it cheaper to book hotels directly or through a booking company?", "link": "facebook.com/groups/1373361046396315/permalink/2210999732632438/", "likes": 7, "comments": [{"username": "Suzanne Sanderson", "comment_text": "I usually look for one on booking.com then check hotel website or ring them"}, {"username": "Frank Hunt", "comment_text": "Yes and no!"}, {"username": "Todd N Nicole Clarke", "comment_text": "Look up both try and book with free cancellation"}, {"username": "Kit Nader", "comment_text": "Both... check both...sometime\ns there are offers so shopping around is good. And some booking sites are cheaper too."}, {"username": "Jeff Gentner EA", "comment_text": "I book through the hotel. You have a better chance at an upgrade or other perks upon arrival. On our trip last fall, I made the mistake of booking through a company for hotels in Bellagio and Sorrento. Both hotels contacted me and said if I booked through them they would upgrade me. Since they pay fees to third-party sellers, it works out better for them. I cancelled and rebooked directly with the hotel."}, {"username": "Jenny Frank", "comment_text": "Check both..."}, {"username": "Jeannie Morris Wierman", "comment_text": "I book straight thru the hotel. If you have to make any changes, the hotel makes you go back to the 3rd party that booked it for you."}, {"username": "Christi Craddock Taylor", "comment_text": "We always check out the third party hotel sites to decide where we want to stay, get location, pricing, etc. Then call hotel direct. It’s always been cheaper and I think better to deal with them directly."}, {"username": "Robert Lawshe", "comment_text": "Much better off booking directly in case there’s a problem"}, {"username": "Antonio Aloè", "comment_text": "I always use Expedia and in many occasions is cheaper than booking directly with hotels.Furtherm\nore I get rewards."}, {"username": "Kristina Ruk", "comment_text": "It depends as I have genius 3 level on booking com so sometimes it is cheaper always check with a hotel ;)"}, {"username": "Susan Levine Solomon", "comment_text": "I check both ways. Booking directly can possibly get u a better deal and the cancellation policy might be better too."}, {"username": "Claire Henderer Haughney", "comment_text": "Hotel direct always"}, {"username": "Ingrid Belova", "comment_text": "Normally if you find better price through any company and tell this to hotel they give you the same price at least. Directly with hotel is always better no unexpected surprises and standard Terms and conditions."}, {"username": "Lisa Adams Robertson", "comment_text": "You always should compare the two against each other. I've noticed on direct websites, sometimes there are room types listed that don't show up on the third party sites. On the other hand, I've found better cancelation policies on third party sites, occasionally. I do a mix of direct booking and third party booking."}, {"username": "Michelle Murphy Margolati", "comment_text": "Go direct. If you have questions or issues you won’t deal with a third party."}, {"username": "Gary W Anderson", "comment_text": "We check both but usually directly through the hotel works best. Also check prices on different days, they may vary and on holidays."}, {"username": "Jed Eldredge", "comment_text": "Airbnb / VRBO"}, {"username": "Casarine Temple", "comment_text": "I always book with the hotel directly."}, {"username": "Cynthia Sophia Davis", "comment_text": "Directly. Same with hotels they will price natch"}, {"username": "Tami Sue", "comment_text": "Usually it's cheaper through a 3rd party but if the price is similar directly at the hotel, I book from the hotel."}, {"username": "Tricia Bean Scott", "comment_text": "Depends. Points (earning or spending) = book through hotel website. Otherwise, I book through Expedia."}, {"username": "Sabine AndCo", "comment_text": "I always book direct !!! ❤️"}, {"username": "Sabrina Marie", "comment_text": "Do your own research once you find a hotel you like. A lot of times the hotel website will list coupon codes and offers direct on their site, I got one for 20% off on my recent last minute bookings for a hotel in Milan, Venice, and Rome."}, {"username": "Lina Khasky-Parness", "comment_text": "I like to use points, so i book through Amex, but it’s always a little more."}, {"username": "Joy Pascxa", "comment_text": "Always…"}, {"username": "Lisa Martinson", "comment_text": "Yea they may price match."}, {"username": "Olga Cherkasov", "comment_text": "I like through hotel."}, {"username": "Roger Pajo", "comment_text": "Direct… avoids a lot of issues…"}, {"username": "Joe Pisano", "comment_text": "Cheaper? Not gonna save much either way. Whatever you’re comfortable doing.\n\nQuit worrying about small potatoes"}, {"username": "Melissa White", "comment_text": "Look up on Booking, get best price, then ting hotel directly. Tgey will match and get ALL the money not just 80%"}, {"username": "Gillian O'Callaghan", "comment_text": "I book all my accommodation on booking.com and earn rewards. So not only better budget wise but all my bookings in one place."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211004782631933", "text": "Hi. My friend and I are starting in Naples and ending in Naples. We have 2 weeks and want to go to the following places. Any suggestions on the order we do it and how many days in each spot? Thank you. I've never been to Southern Italy. We will have a car. Rochelle Vaughn\n\nPuglia, Italy\nAmalfi Coast\nPossibly some wineries inland", "link": "facebook.com/groups/1373361046396315/permalink/2211004782631933/", "likes": 0, "comments": [{"username": "Ted Cabot", "comment_text": "Hi Jennifer\n\nFrom Naples I recommend driving to Bari in Puglia for some great beaches and seafood at Nicolaus Bistro Al mare. From there if you are in to once in a lifetime fine dining in the most amazing location on earth, go to Grotta Palazzese, the food is fine but the ambiance is unmatched. You can also stay there at their hotel if you like. I suggest next making your way to Matera for at least one night, possibly two if you can. The main area, the sassi di Matera is one of the most interesting places on earth.\nFermento wine cave, amazing bar\nRadino wine bistrot, another just incredible spot\nWine tasting at Tenuta Lacovazzo\nStay here\nhttps://\nmaps.app.goo.gl/\nXkroaVyTbALmeCCw\n8?g_st=ic\n\nOr here\n\nhttps://\nabnb.me/\n5Qk36QMycCb\n\nIn this region, Basilicata, the most famous red grape is Aglianico\nFrom there head to amalfi, stay in Praiano, we love hotel margherita, it’s got incredible and I mean incredible views, good in house food and parking, very important.\nOur favorite restaurants there are Kasai (absolutely amazing) and La Posteria, fairly new, great food and the service is unmatched, our waiter even even drove us back up the hill in the rain after we walked down! 🤣🤣\n\nPM for anything else you need!!"}]}, {"id": "2211004862631925", "text": "I heard that you need an IDP to rent a scooter. Is this true? We are thinking of renting scooters on Capri.", "link": "facebook.com/groups/1373361046396315/permalink/2211004862631925/", "likes": 0, "comments": [{"username": "Jennifer Avrett", "comment_text": "You should have one in case there's an accident or you get pulled over. You don't want to be in those circumstances without one. That being said, they're probably not going to ask you for one when you rent. A Vespa is THE best way to see Capri!! You can easily explore the entire island."}]}, {"id": "2211007492631662", "text": "Will be in Palermo and Mondello end of August for a week. Appreciate any recommendations of what to see, where to eat, & what to avoid? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2211007492631662/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}]}, {"id": "2211014235964321", "text": "Looking for recommendations for sorrento hotels that are reasonable for mid September…", "link": "facebook.com/groups/1373361046396315/permalink/2211014235964321/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2791\n84-Reviews-Gran\nd_Hotel_Riviera\n-Sorrento_Provi\nnce_of_Naples_C\nampania.html"}, {"username": "Suzanne Sanderson", "comment_text": "Hotel Plaza Sorrento is lovely and central. Staff are really helpful and a rooftop bar and pool!"}, {"username": "Clelia Marcantonio Vanasse", "comment_text": "Did anyone stay at Hotel Minerva ?"}]}, {"id": "2211037765961968", "text": "Can you help with my agenda? We fly into Bari on a Saturday night in October. We fly out of Naples on Friday. We would like to see Matera but if it's going to be too hard with this amount of days (5 - Sunday - Thursday. Leave Friday) we can enjoy Puglia and then go over to Naples Thursday night. Wasn't sure if we could make it to Matera Wednesday afternoon and then go to Naples late Thursday night. I'm feeling rushed and we haven't even gone yet! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2211037765961968/", "likes": 0, "comments": []}, {"id": "2211030935962651", "text": "Wondering if any of you can recommend a hot air balloon company in Tuscany. I’ve been looking at ones online but they all seem so similar I’m hoping for some help choosing one over another. TIA!\nWe are traveling in early October and will be just outside of Pienza.", "link": "facebook.com/groups/1373361046396315/permalink/2211030935962651/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nTuscany-Hot-Air-\nBalloon-Flight/\nd519-6365HABFLR?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Debi Murray Lee", "comment_text": "Carolyn Powell"}]}, {"id": "2211040265961718", "text": "Need help coming from Rome want to visit Pompeii site, Amalfi coast where should we stay ? Next day going to Florence", "link": "facebook.com/groups/1373361046396315/permalink/2211040265961718/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "have a look here https://\nwww.viator.com/\ntours/Rome/\nPompeii-Amalfi-C\noast-and-Posita\nno-Guided-Small\n-Group-Day-Trip\n-from-Rome/\nd511-3731P159?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Naomi Grace", "comment_text": "You can do a day tour from Rome"}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "Jennifer your answer disappeared"}]}, {"id": "2211040595961685", "text": "Hi ???\nApart from passport\nEsta??\nTravel insurance\nDo you really need to show how much money your taking??", "link": "facebook.com/groups/1373361046396315/permalink/2211040595961685/", "likes": 0, "comments": [{"username": "Ruth Akutu Maccarthy", "comment_text": "😂😂🤣🤣 is this really an issue???"}]}, {"id": "2211039709295107", "text": "When flying from the uk\nApart from passport\nEsta???\nInsurance\nDo you really need to show how much money your taking with you for the trip", "link": "facebook.com/groups/1373361046396315/permalink/2211039709295107/", "likes": 0, "comments": [{"username": "Jenny Payne", "comment_text": "No from Australia we can take up to $10,000 cash I think as I go often but I do rake cash with me🌻"}, {"username": "Colleen Dawson", "comment_text": "No, you do not have to,some countries I have been to only require a return ticket, never Italy."}, {"username": "Sally Cardew", "comment_text": "Thankyou for your advice"}]}, {"id": "2211055275960217", "text": "Looking for recommendations for the best non-touristy, local, authentic restaurants in the following areas (local pubs welcomed too!):\n\nMilano, Venice, Florence, Sorrento/ Amalfi Coast area, Rome.\n\nSincerely,", "link": "facebook.com/groups/1373361046396315/permalink/2211055275960217/", "likes": 0, "comments": [{"username": "Rosa Zordan", "comment_text": "Just walk and pick for yourself, you can't go wrong in Italy. All food magnificent, just read menus at front of restaurants and cafes. Depends on your budget and tastes."}, {"username": "Valerie Collanton", "comment_text": "Download the Fork App. You can look at lists of options, ratings and reviews. You can book on the app"}, {"username": "Julia Salmon", "comment_text": "Il Ritrovo I think can be touristy a little but was one of our favorite restaurants during our whole trip! Other than that we just walked around and stopped in some places or just looked online for good reviews and tried it"}]}, {"id": "2211048022627609", "text": "Has anyone done a cooking class they’d recommend in Florence? Possibly combined with either a market or winery tour.", "link": "facebook.com/groups/1373361046396315/permalink/2211048022627609/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nSmall-Group-Ital\nian-Cooking-Cla\nss-in-Florence/\nd519-5049COOKING\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Caroline Maloney", "comment_text": "Thank you🙂"}]}, {"id": "2211041089294969", "text": "We discovered that there’s a town called Corsanico near Lucca. Of course we have to visit ! ☺️ has anyone been there or know anything about it ?", "link": "facebook.com/groups/1373361046396315/permalink/2211041089294969/", "likes": 0, "comments": [{"username": "Donna Lyle Epright", "comment_text": "If I remember from Italian lessons it’s in the northern part"}]}, {"id": "2211042625961482", "text": "Can someone please explain how to get “print at home” tickets for the Colosseum through Coop Culture? I chose that selection when I bought my tickets but all I received was an email confirmation of my order but no tickets. I have emailed them and filled out their online form requesting my tickets with no responses to either. Also, how do you getआणखी the other tickets included:\n\n1. entrance to the Roman Forum and Palatine\n2. Entrance to the S.U.P.E.R. sites open (Oratorio dei Quaranta Martiri, Museo Palatino relativamente al I livello, Esterno di casa di Augusto, Schola Praeconum)\n3. Entrance to the temporary exhibitions", "link": "facebook.com/groups/1373361046396315/permalink/2211042625961482/", "likes": 0, "comments": [{"username": "Jade Perehudoff", "comment_text": "I got tickets this morning and my receipt was in my inbox and my tickets were in the junk folder! Hope you find them there"}, {"username": "Karen Blackmore", "comment_text": "etickets@coopcu\nlture.it is the email address I got my tickets from last year, email title was \"etickets\". Worth a search of your emails and junk folder."}, {"username": "Karen Blackmore", "comment_text": "My tickets were attached to the order email. See below an email address to query them"}, {"username": "Eleana Flores", "comment_text": "It took awhile for my tickets to come separately. Give it 24 hrs. I was nervous too 😅"}]}, {"id": "2211044812627930", "text": "We will be traveling to Italy next year with our 13, almost 14 year old son. We were hoping to do some e-bike tours in various cities. However, I have read that Italy requires e-bike riders to be 14 years old. Does anyone know how strict they are regarding the age limit when renting e-bikes/touring?", "link": "facebook.com/groups/1373361046396315/permalink/2211044812627930/", "likes": 0, "comments": []}, {"id": "2211051212627290", "text": "I just got back from 9 days in Italy. First trip there, and it was amazing. 3 days in Rome, 3+ days at The International Kitchen cooking school at Il Falconiere outside of Cortona, 2 nights in Florence, 1 night in Venice. I don’t often post in groups, but I asked for and got recommendations for jewelry, and I took in a lot of helpful info during my planning (I planned/booked the whole trip myself). There are a few things to note from my experience that may help others:\n1- we used more euros than planned. Little purchases like gelato, cheese and crackers at the market, etc. We also had some arranged transfers/cabs that were to be paid locally in cash.\n2- I used Omio for 2 of our trains and Italo’s site for the third. All electronic tickets, zero problems with any of the trips.\n3- Everybody says there are water fountains everywhere, but we actually had to really look for them at times. That said, I filled my bottle with tap water when needed and that was good, too.\n4- If you have any opportunity to stay at the Il Falconiere, do it. Our stay there for the cooking school was the highlight of our trip.\n5-I’m not super into museums, so while I saw all the highlights/main attractions, simply getting the skip-the-line, self-guided tour worked well for us at some places.\n6- I highly recommend Turtle Tours Rome at Night by Golf Cart tour. Our guide/driver was fantastic. I also highly recommend Discover Tuscany’s day tour to Siena, San Gimignano, winery, Pisa. It was a long day, but it was well-timed and our guide was wonderful.\n\nI’m happy to answer any questions if I can help with your planning!\nPic from our room at Il Falconiere - Under the Tuscan Sun. (No filter - yet, it really does look like a painting!)", "link": "facebook.com/groups/1373361046396315/permalink/2211051212627290/", "likes": 60, "comments": [{"username": "Judy Grayson", "comment_text": "Thank you for sharing this!"}, {"username": "Sally Rush", "comment_text": "Who did you book the discover Tuscany tour with?"}, {"username": "Marlene Pellegrini", "comment_text": "Thanks for the tips"}, {"username": "Rhonda Farrugia", "comment_text": "My mum and I are heading over soon as well … so many have mentioned the Tuscany tour; as above who did you book through, did you book in advance and from where did you get picked up from? A lot of questions sorry x"}, {"username": "Sue Farrell", "comment_text": "B"}, {"username": "Lynn Johnson", "comment_text": "You captured the view perfectly ❤️"}, {"username": "Carol Ruesewald Hajovsky", "comment_text": "Pamela Ruesewald Litton"}, {"username": "Genelle Linde Wolf", "comment_text": "Amy - some tips for our trip!"}, {"username": "Lora Jane", "comment_text": "I posted a comment here answering Sally Rush and Rhonda Farrugia ‘s questions and it looks like someone has deleted that. Not sure why…. I’m happy to answer any questions!"}, {"username": "Pamela Ruesewald Litton", "comment_text": "Lots of good info"}, {"username": "Marla Mullaney Lambert", "comment_text": "The Tuscany tour covers a lot of ground and sounds wonderful, but having just returned from a trip that included a day in Siena, I can’t imagine doing San Gimignano, Pisa and wine tasting all in the same day. I’m exhausted thinking about it!"}, {"username": "Milinda Jensen Fortune", "comment_text": "Please tell me about the jewelry you found! 💍"}]}, {"id": "2211052262627185", "text": "Looking for a recommendation for a private car from Rome airport to city center. Searched in group and see lots of conversations about day tours… not sure if that’s the same companies or if one way transports are different. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2211052262627185/", "likes": 0, "comments": [{"username": "Carrie Teller Badger", "comment_text": "Romecabs.com"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nLuxury-Private-D\nay-Transfer-fro\nm-Rome-Airports\n-FCO-CIA-to-Rom\ne-City-Center/\nd511-106109P21?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Kay Rendall", "comment_text": "Romacabs. Very reliable book on line"}, {"username": "Allison Carlisle Young", "comment_text": "We used limousinrome.co\nm. They were my transfer to airport and they did a rome in a day tour. We really enjoyed"}, {"username": "Audrey Bauer", "comment_text": "I used Welcomepickups.\ncom. They provide quotes! And about same cost for taxi."}, {"username": "Valerie Collanton", "comment_text": "Welcome Pickups. Download the app and you can book there"}]}, {"id": "2211051805960564", "text": "Can anyone recommend a reputable private transfer company that they have used? I'm looking to book a private transfer from Rome airport. Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2211051805960564/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nLuxury-Private-D\nay-Transfer-fro\nm-Rome-Airports\n-FCO-CIA-to-Rom\ne-City-Center/\nd511-106109P21?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Kay Rendall", "comment_text": "Romacabs very reliable. Same fixed price as taxi book online"}, {"username": "Antonella DeStefano Nigro", "comment_text": "Has anyone used welcome pickup? And if so, how was your experience?"}]}, {"id": "2211059072626504", "text": "I will be going to lake Garda in October, but just for one day. What is the most beautiful and charming town to see? Google is overwhelming with “top 20 places to see in Lake Garda”. when we only have one day😅. Photo so this gets noticed:)", "link": "facebook.com/groups/1373361046396315/permalink/2211059072626504/", "likes": 44, "comments": [{"username": "Ike Simoncini", "comment_text": "Sirmeone is nice yeah and if you go there reserve a spot at this reastaurant one of the best of the whole garda lake https://\nwww.risorgimento\n-sirmione.com/\nen/home-2/\nhere we always eat crudite di mare (various types of raw fish) or insalata catlan (lobster salad that is freshly made at your table) in advance and as a main course sea bass or steak cooked in a salt crust absolutely fantastic for dessert, crepes suzette or zabayone are also freshly prepared at your table"}, {"username": "Sydney Chakalos", "comment_text": "Sirmoine! We were just there and it was incredible!"}, {"username": "Tracey Mathew", "comment_text": "Riva del Garda , was lovely for a few hours."}, {"username": "Samantha Edmonds", "comment_text": "Looking at this post and viewing pictures of these towns makes me want to rethink my itinerary. So beautiful"}, {"username": "Beata Zabek", "comment_text": "Limone,beautifu\nl!!!!!!!!"}, {"username": "Etschi Bruckner", "comment_text": "Malcesine - and there are some hidden gems like www.hellergarde\nn.com ( on the other side) - and also some beautiful spot and medieval villages in the mountains behind it the lake - you will come back to check the place out properly!"}, {"username": "Virgz Van Møøre", "comment_text": "Sirmione, as many people, don't miss Grotte di Catullo"}, {"username": "Cecilia Attard", "comment_text": "Salo', Gargnano e Sirmione"}, {"username": "Chantel Walls", "comment_text": "Bardolino has a wine festival in October, not sure of the exact date. We went last year and it was brilliant"}, {"username": "Renae Larcus", "comment_text": "Lake Garda is big! We stayed in Sirmione and just loved it."}, {"username": "David Gotlieb", "comment_text": "Sirmione"}, {"username": "Ryan Monahan", "comment_text": "Sirmione is gorgeous and easily accessible as it’s on the southern tip of the lake. If you try to go to the cities more to the north you will have to take a long ferry ride. We stayed in Sirmione for 3 days last month. One day we took the ferry, Sirmione-Malcec\nine-Limone-Riva\nDel Garda-Sirmione.\nIt took about 8 hours for the trip, with brief stops in the towns."}, {"username": "Andrea Robinson", "comment_text": "Limone or Garda x enjoy x"}, {"username": "Pietro Adami", "comment_text": "Sirmione"}, {"username": "Marit Gerrits", "comment_text": "Riva ❤️"}, {"username": "Nancy Kaelin Smith", "comment_text": "Following"}, {"username": "Maria Fefelova", "comment_text": "Limone Sul Garda ❤️"}, {"username": "Sarah Luisa Hughes", "comment_text": "Malcesine, Riva, Limone, Sirmione... its all lovely to be honest!"}, {"username": "Michelle Myers", "comment_text": "If only going for a day I would say Malcescine, you have the cable car up Monte Baldo for incredible views, a lovely town and castle to name but a few things."}, {"username": "Janice Styler", "comment_text": "Riva"}, {"username": "Leanne Bradshaw", "comment_text": "Kylie Grant"}, {"username": "Silvana Villella", "comment_text": "Riva del Garda also Peschiera del Garda"}, {"username": "Paola Bersano", "comment_text": "Sirmione, Malcesine and Lazise"}, {"username": "Dima Daoud", "comment_text": "Malcecine sooooo beautiful. We just came back from there"}, {"username": "Asia Cartlidge", "comment_text": "Malcesine"}, {"username": "Elaine M Woodward", "comment_text": "Such a great picture"}, {"username": "Angela Hall", "comment_text": "We love Salo! Accessible by ferry, a lovely boardwalk, great shops and restaurants and a really nice relaxed vibe!"}, {"username": "Ted Kostisin", "comment_text": "Limone"}, {"username": "Su Barry", "comment_text": "Sirmione beautiful"}, {"username": "Annalisa Francesca Gianna", "comment_text": "I think it depends on how you are getting there. If you are driving, you can make many stops. I took my husband for the first time in May. We drove from Sirmione to Peschiera, Lazise, Bardolino, Garda, Torri del Benaco, Arco, Riva and then finished the evening in Malcesine, having dinner on the water front and watching the sunset. We left from Vicenza at 8 am and got back to Vicenza around midnight. We spent over an hour in each location and spent probably 4-5 hours in Malcesine between dinner and walking around. This would take you from south to north of the Veronese side of Garda."}, {"username": "Christoph Maneschg", "comment_text": "Don’t go for just one day‼️ There are so many nice places…! One of the nicest towns is Malcesine"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Sirmione"}, {"username": "Emma Kelly", "comment_text": "Sirmione and Limone without a doubt!"}, {"username": "Iwona Dygas", "comment_text": "Sirmione and Limone are nice but quite commercial. Gargnano is small and lovely, might be quiet in October. I preferred Salò to Limone and Sirmione but if you are going for only one day it is a tough choice. Aaa! I have forgotten of a real gem Malcesine."}, {"username": "Iwona Dygas", "comment_text": "If you drive I would see a few on one or another shore. Last winter we drove along the east shore: from Malcesine to Sirmnione, then in May we did the west part."}, {"username": "Rossana Rotini", "comment_text": "Sirmione"}, {"username": "Kejdi Okej", "comment_text": "Don t go for just one day there are so many nice places one of the nicest towns is malcesine"}]}, {"id": "2211072005958544", "text": "I have booked our airfare from Charlotte to Venice end of March , bought and paid. There is a layover at London Heathrow for 1 hr 50 minutes. Arrive at terminal 3 I didn’t realize that we have to go through security or customs there. Then our flight to Venice leaves from terminal 5. Arrive 6:50 am . Departs 8:40am. Just carryons. is this doable ?", "link": "facebook.com/groups/1373361046396315/permalink/2211072005958544/", "likes": 3, "comments": [{"username": "Jenny Payne", "comment_text": "Yes, if you have either a good pack pack or cabin size case + a cross body bag. Don’t take the world with you as if u use trains want to make it as easy as possible 🌻"}, {"username": "Louis Des Forges", "comment_text": "Yes you will need to clear passport control, not sure if you will be able to check your luggage through if you need to change terminals.\nhttps://\nwww.heathrow.com\n/\nat-the-airport/\nairport-maps/\ntravel-between-t\nerminals\nIn the event you miss your connection you will be rebooked on a later flight."}, {"username": "Rosa Zordan", "comment_text": "Tight"}, {"username": "Gregory Smith", "comment_text": "Same airline or are you changing airlines? If this is an AA/BA code share then they think it’s doable although tight. You’re probably challenged if you are changing airlines."}, {"username": "Rhona OConnor", "comment_text": "You should be OK. It's always best to book a through ticket.... Then they have to sort you out. There are probably several flights after your one anyway. 👌"}, {"username": "Terry Hamlet", "comment_text": "Security yes, customs no. You’ll do customs at Venice as it will be your first Schengen stop.\n\nSounds like you’ll be on American which means a terminal change. 1 1/2 is doable but you’ll need to move quickly."}, {"username": "Alison Walker", "comment_text": "Uk citizen here who travels a lot in Europe. If you have checked your luggage all the way though to Venice you can transfer directly from terminal 3 to 5 at Heathrow without clearing customs. Just look for the “connections board” when you get off your flight and arrive in Heathrow. You have time to make the connection. Have a fab time."}, {"username": "Angie Hoff-Hess", "comment_text": "With airline delays and flights not always on time, you probably can call and get a more doable itinerary. I call Lufthansa, they answer, they switch flights no fee"}]}, {"id": "2211068375958907", "text": "🚂 ciao ! we are high speed training all over Italy next year & wanted input on luggage size . At the moment we are contemplating 1 x medium suitcase and 1 x small suitcase for 3 adults. What is the luggage storage like on the Italo & Trenitalia? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2211068375958907/", "likes": 0, "comments": [{"username": "Rebecca Martin", "comment_text": "These are the smallest Away carry on cases, on an Italo train."}, {"username": "Rebecca Martin", "comment_text": "They also had some sort of lockable luggage rack near the door. Italo, primo class car."}, {"username": "Rebecca Yeoh", "comment_text": "I travelled with Trenitalia, several trips across Italy in a mix of economy and business carriages. My mother and I carried a medium-large suitcase each. There are overhead racks for “carry on” size luggage, and there are large racks (for all the big suitcases to be stacked on) at both ends of the carriage. You can also slide larger suitcases between seats (as seen in the pic), but I found my bag didn’t fit in there in Economy but did in Business. You don’t need to be concerned about sitting far from your bag…everyone is in the same boat. I just kept an eye on my bag when we stopped."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211075615958183", "text": "Vatican —> FCO\nWe are a group of 4 with a large suitcase each.\n\n1. How easy is it to get a taxi without having to deal with unscrupulous drivers? Can we book the night before?\n\n2. Anyone knows the estimatedआणखी cost for taxi (for 4 with a suitcase each) from Vatican to FCO?\n\n3. Also, would it be faster/less risky by train? We need to be at the airport by 8am on a Monday.\n\nTIA 😌", "link": "facebook.com/groups/1373361046396315/permalink/2211075615958183/", "likes": 26, "comments": [{"username": "Carolyn Hall Raffo", "comment_text": "We used Uber"}, {"username": "Lisa Kelly", "comment_text": "You’ll be so much happier if you each take one small rolling bag. We (4) just did 3 weeks that way with trains and taxis and we had such an easy time. We all felt there were clothes we didn’t even need."}, {"username": "Jeff McLellan", "comment_text": "Regardless of cost just book a van through a car service will just make your day way less stressful. Also allow yourself plenty of time in Florence we got stuck behind a garbage truck that was going nowhere fast at all."}, {"username": "Lesley Stewart-D'Ortenzio", "comment_text": "We took from Vatican to train station 68€"}, {"username": "Barbara Bastianini", "comment_text": "Most taxis are too small to fit 4 large suitcases. So you could take two taxis. (Which is what I would do.) There are a few larger taxis but they tend to be more costly so you might spend as much on a larger taxi or on a van as you would on two regular size taxis. But if you absolutely have to have one vehicle I’d reserve it in advance somewhere because there aren’t many bigger vehicles.\n\nI myself would not take the train with a large suitcase. It’s slower and stressful. You have to get yourself to the train station carrying your bags even before you board the train so that’s extra time right there. And maneuvering luggage through cobblestone streets is no fun at all so you may need a taxi just to get you to the station. In that case you’ll have the two taxi dilemma anyway, plus the cost of those taxis in addition to the cost of four train tickets. And you have to lug your cases up and down steps into and out of the train car. Then you mention “riskier.” It’s always more risky anywhere to carry luggage on public transportation than on a taxi.\n\nYou could always ask your hotel to make your transportation arrangements to the airport for you. They do that often so they usually have arrangements with reliable companies. Or at least ask them for an estimate of the cost. Because they’ll have current, up to date info.\n\nIn my opinion money spent on making things easier is money well spent. I think springing for two taxis is the easiest option here. So I’d gladly pay the cost if two taxis to avoid stress.\n\nAnd in my opinion I think the fear of “unscrupulous” taxi drivers is exaggerated. Taxis fares are regulated by law in Rome. So just be sure you take a white taxi with the official Rome logo on the door. It will have a meter and the drivers license number will be displayed inside along with a telephone number to call in case you suspect wrongdoing. And keep in mind that sometimes tourists mistake things. Tourists at times think a taxi driver is going out of the way in order to boost the fare. But in reality given the maze like nature of the streets in Rome you actually might have to go east to get to the west. And taxi companies keep the drivers updated on congestion so a driver may very well take what seems to be a roundabout way to get around a traffic jam instead of driving into a back up. It’s a shame when an effort to keep the fare down results in an oblivious tourist accusing the driver of deception!\n\nSo I’d say that in general you don’t have to worry too much about the taxis if you take an official taxi."}, {"username": "Eva Salas", "comment_text": "I think it’s posted on the door. 50. Euros."}, {"username": "Dana Rinaldi", "comment_text": "There is a bus in Via Crescenzio close to the Vatican, I've used it a few times www.sitbusshutt\nle.com"}, {"username": "Roletta Ng", "comment_text": "Our Airbnb host in Rome arranged for a private car to pick us up from the airport and it was 55 euros"}, {"username": "Anna Woolsey", "comment_text": "We had our hotel arranged our taxi to the airport for early morning 07:30 flight. We used taxi, because it took us directly to airport check in location. I’m afraid it would be difficult going by train with all the luggages."}, {"username": "Susan Sassoon", "comment_text": "I hv never gone on a trip without advance booking by a reputable company. Taxi at the last minute especially for 4 people is playing Russian roulette. The people on here are great. I would also hv to add that I get a lot of my info on “Trip Advisor”. People write in with a lot of references and their experiences."}, {"username": "Rachael Richardson", "comment_text": "Just get metro then a train - it’s easy and cheap"}, {"username": "Angie Boutzis-Luis", "comment_text": "Download itaxi app. You can book ahead. We used taxis a couple times. 4 ppl with 4 carry on luggage and cabs were maxed out. You will likely need 2 cabs. Also seemed very standard that cabs charge an extra $1 per luggage."}, {"username": "Nancy Caruso Watts", "comment_text": "We paid 60 euro and 50 euro for a prebooked taxi. Usedbthe train on arrival and decided there was no way we were using it to go 1st thing."}, {"username": "Lloyd Davies", "comment_text": "Taxi to or from FCO to Rome is fixed price 50 euro. Good luck."}, {"username": "Sonia Gorton", "comment_text": "Maria Urdi I agree, stay away from train station with suitcases. Not worth the hassle. If you tell your hotel, they will book a taxi for you. They have suvs for big families and suitcases."}, {"username": "Kathleen Watt Phillips", "comment_text": "Try the app welcome pickups. So much cheaper than a regular car service and the drivers were perfect.\nUsed repeatedly across Europe"}, {"username": "Karen Lenthe Redett", "comment_text": "Train it. Take to termini and then take the express to FCO. Never travel to airport the day of travel. Delays will happen and you’ll miss flight. Large Luggage is no big deal. We had one each. Save on taxi. Total rip"}, {"username": "Rose Stolarek", "comment_text": "You will need a large cab . They are available at the airport . Taxi fares to Centro Storico are 50 euros as that’s what we paid recently"}, {"username": "Frances Collado Sabella", "comment_text": "I’m paying 65 💶"}, {"username": "Lien Tran Griffin", "comment_text": "Our family of 3 were in Italy for 12 days. I used FreeNow App to book our Taxi. It was not perfect. It worked some of the time. I reserved a Taxi with FreeNow in advance to take us from Roma Termini train station to our Airb&b. The taxi driver canceled on us literally five minutes before our pickup time. We were waiting for him at the pick up point. I tried to rebook 5 more times and they would accept the reservation then cancelled. We ended up walking in the 97 degree heat because the waiting line to get a Taxi was so long by then. Luckily after walking for 10 or 15 minutes we walked by a Taxi Stand and was able to get one to take us to Airb&b.\nHowever, we have no issue with using FreeNow App to book ride from our Airb&b to the Vatican or to the airport. So if use FreeNow App, have an alternative plan in case they cancel on you.\nWe were spoiled in Greece, our Airb&b host booked our taxi for us at the airport.\nOur Airb&b host in Rome was not as helpful. She recommended the taxi App when I asked her to book a taxi for us. 😂\nIt was our first time navigating transportation in Italy. It was an adventure."}, {"username": "Ellen Marie", "comment_text": "Book with Queen limousine. They will guarantee a driver in a large vehicle that can accommodate your luggage and they will be at the designated spot on time, guaranteed. Price is around 60€ during normal hours for Rome central to FCO or vice versa. You can send them a booking request email and they will respond. 10/10 recommend (we use them often)."}, {"username": "Erika Kl", "comment_text": "Free now is an easy way to get a taxi. I took a taxi to my hotel from the train station, but later I started using the metro and it is much more affordable and goes to all the major sites. It just depends on where you going cause the metro doesn’t go into some areas"}, {"username": "Toni Quatrini Bannister", "comment_text": "We stayed at a hotel about 10 minutes from the airport the night before our early flight and they provided a large SUV I think it was $30 for us!"}, {"username": "Celeste Germany", "comment_text": "Allow plenty of time ahead of departure. More than 2 hours. Our preference is to stay by airport at a hotel - they have shuttles to the airport or they can arrange for transportation"}, {"username": "Andria Saia", "comment_text": "Book an Uber 😊"}, {"username": "Nicole Wang", "comment_text": "When you use an app to call a taxi in Rome, the meter starts at the end of the acknowledgement\nwhether the driver is 3 minutes or 30 minutes away.\nRates for taxies to the airports to a hotel in Rome are fixed. It doesn’t matter how many people are in the cab. The fare is a fixed rate.\n\nNever ask a driver how much a ride will be. The minute you do, he will shut off the meter and raise the price.\n\nNever ask a driver if he will accept a credit card beforehand. All are required to do so. If you ask and the drive says no, he is scamming you and the taxi company so he can pocket cash if you are willing to forgo the credit card. Just enter the cab, give your destination address then pay him with either cash or credit card at the end of the ride.\n\nDo not try to flag down a taxi on the street. It is illegal for drivers to pick up fares this way. Find a taxi stand sign ( they are orange black TAXI signs) which are located throughout Rome and wait for a cab. They usually appear within a few minutes as drivers know to frequent fares at these locations."}, {"username": "Nikki Buxman", "comment_text": "The bus works well for me with a large check in, not knowing which metro station has an elevator"}, {"username": "Ryan Shearer", "comment_text": "Uber Black. We used it all over Rome, mostly E-class and Vito Mercs."}, {"username": "Colleen Campbell Bussey", "comment_text": "Uber works! We used it many times in May and each visit!"}, {"username": "John Spensieri", "comment_text": "I thought the taxi’s in Rome were great , drivers were friendly and the fares were reasonable. Reasonable compared to San Francisco where everything is overpriced and expensive. A 7 euro fare in Rome is a $20 fare in San Francisco 🙉"}, {"username": "Elena Innocenti", "comment_text": "ItTaxi app"}, {"username": "Alexandra A Welker", "comment_text": "How big is your luggage? 28\" size? If so most likely you'll need two cars/taxi. But I think it's best to stay close to the airport the night before so you don't have to worry about getting into a car super early. I also think getting a train is doable but you have to transfer at na Roma Termini. Ask your hotel to arrange a taxi/private car service."}, {"username": "Roxanne Franquelli", "comment_text": "I used the app this morning a reserved and paid for a taxi. Someone posted it on this group and I gave it a try. The driver was 10 min early. It is called free now."}, {"username": "Nicola Amy MacDonald", "comment_text": "Pay €80-100 and get a concierge"}, {"username": "Nicole Condemi", "comment_text": "The hotel told me it’s €50 standard rate to the airport, can be more if it’s a van.\n\nWe had trouble booking a cab as our hotel is directly in front of a taxi rank, even though there are no taxis at 430am in the morning 🤦‍♀️\n\nI was told to book an Uber in the morning and hope for the best 😬\n\nUltimately the night before I noticed a bunch of taxis in a piazza just waiting for a fare, so I approached one and booked him directly. Charged me €65 as it was a van as we are 5 with 4 suitcases plus pram etc."}, {"username": "Darcy Jessen", "comment_text": "Check out Movin Rome. They provided great service and had cube vans"}, {"username": "Susan Trenear", "comment_text": "We just come from Rome, I would go with UBER Van. At least you know how much you are paying in advance and where exactly where you are going. Appears more expensive at face value….but is it!"}, {"username": "Frank Hunt", "comment_text": "50 Euro per couple with luggage last year, booked by the hotel. Standard rate."}, {"username": "Melanie Matthews Stuprich", "comment_text": "We just did exactly this and stayed in that area as well but we had 9 people. Our Airbnb set us up with one van and one car and they were around the same cost. The van was 70euro I think and the car was 65 euro"}, {"username": "Melanie Matthews Stuprich", "comment_text": "The opposite way when we arrived was just 3 of us at the time and we did Uber black and it was a large van and was around 70 euro as well."}, {"username": "Dunia Aldyni", "comment_text": "Use Uber more safe"}, {"username": "Maria Urdi", "comment_text": "Don’t do train with large suitcases. It’s not fun. I just did it. We got a driver easily at FCO 3 people, 5 luggage $95 euro"}, {"username": "Rumon AndFriends", "comment_text": "I think there is a flat rate of 50 euro from FCO to city. Train from Airport Leonardo express is perfect to Roma Termini and from there taking a taxi (shouldn’t be much) but with 4 ppl it’s better to go directly with a taxi because train tickets are 14x4 plus taxi from Roma Termini"}, {"username": "Krissy Dascoli-Meehan", "comment_text": "We found taxis hard in Rome. Free now worked a couple times for us but when we needed one to get to the train station, it didn’t work. Some tacos are vans and others will be small. Ask the Airbnb if they can help arrange a taxi."}, {"username": "Allison Carlisle Young", "comment_text": "I used limousinrome.co\nm. $100 euro. A family of three with suitcases had to split up. Cars are small. We were near Vatican."}, {"username": "Jeff Gentner EA", "comment_text": "One of the disadvantages of an Airbnb. We always hire a driver and get it all set up before we travel. To and from the airport is critical. Too stressful to wait upon arrival. Good Luck"}, {"username": "Lyn Pappas Dahm", "comment_text": "Book Mary Roma of Rome Cab Transfers. They have a van. They will pick you up here at your accommodation and take you directly to the airport for €50."}, {"username": "Carlene Reader", "comment_text": "We booked a taxi van through our hotel. 4 people with 4 large suitcases. 75 euro"}, {"username": "Helen Clare", "comment_text": "Uber"}, {"username": "Jenn Messina Babore", "comment_text": "We used Shared Shuttle from Termini to FCO, but pick up can be anywhere. We had 7 with 10+ luggages and it was 80€. They were great and I’d use them again."}, {"username": "Venette Macalinao", "comment_text": "What about using the FREENOW app. Used them this week with no problems. FREENOW is their version of Uber or Lyft."}, {"username": "Diane Davis Lawyer", "comment_text": "Get the FreeNow app. Others say it is a life saver when it comes to Rome taxis."}, {"username": "Natalina Sacco Soares", "comment_text": "Hi Sharon I have a number of a driver I used last month, 60 euro from Spanish Steps to Airport 4 passengers and 4 suitcases.\nIf you want to number send me a DM."}, {"username": "Pietro Ruscetti", "comment_text": "Ittaxi app. It's the official app of the taxi companie. You can enter the number of passengers, the lungage by size and they will send you a taxi for your needs. If i'm not mistaken, it's a fixed price for around 52€ from the center to fco"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Hotel will do it for you … a van"}, {"username": "Valerie Collanton", "comment_text": "You can download Welcome Pickups app and reserve on there. It is more expensive than a taxi but you will not be able to get a regular taxi for four people with large suitcases."}, {"username": "Debra Indorato", "comment_text": "Our air b&b hosts arranged for drivers for us in Rome, Florence, & Verona. Most were a decent size Mercedes. We had 2 extra large duffle bags and back packs. We paid $50."}, {"username": "Heather Hills Jacobs", "comment_text": "We used Get your Guide app!!!"}, {"username": "Patricia Bejarano Bredehoft", "comment_text": "Taxis are honest"}, {"username": "Babi Tsilosani", "comment_text": "Get Uber"}, {"username": "Claire Buccini", "comment_text": "Try the shared shuttle website. They were great. Normal taxi for 2 people and standard luggage is mandated at 50 euro maximum charge"}, {"username": "Rhonda Lee Courter", "comment_text": "You need at least two cars or a van\nDon't do train"}, {"username": "Jenny Payne", "comment_text": "If your at a hotel ask them to arrange a taxi or airb&b as it will cost you I think with large cases. Go on line as see what the cost is? I have a driver who I have used for a few years and that costs me €50 from a hotel near the termini🌻"}, {"username": "Sam Sabrina Haney", "comment_text": "Stay your last night at the airport Hilton, the one connected to the terminal..\nWe are doing that with two of our flights out of Rome so we can be there for early flights."}, {"username": "Kejdi Okej", "comment_text": "Stay your last night at the airport Hilton the one conneceted do the terminal we are doing that with two of our flights out of rome so we can be there for early flights."}]}, {"id": "2211079649291113", "text": "I love this group. My tour company is offering an optional extra\nSerenaded gondola ride in Venice for approximately $100 Australian per person, my question would it be cheaper to hop on or book independently?\nThankyou", "link": "facebook.com/groups/1373361046396315/permalink/2211079649291113/", "likes": 3, "comments": [{"username": "Jenny Payne", "comment_text": "Go on line and look🌻"}, {"username": "Rosa Zordan", "comment_text": "This is a good price. I'd go with Australian dollar. Cost is usually in excess of €80."}, {"username": "Karen Blackmore", "comment_text": "No idea about Aus $ but a Gondola ride is I believe fixed at 80€ for the whole gondola not per person. So depends how many of you. And no need to book, they are everywhere. Night time prices are higher"}, {"username": "Jules Earl-Rossiter", "comment_text": "Gondola rides are a fixed price... it's 80 euro's for up to 5 people during the day time and 100 euro's in evening and that's for 30 minutes ride....🙃"}, {"username": "Rose Stolarek", "comment_text": "Yes without a doubt . We booked a ride on the day for 4 of us and if memory serves me correctly it was 80 euros for all of us . Gondolas are everywhere"}, {"username": "Nicole Condemi", "comment_text": "€80 for up to 5 people, €100 for after 7pm. And it’s a set loop. Whether that takes 10min or 30, that’s the price"}]}, {"id": "2211077292624682", "text": "Questions:\n1. Picture of best type purse for woman to have in Italy.\n\n2. Solo traveler & first timer in Italy…flying into (FCO) Rome …going to Soriento nel Crimini for 7 days…taxi or rent car?\n\n3. Picture of size or measures of suitcase taken for 12-14 day trip?\n\n4. If NOT a tours kinda person…what do you suggest seeing in Rome?\n\n5. Two options for stays safe for Tuscany? 3 things to do or see?\n\nPlease be kind in response to my roomie questions.\nHelpful to address as #1-5…\n\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2211077292624682/", "likes": 0, "comments": []}, {"id": "2211081042624307", "text": "Just needing confirmation from the brain's trust regarding my daughter's travel internationally please.\nArriving in Naples international airport, bus to main station to get on the train to Salerno, then bus down to Amalfi?\nBook train and bus via Trenitalia?\nHappy for suggestions to make it easier!\nThanks in advance 😃", "link": "facebook.com/groups/1373361046396315/permalink/2211081042624307/", "likes": 1, "comments": [{"username": "Karen Dehne-Simpson", "comment_text": "Sandie Nicole 🤗👍"}, {"username": "Paula Brink", "comment_text": "I think it would be easier to take the bus that runs from Naples airport to Sorrento, then Sorrento to Amalfi. You can look at Rome to Rio for options to go from Sorrento to Amalfi: bus or ferry or taxi.\n\nhttps://\nwww.curreriviagg\ni.it/mobile/"}]}, {"id": "2211106525955092", "text": "Good evening, my husband and I will be in Tuscany, Venice and Rome in September. I am just looking for must do ideas. Anything from tours to restaurants and all in between. Pretty much anything you found amazing and a must see or do. 🙂 ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2211106525955092/", "likes": 0, "comments": []}, {"id": "2211081082624303", "text": "We are planning to visit Cinque Terre from Florence for a day trip. Not planning to book with a tour group. Is it risky to wait to book our train back to Florence from La Spezia when we get to the station? I would prefer to have the flexibility to stay a bit longer and not be tied to train.", "link": "facebook.com/groups/1373361046396315/permalink/2211081082624303/", "likes": 2, "comments": [{"username": "Karla Danielle Heywood", "comment_text": "The only thing i noticed if the price increased x"}, {"username": "Kate Laidlaw", "comment_text": "Nope, the trains run pretty frequently! It’s easy to buy a ticket at a machine"}, {"username": "Rosa Zordan", "comment_text": "Not a good idea. Cinque Terre only accessible by foot unless you view the 5 towns from the sea. Better to go to one of the lakes for the day or Milan."}, {"username": "Paul Anderson", "comment_text": "No it is not risky. For me a vacation means no schedule do it when you feel like doing it."}, {"username": "Diane Mascelle", "comment_text": "Just don't miss the lastctrain back to La Spezia and all should be fine"}]}, {"id": "2211108135954931", "text": "Can someone please tell me if this will work on hotels in Rome with an adapter? Or do I have to buy a different straight iron ? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2211108135954931/", "likes": 0, "comments": []}, {"id": "2211111202621291", "text": "Does anyone have a private guide for transportation that they used from Rome to Almafi? I know there is buses, & trains to Naples then ferry’s but logistically it just seems easier to hire someone for transportation. From what I read the traffic and roads don’t seem pleasant getting there. Any info is appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2211111202621291/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nTransfer-Amalfi-\nCoast-from-Rome\n/\nd511-238445P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Stephanie Osborn Rushing", "comment_text": "We just did this. Left Rome on twin to Naples, took regional train to Pompeii and driver from hotel picked up for private transfer to positano. Or u could have the driver take u from Naples. Was 150-190 euros"}, {"username": "Rosa Zordan", "comment_text": "Private car from Rome to Sorrento €495. Beautiful way to travel but train from Rome to Naples good, but local trains, eg Naples to Sorrento 1 hour, basic. But if little luggage and plenty of time great."}, {"username": "Nakitha Badon", "comment_text": "We did a driver and I was $170"}, {"username": "Allison Carlisle Young", "comment_text": "We used limousinrome.co\nm nice prompt and reasonable"}, {"username": "Andrea Bainbridge", "comment_text": "We were very happy with www.amalfilimou\nsinecarservice.\ncom"}, {"username": "Rebecca Yeoh", "comment_text": "I used Rainbow Limos from Naples to Positano but I know they also do pick up in Rome. Would recommend this company, I found them via very good reviews and they lived up to them. Especially appreciated thorough communication at time of booking and also the day before pick up."}, {"username": "Judy L Machi", "comment_text": "We took the train from Rome to Florence. Really fast and comfortable 👍"}, {"username": "Hunter Lihas", "comment_text": "Hitch Hike"}]}, {"id": "2211113975954347", "text": "What’s your favorite things to do and see in Tuscany ?", "link": "facebook.com/groups/1373361046396315/permalink/2211113975954347/", "likes": 0, "comments": []}, {"id": "2211126509286427", "text": "From La Spezia (early AM, bringing all luggages) to Rome, will Pisa be a good quick stopover? Is it worth the travel or just go straight to Rome?\n\nAlso, are there safe luggage storage places at the train station?", "link": "facebook.com/groups/1373361046396315/permalink/2211126509286427/", "likes": 0, "comments": []}, {"id": "2211126422619769", "text": "Looking for some advice. Booked 3 nights in Rome instead of 4, dummy me. Hotel in Rome is booked, also Arbnb we were staying in Florence can't accommodate an extra night. How doable is Assisi or Orvieto for 1 night on our way towards Rome. Is this a good idea, I'm open to suggestions. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2211126422619769/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nAssisi-and-Orvie\nto-Day-Trip-fro\nm-Rome/\nd511-2390GRET13?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Cinzia Berletti", "comment_text": "Ciao!!\nI just booked a hotel in Orvieto and there are many rooms available.\nI think Orvieto is lovely."}, {"username": "Linda Chase", "comment_text": "Love Assisi"}, {"username": "Jaime Cleek", "comment_text": "We are doing that. It’s a 2.5 hour to Rome we are going one night to drop my sons off"}, {"username": "Dawn Falsinotti", "comment_text": "Assisi is fabulous."}, {"username": "Kathy Tully Sexton", "comment_text": "We did one night in Orvieto two weeks ago. Totally doable. Our son did it as a day trip from Rome. Orvieto has wonderful restaurants with a small town local feel. Be sure to have dinner there. Make reservations as we saw many turned away."}, {"username": "Dr-Jon Warnecke", "comment_text": "Connect Assisi and nearby Spello, or Perugia on your way to Florence"}, {"username": "Robin Burrell", "comment_text": "Orvieto for a night is a wonderful idea."}, {"username": "Dixie Kotylak", "comment_text": "I think Assisi for one night would be lovely! Good luck!"}, {"username": "Brian Osman", "comment_text": "Loved Assisi!!!!"}, {"username": "Rose Turdo", "comment_text": "Bolsena"}, {"username": "Barbara Bastianini", "comment_text": "I love and have stayed in both Assisi and Orvieto. You can’t go wrong either way."}, {"username": "Toni Marie", "comment_text": "Love assissi"}, {"username": "Lucrezia Folger", "comment_text": "Check. I love both however Orvieto is is much closer and of course beautiful, Assisi is great but a lot for 1 night and a trek."}, {"username": "Cindy Sguazzin", "comment_text": "I absolutely adored my day in Tivoli! Historically interesting and Absolutely Gorgeous!"}, {"username": "Beverley Milson", "comment_text": "Love both but for just one night between Rome & Florence would choose Orvieto. Beautiful countryside, wonderful cathedral… a genuine medieval city only about an hour from Rome."}, {"username": "Lynette Leone Watkins", "comment_text": "Both are not only doable but wonderful! Do it!"}, {"username": "Pamela Mcgahagin", "comment_text": "Assisi is wonderful...hav\nen't been to Orvieto, but you can't really go wrong."}, {"username": "Lisa Smith", "comment_text": "Fiosole is lovely too"}]}, {"id": "2211153739283704", "text": "Ok so we won’t drive in Rome. We do want to drive from Rome down to Sorrento. We want to see the Blue Grotto. Any info or suggestions will be appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2211153739283704/", "likes": 2, "comments": [{"username": "Ted Kostisin", "comment_text": "You absolutely can. I've done it. It requires patience, ability to drive in stressful conditions and focus. The driver will not enjoy the alamfi cost road scenery, but tge passengers will. It saves you a ton of time dealing with public transportation."}, {"username": "Stephen Henn", "comment_text": "Rent a small car as the road is narrow. You may still need to fold in the mirrors when meeting oncoming buses. Get an international driver permit at AAA. Video outside of car at pick up and drop off so you have proof of its condition should issues arise later. If you’re staying in Sorrento, hopefully they have parking available."}, {"username": "Sheba Siddiqui", "comment_text": "We just did that. Rented a car from Rome. Stopped in Naples for pizza, spent four days in Sorrento, drove through the Amalfi coast and are now headed towards the southern point of Italy. We have four kids so we have a minivan and we’ve been fine. We were nervous about the roads, because everyone keeps saying how treacherous they are, but it’s not bad at all. We did the road to Hana in Hawaii last year, which is the most nerve-wracking drive. This is not bad at all and there are tour buses doing it all day long. Go for it you will love it!￼￼"}, {"username": "Gina Romano Peralta", "comment_text": "Following. Would love names of rental car cos and specific type of car. I know the roads are sooo narrow there but still need space for luggage"}, {"username": "Paul Anderson", "comment_text": "Make sure you get hotels with parking"}, {"username": "Laura Jetton", "comment_text": "I would take a train"}, {"username": "Rachael Richardson", "comment_text": "Blue grotto was not open when we did capri water level too high so check before you go !"}, {"username": "Mari Falcone", "comment_text": "I rent a car every time I go (about 30 times): I've never gotten an international driver's license....\nSome suggestions: make sure you ask for automatic if you don't want to drive stick on narrow mountain roads. I always rent from Hertz but I'm not saying they're the best. Learn about how to do the tolls on the roads: which lanes to be in so you're able to pay correctly. The highways are wonderful but there are tons of speed traps. We always got our insurance through our AMEX card but Italy is one of 3 countries in the world where AMEX doesn't cover auto insurance in case you dent the car. Don't ask me how I found this out. Some of the gas stations are interesting but you can always find one where someone will pump your gas. Parking spaces are 2\" smaller than whatever car you're getting. On two lane highways Italians make a third lane in the middle to pass. It's really fun to drive there until you're in a roundabout. In a crowded city."}]}, {"id": "2211135699285508", "text": "Can anyone please provide me your reviews, photos or experiences with 2 hotels in Venice? Hotel Cavaletto\nHotel Firenze\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2211135699285508/", "likes": 0, "comments": []}, {"id": "2211161582616253", "text": "Random question! Can anyone recommend a travel steamer that works abroad? The ones I found on Amazon only mention good to travel in the US. I am afraid it will burn out even with a converter. Thank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2211161582616253/", "likes": 0, "comments": []}, {"id": "2211168715948873", "text": "Looking for restaurant recommendations near St Peters Square. Tried searching the group but didn't find much. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2211168715948873/", "likes": 0, "comments": []}, {"id": "2211170249282053", "text": "Hello.\nThanks to admin and all posters for making this a great group.\nWhat is the best app for train-rides in Italy?\nAnd traveling on weekdays between Bologna, Firenze, Rome and Rimini, when is rush time, and what time of day will there be likely to be more calm. I can get up really early, no problem. I can sleep when Im back home. 😁", "link": "facebook.com/groups/1373361046396315/permalink/2211170249282053/", "likes": 0, "comments": []}, {"id": "2211261475939597", "text": "Highly recommend Life restaurant in rome.", "link": "facebook.com/groups/1373361046396315/permalink/2211261475939597/", "likes": 2, "comments": []}, {"id": "2211265165939228", "text": "Salve! I'm trying to find and buy old style Italian charm bracelets and thought the group might help, also since there are many locals here ♥️ Does anyone know if I can find these in Catania or Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2211265165939228/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.ebay.it/itm/\n254707263681?_tr\nkparms=amclksrc\n%3DITM%26aid%3D\n1110006%26algo%\n3DHOMESPLICE.SI\nM%26ao%3D1%26as\nc%3D20200818143\n230%26meid%3D73\nfaed78459747a0a\ncee4d76c997f047\n%26pid%3D101224\n%26rk%3D2%26rkt\n%3D5%26sd%3D254\n707263677%26itm\n%3D254707263681\n%26pmt%3D0%26no\na%3D1%26pg%3D20\n47675%26algv%3D\nDefaultOrganicW\nebV9BertRefresh\nRanker%26brand%\n3DMorellato&_tr\nksid=p2047675.c\n101224.m-1"}]}, {"id": "2210799995985745", "text": "Will be in Florence next week. Help me decide between Grotta Guelfa and Trattoria Dall Oste!", "link": "facebook.com/groups/1373361046396315/permalink/2210799995985745/", "likes": 2, "comments": [{"username": "Carol Ann Nemecek", "comment_text": "Passports? Carry with u or copies?"}, {"username": "Robyn Lawson", "comment_text": "Oh that’s just awful ! But you are okay that’s the main thing!"}, {"username": "Maria Delaney", "comment_text": "If you are going for steak definitely Trattoria dall’ Oste"}]}, {"id": "2211240692608342", "text": "Beautiful castle & love story ~ Trieste, Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2211240692608342/", "likes": 4, "comments": [{"username": "MK Vang", "comment_text": "I was there In Italy but didn’t get to go here. I was in Cinque Terre.."}, {"username": "Fawn Nguyen", "comment_text": "Beautiful and will visit one day"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2210864272645984", "text": "Traveling to Pompeii just got easier (and faster) thanks to a new, high-speed train link directly connecting the ancient archaeological site and the Eternal City:", "link": "facebook.com/groups/1373361046396315/permalink/2210864272645984/", "likes": 17, "comments": [{"username": "Bambi Harris", "comment_text": "really great news but still doesnt help me! (weeping) I have to go on a wednesday!"}, {"username": "Annof RedGables", "comment_text": "Will this be an ongoing service or just this year?"}]}, {"id": "2210950212637390", "text": "Best airline (experience and connections) from Boston to Venice and/or Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2210950212637390/", "likes": 0, "comments": [{"username": "Angie McKee Roth", "comment_text": "Bueller? Anyone?!"}, {"username": "Rhona OConnor", "comment_text": "Check out Aer Lingus The bonus is you pre clear border control in Dublin on your way back and land in the US as a local domestic flight. Big time saver."}, {"username": "Judi Kelley Houpert", "comment_text": "My cousin took Aer Lingus from Boston to Rome and had a good experience. You could also do that from Hartford. Ciao Bella!!"}]}, {"id": "2210968092635602", "text": "What is the weather in end October in Rome, going on a European cruise.", "link": "facebook.com/groups/1373361046396315/permalink/2210968092635602/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "If you're lucky you get nice weather with crisp clear skies and beautiful sunsets"}, {"username": "Dominika Varga", "comment_text": "5 years ago we went in the beginning of November and we got the rain of our life. It was raining so hard, we were soaking wet after a few hours outside.😅 But we powered through and didn't let this ruin our trip."}]}, {"id": "2210970395968705", "text": "Love Venice ❤️ beautiful everywhere.🇮🇹🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2210970395968705/", "likes": 5, "comments": []}, {"id": "2210977485967996", "text": "Does the Temple of Vesta still exist?", "link": "facebook.com/groups/1373361046396315/permalink/2210977485967996/", "likes": 1, "comments": [{"username": "Chiara Normanno", "comment_text": "It's in the Foro Romano"}]}, {"id": "2210984032634008", "text": "My daughter and I did a thing… in Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2210984032634008/", "likes": 355, "comments": [{"username": "Mohammad Farooq Omerzada", "comment_text": "Live is beautiful"}, {"username": "Mohammad Farooq Omerzada", "comment_text": "La vita è bella"}, {"username": "Carolyn Frey", "comment_text": "I was in contact with the artist for two months before I arrived to see the piece he designed for me was AMAZING.....💚💚🥰 \"free spirited one\""}, {"username": "Robyn Harris", "comment_text": "Did you get this when you first arrived in Rome? Hubby and I plan to get one when in Rome but are leaving for Sorrento after that and am concerned about swimming in Sorrento with a new Tattoo😳"}, {"username": "Natalie Prior", "comment_text": "❤️"}, {"username": "Brittney Ziemniak", "comment_text": "Yvonne Lopez"}, {"username": "Judy Carey", "comment_text": "Where did you go? I'm already planning mine for March!"}, {"username": "Anne Bou", "comment_text": "Nadine Tremblay 😲 on devrait se faire faire un souvenir"}, {"username": "Elizabeth Jayne Harris", "comment_text": "Melissa Fass shall we? Like we did in Puerto Rico lol"}, {"username": "Leigh Ann Fan Farmer", "comment_text": "My daughter got her first one in Venice in June!"}, {"username": "Kim Rogers", "comment_text": "Love it!!"}, {"username": "Jen Klemm", "comment_text": "When in Rome..."}, {"username": "Kelli Barnes", "comment_text": "Angie Smith I have ideas"}, {"username": "Cindy Sue", "comment_text": "Sharon Giankos…… hmmmmmm tattoos in Rome ?"}, {"username": "Joann Santagata - Pruitt", "comment_text": "Julie Gayde Benden\nWhat does it say?"}, {"username": "Kelly Peagler Myers", "comment_text": "Shawnna Chance Charles Myers"}, {"username": "Kathleen Craig", "comment_text": "Love it"}, {"username": "Richard Harris", "comment_text": "Elizabeth Jayne Harris"}, {"username": "Lisa Angelillo Bossart", "comment_text": "Life is beautiful!"}, {"username": "Erna Mueller", "comment_text": "Eon Viljoen"}, {"username": "Melissa Ropp", "comment_text": "Carla Henry"}, {"username": "Justine Ldc", "comment_text": "Bonjour,\nJ’aimerai me faire tatouer avec mon copain à Rome également, ou êtes vous allez ? Avec ou sans RDV ? Merci d’avance 🙂"}, {"username": "Michelle Zappa", "comment_text": "Ashley Nicole Cooper read comments there’s places in Rome we could go to!"}, {"username": "Marguerite Lorenzi Gonzales", "comment_text": "Love it! My daughter and I just did a thing in Paris…"}, {"username": "Doreen Burbeck Engel", "comment_text": "We did also!"}, {"username": "Bernadette Adelheid Zephyr", "comment_text": "I also did! In Genova 😍"}, {"username": "Glez Lopez G", "comment_text": "Same here"}, {"username": "Beth Ann", "comment_text": "Got mine in Lucca - insanely talented artist"}, {"username": "Christy Norland", "comment_text": "Julie may I ask how painful that location was? My daughter and I are thinking of doing something similar in Florence in that ankle location but I was told it's really panful there!"}, {"username": "Robyn Boyle", "comment_text": "Vincent Boyle Neeka Boyle travel tattoos?"}, {"username": "Louise Thaell", "comment_text": "What is the 2nd word?"}, {"username": "Kejdi Okej", "comment_text": "What is the 2nd word"}, {"username": "George Csifo", "comment_text": "We should’ve done this Emily Csifo"}, {"username": "Jo Bourke", "comment_text": "Scarlett Mcinnes"}, {"username": "Simone Gore", "comment_text": "Taryn Gore 💗"}, {"username": "Dianne Novak Iadanza", "comment_text": "What a wonderful solvonier lol. Love your idea."}, {"username": "Amanda Igoe", "comment_text": "Well that was clever! At least it only small"}, {"username": "Cristina Fraello", "comment_text": "Julie Gayde Benden hi Julie can you provide the tattooist details. I’d like to get one with my daughter when we are in Rome 😍"}, {"username": "Lori Wroblewski", "comment_text": "I did too!! Best souvenir ever!"}, {"username": "Lorissa Gill", "comment_text": "The blow out on that ink on the left one is not gonna be good 😬"}, {"username": "Angela Brevetti-Cantone", "comment_text": "Love it!"}, {"username": "Kelliann Faheymullany", "comment_text": "Beautiful!! Luv this!!"}, {"username": "Kit Nader", "comment_text": "Love it."}, {"username": "Megan Barnes Johanning", "comment_text": "Gina Johanning souvenir idea!?"}, {"username": "Lorena Vaccaro Golias", "comment_text": "Kaitie Rose Now that’s an idea🙃"}, {"username": "Destinee Kathryn", "comment_text": "This is my Rome tattoo! Cupid with “Love is Blind” 🖤 love travel tattoo souvenirs!!"}]}, {"id": "2211001002632311", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2211001002632311/", "likes": 11, "comments": []}, {"id": "2211012912631120", "text": "Hooray!! Tickets actually available on Coopculture for the night tour in English!!\nhttps://ecm.coopculture.it/index.php?option=com_snapp&view=event&id=2E4CF2E0-F5B7-7757-4241-0173584374D6&catalogid=06B97E06-CA46-981E-360A-017A9FE4C3F6&lang=it", "link": "facebook.com/groups/1373361046396315/permalink/2211012912631120/", "likes": 12, "comments": [{"username": "Trudy Smithers", "comment_text": "I got 2 tickets today for early September 🥳"}, {"username": "Kejdi Okej", "comment_text": "I got 2 tickets today for early september 🥰"}, {"username": "Alison Simon-Ostan", "comment_text": "I got 4 tickets this morning, I was so excited to see the green availability this morning 😂🥳"}, {"username": "Sharon Teoh", "comment_text": "Wow. It’s better than striking lottery. May I ask if it’s exactly 30 days to your tour? And was it released at 12am sharp on that date? And may I also know the difference between the green and pink boxes?"}, {"username": "Michelle Lynch", "comment_text": "Sue Weir"}, {"username": "Kari O'Brion", "comment_text": "I have been refreshing my screen for three days straight trying to get Coop tickets with no luck. Only 1 ticket available at random times. Guess I'll have to take my chances with our 3rd party reservations. 😔"}, {"username": "Melaine Morrow", "comment_text": "I was waiting for the 9th and they seemed to go on sale at least 30 days+2 days prior so I missed out 😩 I thought I would need to be up at 2am tonight in Aust"}, {"username": "Elizabeth Hartzell", "comment_text": "Lucky you! I booked this tour in Italian for 8/31 🥲"}, {"username": "Alisa Flores", "comment_text": "Gaylee Thompson Demlinger"}, {"username": "Amanda Douvos", "comment_text": "Just got mine now ( I think as receipt emailed back is all In Italian so not sure 🤔)"}]}, {"id": "2211045745961170", "text": "recommendations for restaurants in Milan close to the Cathedral?", "link": "facebook.com/groups/1373361046396315/permalink/2211045745961170/", "likes": 0, "comments": []}, {"id": "2211088079290270", "text": "Looking for as much art of Caravaggio and Tiepolo in Italy. Anyone who knows?", "link": "facebook.com/groups/1373361046396315/permalink/2211088079290270/", "likes": 0, "comments": []}, {"id": "2211113682621043", "text": "Best/safest place to exchange $ for € as soon as we land at or near FCO?", "link": "facebook.com/groups/1373361046396315/permalink/2211113682621043/", "likes": 5, "comments": [{"username": "Janine Emma Lucas", "comment_text": "At home. Cheapest rate"}, {"username": "Shelagh Kosinski", "comment_text": "Do before leaving home. We had friends who ran into problems with their cards. Took them several days to get fixed. We became their bank until they could get it fixed"}, {"username": "Brian Osman", "comment_text": "Do it at your bank before you leave"}, {"username": "Lois Ann Layman", "comment_text": "You should do your exchange before you leave home."}, {"username": "Carolyn Dahl", "comment_text": "Rick Steves book says the ATM’s at the airport are safe."}, {"username": "Gail Dial Harris", "comment_text": "B4 you go! N"}, {"username": "Sara R. Anderson", "comment_text": "Your local bank..."}, {"username": "Wolfgang Nitsch", "comment_text": "Frankfurt airport"}, {"username": "Sherri Leis Dillavou", "comment_text": "Airport"}, {"username": "Veronica Nikonov", "comment_text": "I usually use decentralized exchanges, pay directly, and it's best to go down south without too much cash. Too many people squatting at banks for tourists traveling to Italy."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "I recommend doing it at home before arriving in Italy."}, {"username": "Sandra Maldonado", "comment_text": "For nothing in the world I will leave home without some of the money of the country I’m traveling to."}, {"username": "Candace Beutell Gardner", "comment_text": "You can just ask your bank in the States to get you the Euros. So much easier. Less worry."}, {"username": "Jennifer Gustafson", "comment_text": "Right at the airport otherwise there on almost every street."}, {"username": "Monica Roman-Fazio", "comment_text": "The post office ATMS are safe in italy. You should exchange at bank at home even aaa does the exchange it take approximately 2 weeks. Just keep checking exchange rate"}, {"username": "Milt Lawhorn", "comment_text": "The best place is your bank in the states, if they happen to not have them they can get them within a couple of days."}, {"username": "Mary Mahony", "comment_text": "Order foreign currency from your bank before leaving. I went through my bank and it was in hand within 2days. I ordered enough euros and 2 other currency to handle the first day in each country - can get to ATM as I need….so easy and peace of mind with one less travel logistics. Bon voyage!"}, {"username": "David Davey", "comment_text": "Secret is convert before you leaving US, pls don’t broadcast. 😂"}, {"username": "Rosanna Hardeman", "comment_text": "ATM"}, {"username": "Chris Arrona", "comment_text": "ATM"}, {"username": "Linda Wallace Smith", "comment_text": "Bank ATM"}, {"username": "Michelle Plakosh", "comment_text": "Super easy to do this in the US thru your bank."}, {"username": "Michael Spiekermann", "comment_text": "As I recall, last fall, there were no bank affiliated ATMs at FCO, only a commercial ATM which charged exorbitant fees"}, {"username": "John Spensieri", "comment_text": "Why not use an atm to get euros?"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Just past baggage claim you will find bank affiliated Bancomat ATMs. Get some euro there. All Bancomats in Italy have no fees and exactly the same rate of exchange."}, {"username": "Lisa Akira", "comment_text": "Your home bank before you go. Allow a day or two depending on where you live. Euros may be easiest to get. You won’t need a whole lot of cash. Everything is scanned ccards."}, {"username": "Susan Parker Clifton", "comment_text": "Use atms"}, {"username": "Teresa Heran", "comment_text": "I always get from my bank at home before I leave"}, {"username": "Sande Ricci", "comment_text": "Do it before you go."}, {"username": "Fran Scotti Lindner", "comment_text": "Atm"}, {"username": "Alexandra A Welker", "comment_text": "I recommend changing some before you leave, less worry when you already have working currency when you arrive. Triple A can exchange them or some select banks like Chase."}, {"username": "Victoria Marchetti", "comment_text": "The airport exchange was too expensive. They charged 20% commission plus a 5% fee on top of the exchange rate. I exchanged at a bank back home and there was no fee. If you take out money from an ATM, refuse all exchange rates they offer and it will force your back to get the best rate for you for a very small fee if any fee at all."}, {"username": "Michelle Dougherty", "comment_text": "Don't. Why would you? Either do it before or just use an ATM and be sure to select 'proceed without conversion '"}, {"username": "Mike Guluk", "comment_text": "Use your debit card at an atm in rome"}, {"username": "Jenn Messina Babore", "comment_text": "Get Euros at your home bank otherwise make sure it is a bank affiliated ATM."}, {"username": "Mark Spielman", "comment_text": "ATM's at FCO, or patrons on bus #64 will exchange for you, directly out of your pocket into theirs."}, {"username": "Bill Shafer", "comment_text": "Here is our recent experience in Rome, with exchanging currency\n\n$1,000.00 to Euros\nexchange rate .94 /1.06.\nNewark Airport €830.00\nRome airport €726.00\nRoma train station €820.00\nAcross from train station, €875.00\nIn front of train station by snack bar\n€900.00\n\nIf you feel the need to have euros the moment you land, only get a small amount at the airport. Wait until you get into the city and go to a ATM at an actual bank, they will charge less fees and have a better conversion rate. The airports and train stations are a rip off."}, {"username": "Allan Olexa", "comment_text": "Go to a bank atm in the city. Use a no fee debit card."}, {"username": "Erika Clinton", "comment_text": "Thank you all!"}, {"username": "Robert Lawshe", "comment_text": "Use the ATM at the airport. Make sure, and I will repeat. Make sure you do the transaction in euro. Decline the currency conversion to US dollars."}, {"username": "Jay Parekh", "comment_text": "I spent 8 day in Italy and hardly used any cash. I got about 20€ converted and used for tips when I felt I wanted to give but was never expected."}, {"username": "Tara McCloud Odebrecht", "comment_text": "ATM - decline conversion fee. It’s easy and fees are low. Your bank will set the conversion. We always do this - grab a few hundred dollars when we land. We use our card to make almost all purchases while there."}, {"username": "Kurt Tilton", "comment_text": "Use an ATM"}]}, {"id": "2211133509285727", "text": "Is GET YOUR GUIDE a reliable/\ntrustworthy site to purchase tickets for tours/entry tickets for Rome, Florence, Pisa, Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2211133509285727/", "likes": 3, "comments": [{"username": "Jenn Messina Babore", "comment_text": "GYG and Viator are legit travel sites, but they are only the middle man for booking with the actual tour operator and not responsible for any cancelled tours. Always best to book direct if you can."}, {"username": "Sarah Bullen", "comment_text": "Just be aware that the meeting point is not always close to the attractions. I had to walk about 30 minutes from the colosseum to get my tickets from get your guide"}, {"username": "Heather Sechrist", "comment_text": "We had a great experience and didn’t have any cancelled in July. It cut out the middle man and we never had to wait in line for tickets.\n\nAs mentioned above, always check where the meeting point is so you don’t waste time. In the case of the colosseum, it was at the opposite end of the forum but they used that to give a tour on the way. It was worth it."}, {"username": "Lisa Pirone Kaiser", "comment_text": "We had a great experience with them in June."}]}, {"id": "2211138392618572", "text": "Any advice on best way to get from Rome to Terni? 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2211138392618572/", "likes": 0, "comments": [{"username": "Stefano Bressanelli", "comment_text": "Train from Roma Termini to Foligno."}, {"username": "Al-Amin Sharif", "comment_text": "Train is good"}]}, {"id": "2211145309284547", "text": "We are going to Italy in October, making a stop in Florence then Rome , Almafi coast . I only have 10 days. I really want to go to Switzerland. I was thinking a train into Switzerland.. what kind of transportation should I do? Something pretty", "link": "facebook.com/groups/1373361046396315/permalink/2211145309284547/", "likes": 5, "comments": [{"username": "Chiara Normanno", "comment_text": "You have to go all the way up to the North to catch the Bernina, there isn’t really much time imho"}, {"username": "Wade Bailey", "comment_text": "What are you cutting Florence, Rome or Amalfi Coast. You have a southern Italy trip planned. Stay south."}, {"username": "Vanessa Durkin", "comment_text": "You need that time to thoroughly explore italy sure you can get a train from rome tho try omio app"}, {"username": "Mike Guluk", "comment_text": "If you are in lake como area Lugano Switzerland is a 30 minute drive bring your passport"}, {"username": "Jenn Messina Babore", "comment_text": "I would save Switzerland for a separate trip. Your cities are all south Italy."}, {"username": "Glenn Todd Webb", "comment_text": "Not enough time with those 3 places. Drop Amalfi and then you could do 3 days Florence, 3 days Rome, and go up into Switzerland. But I think it’s still a bad idea cutting too much off Italy. Make it a different trip."}, {"username": "Kit Nader", "comment_text": "Venice? Most remarkable city in the world. You can't miss Venice! Not that far from Florence. I'd think I'd died and gone to heaven if I was travelling from Italy to Switzerland....\ntrains are great ...lucky you!!"}, {"username": "Allan Olexa", "comment_text": "Plan a separate trip to Switzerland."}, {"username": "Beth Spiehler Selvia", "comment_text": "If you are in the Como area, take the Bernina Express from Tremezzo to Switzerland. There are 3 different places you can get off in Switzerland. It’s a breathtaking ride on a panoramic train. Gorgeous!"}, {"username": "Rose Turdo", "comment_text": "Land in Milsn,it's a 2 hour drive"}]}, {"id": "2211149299284148", "text": "Well another tour company has cancelled their Colosseum underground tour completely. City Wonders.", "link": "facebook.com/groups/1373361046396315/permalink/2211149299284148/", "likes": 4, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Book directly on Coopculture.it for Colosseum tours"}, {"username": "Karen Blackmore", "comment_text": "Only reliable place to buy is direct on coop culture website. Tickets issued 30d before (usually). Some availability for the 10:30pm tours as shown below. Red sold out. Grey yet to be released."}, {"username": "Karen Blackmore", "comment_text": "https://\necm.coopculture.\nit/\nindex.php?option\n=com_snapp&view\n=event&id=2E4CF\n2E0-F5B7-7757-4\n241-0173584374D\n6&catalogid=06B\n97E06-CA46-981E\n-360A-017A9FE4C\n3F6&lang=it"}, {"username": "Cindy Morgan Schmoe", "comment_text": "They canceled ours a couple months ago and said we would get a 20% refund and never received it.."}, {"username": "Jaime Cleek", "comment_text": "They are cracking down on things."}, {"username": "Joel Minter", "comment_text": "Alicia Thompson Minter"}, {"username": "Kara Paxton", "comment_text": "We used GetYourGuide and had no issues at all. Our tour was the Rome Colosseum Underground and Forum guided tour. Just had our tour 4 days ago"}, {"username": "Heidi Nichole Clark", "comment_text": "Jamie Elam Lynch are ours still good?"}, {"username": "Bethany Morrow", "comment_text": "People need to buy tickets from an official site, Coop Culture. I have heard from and seen so many people writing about their excursion/\ntickets getting cancelled because they were from 3rd party sellers. Only use www.coopculture\n.it then click \"'menu\" then scroll down to \"English\". Then, you can search for any activities and site tours you want to book. It is an authentic ticket site. We used them for our colosseum tour and underground tour of the colosseum. We enjoyed it. We went last week."}, {"username": "Wendy Spano Bracco", "comment_text": "It’s the underground. They don’t have the tickets and they all cancel now. I booked purposely without the underground. I don’t want to get cancelled."}, {"username": "Makala Watkins", "comment_text": "We were told by our travel agent that the government was no longer allowing the underground of the colosseum to be toured."}, {"username": "Alison de Lisle", "comment_text": "We have our tour tomorrow morning. Fingers crossed 🤞 it goes ahead."}, {"username": "Brian Osman", "comment_text": "Don't use 3rd party"}, {"username": "Charlotte Clapperton", "comment_text": "Nicole"}, {"username": "Tracy Rubenstein Calabrese", "comment_text": "We used Viator and it was worth another company but all good. No cancellations. Just there last week. Did underground and area."}, {"username": "Mil Myvegas", "comment_text": "Mil Myvegas\nIf you are not looking for a guided tour then consider The PARCO Membership from CoopCulture. You still need to reserve your free admission to the Colosseum by choosing your preferred date and time, but there is a special link for members to do this and there is currently availability (9:30 am - 5:30 pm) everyday through the first week of September. I purchased the membership and used it two weeks ago. You will need to redeem the voucher at the ticket booth, but there is a designated window for members and there’s no need to stand in the long line for same day tickets. If you purchase the membership you will need to present your passport/s. https://\nwww.coopculture.\nit/en/products/\nparco-membership\n/"}, {"username": "Jennifer Collins-Goodwin", "comment_text": "Jason Goodwin"}, {"username": "Jane Page", "comment_text": "We did the underground tour yesterday with The eyes of Rome. Was fantastic."}, {"username": "Denielle Sutton", "comment_text": "We booked several tours with Get your guide, no issues at all 😊"}, {"username": "Donna Spencer", "comment_text": "Lynn Mcconnell."}]}, {"id": "2210556499343428", "text": "Is driving in Rome a good idea or not? UPDATE: okay thank you! I got a resounding no lol.", "link": "facebook.com/groups/1373361046396315/permalink/2210556499343428/", "likes": 10, "comments": [{"username": "Dianne Ellis Patureau", "comment_text": "Dianne Ellis Patureau"}, {"username": "James-Kathy Dickerson", "comment_text": "No"}, {"username": "Murphy Aileen", "comment_text": "Depends on where you drive from. From USA? Nope. Anywhere in Europe it is like driving in to any big city. Traffic, crummy parking, one way streets, and now, those golf cart tours😅"}, {"username": "Brice Blosser", "comment_text": "There’s no real reason to"}, {"username": "Rebecca Wilcox", "comment_text": "No, no need to we walked everywhere"}, {"username": "Jo Daly", "comment_text": "Being a passenger in a car in Rome is an experience let’s just say. 😂😂😂"}, {"username": "Gary Bailey", "comment_text": "imagine driving around Boston with 3 times the traffic, fewer traffic laws and a few million bikes and scooters"}, {"username": "Eugene Klein", "comment_text": "It is only a good idea if you audition for the next James Bond part. :)"}, {"username": "Mariska Schooneveld", "comment_text": "Nope"}, {"username": "Anthony Attanasio", "comment_text": "Not."}, {"username": "Jeanne Zorich", "comment_text": "No"}, {"username": "Deborah Perry", "comment_text": "Crossing the street in Rome is hard enough, wouldn’t dream of driving 🤣🤣"}, {"username": "Lise Stott", "comment_text": "Not lol"}, {"username": "Sagine Rivera", "comment_text": "No no no"}, {"username": "Dawn Falsinotti", "comment_text": "No"}, {"username": "Joseph Ferragina", "comment_text": "Joseph Ferragina"}, {"username": "Kathleen Hammer", "comment_text": "My husband did the driving. I didn’t think it was bad lol 😝"}, {"username": "Cindy Sguazzin", "comment_text": "No, not—unless you’re stark, raving mad!"}, {"username": "Pong Ac Ai", "comment_text": "Taxi"}, {"username": "Antonella Piccolo", "comment_text": "No"}, {"username": "Sandra Kingsley", "comment_text": "No or Florence!"}, {"username": "Jeanette Colon", "comment_text": "No"}, {"username": "Katia Macri-Roberts", "comment_text": "Sure!\n\nIf you love a migraine, elevated blood pressure, and prolonged hair loss from ripping it out of your head. (which, mind you, would be less painful than the driving experience itself)"}, {"username": "Jose Velez", "comment_text": "No way José"}, {"username": "Patty O'Brien Wrape", "comment_text": "No, previously mentioned vespas and motorcycles plus no parking. We dropped our rental car a couple of train stops outside the city. There are many accessible places to pick up rental cars outside the city center if you want to transit between cities."}, {"username": "Lea Lorraine Nelson", "comment_text": "Why would you want to drive???\nYou will be too focussed on the traff8c and miss seeing all that is around you!\nWalking is the best..you will find hidden treasures, see beautiful architecture and varying colours of the buildings.,\nParking is a nightmare too!\nHave been to Roma many times and love walking seeing appreciating this beautiful City."}, {"username": "Rose Turdo", "comment_text": "Use GPS"}, {"username": "Chris Aman Florian", "comment_text": "No!!! Crazy drivers, no rules"}, {"username": "Ian Beyer", "comment_text": "Depends who’s driving."}, {"username": "Vittoria Blasio", "comment_text": "It’s an adventure"}, {"username": "Andrea Karina Niazi", "comment_text": "Taxi better idea"}, {"username": "Michael Imbelli", "comment_text": "Rome is a very walkable city. Travel by subway is east. Buses can be problematic with pick pockets. Taxis are convenient and can be arranged by your hotel.Smaller towns can be reached by train."}, {"username": "David King", "comment_text": "If you can adjust to:\n—the idea that traffic lanes are not real (even when marked),\n—speed limits are only for highways with speed cameras,\n—motorcycles have the right of way at all times (even when they are dead wrong), and\n—the Italian police dealing with your fender bender aren’t as hot, nor as patient, as you may think they are on social media,\nTHEN GO FOR IT!\n\nWe always secure a driver, take trains or use Uber."}, {"username": "Dawn Richards", "comment_text": "God I wouldn't you take your life in your hands. You need to be an expert rally driver"}, {"username": "Saška Bajat", "comment_text": "We rented a car and had no problems in Rome 🤷‍♀️. We doing 50 days in italy so thats why we did the car. But if u just doing rome. You can walk or take the the bus. From vatican to colosseum is a 50 minute walk. Which goes by quick cuz the views are just breathtaking 💙"}, {"username": "Lynn Francisco Casella", "comment_text": "Take a hotel tram"}, {"username": "Jules Winter", "comment_text": "Good idea definitely sensible idea no 😆"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "No!"}, {"username": "Sylvia Martens", "comment_text": "Sylvia Martens"}, {"username": "Mark Lynch", "comment_text": "I wouldn’t, but of course the choice is yours. The drivers are aggressive in Italy but not rude like Americans. Parking is a real pain. Very limited with tiny spaces. But I’ve noticed that Italians don’t get road rage like half of all Americans do!"}, {"username": "Janette Graham", "comment_text": "Janette Graham"}, {"username": "Olga Plitt", "comment_text": "Not"}, {"username": "Gayl Pizzano Hurley", "comment_text": "Heck no!!!"}, {"username": "Jodie Christensen", "comment_text": "Watch out for the all the Vespas zipping around. They have the right of way and are EVERYWHERE."}, {"username": "Patty Bauer", "comment_text": "Bad idea. Sometimes scary to walk in Rome. Easy to get around without a car."}, {"username": "Karen Kerr", "comment_text": "No"}, {"username": "Michael Widjaja", "comment_text": "Good if you're into pain and difficulty 😁😁😁"}, {"username": "Melissa Torres Collins", "comment_text": "nooooooooo"}, {"username": "Claudette Franco", "comment_text": "No 😑"}, {"username": "Joellen Baltimore Leo", "comment_text": "Not a good idea"}, {"username": "Abe Michelson", "comment_text": "No. Trains, Walk, Bus, Taxi occasionally"}, {"username": "Sandy Radican Shikaly", "comment_text": "NO"}, {"username": "Antonio Aloè", "comment_text": "Depends how a good driver you are and where in the world you have been driving.I found driving in London,Amsterda\nm and New York among other cities,more complicated.\n,"}, {"username": "Jerry Scaglione", "comment_text": "Depends"}, {"username": "Sedalise Hernandez", "comment_text": "Not!!"}, {"username": "Kate Piszczek", "comment_text": "Kate Piszczek"}, {"username": "Rick Calabro", "comment_text": "You are not allowed to drive in the inner city or you will get a ticket, but you probably will not get it till about six months later because it’s all done electronically.\nI got two tickets so far from November."}, {"username": "Marcus Hiesler", "comment_text": "We walked and used hop on hop off buses in Rome. But have driven from Rome to Pescara to Riccione on tbe east coast then Venice. Now in Lugano Switzerland off to France tomorrow then Tuscany. Its been awesome."}, {"username": "Roe Gallo Saks", "comment_text": "No. Don’t stress yourself. Not worth it."}, {"username": "Angelina John", "comment_text": "Angelina John"}, {"username": "John Layman", "comment_text": "We use the metro,or in a pinch use a taxi."}, {"username": "Lynette Garland", "comment_text": "Not lol"}, {"username": "Claudia Jaramillo Giraldo", "comment_text": "We drove all around Italy… Rome is really busy! Traffic is bad! And there is no parking… in Rome we decided to walk or take Uber."}, {"username": "Paul Anderson", "comment_text": "It’s like driving in New York. Not hard. Paris is much worse!"}, {"username": "Rachel Bradfield", "comment_text": "Defo no"}, {"username": "Stefano Bressanelli", "comment_text": "Only the brave. :)"}, {"username": "Lori Greco", "comment_text": "Not a good idea...its madness"}, {"username": "Karen Lyon Barnett", "comment_text": "Noooo"}, {"username": "Bob Lampo", "comment_text": "No way. You’ll never be able to park and essentially you’ll leave your car in one place (hotel who won’t have parking) and cab or walk or bus around town anyway. No parking at any of the venues you will be going to.\nThe Roman’s built great roads but no parking lots."}, {"username": "Diana Bonifaci", "comment_text": "I wouldn't 😅"}, {"username": "Glenn Todd Webb", "comment_text": "Not"}, {"username": "Charles Cordaro", "comment_text": "Oh hell no. They will eat you alive."}, {"username": "Jennifer Lynn Davis", "comment_text": "Absolutely not. The taxis and buses drive with their own rules and there is not enough money in the world to pay me to try it. Lol."}, {"username": "Dan Lehew", "comment_text": "From Montana, I would have been in an accident 20secs after pulling into traffic. Like dodging bullets while walking too"}, {"username": "Randy Webb", "comment_text": "Take our experience and be blessed… DO NOT DRIVE IN ITALY! It’s a nightmare! The high speed trains can get you wherever you want to go in Italy!"}, {"username": "Konstantinos Paraskevopoulos", "comment_text": "Beware of bus lanes.... for traffic cameras 📷!"}, {"username": "Frank Pallante", "comment_text": "Not for the faint at heart"}, {"username": "J Pierce", "comment_text": "Walk!"}, {"username": "Mike Conway", "comment_text": "Lol...ummm. no"}, {"username": "Jeff Gentner EA", "comment_text": "Only if you have lots of time, patience, and practice. Then, think about parking!!!!"}, {"username": "Albert Campagna", "comment_text": "Bad idea!!!"}, {"username": "Mansha Kapur", "comment_text": "I'm a driving instructor and I definitely would not drive in Rome."}, {"username": "Martin Gilchrist", "comment_text": "No"}, {"username": "Sal Facciponti", "comment_text": "I don't think so. Taxi are everywhere plus they drive crazy"}, {"username": "David Horgen", "comment_text": "Absolutely not. We just left there a couple days ago. Spent 3 days there. I am comfortable driving in downtown Los Angeles, San Francisco, pretty much any big city in the United States. But I would never drive there. I was laughing my ass off the whole way in all of the taxis we took"}, {"username": "Lisa Ann Nept", "comment_text": "Taxi for sure....they know how to handle the craziness of Rome driving. Beware of the motor bikes zipping in and out of 🚗"}, {"username": "Phyllis Waring", "comment_text": "Crazy..crazy..c\nrazy idea!!..unless you have a death wish!!\n."}, {"username": "Carrie Stallard", "comment_text": "My husband did it. It was scary but so much easier with all of the driving that we planned to do"}, {"username": "Nan Hanks", "comment_text": "Absolutely not!!!"}, {"username": "Brenda Andrews Priolo", "comment_text": "Oooookaaaay lol!"}, {"username": "Gundega Barkane", "comment_text": "Not. You can get to major spots walking or metro"}, {"username": "Deea Cata", "comment_text": "No"}, {"username": "Mike Ball", "comment_text": "Not worth the risk , use the metro or the local buses , it’s not just the driving it’s finding safe places to park."}, {"username": "Renae Larcus", "comment_text": "Not"}, {"username": "Luis Quílez Alenda", "comment_text": "Not at all...too much traffic and very crazy."}, {"username": "Giulia Cardamone", "comment_text": "The ZTL (no drive zone) restricts your movements and you need to know where it is or you'll cop a huge fine. Basically around the historical centre. Worth researching. Taxi pricing is resonable.\nhttps://\nlurento.com/\nztl-zones-in-ita\nly-2023/"}, {"username": "Vivien Paulik", "comment_text": "Depends on where are you from and how you drive. We had no problem but for us it was us just easier than some places at home. Like we walked around for two days to sightseeing, but because we travelled by car to Rome we experienced the driving too. But we also had no problem with driving in Sorrento and Amalfi Coast while others had. So it is very depends on you"}, {"username": "Michelle Smith", "comment_text": "Very crazy busy\nI say no\nPlenty of public transport and two good legs"}, {"username": "Amanda Igoe", "comment_text": "Not"}, {"username": "Sharyn Wright", "comment_text": "No"}, {"username": "Debbie Walden Panepinto", "comment_text": "Don’t do it!"}, {"username": "Laurie Frainetti", "comment_text": "Driving in and out of the city with a rental, totally okay. But I wouldn’t recommend driving around the city!"}, {"username": "Paula Luca", "comment_text": "No it's not..."}, {"username": "Sandra Shoffner", "comment_text": "Not in the city."}, {"username": "Ted Kostisin", "comment_text": "Drive TO rome, sure. Ditch the car at a rental spot on the perimeter highway. Uber in. Reverse on the way out. I hate waiting for trains and love exploring and detouring on road trips in Europe. Look honey, there's a castle, let's go"}, {"username": "Michael Messina", "comment_text": "Dont bother walking or uderground metro"}, {"username": "Allan Olexa", "comment_text": "NO!!!"}]}, {"id": "2211172542615157", "text": "Be sure to include Menaggio on your itinerary to Lake Como!", "link": "facebook.com/groups/1373361046396315/permalink/2211172542615157/", "likes": 4, "comments": []}, {"id": "2211190219280056", "text": "My friend and I will be arriving in Naples Garibaldi station and have 3 hours before catching a bus at the Metropark. Are there places to eat in the station or along the way— We have to walk about 8 minutes to the Metropark. We have some luggage so love to have restaurant along the way for lunch not too difficult.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2211190219280056/", "likes": 2, "comments": [{"username": "Chiara Normanno", "comment_text": "Good spots aren't really around the station but you can have the most perfect breakfast at Sfogliatelle Calde Attanasio in Vico Ferrovia and try a good pizza at Da Michele. To tell the truth, 3 hours are enough to try and catch the tube for some of the other top rated places"}]}, {"id": "2211198955945849", "text": "Has anyone done the underground tour of Trevi Fountain? If so who did you book it through and what did you think of it?", "link": "facebook.com/groups/1373361046396315/permalink/2211198955945849/", "likes": 0, "comments": []}, {"id": "2211199405945804", "text": "I am looking to find a restaurant in Bologna to end a beautiful 2-week trip in September with 11 dear friends that’s starting in Switzerland and ending in Bologna. Any suggestions would be appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2211199405945804/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211203152612096", "text": "I will be spending 2 days on the Amalfi Coast in September. Anything that is a must do in Positano, Amalfi Town or Ravello?? I have a very short list for each city. So I thought I would check to make sure I’m not missing anything. TIA! 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2211203152612096/", "likes": 13, "comments": [{"username": "Rebecca Yeoh", "comment_text": "One of these gelatos in Amalfi 👌🏼"}, {"username": "Lucy Casado-Martinez", "comment_text": "There’s a lovely museum just as you enter Ravello on the left. Historical garden and castle.\n\nAmalfi there’s lovely beaches and lots of restaurants to go to. We just did a day trip here.\n\nPositano, a lot of shops but can be very crowded. Make sure you walk down to the coast as you get gorgeous views of the flower arches and churches."}, {"username": "Esther Kim", "comment_text": "You should definitely visit the Duomo di Amalfi, which is the magnificent cathedral in Amalfi town. The paper museum in Amalfi is also very interesting. There is a long history of paper making in the area. They sell some beautiful stationery products in the gift shop. Ravello is gorgeous, it has some of the best views along the coast. The gardens and villas are the highlight there, definitely visit Villa Rufolo and Villa Cimbrone. Positano is generally very photogenic and pretty, but also very crowded and expensive. There's nothing specific to see/do there except to just wander around the village, window shop, and enjoy the beautiful setting. If you have time, I would highly recommend a day trip by ferry to the island of Capri, it is one of the loveliest places I've ever been to."}, {"username": "Tiffany Turner", "comment_text": "boat trip to Capri and ride the chair lift up to top in Anacapri"}, {"username": "Sarah Magnusson", "comment_text": "Don’t forget to hike the trail known as the Path of the Gods - start by getting the local bus from Amalfi to Bomerani, the path stretches between Bomerano and Nocelle, then take the bus or walk down the stone steps (there’s quite a lot of them!) to Positano, it’s magical, not to be missed! Wear good shoes and do it on a clear day.😁"}, {"username": "Glenn Todd Webb", "comment_text": "Villa Rufolo and Cimbrone in Ravello. Amalfi cathedral. Skip Positano"}, {"username": "Noopur Kamble", "comment_text": "F"}, {"username": "Jacqui Milford Pruszynski", "comment_text": "We loved the views in Ravello. Villa Rufolo and Cimbrone were beautiful. We stayed on the lower coastline at Villa Scarpariello Relais and LOVED the property there!"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Kendall Wolff", "comment_text": "Adam Kenner"}, {"username": "Debra Quinney", "comment_text": "Capri but my one bit of advice is no matter how busy it seems go straight to the top and work your way down majority do it the other way so many people get stuck at the top in the late afternoon all trying to get back down"}, {"username": "Arina Dard", "comment_text": "Amalfi, Praiano , Ravello\nPositono to touristy/ crowded , over priced"}, {"username": "Lucy Suganda-Ho", "comment_text": "F"}, {"username": "Bernadette Sarmiento", "comment_text": "F"}, {"username": "Lynn Barnett Head", "comment_text": "F"}, {"username": "Monica Patil", "comment_text": "This could be a stupid question but why is everyone saying F lol 😂"}, {"username": "Miranda Cella", "comment_text": "Loved the cooking class at Trattoria La Tagliata - Positano!!"}, {"username": "Elizabeth Lozano-Rodriguez", "comment_text": "F"}, {"username": "Heidi Dummermuth", "comment_text": "A boat tour of Amalfi coast, walk path of the gods, rent a chair and do a beach day at a nice beach club"}, {"username": "Kerrie Johnson", "comment_text": "I am here now. Amalfi is crazy busy!!!! So is Minori. Ravello is better. Just got to Sorrento so I’m not sure yet!"}, {"username": "Jennifer Drake Forstner", "comment_text": "F"}, {"username": "Kelly Ford", "comment_text": "If you like to hike, path of the gods is spectacular!!! Take care of your knees as there are lots of steps."}, {"username": "Linda McNelis", "comment_text": "Autumn Mcnelis"}, {"username": "Lisa Jackson", "comment_text": "F"}]}]