[{"id": "2205433893189022", "text": "So excited to find this site! I am currently in Florence- I just got here today from Sorrento ( also Mt. Vesuvius, Capri, Positano, Amalfi ) and previously was in Rome.\n\nMy daughter died last year in aआणखी senseless car accident and I’ve been traveling a LOT. I have a picture of her on the Spanish Steps so I went to that same spot and took one of me holding her photo. ❤️ I’m traveling with my son and his girlfriend and am just so happy to be here.\n\nBecause of this site, I just booked the pasta-making class in a couple days and am looking at other ideas as well, although our itinerary is pretty full. After here, we are going to Cinque Terre, Pisa, and finally—Venice. Does anyone know where I could maybe find a glass artist who would make something in glass using some of her ashes? ( i.e. paper weight? Or something like that?? )\n\nThanks in advance and here are a few photos of us and our Italian adventures so far!", "link": "facebook.com/groups/1373361046396315/permalink/2205433893189022/", "likes": 554, "comments": [{"username": "Linda Brookings Hull", "comment_text": "Thank you for the great pictures.\nSo sorry for your loss.😞"}, {"username": "Nilza Mercado", "comment_text": "I'm sorry for your loss 💔\nBeautiful photos!"}, {"username": "Nancy Palumbo Mazziotta", "comment_text": "Beautiful pictures."}, {"username": "Caryn Schecter Berman", "comment_text": "Beautiful photos. So sorry for your loss 🙏❤️"}, {"username": "Nola Bostridge", "comment_text": "Murano , boat trip from Venice …. Probably the best place to try. Good luck with everything , it’s a lovely tribute . Enjoy your trip 🙂"}, {"username": "Fabrizio Benedetti", "comment_text": "Murano is famous for glass"}, {"username": "Fabrizio Benedetti", "comment_text": "Have a Nice Holiday in Rome , my Town"}, {"username": "Giulia Cardamone", "comment_text": "Bless you xxx"}, {"username": "Beth Lammes Bruner", "comment_text": "Please try to join this group, there are very informed members with knowledge of active glass shops in Murano. They may have a contact for you. Enjoy your trip….what a way to honor her spirit!"}, {"username": "David Kroening", "comment_text": "Cecilia Rome Tours - any ideas?"}, {"username": "Reina Ve Del Oeste", "comment_text": "Absolutely love your way of remembering her. Sorry for your loss\nIm sure she is there with you in spirit"}, {"username": "Linda Karabias", "comment_text": "So sorry for your loss but happy that you are honoring her in so many ways during your travels. Can I ask where you stayed in Sorrento?"}, {"username": "Carmine Napolitano", "comment_text": "Did you stay at the NH collection in Rome"}, {"username": "Susan Draghi Goco", "comment_text": "These are beautiful pictures!"}, {"username": "Shelton McBride", "comment_text": "One of you is a very good photographer. In Venice, the hotels give free boat passes to Murano where glass works are the best in the world. I don’t know anything about what you are trying to do, but that may be your best shot. Good luck. Nice to see you having fun again."}, {"username": "Brenda Pimentel Dolan", "comment_text": "Did you rent a car to get around or used public transportation?"}, {"username": "Tanya Ochoa", "comment_text": "Sending you love. My bf used a company called Memory Glass out of California"}, {"username": "Vince Iacono", "comment_text": "Thank you for sharing your beautiful photos"}, {"username": "Sh Kaplan", "comment_text": "I’m so sorry for your loss. You are very strong to do this and post about it❤️‍🩹 sending you lots of hugs"}, {"username": "Fran Fitzpatrick", "comment_text": "Venice is world famous for its glass works.So sorry for your loss!"}, {"username": "James Conlon", "comment_text": "Susan Sullivan\nSorry fir your loss\nIt must have been heartbreaking\nYour posting is beautiful, beautiful country\nI hope you have a lovely time there . I am going to Italy 🇮🇹 myself next year fir a month\nLove Italy\nJames Conlon🙏🏼"}, {"username": "James Conlon", "comment_text": "Beautiful post"}, {"username": "Wilma Resta", "comment_text": "Moved by what you wrote. You are a strong woman. Cherish the memories you have and continue making new ones! Beautiful pictures!"}, {"username": "Rosalie Rusty Armour", "comment_text": "May she RIP..God Bless you🙏🌹"}, {"username": "Toni Green", "comment_text": "You are beautiful and your photos are awesome! I’m so sorry for the loss of your daughter. How tragic!!!!"}, {"username": "Neida Quinones", "comment_text": "Beautiful pics, enjoy the rest of your trip. So sorry for your loss, may she RIP 🙏🏻 🕊"}, {"username": "Maria Orofino", "comment_text": "I'm sorry for your loss 💜💜💜. How was Sorrento?"}, {"username": "Andrews Agreat Letizio", "comment_text": "Beautiful pictures"}, {"username": "Tai Temple", "comment_text": "Good for you!!!! So inspiring! Enjoy every minute!"}, {"username": "Tina Berg", "comment_text": "I love the faces Tristan makes. lol"}, {"username": "Krystal Apolinaro", "comment_text": "What a beautiful way to remember your daughter. I too took a trip in July to Italy, as a way to embrace life after losing my Mom last year. Even though I didn’t bring anything of hers with me, there were reminders of her everywhere. The accordion players reminded me of her accordion, the lighthouses in Venice reminded me of her love of lighthouses. No matter what, your daughter will always be with you in spirit. 🤍🤍"}, {"username": "Patty Oliver Smith", "comment_text": "May Peace be with you, you Beautiful Mother! Enjoy your time in Beautiful Italy! ❤️💚🤍"}, {"username": "Judy Grayson", "comment_text": "Beautiful photos.... you have a gift for composition in them... thanks for sharing your journey... God Bless..."}, {"username": "Larry Trent", "comment_text": "Your story really touched me.."}, {"username": "Cari Wilson", "comment_text": "You are an amazing, strong woman! So lovely you are taking this trip with your son and his gf. ❤️"}, {"username": "Ginger Phifer", "comment_text": "Beautiful pictures. Thank you for sharing your story."}, {"username": "Phil Derriaghy", "comment_text": "Hi Suzanne … incredible post and sending you all much strength. I have a few connections in Murano (glass making island in Venice) and will see what I can organise for you. Stay well and embrace the travel Experience … (I live close to Venice)"}, {"username": "Dara Adler", "comment_text": "Wow this is amazing ! I’m so happy for you! Sad but happy if that\nMakes sense! That you are giving this to yourself."}, {"username": "Adriana Sormani", "comment_text": "I am so so sorry for your loss."}, {"username": "Adriana Sormani", "comment_text": "Bellissime fotografie!"}, {"username": "Ruby Kwan", "comment_text": "So sorry for your loss. I’m sure your daughter is with you in spirit. ❤️❤️Enjoy the beauty of Italy. It was absolutely amazing for my family and I!"}, {"username": "Lorraine Page", "comment_text": "So sorry for the loss of your beautiful daughter. Enjoy making great memories with your gorgeous family , your pictures are stunning 💕💕"}, {"username": "Caroline Dombey", "comment_text": "Beautiful"}, {"username": "Wendy Ward Stanger", "comment_text": "I’m so sorry for your loss. Your daughter is beautiful. I’m so glad that you continue to travel and enjoy your life with her memory tucked inside your heart as you go. ￼❤️❤️"}, {"username": "Martim Monteiro", "comment_text": "Hi In Portugal you have an artist at Berco Vidreiro. He could do so. 🙏🏼"}, {"username": "Julie Espinoza", "comment_text": "What a beautiful way to remember your daughter to retrace her steps. Your pictures are beautiful."}, {"username": "Josephine Rauch Rotunda", "comment_text": "Very beautiful photos! I’m so sorry about your daughter. I hope being in Italy, soothes your pain. I’m sure your daughter is looking down on you and is looking over your shoulder. What beautiful people you are traveling with now…may her memory be a blessing to you always. Going to Italy will soothe anyone’s pain. Hugs to you!❤️❤️"}, {"username": "Claudine Auclair", "comment_text": "So sorry for your loss. Glad you get to enjoy it with your son and girlfriend. What time of day where you there?"}, {"username": "Barbara Fucci", "comment_text": "When you are in Venice ask your hotel concierge about a boat ride over to Murano there are many glass blowing places that may be able to help you"}, {"username": "Barbara Fucci", "comment_text": "Do sorry for your loss enjoy your Italy trip your daughter is watching over you"}, {"username": "Sew Chek", "comment_text": "So sorry for your loss . You are a beautiful strong mama. This is a beautiful way to create memories . ❤️\n\nIf you got time, Matera is such a beautiful place . We love it ."}, {"username": "Ed Maureen Lacerte", "comment_text": "All the love"}, {"username": "Starla Dawn", "comment_text": "Oh my I’m so sorry for the loss of your daughter, I just took mine to Italy and took her pictures on the Spanish steps as well. I’m so sorry"}, {"username": "Lisa Ann Reddy", "comment_text": "Sorry for your loss\nGet your guide pizza and gelato class!!!!! So fun and beautiful location"}, {"username": "Anita Alam", "comment_text": "Cinque Terre absolutely worth it! You can go swimming in Monterosso or Manarola - enjoy 🤗"}, {"username": "Roxanne Franquelli", "comment_text": "So sorry for your loss! Enjoy your holiday and be safe."}, {"username": "Kim Aranha", "comment_text": "I am so sorry for you to have lost your daughter - how incredibly difficult that must be - judging from your photos you are beautiful and so was she. I hope this trip gave a you additional strength and made you feel close to her. I have no knowledge of the murano glass artists - I can’t help you but wanted to say words of encouragement and sorrow."}, {"username": "Jen Lim", "comment_text": "Beautiful💕 enjoy ur trip n cherish d memories of yr daughter"}, {"username": "Kelly Peagler Myers", "comment_text": "So sorry for your loss. Beautiful way to honor your daughter."}, {"username": "Anthony Sperduti", "comment_text": "Great pics\nHave a great time"}, {"username": "Kathleen M Slattery", "comment_text": "Great pictures, especially the first!"}, {"username": "Cecile Geeurickx", "comment_text": "There was a post here about a workshop where you can make you own glass pendant/\njewelry, in Murano. What a beautiful idea. so sorry for your loss. 🤗"}, {"username": "Jennifer Melka Maley", "comment_text": "Have a wonderful time !! Hugs to you..\n♥️♥️♥️"}, {"username": "Catherine Gomez", "comment_text": "So sorry for your loss. What a beautiful way to honor your daughter. We just lost our dad on Friday and I am going back to Italy in October. We live in Chicago and found one of several companies that take ashes and make them into jewelry. You may want to have it done there but here is another option for you in case you don’t find someone there. My deepest condolences and keep on enjoying life. I’m sure she would want that 🙏🏼\n\nhttps://\nclosebymejewelry\n.com/\ncollections"}, {"username": "Lesley Richardson", "comment_text": "Get one of the artists to paint you a painting of your daughter. Sorry for your loss, hopefully you will all enjoy your holiday! Go up to Piazzale Michaelangelo tonight for sunset 🌅"}, {"username": "Mike Incantalupo", "comment_text": "Beautiful pictures! You can see & feel the love you have for your family, especially your daughter. Love is stronger than death. Your daughter will always be with you. Enjoy your trip!0"}, {"username": "Daisy Yoo", "comment_text": "I am so sorry for ur loss , I lost my mom whom was also my best friend last year and I am agreeing with y, traveling has been the best medicine !! Keep on travel and keep on taking her along!! Hugs"}, {"username": "Emily Thelen", "comment_text": "I am sorry for your loss of your precious daughter. She looks so radiant in that picture of her with the dress on the Spanish Steps. Good for you to travel and then to bring her pic ❤️❤️❤️❤️"}, {"username": "Debbie Grasso", "comment_text": "So sorry for the loss of your beautiful daughter. Enjoy making great memories with your family:)"}, {"username": "Prasangi Gunasekara", "comment_text": "So sorry for your loss. Have a lovely time in Florence"}, {"username": "Desiree de la Vega-Cannone", "comment_text": "My sincere condolences to you and your family. What a beautiful way to honor your daughter. I hope you find what you're looking for. If not, there are companies that make jewelry using the ashes of loved ones. Sending you hugs and much love."}, {"username": "Leila Jane", "comment_text": "Wonderful pictures. Thank you for sharing them. I'm so sorry for the loss of your daughter. The island of Murano is known as the glass making place in Italy."}, {"username": "Sherri Haff Benson", "comment_text": "Beautiful pictures and family. I am so sorry for your loss!! This is a fabulous way to celebrate her. God Bless!"}, {"username": "Mariposa Mariposa", "comment_text": "Beautiful photos and thank you for sharing your story."}, {"username": "Manuela Teves", "comment_text": "Sorry for the loss of your daughter, you are stunning beautiful pictures"}, {"username": "Fran Siebert Roberts", "comment_text": "I’m so sorry about your daughter - what a beautiful day to honor & remember her. Your pictures are beautiful!"}, {"username": "Mieke De Cnodder", "comment_text": "Beautiful photo's! In october i'll be in Sorrento. Do you have any tips on what i really have to see or do?"}, {"username": "Toni Marie", "comment_text": "So glad you had your trip and so sad for your unimaginable loss"}, {"username": "Ingrid Ebner", "comment_text": "In Miurano, a boat ride from Venice, they make beautiful glass. Maybe they could help. Enjoy the rest of your trip."}, {"username": "Monica Grieger", "comment_text": "We were there yesterday\nWave Murano Glass they have a special at the moment 65 euro and u get to blow etc you get to choose glass vase etc there are 4 options but they said it needs to set so isn’t available until the following day for collection so depends what time u have they can post it also"}, {"username": "Sylvie Hogg Murphy", "comment_text": "Sending you a big hug. ❤️ Your radiant spirit and love for your daughter shines in these gorgeous photos. You are doing it all and having a wonderful time - what a beautiful way to celebrate your daughter. I lost my dad one year ago to this day and have also been traveling like crazy ever since, and I know he’s there smiling along with me on all of my adventures- just like your daughter. For Murano seek out one of the smaller glass studios, although they may need more time for a special commission such as this. I will look into it and pass on any info in DM if I find something."}, {"username": "Rosanna Hardeman", "comment_text": "Murano, make arrangements ahead of time to have a piece made. Sorry for you loss."}, {"username": "Danielle Genest Godfrey", "comment_text": "Your pics are beautiful and I'll be right there in 5 weeks! So sorry for your loss!"}, {"username": "Jane Nielsen", "comment_text": "Condolences 🙏"}, {"username": "Avril Samuel", "comment_text": "From another bereaved parent, sending you hugs. I always light a candle in a church for our daughter wherever we go."}, {"username": "Steve Griggs", "comment_text": "Beautiful photos! 📸\nYou look like you belong there."}, {"username": "Adeola Awolowo", "comment_text": "Sorry for your loss\nYou can find a really nice glass maker in Venice"}, {"username": "Patricia Chavez", "comment_text": "Sending my Condolences on your great loss.\nWhat a great way to honor your daughter.\nMake some Awesome Memories with your Son and his girlfriend.\nI Love all your Wonderful Pictures.\nEnjoy your time there."}, {"username": "Mark Andrews", "comment_text": "Wow. Great pics. We are on the same itinerary I think. You have an angel now travelling with you all the time 🙏"}, {"username": "Deepti Kaul", "comment_text": "Suzanne, very pretty pictures. Thanks for sharing! Your daughter will be happy to see her mommy happy, wherever she is at this time! Sorry for your loss."}, {"username": "Sarah Middlewick", "comment_text": "Murano or burano is the best place to go for glass. Really hope you find somewhere. You're post has given me goosebumps. What a beautiful, strong woman you are. 🥰"}, {"username": "Cip Toma", "comment_text": "very nice memories"}, {"username": "Geoff Plus Jann Mains", "comment_text": "Thankyou for sharing.\nBe to some of these places.\nAnd murano glass.\nFantastic.\nJann\nNew Zealand 🇳🇿 😍"}, {"username": "Lj Downs-Ahearn", "comment_text": "Beautiful pictures!"}, {"username": "Jennifer Erdman", "comment_text": "Hugs to you. What a nice way to honor your daughter. I’m very sorry for your loss."}, {"username": "Caterina Sergi", "comment_text": "Beautiful memories .. Murano is the best place for glass ❤️ enjoy the rest of your trip , Italia is beautiful 🇮🇹"}, {"username": "Valerie Nicole", "comment_text": "Beautiful picture. Sorry for your loss. If you are looking to get out of Florence for a day and head out to Tuscany for some wine tasting I highly recommend this tour we did which is Tuscany Day Trip from Florence with Chianti, Siena & San Gimignano. They provide all transportation and a great guide. https://\nwww.walksofitaly\n.com/\nflorence-tours/\ntuscany-day-trip\ns-from-florence\n/\n\nAlso in Cinque Terre make sure when you are in Manarola make sure you stop at Nessun Dorma. Great views and food. They even have a really fun pesto making classes you can sign up for.\nHope you enjoy the rest of your trip."}, {"username": "Robert Pirolli", "comment_text": "Beautiful photos….beautif\nul lady 🌹"}, {"username": "Caren Simonds Perry", "comment_text": "Gorgeous pictures. I’m so sorry for your loss."}, {"username": "Lisa Bair DeMola", "comment_text": "Hugs to you, a beautiful way to honor her memory. Murano is a quick boat ride from Venice. I’d reach out to them to schedule time for the custom piece to be made while you’re there."}, {"username": "Robert Pirolli", "comment_text": "If you can try to get to Florence ……..the art will fill you with joy…..I promise you you won’t be disappointed……."}, {"username": "Amelia Bonannella", "comment_text": "Beautiful memories made to honour your beautiful daughter. So sorry for your loss 🌹"}, {"username": "Michelle Evans", "comment_text": "Great pics. Enjoy your special time. So sorry for your sad loss.\n🇦🇺💕"}, {"username": "Maria Sullivan", "comment_text": "You could ask one of the bigger glass stores in the main square in Venice selling good quality pieces where there would be someone that could help you with your lovely idea to remember your loved one ."}, {"username": "Joanne Smith", "comment_text": "Beautiful pictures you have a beautiful son and I’m sure your daughter is with you always"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "About Pisa I wrote a post about visiting around the 12 Jul. There is a walking tour from the train station so you don’t end in the tourist/\npickpocketers/\nscammers/ugly part of the city (that is where google maps will take you).\nFor the glass this Murano maker makes personalised creations, you could try to reach them with an e-mail before you go there and ask if it would be possible https://\nwww.vetreriabadi\noli.com/\nnuovo-sito-web-v\netreria-badioli\n/"}, {"username": "Linda B. Fontaine", "comment_text": "In Venice we toured a glass factory. Try there."}, {"username": "Rita Sanza", "comment_text": "Rita Sanza"}, {"username": "Senan Haugh", "comment_text": "Amazing pictures and lovely to remember your daughter.. take care."}, {"username": "Gianna Onesi", "comment_text": "Beautiful photos sorry for your loss."}, {"username": "Kim Briggs", "comment_text": "Fabulous photos. I’m very sorry for your loss. I do not know of a glass blower, however if someone could do your special project it would be Venice area"}, {"username": "Mary Lou Gillen", "comment_text": "Such lovely pictures! So sorry for your loss. I’m sure she’s with you in spirit the whole time."}, {"username": "Paul A Scardigno", "comment_text": "beautiful...."}, {"username": "Ibraj Andela", "comment_text": "I am so sorry for your loss. What an great way to honor your beautiful daughter. Enjoy the rest of your trip."}, {"username": "Paul DeMelin", "comment_text": "Great pictures!"}, {"username": "Heena Chawla", "comment_text": "What a beautiful way to remember her! Enjoy your memories with your daughter!\nMay God bless her soul 😇"}, {"username": "Angie McWilliams", "comment_text": "So sorry for your loss!! What a lovely way to honour your daughter! She would be loving the fact you are having a wonderful time!!"}, {"username": "Gina Hassett Hunt", "comment_text": "So sorry for your loss!\nBeautiful pictures and memories!"}, {"username": "Meg Reaburn", "comment_text": "I'm so sorry for your loss, I'm sure your daughter is with you in spirit every step of the way through your travel adventures ❤"}, {"username": "Mark Spielman", "comment_text": "You look happy, that is how your daughter would want you to be. Travel on !"}]}, {"id": "2205444469854631", "text": "Landing a month trip in Italy! Wondering which small town in the Amalfi coast you would recommend most. Also, is driving around extremely difficult? Should we take a cab or rent a car?\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2205444469854631/", "likes": 0, "comments": [{"username": "Jennifer Avrett", "comment_text": "If you're a confident driver wherever you live, you'll be a fine driver there. We always have a car and sometimes a Vespa as well. It relieves the hassle of transportation,\nwhich is expensive and slow. Just arrange for parking BEFORE you go on your trip. We usually choose an airbnb that has a parking space nearby."}, {"username": "Brad Nelsen", "comment_text": "Praiano"}, {"username": "Nancy Koehler Barboni", "comment_text": "Hire a driver and enjoy the views❣️"}, {"username": "Joan Belserene Forcheski", "comment_text": "Minori! Quaint, beautiful, easy ferry access & not mobs of tourists"}]}, {"id": "2205438473188564", "text": "If going to Florence/ Firenze you must visit Piazza Michelangelo on the hill for sunset photos 🥰🇮🇹🌅", "link": "facebook.com/groups/1373361046396315/permalink/2205438473188564/", "likes": 93, "comments": [{"username": "Michelle Pratt", "comment_text": "Thanks for sharing. What is the best way to get to this spot? Be there at the end of Sept."}, {"username": "Kate Laidlaw", "comment_text": "A few nights ago! A must. And free"}, {"username": "Jess Baloh Wuslich", "comment_text": "Must LOVE crowds.."}, {"username": "Amelia Smith", "comment_text": "Agreed, a night to remember."}, {"username": "Linda McShane Payne", "comment_text": "What time is sunset these days?"}, {"username": "Dawn Burton Hammon", "comment_text": "We plan to visit in Sept. Is there a taxi stand readily available to get back to town afterwards?"}, {"username": "Demi Quinn", "comment_text": "Marie Simpson Sophie King"}, {"username": "Tammy Moore", "comment_text": "Thank you for sharing this!"}, {"username": "Laur EnLew", "comment_text": "Wow! It’s so crowded! Last time I was there it was April (many years ago) and it never looked like that… is it just this crowded in summers, or more often in general now?"}]}, {"id": "2205439379855140", "text": "San Nicola Church, BARI.🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2205439379855140/", "likes": 0, "comments": []}, {"id": "2205442716521473", "text": "If by chance I can get tickets through the COOP culture site for the coliseum does the full experience Come with a guide to show you around and explain things??\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2205442716521473/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "I don't think it does but you can look on the site and it explains what is included."}, {"username": "Jay Parekh", "comment_text": "Yea we had a guide for the full thing and underground. Guide doesn’t come up to the top floor as it’s more on you own. The guide will show you below and top level with a lot of good information. It was great!!"}, {"username": "Jenn Messina Babore", "comment_text": "Yes, but you have to select the right tour. There are several options so look for one with a guide. Not all tickets have guides."}, {"username": "Melissa Hunt", "comment_text": "You have to choose the “educational” Full Experience one to get a tour guide."}]}, {"id": "2205443853188026", "text": "We will be in Sorrento in early October. Planning a day trip to Capri. Should I book my ferry now, or wait.", "link": "facebook.com/groups/1373361046396315/permalink/2205443853188026/", "likes": 3, "comments": [{"username": "Kally Trahearn", "comment_text": "I went in April one year and didn't book ahead. We just turned up early at the ferry port to get the first ferry out. No price difference in booking ahead or on the day as far as I remember"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Wait. You never know what the weather or the seas will\nbe like in October."}, {"username": "Fiona Mac", "comment_text": "Just wait till u get there great ferry services watch the restaurant up the top Monte salero 34 euros for a gin n tonic and mojito\nAnna capri us stunning x"}, {"username": "Debra Genovese", "comment_text": "I'll be there in October too thanks for the advice to wait"}]}, {"id": "2205448853187526", "text": "I’ve become so paranoid about whether or not to carry my passport. I this answer will put the QUESTION to legal and very real bed once and for all. #carryacopy", "link": "facebook.com/groups/1373361046396315/permalink/2205448853187526/", "likes": 21, "comments": [{"username": "Tanya Williams", "comment_text": "I’ve been debating this also. We’re going to be there in 3 weeks. I’ve made copies to carry as don’t want to carry our passports around. Hoping that will suffice"}, {"username": "Claudio Blizzard Indastria", "comment_text": "That's a not a statement from local authorities, it's an interpretation.\n\nYou are supposed to carry thr original with you, sometimes the copy workaround works, sometimes not."}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "If your US citizen and have a passport card carry that and leave your passport in your room safe"}, {"username": "Daria Dandolo", "comment_text": "In all EU we are always obliged to carry ID or passport. That is very common. You need your ID for banks, administrative works, identification,\netc..."}, {"username": "Brenno Bianchi", "comment_text": "That law says at article 6.3 that a passport must provided by the foreigner whenever asked by a police officer, otherwise 2000€ of fine or up to 1 year in jail."}, {"username": "Carine Brys", "comment_text": "Just relax and focus on the food and sights. My parents owned a villa on Sardegna, I have visited many places on the mainland. We just left our passports in the safe of our hotel or at home. I currently live in Belgium, but I always leave my ID card at home."}, {"username": "Lindsay Stewart", "comment_text": "Never been asked for this and been several times"}, {"username": "Lee Mckay", "comment_text": "Travelled for 5 weeks in Italy all over the country n never carried my passport"}, {"username": "Lisa Silverman", "comment_text": "I had a copy of my passport and my license. No one ever asked to see it."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "This is an explanation of the law https://\nwww.avvocatofran\ncescolombardini\n.it/\nmancata-esibizio\nne-del-permesso\n-di-soggiorno-e\n-del-documento-\ndi-identificazi\none/\nYou must carry the original passport. If you are at the beach (and you didn’t drive there) and you don’t want to risk (I can understand that) make sure you made a copy also of the page with the Visa stamp, I’m quite sure if there is any problem or need of control the policemen will understand!"}, {"username": "Janine Brailsford", "comment_text": "Suggestion: IF …. you’re an American: Write or make a call to our State department or the Italian Consulate in Washington D.C.\n\nIf you are a citizen of another country & they gave a Italian Consulate- call or write to them.\n\nI carried my drivers license & a copy of my big bulky passport… in many countries (including some not so friendly ones). I personally, never had an issue.\n\nThough, I never got stopped or questioned by the authorities either.. due to any misconduct on my part or the part of others (such as pickpockets or criminal behaviours)."}, {"username": "Anita Clayton", "comment_text": "Never been asked for ours in 25 years of travelling all over Italy."}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "Don’t to protect from stealing . We always had copies on us"}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "And don’t be paranoid . Easy peasy"}, {"username": "Vivien Paulik", "comment_text": "People who say they were never asked. Okay, nobody told everybody is always a asked, but it can happen. Random checking is totally normal"}]}, {"id": "2205452449853833", "text": "Brits driving in Italy (more specifically sicily)….. what do I need to know? I’ve never driven in Europe before!", "link": "facebook.com/groups/1373361046396315/permalink/2205452449853833/", "likes": 1, "comments": [{"username": "Jamie A White", "comment_text": "We drove around Naples a couple of years ago, Italians (as a general rule) I found to be more “assertive” with their driving (compared to the French or Swiss).\n\nIf there’s a tiny gap between you and another car, it will soon be filled with a car bumper or scooter rider, which seem to come from either direction.\n\nIt’s a lot of fun driving in Italy, but you’ll need eyes in the back of your head.\n\nMy biggest adjustment was approaching roundabouts and remembering to look left and not right."}, {"username": "Mike Ball", "comment_text": "Just take your time initially and if possible avoid driving in any of the big cities as it can be very confusing and you will need eyes in the back of your head,\n\nWe have driven around Italy a few times now and for the most part it’s been a very enjoyable experience. If we wanted to visit any of the big cities like Florence or Naples we would drive to a small town a few miles outside and catch the train, it’s hard to find anywhere to park and we did receive a fine on one occasion for entering a restricted area ."}, {"username": "Maria Musumeci", "comment_text": "Same as us Aussies, you'll need to adjust driving on the other side of the road.\nAussies need to get ourselves an international driver's licence, not sure if the Britts do too, so look into that.\nWe drove in Sicily (not me) but our husband's did. The first 10mins was crazy but they soon got into the swing of things & actually enjoyed it.\nIf you use Google maps as we did, you'll be deterred from streets you're not allowed into (residents only) or not allowed to park. Google helps decipher street signs too, and helps with speed limits. Goodluck 👍"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Avoid driving in big cities, we italian drive like maniacs when stuck in traffic."}, {"username": "Giovanni Pianigiani", "comment_text": "Get an automatic... or the first times you intend to change gear you'll end up opening the window! 😅"}, {"username": "Alasdair MacDonald", "comment_text": "My son and I drive through Europe and Italy most years and find it better than driving in the UK.\nIf your driving down through France or Germany to get to Italy you'll adjust quite quickly to being on the right. Although roundabouts are the one thing that always seem to take longer to get used to! Plus even if you are on the roundabout cars joint will pull out just to through quicker.\nIf you are driving through France a lot of the motorways have tolls but they all take cards or cash. A lot of the non toll roads are only 2 lanes but are generally quieter.\nBelgium and Germany don't have tolls and I've always found their motorways easy to travel along! Though all get busier near and around the bigger cities.\nIf you go through Switzerland or Austria you'll need a vignette to use the motorways. You can purchase the snal sticker at the borders or at fuel stations near the border. Although both now do electronic vignettes that just uses numberplate recognition.\nIn italy they do seem to think the motorways are just 1 big F1 track but just stay right till you get used to it. Again most motorways are only really busy near the cities and bigger towns. There are tolls again on the motorways but just head for the gates marked with a card or cash symbol and you'll be fine.\nWe tend not to drive in the cities as there are usually plenty of park and ride places plus parking in the city is difficult and there are nowore and more environmental zones in the cities where certain cars are not allowed.\nIf you haven't been before I'd recommend going over at least 1 alpine pass into Italy! The drive up and down is great and the views are always amazing 😁\nAlso make sure you have European breakdown cover and good travel insurance!"}, {"username": "Philip Curnow", "comment_text": "Don't be intimidated, keep within your comfort zone and use your mirrors. Give yourself space. Autostrade have two lanes, unlike the three in the UK. I once drove a UK Beetle from Calais to Rome. Wonderful run. Only Genova and the continuous stretch of tunnels in Liguria to the Tuscan border needed some extra concentration and nerve. Sicily is fine."}, {"username": "Kit Nader", "comment_text": "Just get the train. They're good and so easy."}, {"username": "Klaudia Karina", "comment_text": "Don'drive."}, {"username": "Edoardo Casolo", "comment_text": "Pray"}, {"username": "Samantha Pavanello", "comment_text": "La sicilia è molto molto trafficata, poche regole stradali sono rispettate, c'è molto caos in strada. Guida piano e fai attenzione, rispetta tu il codice della strada e dove non riesci a passare fai come fanno gli altri buttati 😆"}, {"username": "Ryan Shearer", "comment_text": "Hi I’m rules. Yeah they don’t exist. You need to have a decent dose of ADHD and a total disregard for the law. 3x the speed limit past the police…just keeping up with traffic, if you aren’t used to small cars going at 100mph plus then don’t."}, {"username": "Gergő Fodor", "comment_text": "Any bucketlist"}, {"username": "Debra Quinney", "comment_text": "Aslong as your a confident driver you will be fine just need a little more concentration than at home as they are abit more aggressive drivers than us"}]}, {"id": "2205452943187117", "text": "आणखीhttps://www.coopculture.it/en/products/the-wonders-of-the-colosseum-visiting-the-underground-and-the-arena/?fbclid=IwAR0zk1ahOYbLM39B8IVO1usgMz0OGP5l7fe26DJn-BZeZ92jGw24TtA38jM_aem_AcLzyZ2_eISQboQBX5bvZ_k-A_WcqfIOpNHBHWNopqYiApeElt0t3J0J2osAJbVN4Is&mibextid=Zxz2cZ\nHi all! Is this your a “skip the line” tour? Do you recommend it? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2205452943187117/", "likes": 0, "comments": []}, {"id": "2205456406520104", "text": "Can I please get recommendations for areas appealing to young adult children ( ages 24/25). Planning a family trip and don’t want long bus excursions. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2205456406520104/", "likes": 0, "comments": []}, {"id": "2205456846520060", "text": "If you had to choose, would you take a private coliseum tour or a private Vatican tour? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2205456846520060/", "likes": 1, "comments": [{"username": "Stella Kevin", "comment_text": "We did both and found neither worth it."}, {"username": "Karen Landini", "comment_text": "Vatican. They can get you around to what you want to see and provide lots of info. There's a ton to see at the Vatican so it helps to have focus."}, {"username": "Gena Diaco Penland", "comment_text": "We did both and thought they were both great! If I had to choose one, I would pick the Vatican."}, {"username": "Ken Vecchia", "comment_text": "Must do both but Vatican is unbelievable"}, {"username": "Vivien Paulik", "comment_text": "Vatican"}, {"username": "Pam Kimak", "comment_text": "We did a wonderful Vatican tour, and walked around the Colosseum on our own. There was alot of easy readable info posted. Glad we did it that way."}, {"username": "Cheryl Saunders", "comment_text": "Vatican"}]}, {"id": "2205461209852957", "text": "What is the best time of year to go to Italy? And what are some must visit locations? I am planning a trip for next year. I don’t want it to be super hot so definitely not summer. My hopes is to go for a few weeks to a month and travel around to different places. Any suggestions appreciated! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2205461209852957/", "likes": 5, "comments": [{"username": "Carolyn Chambers Rosamilia", "comment_text": "Read some Rick Steves Italy guides and watch some of his online videos. This will give you a better idea of what you would like to see and spend time. Don’t travel around too much. I think if you have enough time, allow 3-4 days at each destination and allow for travel time and relaxing time.\n\nOh, and be sure to get independent travel insurance."}, {"username": "Alice Francesca", "comment_text": "Hello! I am Italian and in Italy we tipically visit the città d'arte (cities of art) in the spring or fall , nice weather, less crowds.So april until middle of june or september till early november.\nIn the summer we head to the seaside or the mountains! No Italian would ever dream if visiting Florence or Rome in July or August!;)"}, {"username": "Melissa Reyes", "comment_text": "Not July that is for sure lol it was crowded & hot"}, {"username": "Fiona Mac", "comment_text": "June is lovely time of year"}, {"username": "Kim Falgout", "comment_text": "Heading to Italy April 2024, been seeing and reading that the weather is usually 60-70 degrees and lesser crowds!"}, {"username": "Sharon Menegoni", "comment_text": "I was there in March of this year and the weather was perfect! It only rained one day and them the temps were high 50's to mid 60's and sunny. and NO crowds!"}, {"username": "Jordan Bramley", "comment_text": "Thank you everyone for all the info! It really helps, greatly appreciated 💜"}, {"username": "Marco Scacchi Fratini", "comment_text": "Hey Jordan - Keep in mind that the weather (and temperatures) can vary significantly between the north, center, and south of the country. While September could be a great time to visit Venice or Milan if you want to avoid the heat (average high 75.2F), the average high in Rome in September is significantly higher at 80.6F. If you're heading further south, say Catania in Sicily, brace yourself for a hotter climate with the average high temperature shooting up to 84.2F. And while the weather now seems to be more and more unpredictable, you can see how ranges can vary between regions"}, {"username": "Rhonda Hope", "comment_text": "Spring, fall or winter"}]}, {"id": "2205465916519153", "text": "Heading to Southern Italy this September for 12 days. Its just the two of us. Wondering how much cash we should take. Any suggestions/experience? Is it easy to withdraw cash if needed?", "link": "facebook.com/groups/1373361046396315/permalink/2205465916519153/", "likes": 1, "comments": []}, {"id": "2205471509851927", "text": "Traveling to Italy for two weeks with my then 18-year-old daughter (HS Graduation gift). We are flying into Venice, spending two nights there, then to Florence for 3 nights, then Rome for 3 nights, then Sorrento for 4 nights, 1 night in Naples and fly back home from the Naples airport. We are doing all AirBNBs except for last night a hotel inआणखी Naples that’s close to the airport.\n\nA few questions…..\n\n1. I have Celiac. Any tips on finding restaurants while there?\n\n2. Best excursions in these locations? Definitely interested in Pompeii (I’m guessing when in Sorrento is easiest location to visit Pompeii), Florence maybe a cooking class, a boat tour of Almafi coast and maybe Capri.\n\nWould love recommendations of excursions your done in these areas you’ve loved. Venice do we really need a tour or can we just go see the sights ourselves? We’ll definitely take a gondola ride there.\n\n3. Best travel backpack? We want to just travel with a backpack, cross body bag and maybe larger tote so we can easily transfer between locations.\n\nThanks!!!", "link": "facebook.com/groups/1373361046396315/permalink/2205471509851927/", "likes": 5, "comments": [{"username": "Frances Scannapieco", "comment_text": "I also have celiac. I go to Italy every year. I would say 90% of the restaurants have gluten free options.\nBut I also have found that even food that is not gluten free doesn’t get me sick.\nMy doctor said because the food in Europe have virtually no chemicals\nEither way you definitely shouldn’t have a problem"}, {"username": "Ryan Monahan", "comment_text": "When you arrive in Venice, hire a private boat taxi to take you into the city to the stop nearest your hotel. You’ll come out the doors of the airport and right into the boat. It’ll shoot across the lagoon and then into the city on the Grand Canal. It’ll cost a little more but it’s an “excursion” in itself! Then just walk around and explore."}, {"username": "Jenny Payne", "comment_text": "Backpack with lots of zips, as I travel a lot with backpack,crossb\nody bag & a small size cabin case, works well for me. Don’t take the world, I travel with 2pairs sneakers + one pair of leather sandals & my clothes are only linen,silk,cott\non 🌻"}, {"username": "Lisa Valdovinos", "comment_text": "I saw quite a few restaurants that stated they had gluten free options."}, {"username": "Isabelle Panagapka", "comment_text": "Our family just returned from a 13 day very similar itinerary. It was our first time doing just carryon and we each had a variation of this backpack.\nThe larger pack is carryon size and it has a smaller daypack that straps onto it to make it all-in-1 for carrying, or can use separately too. It has tons of space in it, and we used packing cubes to maximize space.\n\nAs far as excursions, I loved Pompeii and the Colosseum/\nForum/Palatine Hill. Amalfi Coast was beautiful too."}, {"username": "Angel Burnard Marx", "comment_text": "We returned from Italy recently and were with someone who has Celiac's. I was pleasantly surprised at the amount of options for GF in most restaurants."}, {"username": "Amy Schmelzle Walsh", "comment_text": "Patagonia black hole duffel 55L that has straps as a backpack worked very well and fits as carry on as long as it isn't stuffed"}, {"username": "Laura Jetton", "comment_text": "Go to the bridge of sighs in Venice- very interesting tour.\nI could live in Florence- there is sooo much to see."}, {"username": "Gregg Pires", "comment_text": "Log on to Joe Banana Limos...we are going for 2 weeks in September and they took care of everything at a very reasonably price."}, {"username": "Marybeth Obrien", "comment_text": "Can you share hotels air b and b in time and amalfi going in October nothing booked yet"}, {"username": "Tari Lawson", "comment_text": "In Venice I recommend getting off the main tourist route and getting lost. Walk all over. It is beautiful. You can do Pompeii on your own. They also offer an audio tour or have guides for hire onsite."}, {"username": "Jennifer Gustafson", "comment_text": "My daughter and I did the same thing last summer and it was amazing! Water taxi over to Venice and just wander the streets getting lost it’s part of the fun. There’s so many fresh vegetables and seafood there. I don’t think you’ll have a problem finding food to eat and a lot of people that are gluten free can still eat their pasta there.\n\nWe averaged 8 to 12 miles a day walking in each of these cities so we are a comfy walking sandal. I used sketchers. We were sundresses as the average temps were in the high 90s but don’t forget your anti-chafing shorts for underneath. We loved exploring, Florence suppertime, and after the city is in chanting at night, we did day trips out to San Gimignano, Lucca, & Pisa.\n\nWe booked a truffle hunting tour through www.eatingeurop\ne.com.\n\nA private car picked us up and took us to San Gimignano where we did a truffle hunt, wine, pairing, and tour of the city. Took the train to Pisa and Lucca.\n\nAnd Amalfi I recommend staying central in Amalfi it’s easier to get around to the other towns. Take the train from Rome to Salerno and a ferry around to Amalfi. I highly recommend the restaurant Agricola Fore Porta beautiful farm to table restaurant all homemade and I believe they do cooking classes also. But know it is quite a hike up the mountain but totally worth it.\n\nIn Rome, we also booked a tour through www.eatingeurop\ne.com it was the twilight Trastevere tour.\nWe were gone 18 days, and only packed a carry-on and a backpack and did laundry at our Airbnb’s . We used an anti-theft, backpack, and Crossbody purse, and never had any issues. Just always be watchful."}, {"username": "Mara Mike", "comment_text": "Following"}, {"username": "Carrianne Freeman-Hall", "comment_text": "Join the gluten free Italy FB page, really helpful"}, {"username": "Tammi Vajda", "comment_text": "I was surprised how many restaurants accommodate gluten free and celiac. Florence had at least 3 or 4 places with gluten free pizza. Sorrento had many restaurants with gluten free past too. Travel as light as possible. Especially if your AirBnB’s have a washer. Have fun!"}]}, {"id": "2205471729851905", "text": "Any recommendations for a Marriott affiliated hotel in Florence ? Venice ?", "link": "facebook.com/groups/1373361046396315/permalink/2205471729851905/", "likes": 0, "comments": [{"username": "Rob Wolfe", "comment_text": "We stayed at Sina Villa Medici in Florence. It was nice. Easy walk to the main areas. Great cafe close and some good restaurants. Pool was delightful."}, {"username": "Alex Kovacs", "comment_text": "In Florence I didn’t love the locations or they were $1k a night so we stayed at hotel Calimala! It was super nice and central, loved it. In Venice we were only there for two nights so we opted for the ac Marriott near the train station. Nice hotel but a good walk to the main things."}, {"username": "Lina Stump", "comment_text": "Why?"}, {"username": "Lori Yelland", "comment_text": "Westin Excelsior in Florence is beautiful"}, {"username": "Lynn Francisco Casella", "comment_text": "Not Marriott, Hilton Garden Inn"}, {"username": "Joel Rosenberg", "comment_text": "Gritti Palace in Venice was fantastic and perfectly located"}, {"username": "Bridget Gieseke", "comment_text": "Excelsior or St Regis in Florence…Daniel\ni in Venice… used to be a Marriott property… would recommend the Gritti palace"}, {"username": "Pam Armenia O'Brien", "comment_text": "Westin Excelsior"}, {"username": "Heather Held", "comment_text": "Florence- Westin. It was fabulous! Venice- JW Marriott! Both were so amazing!! We just stayed in April!"}, {"username": "Debby Finn Martino", "comment_text": "Just stayed at St. Regis in Florence & Venice. Both great hotels"}, {"username": "John Calabrese", "comment_text": "The St Regis in Florence is absolutely perfect.\nYou better have a lot of points if you're going in that direction."}, {"username": "Shannon Allder Kitchen", "comment_text": "We stayed at the Westin in Florence last week for 1 night and 3 nights at the St Regis in Venice. The St Regis was fabulous in every way!!"}]}, {"id": "2205474176518327", "text": "Any recommendations for actual working farms / agriturismos in Tuscany that make a good home base for exploring the region and allow less than a weekly stay? We are a group of 8 (two families of 4), so need a few rooms or one house.", "link": "facebook.com/groups/1373361046396315/permalink/2205474176518327/", "likes": 0, "comments": []}, {"id": "2205476066518138", "text": "Planning my first trip to Italy in 2024. We will most likely visit more than once (so many places I want to see) but next year we are limited to 7/nights - 8days. Traveling from VA. As a first timer I’m not sure if we should go to Venice, Cinque Terra and Tuscany (Florence, Siena etc) or Naples, Amalfi Coast, Capri and Rome. I’m torn - grandparents are from Tuscany but want to see the beautiful coastline. Are the itineraries too agressive for 8 days?? Any suggestions would be much appreciated. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2205476066518138/", "likes": 1, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "Definitely too aggressive.\nIf you want the coastline just do Florence+ 5 Terre and a day trip in the Chianti area and Siena.\nIf You want Venice do Venice and Florence.\nIf you want Rome just do it with two day trips to Naples and Pompei and Orvieto.\nIf you want Capri and Amalfi visit combining it with Naples and Pompei."}, {"username": "Bev Madill", "comment_text": "I really think you’re trying to do too much. You need to really experience places. I hope you have a great trip."}, {"username": "Dann Hrusch", "comment_text": "Sure, it would be nice to have all the time and money to travel for as long as we'd like, but I think 7 nights is enough for Venice, Tuscany and Cinque. Personally I'd do 2 nights Venice, 3 Tuscany and 2 Cinque. I prefer to see as many places as I can the first time in a new country that way you can experience more and know what places you want to see more of in the future. For me, two nights in Venice is all I needed and have no desire to go back. Meanwhile I've been to Cinque Terre three times."}, {"username": "Pat Cray", "comment_text": "Yes! Stick with Rome, Sorrento, day trip to Amalfi coast, and Florence if you have time!"}, {"username": "Deborah Schroeder", "comment_text": "If you are not counting travel, leaving from Dulles you will have an overnight flight, arriving the next morning-1 day gone. Then consider the flight back, time zone in your favor so you lose 1 day. An easy way to cram it all in is, land in Venice 1 night. Train to Florence 3 nights with a day trip to Siena or Cinque Terre. Train to Rome for 3 nights and leave from there. You won't see much but you will get an idea of what is out there. Take the extra night and add to where you want. If travel is part of your 8 nights, lose Rome and see Venice and Florence better."}, {"username": "Marianna Holloman", "comment_text": "We love Florence and Rome. We would not go back to Venice."}, {"username": "David Hibbs", "comment_text": "We flew into Milan and went to cinque terre for a couple nights then to Tuscany for a few nights and visited some small towns around then went to Florence. A lot to see and busy but it was a great trip"}]}, {"id": "2205485276517217", "text": "Feedback wanted. I am in the process of planning a trip around Italy. But I would like to do it when there are festivals and cultural celebrations happening. I also don’t want to be doing the holiday in cold or wet weather.\nI hoping to visit Tuscany, Verona, Rome,Venice, Panarea, Capri, Sorrento , Florence, Sicily and Pisa plus any other suggestions\n\nThanks in Advance", "link": "facebook.com/groups/1373361046396315/permalink/2205485276517217/", "likes": 0, "comments": [{"username": "Katrina Harrison", "comment_text": "I am coming"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "That’s a lot of places and traveling. How long is your trip?"}, {"username": "JeriLynne Clifford", "comment_text": "We are going to a wine and food festival in Asti in September. Are you talking religious festivals?"}, {"username": "Dawn Falsinotti", "comment_text": "There are festivals and celebrations all the time. Italians celebrate everything. I’d do some research as a start."}, {"username": "Deborah Schroeder", "comment_text": "There are sites that list events for an entire year for every place you want to stop. Just do your homework and you will be able to plan better."}]}, {"id": "2205486259850452", "text": "We are planning to travel to Italy next June for 10 days. Our kids are age 4 & 7. We are not interested in doing the busy cities (Rome, Milan, Florence etc) We prefer slower travel pace/less crowded areas.\nI can see us doing a lot of beach days, boat tours, garden walks , people watching etc etc\nWhere would you suggest we go in Italy for a more “relaxed” trip with kids since they are so young and will not be able to roam too far without them getting tired etc.", "link": "facebook.com/groups/1373361046396315/permalink/2205486259850452/", "likes": 0, "comments": []}, {"id": "2205487969850281", "text": "Hi\nWe have 3 nights, two days in Florence, should I just go to Academia galler and other day hang around or is it recommended to do 1- Day tour of Tuscany in one of those days . Thanking you in anticipation", "link": "facebook.com/groups/1373361046396315/permalink/2205487969850281/", "likes": 0, "comments": [{"username": "Karen Landini", "comment_text": "You will easily fill two days on Florence. I wouldn't spend less than that there."}, {"username": "Jenny Payne", "comment_text": "I go to Florence often twice a year to show friends around & always find new things that I haven’t seen before so I would spend one day either at Uffizi gallery or Accademia either one is good and then just wander over the Ponte Vecchio , along past the pitti palace or over to the area called Santo Spirito and find a restaurant for lunch and take in everything 🌻"}, {"username": "Gena Diaco Penland", "comment_text": "We did a golf cart tour there that was great! We also loved the Santa Croce church (where Michelangelo and Galileo are buried)."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205489333183478", "text": "We are going to Italy in October. We are in Rome for a few days. On first day I was thinking of going to the baths at Caracalla. Does anyone have any tips?", "link": "facebook.com/groups/1373361046396315/permalink/2205489333183478/", "likes": 0, "comments": [{"username": "Albert Campagna", "comment_text": "Bring a towel"}, {"username": "Peter Morgan", "comment_text": "Take a towel !!"}]}, {"id": "2205489413183470", "text": "Hi all,\nI’m heading to Italy in November. I’ve read the best bet for Vatican tours is to do the early morning to avoid the throngs of people. I’m wondering if that is still necessary in November since it’s low season for tourists. Will it be overly crowded if we did a later tour? I believe the early morning tours are a bit more expensive and I just don’t know if it’s necessary at that time of year. Appreciate any insights.", "link": "facebook.com/groups/1373361046396315/permalink/2205489413183470/", "likes": 0, "comments": []}, {"id": "2205494573182954", "text": "Positano❤️", "link": "facebook.com/groups/1373361046396315/permalink/2205494573182954/", "likes": 5, "comments": []}, {"id": "2205495813182830", "text": "Hi all. I love this page and am grateful for all your amazing help so far. I will be on a cruise and have 5 hours in Rome. I was thinking of taking a walking tour or doing the on and off bus. I am\nConcerned there will be so many people that we won’t get a seat or will wait in a line forever to just get on…. We are going august 24. Any advice of what to do. There are 2 kids 11 and 13, my husband and my mom. (5 of us total). Thanks all", "link": "facebook.com/groups/1373361046396315/permalink/2205495813182830/", "likes": 0, "comments": [{"username": "Lyn Evans", "comment_text": "Is 5 hrs from arrival to departure time? The ship docks quite a long way from Rome itself ..approx 50 min train trip each way."}, {"username": "Nadia Mckenna", "comment_text": "Stay on the ship😜"}, {"username": "Helen Ladkin", "comment_text": "I agree stay on the ship unless you book a tour with the ship, then they won’t leave without you. Our last experience reinforced this."}, {"username": "Tari Lawson", "comment_text": "I did Rome on cruise ship stop my first time. We uses Rome in Limo. They picked us up at the ship, drove us site to site and back. We prebooked Colosseum tickets. We were able to visit the Colosseum, Pantheon, Spanish steps, Trevi Fountain and Vatican (also pre booked with a guide). I can't remember how many hours we had. It was fast paced, but amazing."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Do not do the bus. It lets you off quite a distance from most of the main sites and often bypasses the stop because it is full. Historic Rome is easily walkable in most cases."}, {"username": "Robyn Lawson", "comment_text": "Hire a private car and driver for a couple of hours. Ensure back with an hour to spare! At least h in will get go see some of Rome 😊"}, {"username": "Fetchin Gretchen", "comment_text": "Book beforehand but does not really sound like you have more than a couple hours due to time there and back."}, {"username": "Mike Guluk", "comment_text": "walking tour by far"}, {"username": "Tina Norris", "comment_text": "Dont do bus, 2 hours to and from ship which leaves 3 hours to sight see. 🙈"}, {"username": "Leila Jane", "comment_text": "No to bus. We also used Rome in Limo tours and were SO GLAD we did. The limo gets you to Rome faster and then once you're there, a limo gets you closer to the historical sites and you can see MANY more of them with the time allowed. All in more comfortable seats without waiting for 40 other people to get on and off everywhere."}]}, {"id": "2205498199849258", "text": "Vernazza is one of the 5 centuries-old villages that make up the Cinque Terre. #reels #reelsinstagram #instagram #trending #viral #explore #love #instagood #explorepage #reelitfeelit #follow #आणखीphotography #fyp #reel #instadaily #reelsvideo #like #memes #foryou #music #facebookreels #facebook #facebookviral #reelsviral #reelsviralvideo #reelstrending #trendingnow #reelstrendingvideo #facebookpost #riomaggiore #monterossoalmare #manarola #corniglia #vernazza #cinqueterre #laspezia #reels2023 #ristoranteilgabbiano #paanokumitasafacebookreels #facebookreelssahod #facebookreelsearnings #metaverified #metaverifiedaccount #facebookreelsmonitization #facebookreel #fbreels #facebookreelssettings #facebookreelsincome #facebookreelsplaybonusprogram #facebookreelsvideo #facebookreelseligibility #facebookreelsviral #facebookreelspayout #facebookverified #bonassola #levanto #adsonreelsfacebook #adsonfacebookreels #adsonreelsmonetization #monterossobeach #monterosso", "link": "facebook.com/groups/1373361046396315/permalink/2205498199849258/", "likes": 1, "comments": []}, {"id": "2205498419849236", "text": "Just got our final itinerary!! So excited!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2205498419849236/", "likes": 7, "comments": []}, {"id": "2205503029848775", "text": "Venice", "link": "facebook.com/groups/1373361046396315/permalink/2205503029848775/", "likes": 2, "comments": []}, {"id": "2205503609848717", "text": "Best resources for a Rome North itinerary?", "link": "facebook.com/groups/1373361046396315/permalink/2205503609848717/", "likes": 1, "comments": []}, {"id": "2205504199848658", "text": "Looking for suggestions of company’s used to book a trip to Italy. We want a self guided trip of the countryside and not a lot of time in the big cities.", "link": "facebook.com/groups/1373361046396315/permalink/2205504199848658/", "likes": 0, "comments": []}, {"id": "2205516659847412", "text": "Hi we usually stay at the Florence Art Apartments but they are double the price for next year. Can anyone recommend a 2 bedroom apartment or two 1 bedroom apartments in a great location. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2205516659847412/", "likes": 0, "comments": []}, {"id": "2205544053178006", "text": "Got this email for our tour in 48 hours…is this normal just to change times?\n\nThe Colosseum, due to organizational purposes had to move the entry time so the new meeting time at the meeting point at **Via del Colosseo, 24 is at 08:00pm**.\n\nKeep in mind that the voucher won't show the change as this modification was made by the Colosseum internally.", "link": "facebook.com/groups/1373361046396315/permalink/2205544053178006/", "likes": 0, "comments": []}, {"id": "2205562776509467", "text": "I am going to be in Rome for one night getting in around 6 o’clock in the morning and leaving the next morning. I really need a great place to stay for two people for one night that’s not like crazy expensive, and what to do in that day!!\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2205562776509467/", "likes": 0, "comments": [{"username": "Karen Landini", "comment_text": "Hotel Sonya. We have stayed before and are also going for one night in October before our train the next day."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Check a booking site for availability."}, {"username": "Cherie Horne Duda", "comment_text": "We loved this place. Great location and don’t miss the terrace. https://\nwww.nikiscollect\nionnavona.com/"}, {"username": "Donna Watson", "comment_text": "The Loft is a very very beautiful place\nFrancesca Mongali. Superb location\nBooking.com"}]}, {"id": "2205565103175901", "text": "Are designer brands like YSL, Louis Vuitton, Gucci ect cheaper in Italy compared to Australia even with the terrible exchange rate $? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2205565103175901/", "likes": 0, "comments": []}, {"id": "2205663176499427", "text": "So I watched a video on YouTube and this family were traveling all over Italy and they said the only place they felt unsafe was Naples. My family (husband, wife, adult son, teen daughter) currently has plans to visit Naples to try pizza where it was created. Is it worth it? Is it safe?", "link": "facebook.com/groups/1373361046396315/permalink/2205663176499427/", "likes": 4, "comments": [{"username": "Brenda van Valen", "comment_text": "You will be fine, just be aware of your surroundings and valuables."}, {"username": "Dianne Metcalf", "comment_text": "There much nicer places in Italy than Naples."}, {"username": "Angela Gilmore", "comment_text": "I read this question on this group dozens of times, and the answers are always the same, 90% of people say it is worth it and beautiful, and 10% say it is not.\nDon't know why people keep asking that and keep having doubts about Naples 🤷"}, {"username": "Anna Sanday", "comment_text": "I’m in Naples now. We came here from Rome. I’m a single mom with two daughters & we walked from the train station to our appartment (it’s in a rough area) One of my daughters said she preferred rome, the other ‘loves the vibe’ here. We’ve just been out for dinner & walked the streets. Felt completely safe. It’s very basic, but has a kind of charm. The people are so friendly! We’re here for 3 nights so plan to explore more. It’s VERY different to Pisa & Rome but so far so good. We’ve just been out for dinner, the food was amazing, service was great, prices were good and they gave us 2 free deserts (lemon sorbet with vodka ❤️)"}, {"username": "D'Anna Hohe", "comment_text": "It depends upon what else you want to see and what is important to you. It’s safe enough but may look a bit sketchy to you compared to other places. I wouldn’t go just to have pizza, but if you plan to check out the city, visit the archeological museum, go to Pompeii and/or Herculano and climb Vesuvius, then yes, having some pizza is worth it.\n\nBTW, please don’t expect American pizza, or you will be disappointed. Italian pizza is wonderful but it is very different!"}, {"username": "Yolie Marroquin", "comment_text": "Naples is definitely worth it and “Is it safe”? Well no one can guarantee you that there or any other place, but if you just use common sense and are aware of your surroundings, just like in any big city in Europe or anywhere in the 🌎 you should be fine. So many people travel everyday to Naples, Rome, etc and low life scammers and pickpockets know this, so don’t obsess over the “what if” and just try to be a smart and savvy traveler 🌻"}, {"username": "Delphinia Salamin", "comment_text": "If you feel unsafe just do a tour while there. I’m doing g a pizza tour"}, {"username": "Candace Beutell Gardner", "comment_text": "Never felt unsafe anywhere in Italy, including Naples."}, {"username": "Roxana Iosifescu", "comment_text": "Roxana Iosifescu"}, {"username": "Maria Brozou", "comment_text": "it is safe. You will be fine. The city is beautiful and the pizza is the best in the world. Do not stay near the train station please."}, {"username": "Marissa McLean", "comment_text": "I feel more unsafe in Vancouver than I ever have in any Italian city, including naples"}, {"username": "Skye Birch", "comment_text": "YES ITS SAFE..."}, {"username": "Christie Grant", "comment_text": "We just caught the train from Florence to Naples and the 6 of said we were glad we weren’t staying there. In saying that there has to be pleasant parts of Naples. We were only\nIn the vicinity of the train station and we never felt safe."}, {"username": "Elena Colandrea Coppola", "comment_text": "Go to Naples and enjoy this beautiful city!\nSo so worth it."}, {"username": "Linda Pitler", "comment_text": "Naples is beautiful. Use some common sense and you’ll be fine."}, {"username": "Samantha Edmonds", "comment_text": "Best place for pizza in Naples? We will be passing through for a few hours on our way to another destination and excited to try the food"}, {"username": "Jeanne Bissell", "comment_text": "I could not wait to get out of Naples. Other people love it."}, {"username": "Enrica Palla", "comment_text": "Yes it is, like every big city also in USA and all over the world you have to use common sense."}, {"username": "Rosalia Ciminella Caramanica", "comment_text": "Sometimes it’s hard to just scroll down,,, like someone said: same questions and same answers! Naples 💯"}, {"username": "Wendy Spano Bracco", "comment_text": "I am spending 3 hrs in Naples, having pizza too, then getting on the ferry to Anacapri. Im not worried."}, {"username": "Marco Scacchi Fratini", "comment_text": "Stick to popular, well-lit areas, and I don't think you'll have any issues. Having said that, Naples is neither the most crime-ridden nor the safest large city in the world. I've been there a few times and wouldn't have reservations about going again. However, I would recommend looking at crime statistics to inform your decision. Numbeo provides a high-level international comparison where Naples is shown as safer than New Orleans and Philadelphia, but more dangerous than Washington or Portland (https://\nwww.numbeo.com/\ncrime/\nrankings.jsp?tit\nle=2023-mid). If you look at detailed statistics among Italian cities (apologies, I couldn't find data in English), you'll see that in aspects that matter to a tourist, Naples ranks first among large Italian cities for purse snatching and vehicle/\nmotorbike theft. For other crimes, including rapes for instance, other large cities like Milan fare worse (assuming all crimes are reported equally, of course). This is the link to the detailed statistics for Italy: https://\nlab24.ilsole24or\ne.com/\nindice-della-cri\nminalita/\nindexT.php"}, {"username": "Shardul-Neha Purohit", "comment_text": "People forget we all have limitations on travel time/budget/\ninterests…with that said…Naples would be at the bottom of my list…maybe one day but not any time soon…Sorrento on the other hand…would happily do it again"}, {"username": "Annette Tamminga", "comment_text": "It is a metro area. Any large city comes with greater risks than a small community. Use the same common sense you would use in metro areas where you live."}, {"username": "Anna Sanday", "comment_text": "Anna Sanday"}, {"username": "Gaby Devyll", "comment_text": "Naples is a great city by the port and with lovely people despite my language barrier. Great food and cheap as well. I don't understand how people find this place to be unsafe unless you get mugged or whatever then I would have agreed."}, {"username": "Emily Chiavola", "comment_text": "Naples is beautiful and definitely worth visiting. That being said, like any touristy city, there will be pick pockets so please just be aware of your surroundings and personal items! I had a wonderful experience in Naples and did not feel unsafe, but I have had a friend get a phone pickpocketed there (she is very American looking and they do target Americans especially). Just be aware and you will be fine! If you have been to Rome/Paris/\nLondon I would say it’s about the same as it is in Naples. Now, go and enjoy some authentic Neapolitan pizza!"}, {"username": "Michael Widjaja", "comment_text": "I’d feel more unsafe in the Northern cities like Milan…"}, {"username": "Esther Newcombe Mahon", "comment_text": "What would you think woukd happen then there that cpulsnf happen anywhere else .take precautions.\nI'm going in September I intend in having anything of huge Value under my clothes"}, {"username": "Irene Oda", "comment_text": "I spend a lot of time in Naples- every year. I love it. Wonderful people , art, great museums and amazing foods. Never felt in danger at all."}, {"username": "Katia Taam", "comment_text": "I've stayed 3 months in Naples last year. Loved every minute, felt safe all the time. Walked at night without any problem..."}, {"username": "Jess Armour", "comment_text": "It’s fine, you just need to be smart about it (like everywhere) do some research on areas to stay in and you’ll have a ball. Plus the pizza is 1000 times worth it!"}, {"username": "Sonia Scotto Lubrano", "comment_text": "How old was the video? Naples has really turned itself around\nIts 100% worth it\n\nMilan & Rome have way surpassed Naples"}, {"username": "Alessandro Iannelli", "comment_text": "it's not easy to answer your question because i feel that if i said all is well and good in naples, i would be lying to you. the chances of being robbed in naples are overall not high, but are higher than the average for italy. anyways, i would feel safer in naples than in an average u.s. city, to be frank. so, is it worth it? in my opinion, it is. we are talking about the city with the greatest historic center in europe, rich in monuments, at some point (xvii century) the biggest city in europe. however, but this is my opinion, i'm not sure that pizza alone (since this is what you are mentioning) is a good enough reason to go to naples because honestly, there's great pizza pretty much everywhere in italy."}, {"username": "Tony Palombino", "comment_text": "Naples, as with any other very large city has its risks, Naples historical Centro is in my opinion, the safest area to stay, now with that said, a few years back, we were with another group who were robbed at gunpoint in that area, took their wallets, cameras, phones, etc. But again that risk could be anywhere."}, {"username": "Sigrid Cormier", "comment_text": "I have never yet heard of some nut with a gun run into a church, department store, school or parking lot and murder dozens of people or children. Yet this happens every day in the US, and you worry about the offbeat possibility of being pickpocketed?"}, {"username": "Pam Gerretsen", "comment_text": "We were in Napoli for the first time last week (been to Italy many times) and loved it! It's different to other parts of Italy, for sure. We parked at the San Genarro catacombs and walked into the city with our teen daughter (20-25 min walk) - did not feel unsafe at all. (Taking usual precautions of bag at the front, etc.). Don't be put off, be careful (same as anywhere) and enjoy the pizza, it's the best we've had in Italy by a long way! And San Gaudioso catacombs are worthwhile, if you have time."}, {"username": "Don Bentivoglio", "comment_text": "Safer in Naples than in Portland or Seattle. If you are that worried about experiencing a \"foreign\" country, perhaps you should stay home. YouTube isn't exactly the best place to get travel advice or to listen to someone \"who heard from a guy who heard from another guy\". Italy is a magical country just lean back and enjoy it."}, {"username": "Karyn McCluskey", "comment_text": "Naples is ok just be aware of surroundings,we\nwent to first Pizza place & it was closed .😉"}, {"username": "Valerie Collanton", "comment_text": "It’s worth it. It is an amazing city. It’s safe IMO. Have been there a few times including a solo trip. No issues. Like any big city anywhere in the world — be aware of your surroundings and use your common sense."}, {"username": "Lisa Adams Robertson", "comment_text": "We loved Naples and never felt unsafe. We stayed in the historical center for 3 nights, and wish we had more."}, {"username": "Laurie Denoni", "comment_text": "Naples is a feast for the senses. It it beautiful and real. If you expect to be a resort then bypass but if you want experiences to remember go. We have spent 4 months in Italy. Recommend you stay a couple nights at least if you can. Enjoy."}, {"username": "Dixie Kotylak", "comment_text": "I will need to go back to Napoli, the place we had booked was out in the middle of nowhere unfortunately, and we were unable to even walk to the trains…I know I did not see the best side of Napoli, where we were seemed ‘shady’ and run down….so I will need to go back and give fair Napoli another chance to show me her best. 👌🏻 I’ve seen pics of her beauty, I’m sure you’ll love her. 🥰"}]}, {"id": "2205678029831275", "text": "Hi I am travelling to Italy so wanted to know how the euro rail pass works ?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2205678029831275/", "likes": 0, "comments": []}, {"id": "2205665879832490", "text": "Will be traveling to Italy for over a month. What are the must eat, drink and do things in Italy. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2205665879832490/", "likes": 0, "comments": []}, {"id": "2205679643164447", "text": "Hello Itabros or anyone else visiting this wonderful country.\n\nSo, I've just come back from a trip where I rented a car from Turin for 2 days.\nThe process was that I would pick up the car from a certain parking lot and return it there too, which I did and in the exact state I found it in.\n\nHOWEVER, they've come back to me saying they were gonna charge me 300+80 EU for damages they've found and administrative fees for a severe scratch they found on a door, which I'm sure I didn't do. And he'll if I know how. Could be another car in the parking lot/a meteor for all I care.\n\nAdmittedly it was my first time renting a car myself and I just now found out taking pics/videos of the car at pickup and drop-off is a thing. The rental company also comes up for fishy/scummy actions when searching (yeah-shoukd have done this beforehand) them by their name.\nOn pickup I used a credit card ofc and they said they would keep a deposit of 600, however checking my web-banking this sum doesn't appear to have left my bank account.\nSo I moved everything to another bank and canceled my credit card before they could charge me by new.\n\nThey question is, can they claim the money in anyway else? Ofc I don't want to get into an email and claims war since I don't have undeniable evidence and would rather let them chase their tails around.", "link": "facebook.com/groups/1373361046396315/permalink/2205679643164447/", "likes": 3, "comments": [{"username": "Sharon Roberts Crossley", "comment_text": "Tell them to send a pic of damages"}, {"username": "Gianna Onesi", "comment_text": "To claim the money back don't they have your license etc..maybe track you from there?"}, {"username": "Annette Mayer", "comment_text": "This happened to me in US. Put the burden of proof back on them. As them to send you before and after pictures of the car with license plate.\n\nI've read this happening to others too. This is why even though I so much want the freedom a car will give us, we will not be renting."}, {"username": "Alessandro Battxi", "comment_text": "Did you take the pictures before going with the car? If not, it's their proof against your missing pictures before renting. You'll have problem and they probably will move some kind of action against you that will give you issue next time you come back to Italy. Remember, you give your ID to rent a car, so your identity is fully disclose to them."}, {"username": "Samantha Lynch", "comment_text": "I had this happen with a friend who had a \"leave the rental in a parking lot\" situation. She disputed with her credit card and contacted the company separately. She won on both fronts."}, {"username": "Bonnie Rodgers Henderson", "comment_text": "Always take pictures of the car you pick it up. I always do that when I rent a car, including the US. Those pictures helped when I rented a car in North Carolina last month."}, {"username": "Laura Uribe", "comment_text": "Unfortunately, you should always get all offered insurance when traveling overseas. And take before and after pictures."}, {"username": "Lisa Jane", "comment_text": "We had no damage on a car we used from Rome to Florence and they said it was all good on return.. then when we got back to Australia they tried to hit us up for 300 Euros- we ignored the bill and nothing ever came of it… that was 5 years ago."}, {"username": "Alicia Cox", "comment_text": "Everything advised here -\nCall car rental, dispute it verbally, get name of who you speak with & document date, time, who you spoke with.\nSame with credit card - call & document.\nFine that you have cancelled & changed, etc but still communicate.\nThey likely will track you down. I had that with a ticket that was unfair. We got contacted by a legal firm in the US for the ticket plus a fine. I payed it as I knew we would go back to Italy & I had visions of being arrested as I got off the plane 🤣, so I payed it 🤷🏻‍♀️."}, {"username": "Susan Rathke", "comment_text": "What type of insurance did you use for the rental car? Seems to me an insurance claim would be first place to start…"}, {"username": "Kim Butler Oam", "comment_text": "Just ignore it now you’ve changed your card. They sound dodgy so I doubt they’ll chase you. I’d never hire a car in Italy after all the horror stories."}]}, {"id": "2205688463163565", "text": "I have so many positive things to share about our 2 week trip to Italy, however I wanted to make a quick post about places I suggest to avoid if your booking a hotel.\nBoth booked on booking.com with high ratings and good reviews.\n\n1. Parthenope’s Home, Naples.\nNeeded to be close to train station, and it was an excellent location.\nwhen we walked in, everything smelled damp, musty, and the towels smelled of dead fish and vinegar, but it looked clean enough.\nThen my daughter got into the shower. I was lying in the bed, and she said she was done and needed a towel, so I sat up, and put my feet down into a LAKE on the bedroom floor.\n\nAt first I thought a bottle of water leaked in our luggage, so I ripped said luggage apart looking for it. No water in our bags. Now I look for a leak or something in the ceiling. Nope. I then realize the shower is directly on the other side of the wall from the leak, and there’s water gushing out from underneath the wall, flooding the room, and soaked all of our luggage sitting there.\n\nI immediately message the host, saying we need towels to clean this up, and the wall/shower\nIs leaking, please come look.\n\nShe responds with “bambino did it!!! BAMBINO no shut door”. The door WAS in fact all the way shut, the bathroom floor completely dry.\n\nShe comes up stairs SCREAMING at us (all Italian, no English - which is fine), but refuses to use google translate to communicate with me, instead shouting “Alora!!!” Over and over and over.\n\nTHEN she walks over to my daughter and starts grabbing her by the face, still speaking frantically at her in Italian.\n\nShe then says, “I knew absolutely nothing about this. No one else this ever happen to”\nBullshit. And Don’t touch my kid.\n\nUnfortunately it was late at night, and we needed to be up in a few hours or I would have left and got another place. Thank god we were only there for a few short hours.\n\n————————\n\n2. Hotel Nord Nuova, Rome.\nThis was our second hotel in Rome at the end of our trip for one night. I needed to be close to Termini, which it is\n\nWe checked in around 9pm and headed straight out to dinner, and spend our last few hours exploring beautiful Rome. The room stunk a little, like smoke and dampness, but I thought “it’s just one night”\n\nWe got back in around 2am, and when I went to take a shower I notice the black mold crawling up the walls and out of the ceiling, a ring around the entire bathroom. Disgusting and unacceptable.\n\nThe bed and pillows were hard as hell but we were so exhausted it really didn’t matter.\n\n—————-\n\nThe other places we stayed over the two weeks were fantastic. I’ll\nPost about that later on.", "link": "facebook.com/groups/1373361046396315/permalink/2205688463163565/", "likes": 57, "comments": [{"username": "Marisa Mariniello Grano", "comment_text": "I’ve been to Italy for 5 weeks booked through booking.com and had awesome apartments. Always always read the reviews! If none don’t book it. That’s my motto!"}, {"username": "Michele Liggett", "comment_text": "Your story makes me glad we worked with a travel agent to give us hotel options."}, {"username": "Cinzia Colombo", "comment_text": "Completely shocked by the woman’s behaviour … grabbing one kid’s face and speaking frantically a language that the kid doesn’t understand is so despicable! Grabbing anyone’s face in general is rude, vulgar and so low level … I am sorry that you had to experience that and I hope your kid didn’t get frightened by that psycho!"}, {"username": "Lori Risco", "comment_text": "Thanks for the heads up. Will definitely not book either of those hotels. 😬"}, {"username": "Katie White-Meade", "comment_text": "One rule I have always been taught. Everyone has the right not to be touched. Never touch anyone. Gosh, mumma bear you must have been furious knowing that none of this was your child’s fault. Disgusting behaviour. She decided not to listen cause she knew she was wrong."}, {"username": "Anna Gambino", "comment_text": "Nightmare"}, {"username": "JoAnn Sgarlata Simmons", "comment_text": "Michelle Vincent take note! Yuck !!"}, {"username": "Catalina Daniel", "comment_text": "My experience was slightly similar w an outrageous host in Rome. No way Id allow someone to touch my child in such a manner. Im sorry your child dealt w that. That’s disgusting behavior.\nI myself, rented from a “super host” turned out to be a super nightmare!!\n>Veneto exclusive suite< In Roma\nTurned out shes been having the same issues I complained about for at least a year ( after reading her reviews from beyond the last year). Then she tried to blame me for all of it!\n1. She scolded me for placing my purse on the table upon check in. Then took my purse & put it on the floor! Idk about others but I found it extremely disrespectful to touch another person purse & unlucky & dirty to have it on the floor.\n2. My son was reading her information sheet & she snatched it from his hands & scolded him to “No touch!”. She kept saying no touch this, no touch that!\n3. I went to open a curtain & the rod fell out nearly hitting my son & I. We showed her & of course it was my fault! The wall was boared out & the hook was barely hanging in. My adult son & I got up on a ladder & tried our best to fix it. Reality is the wall needed to be patched then reattach the hook.\n4. I decided to washed my sheets & when I pulled back the covers, to my SHOCK the mattress was COVERED in URINE STAINS!!! And I do mean COVERED!!! Again, she tried to blame me (thru airbnb review).\n5. Upon check out she said I could leave the keys on the table. I had enough & refused to be subject to her lies & rudeness, so I did just that! She then wrote the most disrespectful review on me again blaming me for ALL OF THIS & more!\nStay clear of this lady! I now know she has a history of blaming her guest for the same damage over & over!\n6. I then responded to her review w the TRUTH & in detail. I hope it saves the next guest from living a nightmare. From the second I walked in I felt disrespected. I hope I or anyone never have to deal w host like this again."}, {"username": "Cindy Sguazzin", "comment_text": "We’re these two horrible places really hotels, or B & Bs?"}, {"username": "Sierra Behrens Tibbetts", "comment_text": "I always book based on reviews. There needs to be a lot of reviews too. Not just a few. So sorry this happened to you."}, {"username": "Sheri Kaylor Marrs", "comment_text": "I am curious how booking.com rated these 2 places, can you please share? Thank you!"}, {"username": "Angela Grumpylicous", "comment_text": "Just make sure to post reviews about all the places you stayed good and bad to all platforms. I try to post all my good reviews right away and then wait a minute to calm down before posting the bad reviews"}, {"username": "Sandra Keyser", "comment_text": "We had one place that was a horror and reviewed as such. The owner wanted to know why we gave him a bad review! We told him: Advertised ocean view, only if you left the apartment and walked two blocks! Advertised easy access! 85 steps straight up! Advertised air conditioning: Only if you opened the windows and prayed for a breeze!\nAdvertised spacious: Dorm rooms are larger than the apartment! The embarrassing part is that we rented it for family members and we were in a lovely apartment! We found out he lived on Turkey and had never been to the apartment!"}, {"username": "Charleen Siegler Schuss", "comment_text": "Sorry your awful experience I'm not sure it's Booking.com fault. Places around the train stations usually are not the best."}, {"username": "Melanie Matthews Stuprich", "comment_text": "I have stayed in many places all over Italy with Airbnb and booking.com (and all over Europe in general) currently live in Sicily so we do a lot of weekend trips. I hate that you had to deal with that experience and sounds very frustrating…but\nfor all those reading, it’s not the norm here, It’s definitely the exception!"}, {"username": "Delphinia Salamin", "comment_text": "I just looked at reviews at Booking/com but didn’t see a negative review posted for Parthenopes Home Naples and all seem very good. Sometimes you just can’t base things from a review and hope for the best. I can’t credit the above ⬆️ review with Anonymous Name may not be true information"}, {"username": "Sheree Gillard", "comment_text": "Its good that people can all share stuff on here so others no.who to stay away from,i used to love going to Rome but over the last 5 years i tried to avoid taking my people on tours through rome ,the romans have got really nasty and rude,they dont want the tourists there ,but they forget with out them there economy will collapse thats there bread and butter so to speak"}, {"username": "Chi Linh Nguyen", "comment_text": "Following"}, {"username": "Amy Kaye", "comment_text": "OMG, I would have been arrested for assault after that!"}, {"username": "Sigrid Picken", "comment_text": "That's dreadful."}, {"username": "Sh Kaplan", "comment_text": "Did you read any reviews or where did you find these hotels ? Concerning !"}, {"username": "Paula Ann", "comment_text": "Unacceptable in any country! I witnessed a couple get turned away from our hotel in Venice after arguing they booked their stay thru Booking . com. I booked directly with our hotels or bed and breakfast (not AirBnB!) and got discounted rates. In some cases, an additional discount was offered if I paid the balance in cash at checkout."}, {"username": "Julia Jacobie", "comment_text": "I’m so sorry you had such an awful experience. One thing I will say after many years of travelling in Italy is never book a hotel near a major train station - it is usually the worst part of the town/city and most of the ‘hotels’ are somewhat dodgy. I’m glad the rest of your trip was a lot better for you x"}, {"username": "Claire Buccini", "comment_text": "Be sure to leave reviews and on google too"}, {"username": "Kristy Bretagne", "comment_text": "It would be good to put this info on a more public forum such as trip advisor!"}]}, {"id": "2205734549825623", "text": "Hello friends! Heading to Turino in a few weeks for a long weekend. Any tips or recommendations? Day trips? Thanks so much I'll be flying in from London.", "link": "facebook.com/groups/1373361046396315/permalink/2205734549825623/", "likes": 0, "comments": []}, {"id": "2205735283158883", "text": "What app is best to book rail travel?", "link": "facebook.com/groups/1373361046396315/permalink/2205735283158883/", "likes": 1, "comments": [{"username": "Bing Robertson", "comment_text": "Direct with the company, I used trnitalia, no extra handling fees"}, {"username": "Jay Parekh", "comment_text": "Trentalia or Ilto directly"}, {"username": "Mia Catalano", "comment_text": "Trenitalia, we did all ours with them 😀"}, {"username": "Marc Spiegel", "comment_text": "We used Omio"}, {"username": "Gianna Onesi", "comment_text": "Trenitalia and you can search up top for more info on that. This question has been asked many times 😃"}, {"username": "Jenn Messina Babore", "comment_text": "TrenItalia"}, {"username": "Mel Devereux", "comment_text": "None. Italo website/app directly"}, {"username": "Andrea Herbold K.", "comment_text": "Buy direct"}, {"username": "Sam Mah", "comment_text": "Trenitalia."}, {"username": "Gillian O'Callaghan", "comment_text": "Trainline....bo\noked 13 trips in Italy, covers both companies, great info, easy QR codes."}, {"username": "Emily Mars", "comment_text": "I just used Trainline last night no problems!"}, {"username": "Kate Rumbold", "comment_text": "Thank you so much! 😘"}, {"username": "Amelia Bonannella", "comment_text": "Majority booked through Trenitalia (as it’s direct) with the odd booking through Trainline"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205760496489695", "text": "Any suggestions how to get from Cavour Hotel Milan to Milan Melpensa Airport, there’s two of us and have been quoted AUS $130 per person transfer, sounds expensive or is this normal? (So A$260 for the trip)??", "link": "facebook.com/groups/1373361046396315/permalink/2205760496489695/", "likes": 4, "comments": [{"username": "Pietro Adami", "comment_text": "Taxi yo the train station Milano Centrale + train Malpensa Express"}, {"username": "Cynthia Cahoon", "comment_text": "Look at a site Rome2Rio"}, {"username": "Jenny Payne", "comment_text": "Google drivers to airport or ask at your hotel or airb&b could they arrange it?"}, {"username": "Giovanni Pianigiani", "comment_text": "the flat rate for public cabs is 110€ (per car, not per person)"}, {"username": "निनावी सहभागी", "comment_text": "Thank you for your answers 😊"}, {"username": "Gilda Capraro", "comment_text": "Sounds a bit high. Last year a taxi was 100 Euro. Per car, not person."}, {"username": "Pamela Campaner", "comment_text": "Subway to Cadorna or Centrale station and then Malpensa express every half an hour"}, {"username": "Giorgio Zanichelli", "comment_text": "just take the train"}, {"username": "Giorgio Zanichelli", "comment_text": "walk or take the subway yellow line to centrale\nthen the malpensa express train.\nas easy as could be. No need for a private transfer, you're not VIPs anyway"}, {"username": "Sande Ricci", "comment_text": "Train. It stops at the airport."}, {"username": "Brian Osman", "comment_text": "Speak to the people at the hotel desk, they are great with this kind of stuff"}, {"username": "Trevor Ian Wright", "comment_text": "Public transport we got a bus from the airport to the centre of milan"}]}, {"id": "2205762823156129", "text": "Has anyone been to the Porta Portese Market in Rome on Sundays? If so was it worth it? Our landlord said it isn’t… (but wanted to hear from someone who’s been)wondering if it’s worth the 45 minute walk before we head out to Florence that afternoon.", "link": "facebook.com/groups/1373361046396315/permalink/2205762823156129/", "likes": 0, "comments": []}, {"id": "2205764366489308", "text": "So how hot is hot? I’ve been reading so many people say how hot it’s been.\n\nI’m an American from Southern California and we are in a Mediterranean climate as well. It gets really hot here, especially farther you get from the coast. I’ve lived in summers of 110f for more than 20 years. I was once at Disneyland when it was 109f. Ive been to Las Vegasआणखी in August. Yeah it’s hot but I can handle it. To me, cool weather is under 90f. Also, I also does it get cool at night or does it stay above 80f and never cools off? We were going to go in October but decided to go in June or September of 2024. I’m leaning towards September because if Italy weather is anything like California, September will be warmer than June.", "link": "facebook.com/groups/1373361046396315/permalink/2205764366489308/", "likes": 15, "comments": [{"username": "Jazmin Avila", "comment_text": "I’m from Texas where we experience high temps with high humidity. Italy was the same. The only issue is that you get little breaks from the heat during the day unless you go back to your hotel or accommodation. Most restaurants and other businesses will not have strong ac if anything at all. They may have fans, shade or just the windows open for some breeze to pass through. So just come prepared: fans of your own, water bottles (there are fountains around to refill them), cool clothing, etc. Take a break/nap at your accommodation during the hottest part of the day then come back out for dinner. We were there nearly the whole month of July and stayed near Rome most of the time (travelled to Sorrento and Florence area a bit) & temps started out in the mid 80s typically then would go up to the high 90s or low 100s. It was hot but the heat did not deter us from going out and doing what we wanted to do."}, {"username": "Annalisa Shulde", "comment_text": "It’s the sun. It is constant. And I love it!! No clouds in the sky!"}, {"username": "Christine Mackenzie", "comment_text": "We are in Rome right now, it's around mid 90s in the day and 75 overnight. It's hot in the sun but there is always somewhere to get some share or AC. We are Scottish and usually have temps or around 65 in the day time. We are coping ok with it and sleeping so soundly at night because we are exhausted. Just make sure you drink plenty water, which is easy as there are fountains all over the city. Today is day 6 for us and the first day I would say I have got the sun and thats because we were cycling the Appian way with limited shade and stupidly not enough suncream."}, {"username": "Emma Wentzel", "comment_text": "I am here now. It is hot, and feels like a different kind of heat and unsure why. It may be perhaps of the streets and the heat radiates from the ground? I really recommend a cooling towel, it has saved me today!"}, {"username": "Renee Rundle Stoneham", "comment_text": "Wayyy more humid than California.\n\nAlso consider what you’re going to do. If you are just going to visit lakes and beaches etc it’s fine.\nIf you are going to be visiting cities like Rome, Florence etc and plan on see the sites and walking etc its HOT! At home you’re not walking outside all day, Rome gets hot the heat radiates off all the granite stones etc.\nCrowds, your with thousands of people and having to wait in lines etc..\nA/C is not like US A/C and cities have conservation laws where it doesn’t run during the day. It’s set at around 74.\n\nWe were there in June this year, we were in France first and it was great! Got to The lake region and summer hit! Maggiore wasn’t as hot as Como, by the time we got to Milan summer was in full swing. It wasn’t unbearable but sweaty 😂\nThis was before the heat of July started.\nI won’t go back in summer again unless it’s for the beach.\n\nSeptember should be very nice. Less crowded as well."}, {"username": "Ashley Martins", "comment_text": "I also live in Southern, California. We went to both Greece in Italy 6/15 to 7/5. Water is warmer then our pacific & air is more humid. The only place I felt, wow this is hot was Rome & compared to the heatwave later in July they had, it wasn’t even that bad. I would go in September as crowds would hopefully be a little less once everyone is back in school."}, {"username": "Maria Samaee", "comment_text": "I live in Southern California as well and grew up in a very hot country, that was exactly what I was thinking, but it was too HOT for me when I was in Italy in July and never go back in Summer, it is different type of hotness! Very humid, also here we drive anywhere and all places with air conditioning but there we need to walked a lot and many places did not have a good airflow."}, {"username": "Yvonne Ormson", "comment_text": "It’s much better now! Regular summer heat. A few weeks ago was insanely hot 🥵"}, {"username": "Sonia Scotto Lubrano", "comment_text": "The heat is relatively the same. Maybe more humid here.\nThe issue with it feeling warmer here is that we don’t have the same relief as Americans do. Maybe also because you’re walking in the streets and the pavement radiates warmth.\n\nIE:\nAir conditioning in the states is abundant. It’s everywhere and works well everywhere. Works great in the car. The store. The restaurant.\nNot the same rings true for Italy.\n\nNeed to cool off with a cold beverage in America? Ice. Ice everywhere.\nIn Italy - you’ll get a bottle from out of the fridge and even that is barely cold lolol"}, {"username": "Nicole Beaumont", "comment_text": "I’m from SoCal too and was there for 3 weeks in June. It’s definitely more humid than at home. I did have times where the humidity got to me, especially in Rome. The key is to always have water on you and in the afternoons to do indoor activities or go back to your hotel room for a few hours to beat the heat. Gelato also helped cool me down! 😊"}, {"username": "Debbie Riffe Fulco", "comment_text": "I’m from the south in the US and I went for 2 weeks in October last year. I brought layers, but after being out walking all day, I soon stripped down to a tank top. But others were walking around in coats. It’s what you’re used to I guess. The ac in Italy is different than ours and I travel with a fan everywhere I go."}, {"username": "Kelly McChurch Rehn", "comment_text": "We were there this week when it was mid 90s. I packed all the gear for hot weather but in reality it was tolerable to the point no one wanted to bother carrying it. Im from the midwest where we have hot, humid summers and thankfully we were well conditioned for it."}, {"username": "Rosanna Hardeman", "comment_text": "No comparison to SoCal, it’s a humid heat, and it’s so bad that Italians leave in August for a more tolerable climate. Go in October, even June is warm. It’s the humidity that gets you."}, {"username": "Kate Argent", "comment_text": "We’re from the uk so used to cold and rainy weather. We are currently in Sorrento. We have been to Pompeii and Vesuvius with our 13 year old son who likes to complain. We have all managed perfectly in the heat and loved every minute."}, {"username": "Alexandra A Welker", "comment_text": "The heat is about the same but because of the humidity it will feel warmer/hotter."}, {"username": "Moe Berg", "comment_text": "It’s hot but no hotter than Florida or Texas. The hottest I’ve ever been in my life is Tybee Island, GA. But people are right about the A/C being variable. Bring a battery operated fan."}, {"username": "Sophie Heather", "comment_text": "Been cloudy & chilly jn cinque Terre last 36 hrs !"}, {"username": "Agne Krause", "comment_text": "I'm from Chicago, finishing 13 day trip. Fortunately we arrived as the heat wave subsided and it wasn't bad at all. It helped that we spent first 6 nights on the coast. I used neck fan and hat in Rome and Florence where the heat was more intense. We stayed in central locations in all cities so we can reach everything easily and return to the room every few hours to cool off and rest. I was worried so much about the heat after reading all these post warning against touring Italy in summer, but it was fine!! Just today did bell tower climb at 1 pm in Florence at 33 celcius, and I barely felt any discomfort. Summer trips were a lot worse for me in Vegas and Key West heat and humidity wise! You'll be fine!"}, {"username": "Ειρήνη Δεγρέση", "comment_text": "If 90 Fahreneit is 32 Celsius and you consider this ''cool'', I rest my case. For me, everything above 22 is unpleasantly hot."}, {"username": "Enery Castellanos", "comment_text": "Florida born and raised and just left this morning. We went from the Amalfi to Venice and horrendous heat. Draining and soaked type of sweating. I’ve been in shock the whole time. We had to buy portable fans and all."}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "It’s the humidity and also the a/c or lack there of. You don’t get the same rest from the heat as you do in ac in the US"}, {"username": "Toni Quatrini Bannister", "comment_text": "I went this past March and the weather was perfect only one day of rain and way less crowded! I live in Southern California also!"}, {"username": "Anita Bonaminio Krimm", "comment_text": "I’ve lived in a tropical resort area, Hilton Head Island SC, for 38 years now where it is extremely hot and equally humid so being hot in Rome doesn’t scare me. You should just adjust and not let it damper any fun because you’ll be visiting one of the most beautiful countries in the world. 🇮🇹🇮🇹🇮🇹Right?"}, {"username": "Jennifer Aguilar", "comment_text": "We're supposed to be there the end of February, I was thinking like 60's?"}, {"username": "Maria Al", "comment_text": "I compare it to the bottom of the Grand Canyon. It was 120 there. It was 110 halfway up. Walking Vegas was 104. I live by the Great Lakes and it’s always humid. It was 90s when I was in Italy with feels like of 104. I came home and felt SO much more comfortable despite our heat advisory with 90% humidity. I don’t know how to explain it other than oppressive. Just sitting, sweat was rolling down my back. I had a neck fan going and was constantly hydrating."}, {"username": "Steph Kittles", "comment_text": "I'm in southern California, inland empire, where it's hot. We went in October to Italy and I was shocked how warm rome was. I was a sticky mess with a zillion mosquitoe bites...includi\nng one that left a scar on my cheek ugh! Since nothing outside of museums and our hotel had AC, going into little shops was not enjoyable with the heat. We still had a nice time but I kinda wish we had booked in dec or Jan as we don't love traveling in the heat. We probably would have had a better time. I'd rather be in a sweater than sweating..."}, {"username": "CT Loque", "comment_text": "Its hottt in the sense that u know here in america if its a 100 degrees out and we need to go to the store we dont walk we have our cars,ac etc. imagine its 100 degrees out and need to walk all day under that sun to attractions take pictures etc. it really is tiring of course with breaks its going to be fine..i mean idk if you get my explanation haha"}, {"username": "Laura Zanivan", "comment_text": "Both months are good to travel in Northern Italy.\nJust avoid beginning of June because June, 2nd is a National holiday and in that specific week touristic destinations are usually crowded.\nAll other weeks of June and September are usually ok."}, {"username": "Cess Kearns", "comment_text": "We went in October and was very pleasant from Rome to Venice to the Tuscan region, towns in between, then back to Rome, just a light cardigan and an oversized scarf"}, {"username": "Andrea Ferretti- Kearney", "comment_text": "Depends on where you are in Italy. Rome was extremely hot and humid. That being said, I found it less humid than where my sister lives, closed to Milan. But if you’re in the Sorrento are and closer to the ocean where you get that ocean breeze the heat is more bearable"}, {"username": "Jan Fargo", "comment_text": "Don't go in June, horrible crowds and traffic. Sept will be cooler less people."}, {"username": "Alessandro Iannelli", "comment_text": "first off, where in italy? i mean, milan or syracuse are very different temperature-wis\ne. also, it depends on which part of the month we are talking about: early june and end of june are two completely different beasts, and the same applies for september. anyways, i don't find much of a difference on average between june and september. if you want something more accurate, old plain wikipedia is a good reference: https://\nen.wikipedia.org\n/wiki/\nClimate_of_Italy"}, {"username": "Devon Grandi Powell", "comment_text": "We just left Rome and it’s hot but certainly not unbearable in any way (we live in Boston so are used to humidity but it is usually 90 or below). The only times I felt uncomfortable were inside crowded buildings with no AC and when we toured the Forum (very little shade). We were fine though, we had hats and sunscreen. My younger son really liked the neck fans we brought but no one else used them. We did use cooling towels (that you get wet) in the Forum but that was the only place. The most useful “cooling” device we had was an inexpensive old fashioned folding fan. We did Pompeii yesterday and even that was fine - it was hot but we were lucky to have a nice breeze through a lot of the morning and there was more shade than I recalled from our last visit. So- it’s hot, but I wouldn’t let it dissuade you if this is the time you are able to travel!"}, {"username": "Whitni Henderson", "comment_text": "June is high season. It will be incredibly crowded"}, {"username": "Diane Davis Lawyer", "comment_text": "For once I'm grateful for living in a hot and humid environment where humidity in summer months is almost always 90%+ or so. It has conditioned me to be able to tolerate most hot climates, even if not enjoyably so. If going in the summer months, hit the sauna for a couple of weeks beforehand to condition your body to increased, humid temps!"}, {"username": "Paige Wood", "comment_text": "It’s more humid than Southern California, especially inland (at least in Rome in June)"}, {"username": "Lucrezia Folger", "comment_text": "It's very easy to Google past year's trends in cities you'll be visiting in Italy during the months your planning to visit. Yes, when the sun goes down it gets cooler, during the summer it stays light at least until 9PM."}, {"username": "Fabiola Calderon", "comment_text": "We were in Rome last week and we’re from Southern California (115 degrees) and we handled it just fine. It’s more humid than we’re used to but it was bearable for us (family of 5, 4 adults and a 17-year old)."}, {"username": "Rhonda Hope", "comment_text": "It’s the humidity"}, {"username": "Jared Mankins Scavotto", "comment_text": "I'm from Florida. I know heat and humidity. When we went in May, the high was almost 80 and I was burning up as I was walking the streets in Rome. There is something different about the heat there and I'm really not sure the reason or why. I'm not hot at 80 anywhere in the U.S. but for some reason it felt oppressive and brutal there. Maybe humidity? Idk."}, {"username": "Shirley Lewis", "comment_text": "Florence is a renaissance city, narrow streets hemmed in by buildings, little A/C, lots of people ... I've spent a lot of time there and the heat and crowds can be miserable BUT it's a wonderful place with so much art! and so much chaos! this is a street in Florence also used by a select few cars"}, {"username": "Joanna Ruvolo", "comment_text": "I went in Sept and it was perfect"}, {"username": "Marty Harte", "comment_text": "Just got back last night. AM’s were so nice and pleasant low 70’s. Hottest day we hit 95 one day. It’s humid but not unbearable. Come back to your hotel during heat of day and head back out early evening if needed. We only did that one day. Pack the water bottles for sure."}, {"username": "Iris Garza", "comment_text": "I'm from Houston Texas and it is not hot at all. We've been to Venice, Milan, Florence and arrived to Naples today. It is no where near Houston TX hot."}, {"username": "Lorena Ospina", "comment_text": "Here now and not hot at all. Also from Cali. Going on 2.5 weeks here from Rome to Amalfi. Def tolerable"}, {"username": "Terry Pisano", "comment_text": "Lived in California and the Southeast US. 100 degrees is not the same in both areas. Humidity makes it much less tolerable."}, {"username": "April May", "comment_text": "Humidity here is not as high as in Michigan. Temps feel about 5-10 degrees cooler than back home. Plus there were lots of nice breezes in Italy"}]}, {"id": "2205773679821710", "text": "We're visiting Rome at the start of November. We have got everything sorted except the two tours we want to do.\nWe're wanting a local to do an early morning private tour of the Vatican and an early morning private tour of the Colosseum; but the main tour companies are quite pricey for private tours.\nAre their smaller local companies people know of and have used they can recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2205773679821710/", "likes": 0, "comments": [{"username": "Gena Diaco Penland", "comment_text": "We did tours through Viator. They were not private, but they were great! They give you a headset so you can always hear the guide."}]}, {"id": "2205508789848199", "text": "A 'passing through' decision in September. Time only for a short tour or delicious meal.\nRavello or Bologna?", "link": "facebook.com/groups/1373361046396315/permalink/2205508789848199/", "likes": 0, "comments": []}, {"id": "2205511426514602", "text": "Hi all we have 6 nights booked in Bologna in Sep 23 can anyone recommend any tours or sights that you really enjoyed please ? I have a food tour and Lamborghini tour booked already but really want to make the most of our 6 days. Thanks in advance !", "link": "facebook.com/groups/1373361046396315/permalink/2205511426514602/", "likes": 4, "comments": [{"username": "Eden Zambara", "comment_text": "F"}, {"username": "Scott Perry", "comment_text": "The Archaeological museum is pretty amazing. Guero for cocktails. Tell them Scott sent you."}, {"username": "JeriLynne Clifford", "comment_text": "We did three nights in bologna and five in Modena last fall. If you could spend a couple of nights in Modena, I would highly recommend\n\nI would suggest hiring a driver and going to see where balsamic vinegar is made, Parmesan cheese, maybe a winery and learn about L￼ambrusco. We did the little train (it’s not on tracks) outside the city to see the Madonna San Lucca.\n\nEnjoy! It is such a foodies paradise"}, {"username": "Gerri Willison", "comment_text": "Enjoy your trip"}, {"username": "Debbie Milne Jenkins", "comment_text": "We did “The Tasty Bus” tour booked through the tourist information office in Parma - it was a small group and we visited cheese making, Parma Ham, and balsamic vinegar producers. Each stop offered samples of their product with champagne and a typical local lunch - I wasn’t expecting much but it was a great day."}, {"username": "Kim Buchanan", "comment_text": "Catch the train to Ravenna, beautiful mosaic filled town"}]}, {"id": "2205517773180634", "text": "We are planning to take a day trip to Cinque Terre or Venice from Florence. Which place will be better to go?", "link": "facebook.com/groups/1373361046396315/permalink/2205517773180634/", "likes": 1, "comments": [{"username": "Nina Tross", "comment_text": "Tough choice - two such different areas and both require lots of walking to appreciate. My vote would be Venice/Burano/\nMurano"}]}, {"id": "2205519233180488", "text": "I would like to go to Venice from London for 3 nights, with 2 kids. Please can someone suggest any nice hotels or somewhere to stay and what to do...need to go asap. Also nearest airport will be great. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2205519233180488/", "likes": 1, "comments": [{"username": "Rae Gasparini", "comment_text": "Thank you so much!❤️"}]}, {"id": "2205529083179503", "text": "Best dinner restaurant in Rome? Don’t need 5-star, Michelin. Just something really good!", "link": "facebook.com/groups/1373361046396315/permalink/2205529083179503/", "likes": 9, "comments": [{"username": "Alexis McNamara", "comment_text": "https://\nwww.tripadvisor.\ncom/\nRestaurant_Revie\nw-g187791-d6965\n16-Reviews-Coll\nine_Emiliane-Ro\nme_Lazio.html"}, {"username": "Brooke Wylin", "comment_text": "Following!!😍"}, {"username": "John Green", "comment_text": "Strada romana was fantastic"}, {"username": "Eileen Glenane", "comment_text": "Dilla."}, {"username": "Kim LaFontaine", "comment_text": "Capranica Enoteca & Taverna. Hosteria Costanza, Pizzeria Emma. All fantastic. 💗"}, {"username": "Sarah Frank", "comment_text": "Loved l’amatriciana!"}, {"username": "Colin Ng", "comment_text": "F"}, {"username": "Renee Schoenbrun Rubin", "comment_text": "Alfredo’s for the fettuccine Alfredo"}, {"username": "Stephanie Lee Garcia", "comment_text": "Thank you for the ideas."}, {"username": "Riccardo Buttarelli", "comment_text": "Flavio al velavevodetto, strongly suggested.\n\nIf you want to try something new and you come in the summer, Oasi restaurant at Fregene has recently changed owners amd it is by far the best experience to eat pasta and vongole at a fair price literally on the sea. Suggest you to go there and see a fantastic sunset"}, {"username": "Julie Walker", "comment_text": "https://\nwww.harrysbar.it\n/en/"}, {"username": "George William Frederick III", "comment_text": "Following 😁"}, {"username": "Courtney Soloff England", "comment_text": "We ate last night at Giggetto al portico d'Ottavia - it was my husbands favorite meal and we have had the most amazing food since arriving Sunday!!"}, {"username": "Silvia Fioranelli", "comment_text": "Tonnarello, Trastevere"}, {"username": "Mara Mike", "comment_text": "Following"}, {"username": "Sheree Cheramie Vadell", "comment_text": "Osteria da Fortunata. Five minutes from Novano Square! Get the carbonara!! I swear it like crackling!! Go early, the line shows it’s popularity! Also Old Bear was fantastic!! Get the eggplant appetizer! U can make a reservation."}, {"username": "Trinity Sign", "comment_text": "Was very disappointed...\nI ate everywhere in Rome...the best food was the panini and pizzas.... their pastas weren't the greatest. Honestly, I cook way better...that's\nmy opinion."}, {"username": "Wendie Rice Bonini", "comment_text": "Dilla"}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson"}, {"username": "Suzanne Sullivan", "comment_text": "This place - hands down. Check out that view!! You need a reservation ( we booked way ahead ) and it’s located on the rooftop of a hotel —don’t get the tasting menu—not worth it, order from the regular menu…they reserve both for cocktails and for dinner. Oro Bistrot Ristorante.( Open Table ) 2nd rooftop favorite is La Fata Ignorante ( Reserve on TripAdvisor )"}, {"username": "Laura Piccinini", "comment_text": "Felice a Testaccio!!!"}, {"username": "Bonnie Brauner", "comment_text": "You must reserve ahead for Roscioli"}, {"username": "Bonnie Brauner", "comment_text": "Casare a Casaletto ****\nVia Del Casaletto 45\n3906536015"}, {"username": "Bonnie Brauner", "comment_text": "Ristorante la Tavernaccia da Bruno\nVia G. Da Castelbolognese\n; 63;\n39-06-581-2792"}, {"username": "Kelly Sangiacomo", "comment_text": "F"}, {"username": "Claudia Gonnelli", "comment_text": "La Fraschetta Di Mastro Giorgio in Testaccio!"}, {"username": "Rosh Ni", "comment_text": "Dilla!"}, {"username": "Barbara Tabor", "comment_text": "thousands of reviews at your fingertips. https://\nwww.tripadvisor.\ncom/\nRestaurants-g187\n791-c20075-Rome\n_Lazio.html"}, {"username": "Christine Chimi Inman", "comment_text": "Go to L’Orso 80…. Right near Piazza Navonna. The antipasto is a feast! They cover the entire table with small plates! No room for an entree! We were sooo full!"}, {"username": "Anna Nardone", "comment_text": "Dilla"}, {"username": "Marco Edoardo Massa", "comment_text": "Agustarello in Testaccio for traditional Roman dishes\nLa Fraschetta di Mastro Giorgio in Testaccio for traditional dishes with a bit of innovation"}, {"username": "Stephanie Harlan Croft", "comment_text": "F"}, {"username": "Paul Handley", "comment_text": "Cucina del Teatro. Beautiful little restaurant 🇮🇹"}, {"username": "Marissa Mc Ardle", "comment_text": "Otello Alla Concordia beautiful food an reasonable"}, {"username": "Rose Marie", "comment_text": "Ristorante Negrone near Termini. The best experience we had our whole time in Rome. Food and staff were amazing."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "L’Orso 80 near Piazza Navona. A local’s favorite."}, {"username": "Kayla Mikalsen", "comment_text": "Roscioli was amazing! Even just for lunch!"}, {"username": "Nadia Granito", "comment_text": "Typical italian restaurant. Only locals. You have to take a taxi ( residential area) Sooooo good with really décent price."}, {"username": "Kelly Aynes Zingaro", "comment_text": "Coso Ristorante"}, {"username": "Laura Nausadis Bieber", "comment_text": "Giulio Passami L’olio is wonderful. We liked it so much we went twice!"}, {"username": "Mat PO", "comment_text": "Michelin gives up to 3 stars only."}, {"username": "Tracie Goebel", "comment_text": "Tom Psaris Janet Psaris"}, {"username": "Tanya Cini-Kirk", "comment_text": "Nannarella’s in Trastavere"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Mimi e Coco Trast!"}, {"username": "Chantal Corneau", "comment_text": "Maïté Riel"}, {"username": "Tricia Brittingham Neff", "comment_text": "Perfect timing!! Looking for a restaurant right now!"}, {"username": "Carola Blödgen", "comment_text": "Three stars is the highest Michelin rating, there are no five stars restaurants."}, {"username": "Linda Landini", "comment_text": "Osteria di Fortunata - Campo de Fiori"}, {"username": "Jan Armstrong", "comment_text": "Tonnarello and Emma in Trastevere"}, {"username": "Tony Campanella", "comment_text": "We have always enjoyed Vladimiro"}, {"username": "Dorothy Jones", "comment_text": "Thank you everyone for your suggestions!! Hope this helps someone else too!!!"}, {"username": "Melissa Elliott", "comment_text": "Roscioli!"}, {"username": "Lisamarie Bianco", "comment_text": "Anything in Trastevere but definitely Da Enzo"}]}, {"id": "2205531703179241", "text": "We will be in Florence for for days in October and want to take a few small-group day trips to either/or Cinque Terre or Siena and other Tuscan towns. I am looking for recommendations of excellent companies you all have used and been happy with.", "link": "facebook.com/groups/1373361046396315/permalink/2205531703179241/", "likes": 0, "comments": []}, {"id": "2205544266511318", "text": "All of us nonnas. Meet the people when you go to Italy. These nonnas didn’t speak much English but we managed to communicate and have a laugh.", "link": "facebook.com/groups/1373361046396315/permalink/2205544266511318/", "likes": 290, "comments": [{"username": "Ralph Desimone", "comment_text": "What town in italy"}, {"username": "Deb Harnett", "comment_text": "Deb Harnett"}, {"username": "Elaine Wilson", "comment_text": "A handsome group of Nonnas. La Bella Figura I think they say in Italy"}, {"username": "Veronica Tame", "comment_text": "Golden oldies from the beautiful country Italy 🇮🇹. 💕"}, {"username": "Elvira Lelli", "comment_text": "Bless all the nonnas🌹\nNonnas are the best......💕💙❤💜"}, {"username": "Enrica Palla", "comment_text": "\"Nonne\", not \"Nonnas\" :)"}, {"username": "Deborah Jones", "comment_text": "❤️❤️❤️❤️"}, {"username": "Rebecca Fiorella", "comment_text": "Aww I love this 🥰"}, {"username": "Carola Blödgen", "comment_text": "Italians are very communicative people, that's why I like them so much."}, {"username": "James Hannan", "comment_text": "CHOW"}, {"username": "Dixie Kotylak", "comment_text": "Beautiful!"}, {"username": "Judith Pitman", "comment_text": "Love this photo!! It speaks volumes of joy and happiness 💕"}, {"username": "Virginia Sudol", "comment_text": "Virginia Sudol"}, {"username": "Doug Burke", "comment_text": "That's the fun part about foreign travel. And one usually has t be out in the \"boonies\" for that to happen. Not in the overrun tourist spots. One of the stories I recall from time to time is we were in the outlaying parts of Sicily and were at a little market getting lunch (all by gesturing). I pulled out my wallet to pay and had a dollar bill mixed in with the Euros. In separating it out, the clerk noticed it and I figured out she wanted a closer look and then figured out she had never seen a dollar. She held it for a while before giving it back and I returned it to my wallet.\n\nTo this day I regret I didn't give it to her."}, {"username": "Caroline Ramirez Randazzo", "comment_text": "Wow! 🩷🩷🩷"}, {"username": "Kathy Fryer", "comment_text": "Kathy Fryer"}, {"username": "Robyn Leonard", "comment_text": "Love this photo! I think it's even better than the scenery photos! My Nonna was the best and wore a dress her whole life. 💗"}, {"username": "Louise Faggioni", "comment_text": "Louise Faggioni"}, {"username": "Diane LoPriore Pryor", "comment_text": "My Nonna in Italy dressed the same way! Love this photo you took. Brings back memories"}, {"username": "Donna Gulla Rosenberg", "comment_text": "Donna Gulla Rosenberg"}, {"username": "Kathy Dowdell", "comment_text": "Love this!❤️"}, {"username": "Claudio Blizzard Indastria", "comment_text": "NonnE though"}, {"username": "Ethelyn Boudreaux Ougel", "comment_text": "Can’t wait to meet Nonna’s. My husbands ancestors are from Italy. We chose Italian grandparents names. I’m called Nonna. Going to Italy in April for our first trip. Can’t wait. We’re from Louisiana in the United States."}, {"username": "Anita Cardenas", "comment_text": "Anita Cardenas"}, {"username": "Ville Lignell", "comment_text": "Lello Shmuel Zarfatii Hai visto questa foto?"}, {"username": "Ville Lignell", "comment_text": "Diana Hessee This is from the old Jewish quarter of Rome, Portico d'Ottavia. I happen to know two of the ladies!"}, {"username": "Leslie Feuer Orton", "comment_text": "Wonderful!!"}]}, {"id": "2205547706510974", "text": "Contemplating ordering packing cubes. Does anyone use these? Opinion? Brand recommended?", "link": "facebook.com/groups/1373361046396315/permalink/2205547706510974/", "likes": 4, "comments": [{"username": "Meredith Williams", "comment_text": "i’ve had these for years and been happy! TravelWise Luggage Packing Organization Cubes 5 Pack, Pink, 1 Small, 2 Medium, 2 Large https://a.co/d/\ni7rX9EE"}, {"username": "Lina Gallo", "comment_text": "I bought the Tripped brand compression packing cubes. I tested them out for a recent trip. I was able to pack 4 dresses, 2 jeans, 3 sweaters, 2 tops, 2 pj's, 4 underware, 3 bras, an extra pair of shoes and toiletries in a carry on."}, {"username": "Carolyn Esposito", "comment_text": "I got mine on Amazon. Name started with a B. They were great. Roll your clothes in them"}, {"username": "Kath Milburn", "comment_text": "I use them for every trip. Got mine of Amazon also."}, {"username": "Diane Plott Miller", "comment_text": "I ordered 2 sets this morning on Amazon. Y’all are the best! Thank you"}, {"username": "Nydia Bryan", "comment_text": "They make picking your outfit much easier, no digging thru your suitcase. They all work the same so you’ll be fine with anything in the mid range price"}, {"username": "Jennifer Amen", "comment_text": "I’ve been looking at packing cubes but I’m afraid I’ll over pack (weight wise) because I’ll be able to fit so much more. Anyone else run into this problem?"}, {"username": "Cindy Gallen Barton", "comment_text": "Love them! Make it easier for me to pack and keep things organized in the hotel. European hotels generally do not have a dresser. I got mine very cheap at Ikea."}, {"username": "Michelle Erickson", "comment_text": "I don't travel without them! It makes it so much easier to pack."}, {"username": "Laurie Ladouceur Schmitt", "comment_text": "Big fan of the packing cubes. Any brand will do."}, {"username": "Jessica Stewart", "comment_text": "So I bought some and will be using them on my trip in September so far I like them as I practiced packed my husband and I items in one checked bag"}, {"username": "Laura Lynn", "comment_text": "Definitely recommend!!"}, {"username": "Penny Reed", "comment_text": "Are your clothes less wrinkled when they are rolled into packing cubes?,"}, {"username": "Gretchen Abee Rombold", "comment_text": "They are nice especially if you are moving from city to city every few days and not unpacking. Helps keep your things organized."}, {"username": "Shannon Confortin", "comment_text": "I won’t travel without compression travel cubes"}, {"username": "Pam Armenia O'Brien", "comment_text": "Love them. So helpful. Ordered them from Amazon"}, {"username": "Annof RedGables", "comment_text": "Used them for the first time last year after many years of travel without. They are a game changer. Wouldn’t be without them now."}, {"username": "Niki Sewell", "comment_text": "I recommended that you get compression cubes."}, {"username": "Stephanie Bock Newlun", "comment_text": "I bought some at TJ Max! Not sure what the difference is? However, I absolutely love packing with them! It makes it so much more organized and efficient."}, {"username": "Anne Goodwin Benson", "comment_text": "I purchased Monos brand - they have double zippers - once filled you compress with the second zipper - they are great!"}, {"username": "Dianne Ellis Patureau", "comment_text": "You can also just use the giant Hefty ziploc bags-they work great!"}, {"username": "Irene Oda", "comment_text": "I have used for about 10 years. Have several kinds from Amazon brand, ebags brand and now Bagail. Not only do i not travel without them, use them for camping, day at the beach. My daughter uses them to keep the children's stuff organized. Love all of them!!"}, {"username": "Victoria Moorhead Murrow", "comment_text": "I bought some.. I won’t use them again 🤷🏼‍♀️"}, {"username": "Teresa Bliss", "comment_text": "Never tried them."}, {"username": "Lisa Adams Robertson", "comment_text": "I like Peak because of the high quality, and the have a divider to keep your clean/dirty clothes separated."}, {"username": "JoAnne Wright", "comment_text": "I bought compression plastic bags last week and started using them today, super pleased they work really well and were so cheap for a bag of six medium & large…. I also have half a doz packing cubes but they’re not compression, great for keeping things organized !"}, {"username": "Debra Quinney", "comment_text": "Wouldn’t travel without them keeps all your clothes sorted and in one place"}]}, {"id": "2205552363177175", "text": "We are planning a trip to Italy next April/May. We fly into Rome and stay 3 nights. Then onto Florence for 3 nights. We also have booked Venice for 3 nights before we head to Portugal. We have 3 extra nights in Italy. We would love to stay in a small countryside town between Florence and Venice? Any ideas of a place we shouldn’t miss? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2205552363177175/", "likes": 2, "comments": [{"username": "Loredana Polichetti", "comment_text": "Near Firenze you can choose Lucca\nNear Venezia you can choose Verona or Mantova"}, {"username": "Rosemary Barbetta", "comment_text": "Stay longer in Florence and do day trips to San Gimignano and Siena. You won’t be sorry."}]}, {"id": "2205552496510495", "text": "We are working on our itinerary for 3 days in Venice. There is so much ground to cover, it feels overwhelming. How did you organize your time to make the most of your visit?", "link": "facebook.com/groups/1373361046396315/permalink/2205552496510495/", "likes": 0, "comments": [{"username": "Nina Tross", "comment_text": "Private walking tours with locals -"}, {"username": "Gena Diaco Penland", "comment_text": "We did a half day tour to Murano, Burano and Torcielo and it was great!! For the gondola ride, you just walk up….no need for reservations. It was really hot and crowded when we went so we just went and saw St. Marks from the outside. The rest of the time we just wandered!!!"}, {"username": "Wendy Lammerant", "comment_text": "We made a list of their we wanted to see—marked their approximate location on a map. As we wandered around each area/\nneighborhood we made sure to check out the site."}, {"username": "Marian Van Soelen Hand", "comment_text": "We took a day off from sightseeing and went to the Lido beach. We reserved beach chairs and umbrellas online at Blue Moon beach club and had lunch out there! It was so hot and crowded in Venice it was a very nice break!"}]}, {"id": "2205558263176585", "text": "Does anyone know if there is any way to get tickets to the starting days of the Ryder Cup in Rome end of September?", "link": "facebook.com/groups/1373361046396315/permalink/2205558263176585/", "likes": 0, "comments": [{"username": "Ceri Tocock", "comment_text": "There’s a group called Ryder Cup Europe Rome 2023 - worth posting on there as the ticket assignment process is currently taking place so lots of tickets seem to be popping up"}]}, {"id": "2205558913176520", "text": "Guys I need your opinions - only staying 3 nights in Sorrento on a 13 day Italy trip - I originally had 2 day trips planned but think it’ll be too much for the fam.\n\nAmalfi Coast day trip OR\nCapri/Blue Grotto day trip?\nIt’s killing me to choose ….", "link": "facebook.com/groups/1373361046396315/permalink/2205558913176520/", "likes": 0, "comments": [{"username": "Kath Milburn", "comment_text": "Amalfi coast for definite."}, {"username": "Gina Rovello Keenan", "comment_text": "Amalfi coast! If you are daring you can take the bus! Or you can take the ferry to each town. Blue grotto is not guaranteed."}]}, {"id": "2205562163176195", "text": "What Louis Vuitton store is the best one to go to in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2205562163176195/", "likes": 37, "comments": [{"username": "Carol Ann Nemecek", "comment_text": "What about gucci bags?"}, {"username": "Wil Atkins", "comment_text": "Tiana Alexandra Atkins"}, {"username": "Rebecca R. Russo", "comment_text": "None! Buy an Italian leather handbag! LV is overrated and not Italian....."}, {"username": "Lucy Lozano", "comment_text": "Spanish steps"}, {"username": "Stacey Nicholas", "comment_text": "Sarah Chapman"}, {"username": "Janice Moores", "comment_text": "None"}, {"username": "Sue Allanby", "comment_text": "Couldn’t agree more Rebecca & Norma 100% buy Italian as a momento of your trip to 🇮🇹 Italy!"}, {"username": "Katherine Quirk-Schwartz", "comment_text": "We were just there and the Rome store at Spanish Steps didn’t have a lot of the really unique limited ones. If you just want the discount, and are ok with a bag that you could easily find here, then that store is an option. We went to the one that is in there big department store and I felt like they had a better selection."}, {"username": "Demi Coronel", "comment_text": "The one by Spanish steps"}, {"username": "Rhonda Hope", "comment_text": "Go on Louis Vuitton website make a appointment have fun"}, {"username": "Jennifer Bernardino", "comment_text": "The one in the airport"}, {"username": "Cassie Hobbs", "comment_text": "Brianna Ostwald"}, {"username": "Bob Elliot", "comment_text": "The ones that you don't go into"}, {"username": "Megan Barragree", "comment_text": "none. the one by the Spanish steps has horrible customer service. I was looking for a specific item that i passed on in Paris & regretted. had a long line put us on a list to be helped. multiple people walked right in & got helped as we were still waiting. As almost 40 min passes we finally said something & we told they passed our name & forgot about us. Finally got helped by the guy was more than annoyed to even help us as we were waiting his time."}, {"username": "Claudine Auclair", "comment_text": "Do you really save buying a Louis Vutton in Rome? What about in Marseilles or Aix en Provence? We disembark in Marseille and staying overnight?"}, {"username": "MyTrinh Tammy Nugen", "comment_text": "None! France is the right place for France's brands."}, {"username": "Jodi Thornton Lindsey", "comment_text": "F"}, {"username": "Cynthia Chow", "comment_text": "The airport location! It’s Vat free"}, {"username": "Catherine Ann Newell Galan", "comment_text": "What's the best leather purse store in Rome or Florence?"}, {"username": "Diana Pacella", "comment_text": "Gucci in Florence"}, {"username": "Maria EIkady", "comment_text": "Airport lol you save even more money!!"}, {"username": "Paul Fielding", "comment_text": "They are about 10% cheaper in Italy than France\nDon’t know why"}, {"username": "Phyllis Frier", "comment_text": "The one on Via Condotti!"}, {"username": "Maria Coladangelo Ducca", "comment_text": "None. Buy Italian brand"}, {"username": "Wendy J. Calvin", "comment_text": "I agree with Lynne Rizzuto Lati - the airport."}, {"username": "Robert Bill", "comment_text": "Go to Paris 😂😆🤣"}, {"username": "Carola Blödgen", "comment_text": "I've no idea why Americans are so keen on LV, very common"}, {"username": "Deborah Jones", "comment_text": "The airport. I saved over 1k. Plus it’s tax free so you don’t have to go the extra mile to get your tax back and wait for it to deposit into your account."}, {"username": "Jan Schiffner", "comment_text": "Hong Kong! 🇭🇰"}, {"username": "Misty Todd Monroe", "comment_text": "They were extremely rude to me in the LV store in Rome. They would not let me touch any of the handbags and I had to get on a waiting list to have an associate help me. Walked out. Went to LV in Florence & ￼Venice, and was treated better, but they did not have the handbag I wanted. I got back from my trip in Italy only to find that my house air conditioner had pooped out and had to buy a new unit. I was thankful I did not spend the money on an LV bag. I did get a nice leather one in Florence."}, {"username": "Yuri Budilov", "comment_text": "on Via dei Condotti probably."}, {"username": "Jill Rosenfeld", "comment_text": "Via Condotti by Spanish Steps. Make sure you bring your passport. They will not accept a copy."}, {"username": "Heath Ullman", "comment_text": "And make an appointment…lin\nes can be long."}, {"username": "Laura Fregoso-Shewfelt", "comment_text": "By the Spanish steps"}, {"username": "Sue Allanby", "comment_text": "Isn’t it French,not Italian?"}, {"username": "Paula Bodden", "comment_text": "I went to all three in search of a particular item and all three stores were very welcoming and friendly. None had what I wanted though but I thought next time I would save Via Condotti for last just because it was much more crowded. The others weren’t busy at all yet still had a nice selection."}, {"username": "Kathrin Wirth", "comment_text": "Via Condotti near the Spanish steps"}, {"username": "Renee Dawn", "comment_text": "Carrie Jendrasheske"}, {"username": "TJ Williams", "comment_text": "Rip off either way lol"}, {"username": "Lynne Rizzuto Iati", "comment_text": "The one at the Rome airport is duty free…no tax. They had a pretty good selection."}, {"username": "Chantal Corneau", "comment_text": "Maïté Riel"}, {"username": "Andrea Brown", "comment_text": "Andrea Brown"}, {"username": "Andrea Corey Andrews", "comment_text": "There's a duty free in the air port"}, {"username": "Alexandra A Welker", "comment_text": "By Spanish Steps but it can be really busy so go early. But there are two others just a few blocks away."}, {"username": "Shila Zokai-Neman", "comment_text": "Rome airport is the best"}, {"username": "Tam Wong", "comment_text": "All of them❤️"}]}, {"id": "2205570443175367", "text": "We will be in Rome in October for 3 nights before my brother’s Positano wedding. We want to stay somewhere where we can just walk around and see the sights. Liked the price of a room at this “luxury house”. What do you think of this location? Has anyone stayed here? Has good reviews as far as I can tell.", "link": "facebook.com/groups/1373361046396315/permalink/2205570443175367/", "likes": 3, "comments": [{"username": "Michael Broadwater", "comment_text": "Just know that the Vatican is the farthest away from everything else and you'll either be on foot a lot or learn to use the Metro"}, {"username": "Fiona Cameron", "comment_text": "Use the Metro, but even from that location its a fair walk to the nearest metro station."}, {"username": "Josephine Vicedal", "comment_text": "From personal experience from my solo trip to Rome last year; if you’re used to walking on holidays etc. Rome is no big deal. Most things are in walking distance. You’re a little further from the ‘main’ attractions, but personally I wouldn’t say the walk to things like the Colosseo, Fontana di Trevi, the city centre from your location is too bad. And if walking really isn’t your thing; the metro system is pretty great and cheap!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "That is pretty far from most of the historic sites in Rome. Try to find something in the historic center."}, {"username": "Kate Laidlaw", "comment_text": "We just stayed near Roma Termini. It was a lot of walking, but felt safe and it certainly wasn’t boring. Our longest walk was to our early morning Vatican tour, past the Trevi fountain when it was quiet which was nice, approx an hour. You could do the same for a Colesseum tour.\n\nThe walk along the river to Trastevere area is nice."}, {"username": "Dan Baron", "comment_text": "Convenient to Vatican, but not much else. Check out Hotel Ponte Sisto.\n\nhttps://\nwww.hotelpontesi\nsto.it/en/"}, {"username": "Mici Farley", "comment_text": "We stayed at Kolbe Hotel Rome. It was a great location. It seems like you’re not near anything but you’re near all of the ancient ruins, walking distance to many of the sites we took a Lyft or taxi when we went to the Vatican or to the train station and we took the speed train out of town."}, {"username": "Helen Ladkin", "comment_text": "The Pantheon, Piazza Navona and Campo de Fiori areas are in the historical centre. Our preferred options."}, {"username": "Michael Messina", "comment_text": "Try to be near Trastevere"}, {"username": "Alice Francesca", "comment_text": "Too far.Try Rione Monti."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "I prefer near Pantheon, can walk anywhere from there. You will be far from everything"}, {"username": "Tam Wong", "comment_text": "I always stay by the Spanish steps. It always seems like the perfect location. Especially if you’re like me and love to shop! 👜 👟"}, {"username": "David Perillo", "comment_text": "That’s fine. Rome is about walking and if you’re up for that you will enjoy every minute of it."}, {"username": "Jennifer Avrett", "comment_text": "This is really far from where you want to be. Part of the fun of Rome is discovering all the little hidden gems as you're walking around. You'll have to travel to get to where you want to explore."}, {"username": "Tracy Foss", "comment_text": "You should try and stay near the Pantheon that area comes alive at night we were there in October & it was still nice enough to sit & enjoy drinks outside"}, {"username": "Teri Depree Martinez", "comment_text": "We stayed near the train station perfect location!"}, {"username": "Jennifer Gustafson", "comment_text": "Everything is within walking distance we stayed by the Roman Forum and walked everywhere (except the airport get yourself a cab for that) lol"}, {"username": "Taryn Jones", "comment_text": "I would recommend staying closer to Trastevere! It will likely be very crowded and touristy at your current location near the Vatican."}, {"username": "Cathy Donnie Critch", "comment_text": "Barb Robichaud"}, {"username": "Debbie Green", "comment_text": "Hotel Santa Maria in the heart of Trastevere. One of the best places we ever stayed."}, {"username": "Claire Buccini", "comment_text": "There are buses that run from San pietro station to city centre. They were 1 euro about 8 years ago."}, {"username": "Kelli Grega-Wise", "comment_text": "We stayed at Palazzo Navona Great location for wandering"}, {"username": "Colin Langmead", "comment_text": "Pantheon is the centre point. Between Pantheon and Travestre is perfect in my opinion."}, {"username": "Marcus Hiesler", "comment_text": "We just stayed in Hotel 77. And central to all. Lots of walking though"}, {"username": "Nicole Beaumont", "comment_text": "I stayed near the Trevi, which was more centrally located to everything. Also, good for early morning pics without the huge crowds! 😊"}, {"username": "Nicola Amy MacDonald", "comment_text": "I stayed at the Antico Albergo del Sole Al Pantheon and it was an amazing room looking out over the Pantheon, breakfast was included. Very central to everything."}, {"username": "Michael Simon", "comment_text": "My favorite place to stay in Rome, and I’ve been there more than a dozen times, is near Piazza Navona. From there you can easily walk to all the major sites. The place you have marked is too out of the way for me."}, {"username": "Neli Bratovanova", "comment_text": "We stayed near Panteon in a small hotel on a quiet little street - for me best location."}, {"username": "Nancy Kaelin Smith", "comment_text": "I personally think it’s to far from other major sites. You don’t want to spend all your time walking to the center. I would stay closer to the Patheon or in Travestere."}, {"username": "Mat Marturano", "comment_text": "there are some nice boutique hotels in Prati neighborhood, near the Vatican. If your close Ottaviano metro station you can be anywhere you want in minutes."}, {"username": "Carmela Losavio Wiltshire", "comment_text": "wow! seems close to Vatican City. From there you can start the tour to see all the main landmarks in the area and on foot! 😄"}]}, {"id": "2205574843174927", "text": "We are traveling from Canada to Barcelona, Nice, Naples to Sorrento, Palermo, Barcelona then back home. I was able to get the information on what I'm allowed to bring through customs into Barcelona and Nice 😃. I cannot for the life of me 🤔 find what I'm able to bring into Naples from Nice, into Palermo from Naples, into Barcelona from Palermo 😳🤯😭.", "link": "facebook.com/groups/1373361046396315/permalink/2205574843174927/", "likes": 1, "comments": [{"username": "Maria Brozou", "comment_text": "these are all EU cities. You should not have to deal with customs except in your initial airport (Barcelona) and the final one (again Barcelona) when exiting the EU. Maybe just a limit on cash you carry on you between EU countries (I think max is 10.000 euros). Other than that what the airline allows."}, {"username": "Miyuki Kanno Paul", "comment_text": "What are you trying to bring in?"}]}, {"id": "2205571896508555", "text": "I’ve been seeing reports of a very bad mosquito problem in Italy. Has anyone encountered this?", "link": "facebook.com/groups/1373361046396315/permalink/2205571896508555/", "likes": 1, "comments": [{"username": "Alessandro Iannelli", "comment_text": "it really, really depends on where you are staying. i mean, you could be in a city and not need any mosquito repellent at all, but then drive 10 km into the countryside and it's a whole other story. then again, not all cities are the same. generally speaking, italy does not have a \"very bad mosquito problem\", i don't know where you've heard this."}, {"username": "Stella Kevin", "comment_text": "We traveled throughout Italy last year at this time and it was very bad. I went to a pharmacy for repellent & anti itch medication. Especially bad in Florence, for me anyway."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205578843174527", "text": "Three more weeks until we leave!\n\nQuestion.. when we are in Florence is it best to do a tour to Tuscany or drive? Which areas other than San Gimignano should we go to get the full wine country experience?\n\nWe want to do wine tastings as well as see the local culture. Non touristy recommendations would be great too. And if there’s a place withआणखी amazing food and wine that’s the best kept secret, we’d love to know!\n\nAlso, if you know of any great pubs and breweries we should be aware of in Milan, Venice, Florence, Sorrento, Naples, or Rome please share.", "link": "facebook.com/groups/1373361046396315/permalink/2205578843174527/", "likes": 0, "comments": [{"username": "Jud Luli", "comment_text": "Mejor alquilar coche. Ir a Volterra es precioso. Siena , Pienza. Para vino Montepulciano y Montalccino y pasar x carreteras secundarias encontraras mil bodegas"}]}, {"id": "2205581089840969", "text": "We are finishing our 13-day trip to Italy in September in Milan for 4 nights. Is it worth it to do a day excursion to Como? Or should we just enjoy Milan? We plan to see an opera, the Last Supper, Duomo, and Castello Sforzesco while we are there.", "link": "facebook.com/groups/1373361046396315/permalink/2205581089840969/", "likes": 2, "comments": [{"username": "Nancy Koehler Barboni", "comment_text": "One full day in Milan is enough to sightsee. Absolutely go to a village in Lake Como. Much more beautiful and enjoyable than Milano❣️"}, {"username": "Gianna Onesi", "comment_text": "Yes! I would do it you are a train ride away!"}, {"username": "Karyn McCluskey", "comment_text": "Yes do it Milan is easy in 1 day"}, {"username": "Karen Blackmore", "comment_text": "Milan to Lake Como is an easy day trip and well worth it! Trains are great!"}, {"username": "Debbie DiOssi", "comment_text": "Yes! Visit Como"}, {"username": "Tonsia Keytel", "comment_text": "Take train from Milan to Varenna, close ferry ride to Bellagio and Mennaggio, very beautiful."}, {"username": "Sande Ricci", "comment_text": "Milan is amazing. You can’t do it in 1 day. Take your time and enjoy it. 1 day at Lake Como is enough."}, {"username": "Rita Levi Montalbano", "comment_text": "As other suggestions, do a day trip to the lake and take more time in Milan"}, {"username": "Pamela Dorigo", "comment_text": "or Maybe you can consider also to take the train to Torino and enjoy a day in Torino, it's a wonderful city full of sightseeing, not enough for a day but from Milan is only 1 hour of train to Torino and you can visit one of the most historical city in Italy but not so popular. 😉"}, {"username": "Marco Scacchi Fratini", "comment_text": "As others have said, definitely make a day trip to Lake Como or Maggiore. There are ferries that link many villages. If you like nature, you could also venture further up for a day trip in the Alps (Val Di Mello or towards Bormio, for instance)."}, {"username": "Dafne Vassetti", "comment_text": "Also add the Pinacoteca di Brera Museum once in Milano and a visit to the Brera district. ❤️"}]}, {"id": "2205581336507611", "text": "Hello everyone!\n\nMy husband and I are flying to Rome from LAX & then coming home from Paris to LAX. Any recommendations on airlines?? 😊\n\nAlso any places you recommend to eat while in Rome & Paris? 😋", "link": "facebook.com/groups/1373361046396315/permalink/2205581336507611/", "likes": 0, "comments": []}, {"id": "2205583063174105", "text": "Leaving Sunday for Paris, Florence, Venice… do we need to make dinner reservations before we leave or will it be okay to do when we arrive?", "link": "facebook.com/groups/1373361046396315/permalink/2205583063174105/", "likes": 2, "comments": [{"username": "Rhona OConnor", "comment_text": "Relax, there are lots of places to eat. When you are wandering along you will see one you like. In Italy the best food we had was the places slightly off the main street with no English on the menu. You will work out what's on the menu or we pointed at what others were having!"}]}, {"id": "2205592293173182", "text": "Is a 1 hour / 10 minutes layover in Rome to Naples realistic with customs, etc.?\n\nPlanning for carry-on luggage only; travel in late May.\n\nTIA 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2205592293173182/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "Where are you flying in from?"}, {"username": "Alessandro Iannelli", "comment_text": "if i were you, i wouldn't trust a 70 minute layover. anything can happen. i once landed in oslo, where they were not supposed to check my id because it's another schengen country, and that took a full hour because there was a line of people whose id was being checked. if i had had a 70 minute layover, i would have lost the boarding of the other plane. and this happened to me, a citizen of the schenger area. i would only consider (not necessarily book, but consider) such a short layover time on certain conditions, for starters the following plane should be from the same airline as the first one, and i would have to be certain i would not have to go through any control, which honestly is something i could be sure of only if i moved within my country."}, {"username": "Rita Scotto Epifanio", "comment_text": "It can be done but it’s not guaranteed. I flew into Rome July 5th, and had a connecting flight to Naples. Our layover was a little over an hour, we missed the flight. Had to wait 8 hours for the next flight to Naples because other flights to Naples were cancelled that day. Our first day of vacation was shot. We also flew ita airways. My sister on the other hand flew our same flight, 2 weeks before me, and made her connecting flight no issues."}, {"username": "Sonia Scotto Lubrano", "comment_text": "If your flight leaves on time. Yes - doable\n\nIf you flight is a smidge late. You’ll miss your flight.\n\nI just had a one hour layover in Rome & I made it. After 30 min in the passport control line I showed the lady my boarding pass and she let me get ahead"}]}, {"id": "2205596306506114", "text": "I’m interested in a night tour in Rome to see the architecture lit up at nite. Heard it’s so beautiful. Any advice", "link": "facebook.com/groups/1373361046396315/permalink/2205596306506114/", "likes": 1, "comments": []}, {"id": "2205604279838650", "text": "Hi all suggestions on a tour company from Rome to Amalfi coast? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2205604279838650/", "likes": 0, "comments": []}, {"id": "2205607893171622", "text": "Hi, my husband, son and I will be in Rome early September. My question, what is the best option for transfer from the airport to our accommodation ie apps and purchasing tickets? Is it better to go by train from the airport to the city centre first and should I book now or when we arrive. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2205607893171622/", "likes": 2, "comments": [{"username": "Heather Hills Jacobs", "comment_text": "We used Venice Group Services! Fantastic!!!"}, {"username": "Vanessa Durkin", "comment_text": "Train to rome termini lots of bus options just there"}, {"username": "Brian Osman", "comment_text": "I would just grab a taxi, plenty at the airport"}, {"username": "Jenny Payne", "comment_text": "I always have a driver as coming from Australia can’t be bothered with the hassle, but it is very easy to catch the train to termini , if you then have to take a taxi to your accommodation, I prefer to get it from the airport as they will try and rip you off so look up the app RometoRio and see the price 🌻"}, {"username": "Bernadette Breen-Shinner", "comment_text": "Be very careful of drivers trying to get your business at the airport. We were taken out to a main road and dropped at wrong address in the middle of the night. Book taxi or train from airport"}, {"username": "Philip Curnow", "comment_text": "An idea of where your accommodation is. (no need to name the hotel/\napartment etc)"}, {"username": "Gena Diaco Penland", "comment_text": "We stayed in an Airbnb and asked the host the best way to get there. She arranged a private van and it was only about 70€. Definitely worth it after the long flight."}, {"username": "Rebecca Yeoh", "comment_text": "There is a special train from the airport to Roma Termini (no stops between). It is called the Leonardo Express. You can get your ticket online but you should be able to just buy it when you arrive. Here is the link if you want to buy ahead of time. When I bought my ticket online I selected a time but on my ticket it didn’t include a time so I’m pretty sure you just get on the first one that arrives when you get there. It’s very regular and super convenient. You can then get a taxi to your hotel. https://\nwww.trenitalia.c\nom/en/services/\nconnections-to-a\nnd-from-rome-fi\numicino-airport\n.html"}, {"username": "Pat Cray", "comment_text": "Private Car"}, {"username": "Rebecca Snyder Corbett", "comment_text": "We always use Rome Cabs!\n\nhttps://\nwww.romecabs.com\n/"}, {"username": "Doris Harris Grotheer", "comment_text": "When you weigh the options between train/\ntaxi, consider that the taxi will cost the same whether one person or three. Then decide if the savings to ride the train is worth it. We didn't ride metro or tram...there were 4 of us so we used taxis for most things...then we also were not worried about pickpockets on the bus. We did ride the trains to Florence and Varenna...and they were wonderful and no problem with our big dufflebag. BTW, my DIL and I did the travel arrangements..it is stressful but none of my worries transpired. If you take the trains and are unfamiliar, I'd recommend watching a few youtube videos explaining how to read the signs at the station. You will love Italy!"}]}, {"id": "2205610266504718", "text": "Hi all, any recommendations for Vatican guided tours. I was looking at her ‘your guide.com’. Too many choices and so confusing. Any tips?", "link": "facebook.com/groups/1373361046396315/permalink/2205610266504718/", "likes": 0, "comments": []}, {"id": "2205611989837879", "text": "Do you need an advance reservation for a sunset gondola ride in Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2205611989837879/", "likes": 2, "comments": [{"username": "Joshua Pickles", "comment_text": "Yes"}, {"username": "Victoria Laverty", "comment_text": "No"}, {"username": "Vivien Paulik", "comment_text": "No"}, {"username": "Eileen Muro", "comment_text": "Nope"}, {"username": "Cathy Hayes", "comment_text": "They are everywhere so no need to book"}, {"username": "Phyllis Ridgway Petrunich", "comment_text": "No!"}]}, {"id": "2205614026504342", "text": "Hello, question about Vatican tix. We'll be in Rome Sept 19th through the 21st and it looks like Vatican tix are sold out on the vatican website. Are the only other options through Viator and Trip Advisor?!? We're looking to do the Vatican museums, st. Peter's basilica and a tour, and a st peters dome climb. Are there just general entry tix to the museums without tours available?!?\n\nJust looking to see what other people have done. TIA!!", "link": "facebook.com/groups/1373361046396315/permalink/2205614026504342/", "likes": 2, "comments": [{"username": "Katalina Loredo", "comment_text": "Vatican tickets only come out 30 days in advance on their website"}, {"username": "Claire Dowson", "comment_text": "We did a self guided tour of the Vatican. Took our time to enjoy it. Think mine were from Getyourguide"}, {"username": "Toby Levy", "comment_text": "Bought on get your guide a few days before our visit was excellent"}, {"username": "Holly Davies Moebus", "comment_text": "We booked a guided tour through City Wonders of the Vatican, Sistine Chapel and St Peter’s Basilica and it was a great tour and in my opinion worth it."}, {"username": "Marty Harte", "comment_text": "Did a great semi private tour last week. I booked it through Viator. It wound up being 7 ppl in total and through City Wonders. Dario was amazing.\nWe did all that you mention plus Sistine Chapel and you can do the dome climb on own when done for small fee."}, {"username": "Angie Davidson", "comment_text": "You can always just line up, the line is long, but you can buy tickets there. If you have tickets you can just go in. I would estimate the line 2 days ago was about 45-60 min long"}, {"username": "Gena Kona-Mancini", "comment_text": "I *highly* recommend getting tickets from the official site IF you can. Just as an example.... I booked viator for $220 for 2 people for a full tour of the colloseum, I tried my luck and got tickets through the official site for less than half the price and it included a guided tour... plus I've heard mention on this page of the third party sites overlooking and some get canceled last minute. (I managed to get tickets through the Vatican site too it wasn't nearly as difficult as the colloseum, but I didn't see which included the basilica unfortunately)."}, {"username": "Audrey Bauer", "comment_text": "We used this tour company with early morning visit. Best to do before they let in general crowds. Dome climb is a separate line inside St Pete’s. https://\nwww.walksofitaly\n.com/\nvatican-tours/\npristine-sistine\n-chapel-tour/"}, {"username": "Fiona Mac", "comment_text": "We got ours via the city tour bus\nFast track too"}, {"username": "Cindy Gallen Barton", "comment_text": "The Tour Guy has a good early access tour."}, {"username": "Delaine Remle Botelho", "comment_text": "Just booked last night for December, admission and breakfast, self guided tour. Other options were sold out."}, {"username": "Mary Chris", "comment_text": "We got them through Get Your Guide. They had a ton of different tours to chose from!"}, {"username": "Jacqueline Schrader", "comment_text": "I wasn’t able to get the breakfast tour for the morning, but be sure to scroll all the way down on the site to see which tours ARE still available. We were able to snatch a “happy hour” one with some food at 4:00, then tour at about 5:00. Not my first choice but the museums are closed to the public at 4."}, {"username": "Sharon Wenzel", "comment_text": "Www.livtours.co\nm"}]}, {"id": "2205614736504271", "text": "Hi! I am going to Italy for thre months and was hoping to find an apartment for rent in Rome. Anyoen have recommendations? I would prefer to support locals rather than airbnb or hotels... any guidance would be greatly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2205614736504271/", "likes": 0, "comments": []}, {"id": "2205617143170697", "text": "If I was wanting to book the following Como, positano, lake garda,\nAmalfi, Cinq Terre, Venice, capri, maybe Rome Vs Tuscany. How many days do you suggest in each? It will be a 10-14 day vacation. What would be the better city to fly into to see all this. Are fly in one and out another?", "link": "facebook.com/groups/1373361046396315/permalink/2205617143170697/", "likes": 1, "comments": [{"username": "Katalina Loredo", "comment_text": "This is way too many cities and not enough time to do all of them. You should either stick to all cities in the north like Venice, lake garda, cinque Terre, and head to Milan and fly out of there or something. I just did an itinerary of Milan, cinque Terre, Florence, Rome, Venice with 2.5 days each (except milan) and that still felt like I was rushing"}, {"username": "Rhona OConnor", "comment_text": "It takes half a day + to travel between places by the time you check out and travel. Also it takes time to see the places, and allow time to sit and just take the place in. Do less, enjoy more"}, {"username": "Paula DiCicco", "comment_text": "We are just finishing 21 day trip including travel days - did Venice 2 nights, Como 3 nights, stop in Milan for afternoon, Cinque Terre (3 nights), Rome (3 nights), Sorrento /Amalfi area (4nights) and family Cassino (4 nights). That was just enough time in each. Train travel to Rome and then rental car. We flew into Venice and out of Rome. Any less would we would not have been able to see enough in each place for it to be worth all the travel time. Hope this helps your planning:)"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Too many for even 14 days. Allow 3-4 nights in each destination and allow for travel between each destination. Have a look at a map and plant your urinary. Rome2Rio is a very helpful app for transportation within the country."}, {"username": "Kimberly Lampros", "comment_text": "Ideally, at least 3 nights in each location if not more"}]}, {"id": "2205621643170247", "text": "Naples for a day…2 people…what are the “must sees”?\n10/25", "link": "facebook.com/groups/1373361046396315/permalink/2205621643170247/", "likes": 0, "comments": [{"username": "Genevieve Bastien", "comment_text": "Pompeii\nSpanish quarters\nLungomare\nConsider a day trip to Sorrento or Capri or Ischia\n\nWishing you a great trip"}]}, {"id": "2205623933170018", "text": "Any recommendations for accommodation in Taormina please. Will be arriving end of October. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2205623933170018/", "likes": 1, "comments": []}, {"id": "2205630199836058", "text": "Just found out that State museums and other attractions have free entrance on the first Sunday of the month in Florence. Is it worth it to go on the first Sunday or will there be too many people because it's free? Will it still be busy even in November?", "link": "facebook.com/groups/1373361046396315/permalink/2205630199836058/", "likes": 0, "comments": [{"username": "Nina Tross", "comment_text": "We were there in late September/ early October last year and were pleasantly surprised by the first Sunday entrance fees and it was not crowded at all in October"}]}, {"id": "2205630789835999", "text": "Looking for recommendations\non an Airbnb in cinque terra for just one night Oct 3", "link": "facebook.com/groups/1373361046396315/permalink/2205630789835999/", "likes": 0, "comments": [{"username": "Jean Williams Bryan", "comment_text": "How many people? We stayed on Corniglia but it was good for two people. Free breakfast at the local diner."}]}, {"id": "2205649279834150", "text": "If you were able to buy one guided tour/activity in Rome, the rest do on your own, what would you suggest?", "link": "facebook.com/groups/1373361046396315/permalink/2205649279834150/", "likes": 38, "comments": [{"username": "Margie Ward", "comment_text": "Coliseum and Palentine Hill definitely"}, {"username": "Michele Fournier Draskovic", "comment_text": "Food tour!"}, {"username": "Patricia Turner", "comment_text": "E-bike tour with Rex bike tours"}, {"username": "Maria Montalvo", "comment_text": "A private tour of the Vatican! I have toured the Vatican on my own and on our next visit we hired a private tour and its amazing the things you discover with a tour."}, {"username": "Kathleen Ostler", "comment_text": "Our guided tour of the Vatican museums (early first tour ) was unbelievably great. He was so knowledgeable and told us how much he loved doing it. I learned so many fun and wildly interesting facts about the artists."}, {"username": "Dunia Aldyni", "comment_text": "Colosseum under ground Night time"}, {"username": "Mary Sproul", "comment_text": "Guided tour of Villa Borghese- a highlight of our trip!"}, {"username": "Fay White", "comment_text": "The Vatican"}, {"username": "Wendy Moon", "comment_text": "The night time e bike tour was fantastic, well worth the money . I’ve not ridden a bike in years and loved it, highly recommend"}, {"username": "Emma Jones", "comment_text": "Following"}, {"username": "Lori Kostbade", "comment_text": "Following"}, {"username": "Kristin Yapelli Anderson", "comment_text": "Food and wine tour in Prati"}, {"username": "Dianne Buscema-Gerogianis", "comment_text": "Vatican City"}, {"username": "Vivian MacDonald", "comment_text": "For sure the Vatican and the museum and church. We did a tour with an Art Historian and it was simply amazing the things we learned from a tour of the museum works, painting etc. It included the Sistine Chapel , St Peters etc, saw it all and had lunch there. It was almost a full day if my memory is right, worth every penny and learned so much from an excellent tour guide. There is so much to see, and so much one does not know or understand the signifigance of having a good tour guide was wonderful, one gets so much more from the tour and a much better understanding of it all."}, {"username": "Debbie White", "comment_text": "San gimignano & wine tasting"}, {"username": "Michelle Corrao", "comment_text": "Vatican guided tour or golf cart tour of city"}, {"username": "Helen Pottle", "comment_text": "Colloseum guided"}, {"username": "Julia Clara", "comment_text": "Hop on hop off and Vatican"}, {"username": "Patti Choy Semple", "comment_text": "Colosseum"}, {"username": "Stefan Sig", "comment_text": "Vatican museum"}, {"username": "Jenny McGhie", "comment_text": "Craig McGhie Eerin Jennifer Mc😎🥰"}, {"username": "Erin Salay", "comment_text": "Food tour"}, {"username": "Denise Whiting Dawson", "comment_text": "Vatican"}, {"username": "Carol Brewer", "comment_text": "Catacombs under St Peters that includes his grave ."}, {"username": "Chef Mark Wilson", "comment_text": "We did a tuktuk cart with a great guide. My elderly parents really had a blast with us"}, {"username": "Liza Bullen", "comment_text": "If you can’t book the tour/guide you want then Rick Steves audio is also very good. We had a few disappointing tour guides and switched to listening to Rick Steves as an alternative. Saved the day!!"}, {"username": "Anne Trites", "comment_text": "Small tour of the Vatican (we used Viator)"}, {"username": "Laura Nausadis Bieber", "comment_text": "We booked the Scavi tour that takes you beneath the Vatican to see where St. Peter is presumed to be buried. Very small group and knowledgeable guide. If you're interested in Vatican tours I would highly recommend! Not sure when you're going but definitely book in advance.\n\nhttp://\nwww.scavi.va/\ncontent/scavi/\nen.html"}, {"username": "Gabby Lafleur", "comment_text": "We did a day tour to Amalfi and Positano! It was the best day."}, {"username": "Lacy NiCole", "comment_text": "Behind the scenes and underground of the colluseum and or Vatican, otherwise you will waste half your day standing in line for either."}, {"username": "Suzanne Mills", "comment_text": "Vatican"}, {"username": "John Bruckman", "comment_text": "Forum and Paletine Hill"}, {"username": "Melissa Ann", "comment_text": "Early access Vatican."}, {"username": "Lynda Dorney Hunt", "comment_text": "We had a private early morning tour to the Vatican. It was so good"}, {"username": "Maria Calderon", "comment_text": "Vatican"}, {"username": "Jacqueline Maldonado-Griffin", "comment_text": "The Vatican is a must"}, {"username": "Nancy Lewis", "comment_text": "Vatican"}, {"username": "Teri Rudin Hetterich", "comment_text": "What are you most interested in? History, art, architecture, etc. we have taken tours of so many things and have enjoyed learning from the guides who are truly knowledgeable and passionate about their subjects.\n\nDomus Aurea, Galleria Borghese, Colosseum, Roman Forum, catacombs and aqueduct park, Vatican…all are amazing!"}, {"username": "Cherie Olney", "comment_text": "The Vatican / Sistine Chapel Tour (reservations must be made asap)"}, {"username": "Mary Healy", "comment_text": "Cooking class. Hands down."}, {"username": "Ron Levasseur", "comment_text": "Try the scavi tour under the Vatican!!!"}, {"username": "Susan Warn Sperrazza", "comment_text": "Maggie McLaughlin Marie McLaughlin Simoncelli lots of info !!"}, {"username": "Kim Murphy", "comment_text": "Gulf Cart Tour. Took us everywhere we wanted to see."}, {"username": "Cathy Perez Stålgren", "comment_text": "Erika Chua Mina and Irish Rodriguez something for us."}, {"username": "Barbara Kleinhans", "comment_text": "Do the Hop on Hop off bus and then decide what you want to see. We usually buy this service and then make decisions of what looks like something we want to concentrate more time on….bty if you are doing multiple cities, you can buy tickets that allow you to do more than one city."}, {"username": "Christina Garcia", "comment_text": "Golf cart tour!"}, {"username": "Belinda Roper", "comment_text": "I did a vespa tour through Rome. It was a blast."}, {"username": "Chelsea Gudith", "comment_text": "VESPA tour!!!!!! 💯💯💯💯"}, {"username": "Teran Petrina", "comment_text": "Vatican"}, {"username": "Connie Crenshaw Fore", "comment_text": "Terri L-d. Check out the page"}, {"username": "Danny Javier", "comment_text": "Tour of the Vatican/ Trevi fountain"}, {"username": "Diane Petonito Giordano", "comment_text": "Rome is such a big city so many places to go. Go to some of the Piazza’s, Jewish Ghetto, go to piazza Fiore in the AM they have an open market with all fresh produce. Borghesi gardens. I can go on & on."}, {"username": "Lina Galvis", "comment_text": "Vespa tour! Was the highlight of my trip!"}, {"username": "Leilani Nemeroff", "comment_text": "The Catholic Traveler, check the Facebook page! We went to St. Peter’s Basilica and had coffee with Mountain Butorac - aka The Catholic Traveler - followed by 6 more churches, in a private car. Never would have seen that number of churches in a morning and get oriented to Rome so quickly otherwise! After that, I was able to navigate on my own much better."}, {"username": "MaryBeth Reed", "comment_text": "Skip the line Colosseum or Vatican tour"}, {"username": "Kamron Trostel", "comment_text": "Night time golf cart tour of the city!"}, {"username": "Sukhvinder Kalsi-Ryan", "comment_text": "Vatican museum and St. Peter’s cathedral"}, {"username": "Sha Mohammed", "comment_text": "Yes"}, {"username": "Sha Mohammed", "comment_text": "The breakfast tour"}, {"username": "Dianne Chalfant", "comment_text": "The Sistine Chapel"}, {"username": "Heidi Kastner Simmons", "comment_text": "Vatican tour. Or Colosseum + Roman Forum (that’s usually grouped as one tour) If not included with the Vatican, do St Peters Basillica on your own. Just don't miss it! It's extraordinary!!"}, {"username": "Pat Hojnowski", "comment_text": "Vatican early morning."}, {"username": "Jeff Gentner EA", "comment_text": "Check out Walks of Italy. Great tours."}, {"username": "Christine Ayers", "comment_text": "Secret food tour"}, {"username": "Anita Roessler", "comment_text": "Vatican guided tours are a must to skip the lines."}, {"username": "Agata Riccioli", "comment_text": "Night bike tour"}, {"username": "Pam Gross Kovitz", "comment_text": "That’s tough because the tours of the Vatican, coliseum and roman forum are all great and you learn SO MUCH!"}, {"username": "Rosemary Sheldrick", "comment_text": "Definitely the Colosseum. We did a guided tour which there was probably 10 to 12 people in our group, small and totally worth it. We got to go places I didn’t know you could. Great guide. Answered all the groups questions. Very informative"}, {"username": "Yvonne Cunningham", "comment_text": "St Peters Basilica and the Vatican Museum! Every time"}, {"username": "Alisa Flores", "comment_text": "Gaylee Thompson Demlinger"}, {"username": "Marianella Flynn-Morales", "comment_text": "The Vatican, so much to see and bus tours are awesome too!"}, {"username": "BettySue Cowan", "comment_text": "The Vatican breakfast tour."}, {"username": "Vicki Kreymborg Sweeney", "comment_text": "Domus Aurea"}, {"username": "Lisa Browning Rodriguez", "comment_text": "Early Vatican"}, {"username": "Cheryl Swiatko", "comment_text": "Colesseum with the Tour Guy. Hands-down."}, {"username": "Faina Monastyrsky", "comment_text": "Vatican"}, {"username": "Jane Anne Herkins", "comment_text": "Food tour of Trastevere"}, {"username": "Jenny Johnson Nuzzolillo", "comment_text": "Golf cart tour, and cooking class"}, {"username": "Michael Edwards", "comment_text": "Early morning Vatican breakfast tour. You really do have the place more to yourself. My second choice would be Roman Forum/\ncolosseum. More for the Forum. Amazing ruins and history."}, {"username": "Jocelyne Voss", "comment_text": "Restaurant"}, {"username": "Elaine Marinari", "comment_text": "Golf cart tour"}, {"username": "Rebecca A. Baer", "comment_text": "Loved the evening tour ending with a delicious meal and musicians to serenade us."}, {"username": "Dawdaw Samaha", "comment_text": "The Vatican it is a must"}, {"username": "Catherine Briggs", "comment_text": "Catacombs and Colosseum"}, {"username": "Charlotte Lowe", "comment_text": "Private tour of the Vatican hands down..."}, {"username": "Gina Scialdone Ferris", "comment_text": "Early morning at the Vatican"}, {"username": "Gayle Gasperin Klancnik", "comment_text": "Colosseum!!"}, {"username": "Tari Lawson", "comment_text": "The Scavi tour to St. Peter's tomb or the Domus Aureus. 2 best tour I have experienced in Rome."}, {"username": "Fran Rosenstein Ryback", "comment_text": "Definitely The Vatican Museums."}, {"username": "Andrea Ludwig Walker", "comment_text": "Fat Tire Bicycle tour has the best tour … and very cheap!! You see so many things and then stop to look at the ruins through virtual goggles to see what it looked like in its prime."}, {"username": "Lois Stevenson", "comment_text": "Vatican"}, {"username": "Maryann Locascio", "comment_text": "The Coliseum without a doubt ❤️"}, {"username": "Michelle Prince", "comment_text": "early morning Vatican tour"}, {"username": "Mariel Rodriguez", "comment_text": "Definitely the Vatican"}, {"username": "Terry Pisano", "comment_text": "Golf cart tour. Have it planned for the day we arrive... should be able to handle that with the jet lag, plus a nice intro."}, {"username": "Bianca Sparacino", "comment_text": "Private underground tour of the colosseum! Best tour we took the whole trip"}, {"username": "Jamie Bartolo Shaw", "comment_text": "Golf cart tour!!"}, {"username": "Sheree Gillard", "comment_text": "Night golf cart tour"}, {"username": "Wendy Johnson", "comment_text": "Definitely the Vatican - Skip the line."}, {"username": "Mark Hardman", "comment_text": "Food tour"}, {"username": "Jenni Peters", "comment_text": "The catacombs"}, {"username": "Robyne Hrubes Ariss", "comment_text": "Colosseum definitely! I took the underground tour and winged the rest of my trip and was the best decision I made."}, {"username": "Natalia Ottesen", "comment_text": "One guided tour - Galeria Borghese. In fact, all of them should be guided in Rome, unless you know Roma history/\nItalian art."}, {"username": "Sara Enders Biasutti", "comment_text": "E-bike tour hands down! We used “The Roman Guy.” It was so much fun! It was a half day tour and we saw parts of the city we wouldn’t have been able to see otherwise. We also did a horseback tour on the Appian way and a dinner at at the stable that was amazing!!! I also love the nighttime tour of the Colosseum!"}, {"username": "Jennifer Smith Ravanesi", "comment_text": "Viator breakfast at the Vatican. Amazing!!!"}, {"username": "Mike Conway", "comment_text": "Night ebike tour of the city"}, {"username": "Aida Perez Castellano", "comment_text": "A golf cart private tour. You’re able to breeze around all of the streets, choose exactly where you want to stop for pictures and how long you want to stay at a particular place. We did it last year and did it again this year. Used Viator. I would definitely do it again if I get to Rome again…"}, {"username": "Steph Kittles", "comment_text": "Probably the vatican just for the sheer size but we loved our coliseum tour the most! The rest of the towns easily doable on you're own. We also downloaded the rick steves audio tours and those were great for places like the Pantheon or just around the city!"}, {"username": "Antoinette Schultz Vogt", "comment_text": "Pamela Schnepp Christopher Vogt robert Bob Schnepp Jr."}, {"username": "Al Filizetti", "comment_text": "I liked the\nHop on hop off tours. He able to get off on whatever site you want to see so if you want to spend some time at the Colosseum hop off hop back on when you’re done or the same thing with some of the other sites that you go see you like Levi fountain."}, {"username": "Susan Carney Ash", "comment_text": "I enjoyed our coliseum tour the best. We went through The Tour Guy."}, {"username": "Leanne Dawn Sutton", "comment_text": "Vatican"}, {"username": "Olga Kevorkova Wilkins", "comment_text": "Vatican for sure. Skipping all lines, very interesting tour, 4 hours that highlighted everything . Walks/europe tour group through project expedition. A lot of it depends on the guide, we did not have a good experience with the coliseum tour. Could've done without a tour guide with internet info instead. Just my opinion, we're here now"}, {"username": "Dixie Kotylak", "comment_text": "I loved Trevi Fountain….but i would probably say the colliseum…"}, {"username": "Amanda Anacker Olsen", "comment_text": "The colosseum and the ruins. It was so worth it!"}, {"username": "Annelie Scheire-Cabello", "comment_text": "Peter Guns"}, {"username": "Annelie Scheire-Cabello", "comment_text": "Kathy Buyse"}, {"username": "Jessica Miller Breiten", "comment_text": "Definitely a golf cart tour!!!"}, {"username": "Karen Blackmore", "comment_text": "Night time tour of the Colosseum via co-op culture. Brought it to life, and hardly anyone else there."}, {"username": "Elizabeth Skeens", "comment_text": "We booked a guided early morning tour directly through the Vatican. Much cheaper than going through a 3rd party. But book early because they sell out!"}]}, {"id": "2205649529834125", "text": "Just looking into Travel Insurance from Australia to Italy any recommendations\nplease appreciated. BTW this a fantastic group thank you for tips to Italy 😉", "link": "facebook.com/groups/1373361046396315/permalink/2205649529834125/", "likes": 38, "comments": [{"username": "Tanya Cutri", "comment_text": "Allianz or Medibank (you get 15% discount if you're a member)"}, {"username": "Marlene Bertino Randolph", "comment_text": "We have a Allianz plan f"}, {"username": "Fiona Cameron", "comment_text": "One Cover or Covermore."}, {"username": "Jennifer Wilson", "comment_text": "Aussie here. I went with Allianz. An excellent option according to Choice."}, {"username": "Beverley Bedford", "comment_text": "Some banks offer free travel insurance with your credit card"}, {"username": "Esiram Greaves", "comment_text": "Thanks for the info, really appreciate it 🙏🏻"}, {"username": "Dan Trudi Flynn", "comment_text": "Allianz"}, {"username": "Katie White-Meade", "comment_text": "Your Healthcare may have you covered. Check. Otherwise shop around for suitable options."}, {"username": "Jodi Harris", "comment_text": "FastCover"}, {"username": "Imperia Arcidiacono", "comment_text": "Anyone used Commonwealth insurance? Good to Europe December and January this year. I have uses RACV before and luckily never had to claim anything."}, {"username": "Kylie Tonkin", "comment_text": "Allianz"}, {"username": "Carole Faulks Lear", "comment_text": "Fellow Aussie here from Victoria. My travel agent gave us 2 insurers to choose from, we picked \"go insurance\" with \"Go Plus\" coverage. A tad dearer than the other one, but reading the fine print, was a better one for us as we are both in our 60's. Hopefully we wont have to make a claim but peace of mind if we do have to. 15 days to go until our much anticipated 8 weeks travelling in Europe ❣ not counting down much! 🤪😂"}, {"username": "Mary Anne", "comment_text": "Do not use Insure and go. Very difficult to contact when needed. I had to threaten to go to the media before they acted when my 86 year old mother broke her hip in Scotland and needed a flight home."}, {"username": "Robyn Green", "comment_text": "Remember Covermore wouldn’t help that lady who fell in Thailand a few weeks ago, they were awful to the family, she was injured badly , they needed to fly her back to Australia and refused, her or husband had to rely on the go fund me money to get her home, the news kept repeating that covermore would not help as she had alcoholic in her system, it’s a holiday for goodness sake🤣\nSo whoever you choose please read the fine print 🥴"}, {"username": "Tau Wen", "comment_text": "If you are Australian snd you hold a Medicare card then medical us free. Just check your eligibility before you go with Medicare"}, {"username": "Tau Wen", "comment_text": "Also your credit card that you purchased your travel tickets - also have insurance. Check with them. No need to buy extra travel insurance. We use the credit card insurance"}, {"username": "Romy Coops", "comment_text": "If you booked with your credit card- it may be included. I know CBA does this."}, {"username": "Sue Graham", "comment_text": "Australian Post Office we found the cheapest"}, {"username": "SAsh Cox", "comment_text": "Covermore"}, {"username": "Irene Zugaro Mancusina", "comment_text": "I used my CBA credit card free travel insurance, you just have to activate it before you leave."}, {"username": "Claudia Codega", "comment_text": "I believe there is an agreement between the two countries"}, {"username": "Linda Monticello", "comment_text": "Allianz Travel Insurance"}, {"username": "Michelle Webb Johnson", "comment_text": "We are traveling to NCL Breakaway October 13 2023 Italy/Greek Isles, I used Bupa.. they were cheaper than most , and covered more."}, {"username": "Shane Farrell", "comment_text": "Check your credit card. Bankwest credit card has my insurance sorted"}, {"username": "Marika Van Der Klugt", "comment_text": "check with your credit card company - I'm with CBA Visa and I have great travel insurance coverage for free! I have had a make a claim once - easy peasy! Also if you're after a great phone/ data plan option - check out SimDirect. $30 (each phone) did us both for 2 weeks in Italy."}, {"username": "Maria Sardi", "comment_text": "We used RAC Insurance."}, {"username": "Vicky Lazzaro", "comment_text": "I used 1cover. Reasonably priced and covers a lot😁"}, {"username": "Craig Spicer", "comment_text": "I am in Italy now. Needed the extra coverage to disclose l am in recovery from radiation cancer treatment. Most places did not give me a look in but l went top coverage with ALLIANZ. They covered me. $200 for the disclosed medical reasons but worth the money if l do have to receive medical treatment for the radiation recovery."}, {"username": "Samantha Carlo Pessotto", "comment_text": "I spent a while researching and decided on Allianz, seemed to cover more than others."}, {"username": "Zinabhai Gupta", "comment_text": "Hop insurance and INF are one of the good options."}, {"username": "Janelle Wales", "comment_text": "We used Covermore"}, {"username": "Nicola Amy MacDonald", "comment_text": "My travel agent used covermore for my trip."}, {"username": "Irene Oda", "comment_text": "Google is a good resource- there must be insurance companies in Australia that offer coverage for travel? It's probably not a good idea to buy with a company outside of your home country."}, {"username": "Gracy Grace", "comment_text": "Allianz. My Aussie cousin ended up staying in a hospital in Paris for 2 months. Allianz paid all her bills and unused hotel bills and sorted out her flight back to Sydney. It was really a horrible situation where she would have ended bankrupt without a Health Insurance. 🥹"}, {"username": "Jann Kinsela", "comment_text": "TID"}, {"username": "Jenny Fitz", "comment_text": "I used 1cover"}, {"username": "Wendy Gauci", "comment_text": "We have travel insurance through our credit card with Covermore but we’ve paid a little extra to upgrade the coverage."}, {"username": "Andreanna Miteff", "comment_text": "Bn using 1Cover for over 30 years. Very price competitive & same coverage as Covermore who are a lot more expensive Check this out, it will help you.\nhttps://\nwww.comparethema\nrket.com.au/\ntravel-insurance\n/"}, {"username": "Bernadette Frawley", "comment_text": "For those who recommend cover more insurance, have you ever needed to make a claim? I used them in January this\nyear and had to claim after the air conditioning rained on our suitcases and electrics and they wouldn’t do anything about it until I could show original receipts of purchase 🤦‍♀️\nWe’re off to Europe in September and looking for more reasonable coverage."}, {"username": "Sheila Gale", "comment_text": "Have used 1cover for many years. Have made 2 claims in that time and had no problems with refunds finalised within a couple of weeks. Being in our 70s now some companies were so expensive, but 1cover were very reasonable."}, {"username": "Kelly Bevan", "comment_text": "Covermore annual if travelling for long periods (over 30 days by memory) and want to include ski cover etc.\n\nRAA is the best I could find with full covid cover but can be more if you are not a member and not ideal for longer trips (RACV in Vic RACQ in Qld etc)\n\nI have used many others also but have fortunate enough to have to not claim. Have heard horror stories about all of them when it comes to claims. Have found RAA amazing with household claims and have had others say the same about their travel insurance hence I always start with them as a guide."}, {"username": "Denise Colls", "comment_text": "Look at Tick insurance. They were the cheapest but got the most and us Canstar rated.\n\nCover More were the worst for me. I put in a small claim and it took six months and I said it was causing me stress and they sent me a link to Beyond Blue."}, {"username": "Karen Copeland", "comment_text": "Teachers health suck"}, {"username": "Jenny Kendrick", "comment_text": "We went with Allianz"}, {"username": "Julia Wildman", "comment_text": "Barclays Bank"}, {"username": "Rebekah Friedman Goldenberg", "comment_text": "Allianz"}, {"username": "Leone Karzon", "comment_text": "We've used Covermore several times and have taken out an annual policy a few times. It definitely saves you if you are doing a couple of trips within a 12 month period."}, {"username": "Denise Coman", "comment_text": "We use Covermore."}, {"username": "Noelene Cameron", "comment_text": "Cover-More."}, {"username": "Melissa Jane Brown", "comment_text": "I used to use Covermore, but have recently changed to Allianz"}, {"username": "Evan-Sue Wilson", "comment_text": "Insureandgo is one we have used. When Covid hit they were great, we got everything back."}, {"username": "Sherene Pipkorn", "comment_text": "Cover more is always a reasonable price and excellent cover"}, {"username": "Nadia Nadia", "comment_text": "I am using my common wealth bank credit card, inclusive travel insurance. There is also some reciprocal medical cover between two countries but need to check more"}, {"username": "Jen Dawson", "comment_text": "Linda Prosser"}, {"username": "Heather Stokes", "comment_text": "Cover more."}, {"username": "Lindsey Brancher", "comment_text": "SAGA have great deals"}, {"username": "Sam Dow", "comment_text": "I’ve just made a $30 000 claim through Insure and Go due to my son getting brain cancer\nThey have been amazing. We had top cover and they returned every last cent\nThe process was all online and super easy\nLimited medical documentation needed too\nThey were also pretty cheap to use"}, {"username": "Ingrid Morris", "comment_text": "I just am using RACQ (QLD based) and got it under $200. Actually, not sure who the under writer is 🤔"}, {"username": "Maria Antidormi Corica", "comment_text": "I’ve used covermore before but they were shocking last year. Allianz is who I recommend"}, {"username": "Peter Trainor", "comment_text": "Cover more"}, {"username": "Jess Dern", "comment_text": "We travelled from Australia through Europe and America and used Tick Insurance."}, {"username": "Mareesa Cullen", "comment_text": "Cover more"}, {"username": "Sherrin Wake Bracci", "comment_text": "Check if you are eligible for free travel insurance with your credit card. I had my insurance broker check out the policy and she was happy with it. It covers my husband and I, our kids (adults) travelling with us will go through my broker. We have used covermore on a previous trip and they were fantastic when we had a claim."}, {"username": "Trish Heymer", "comment_text": "I always use cover more. I was over there December/\nJanuary and had the extra cover in case of covid. Italy still had the 10 day isolation while I was there. Not sure of their regulations in regards to covid at the moment. But it’s something to be aware of while using public transport."}, {"username": "Jo McManus", "comment_text": "Credit card insurance if you have it (and no extra medical conditions). Otherwise I got a great price from 1Cover. Good luck"}, {"username": "Carine Brys", "comment_text": "Allianz? It is what I get travelling to the US from EU. They have unlimited coverage according to my travel agent."}, {"username": "Sally Govic Burnazovski", "comment_text": "Southern cross travel ins - great price"}, {"username": "JoAnn Burgess", "comment_text": "We’ve recently purchased 1cover for our travel later this year. Prior to that we’ve also used cover more. Never had to make a claim so can’t comment on process and time to approve."}, {"username": "Cindy Neilson", "comment_text": "Covermore"}, {"username": "Lizzie Bretag", "comment_text": "1cover"}, {"username": "Lee Farlow", "comment_text": "I am using Fast Travel"}, {"username": "Mia Catalano", "comment_text": "1cover! We have done a cruise and they covered that too!"}, {"username": "Shirley Fraser", "comment_text": "RAA"}, {"username": "Karen Frazer", "comment_text": "Covermore always."}, {"username": "Marie Montafia", "comment_text": "I always use RACQ travel insurance.. they’ve been brilliant coming thru with claims when others haven’t."}, {"username": "Elena Mcleish", "comment_text": "We used covermore"}, {"username": "Rhonda Russell", "comment_text": "I always use Covermore. If you are doing more than 1 trip you can get a policy for a year"}, {"username": "Leisa Davis", "comment_text": "Definitely Covermore"}, {"username": "Jenni Peters", "comment_text": "American Express credit card includes good travel insurance and card is accepted mostly everywhere."}, {"username": "Leigh Webster", "comment_text": "Do not use Medibank."}, {"username": "Sammii Fletcher", "comment_text": "We used Allianz"}, {"username": "Gail Witting", "comment_text": "Allianz"}, {"username": "Paul Stewart", "comment_text": "I highly recommend Cover-More."}, {"username": "Rebecca Yeoh", "comment_text": "1cover"}, {"username": "Rhonda Wicks", "comment_text": "NRMA"}]}, {"id": "2205654689833609", "text": "We have 2 nights spare between Cortona and Menton and have a car. To see CT, are we better off staying in La Spezia or ???", "link": "facebook.com/groups/1373361046396315/permalink/2205654689833609/", "likes": 1, "comments": [{"username": "Helen Gardener", "comment_text": "Yes, La Spezia, especially if you are only sleeping there."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205664403165971", "text": "Has anyone done a tour to Carrara to see the marble quarry? Looking for any tips/tour companies used...", "link": "facebook.com/groups/1373361046396315/permalink/2205664403165971/", "likes": 0, "comments": []}, {"id": "2205673363165075", "text": "Hello everyone,\nI’m looking for a nice restaurant AND beach to stay after lunch, near the San Remo/Bordighera/Vintimiglia area\nFor a birthday\nThanks!!!", "link": "facebook.com/groups/1373361046396315/permalink/2205673363165075/", "likes": 0, "comments": []}, {"id": "2205678949831183", "text": "Positano❤️", "link": "facebook.com/groups/1373361046396315/permalink/2205678949831183/", "likes": 17, "comments": [{"username": "Nathan Earl Stellenberg", "comment_text": "that is just stunning!"}]}, {"id": "2205679216497823", "text": "Torbole in the summer", "link": "facebook.com/groups/1373361046396315/permalink/2205679216497823/", "likes": 4, "comments": []}, {"id": "2205681366497608", "text": "Planning to travel through Italy with a friend who is gluten free. How easy/difficult to find cafes and restaurants that offer gluten fee?", "link": "facebook.com/groups/1373361046396315/permalink/2205681366497608/", "likes": 0, "comments": [{"username": "Zoe Croasdale", "comment_text": "Really easy. Italy is the best place in Europe for GF food. They have a national testingnprogram\nme for their population and give celiacs free food! Also apps for your phone https://\nwww.theitalianon\ntour.com/\ntop-5-gluten-fre\ne-apps-for-glut\nen-free-in-ital\ny/"}, {"username": "Paula English", "comment_text": "You are really planning now!"}]}, {"id": "2205681573164254", "text": "I recently heard something about how it’s common for hotels to hold your passport whenever you are in possession of your room key. Is this true?", "link": "facebook.com/groups/1373361046396315/permalink/2205681573164254/", "likes": 27, "comments": [{"username": "Michael Hansen", "comment_text": "I have had them handed straight back after them taking a copy or sometimes they ask for you to prefill in details on a website. No passport required!"}, {"username": "Ross Boss", "comment_text": "No"}, {"username": "Sandra Desmond", "comment_text": "Yes some do they might just hold it for a few hours or just copy it and give it back you can also ask for it back"}, {"username": "Lisa Pro", "comment_text": "Never once happened to me. I go every year for 3 weeks."}, {"username": "David Davey", "comment_text": "In old days also hotel kept your room key when go outside."}, {"username": "Cess Kearns", "comment_text": "No way!"}, {"username": "Joseph DellaFave", "comment_text": "No"}, {"username": "Katia Taam", "comment_text": "No, never. They always ask for a copy and I always wait and have my passport back. I never leave my passport with anyone."}, {"username": "Elisa Gall", "comment_text": "No they don’t they just ask to see when you check in"}, {"username": "Michele Ann Tomao Ruzzano", "comment_text": "We just left Italy Rome, Venice and Sorrento. None asked for the passports"}, {"username": "Nancy Surprenant Leclair", "comment_text": "They won't take it....they just make a copy which is mandatory according to the hotel policy in Italy."}, {"username": "Michael Barnes", "comment_text": "They need a copy of it. You can hand it to them but wait for it to be returned once they copy it.\nIt is needed also for AirBnB rentals. There is a form they need to prepare for some tax board that requires your details to complete. It felt shady at first when asked until I did a little homework on it."}, {"username": "Caroline Dombey", "comment_text": "This happened to us in Berlin. It was several decades ago though, so perhaps now changed."}, {"username": "Toni Marie", "comment_text": "Just did a 10 day tour and this never happened"}, {"username": "Penelope Browder", "comment_text": "Never happened to us."}, {"username": "Erin Mitchell", "comment_text": "They make a copy. My hotel in Reggio Emilia asked to hold it and I said they could take a copy. I carried my passport everywhere with me and was fine."}, {"username": "Gillian O'Callaghan", "comment_text": "No. Stayed in 13 accommodations and not 1 asked to hold onto my passport."}, {"username": "S.P. Espy", "comment_text": "No, they do not. Many places are required to have a copy or picture of it though."}, {"username": "Antonio Aloè", "comment_text": "In which country North Korea?Afghanist\nan?🤔"}, {"username": "Effie Gatanas Kontolios", "comment_text": "The hotel I recently stayed in asked to see our passports. They took a photocopy and returned them to us."}, {"username": "Maria De Sena", "comment_text": "No holding\nThey just ask to see it at check in"}, {"username": "Lillian Giglia Maniscalco", "comment_text": "They didn’t ask but every time we left the room we gave them back the key."}, {"username": "James Saxton", "comment_text": "Years ago this used to be a thing in Europe. No more. Just a copy normally."}, {"username": "Tricia Harman", "comment_text": "No"}, {"username": "Mariana Mancilla-Pittman", "comment_text": "Never heard of that"}, {"username": "Jennifer A Lo", "comment_text": "Yes they will hold on to you passport until you check out"}, {"username": "Andrea Brown", "comment_text": "No"}, {"username": "Agata Aleksandra", "comment_text": "Just for a check in, never longer. Don't let them to keep your documents."}, {"username": "Milt Lawhorn", "comment_text": "I’ve never experienced this."}, {"username": "Archie Lefkakis", "comment_text": "No"}, {"username": "Lois Ann Layman", "comment_text": "No never heard that. They can possibly hold a copy."}, {"username": "Elize Steyn", "comment_text": "No"}, {"username": "Vivien C N Le", "comment_text": "No, they only need to look at your passport for security reasons, then will return it to you."}, {"username": "Brenda Fife", "comment_text": "Seems like antiquated practice when only safe available was at main reception. Now, everyone has passport copies on cell phones and individual room safes are the norm.🤷‍♀️"}, {"username": "Dayna Scinto", "comment_text": "Many years ago this did happen when I traveled to India but on my last 2 trips to Italy & Europe no. They just take copies of passports."}, {"username": "Phyllis Flowers", "comment_text": "Yes but normally they make a copy you can ask them to make a copy"}, {"username": "Nana Esther Bertolino", "comment_text": "No not at all"}, {"username": "Artilla Puddy", "comment_text": "Never heard of it. Never had my passport held by any hotel ever and I would never leave it if asked"}, {"username": "Bonnie Rodgers Henderson", "comment_text": "This was a common practice in the past. Now they make a copy"}, {"username": "Donna Roth Colletti", "comment_text": "No. They can ask to make a copy, that’s all."}, {"username": "Richard Meek", "comment_text": "Lots of nonsense is heard by members of this group.."}, {"username": "Jan Lumberg Kupczyk", "comment_text": "We have traveled to Canada, Mexico Denmark, Norway Sweden, Germany, Switzerland, France, Italy, Puerto Rico, Bahamas, and they never did this. Nor did they take a copy."}, {"username": "Nana Tirolese", "comment_text": "Not in our case."}, {"username": "Shawn Galbraith", "comment_text": "No"}, {"username": "Maureen King", "comment_text": "I'm not slated 2 b there until September 2024\n\nYou can copy it all you want\n\nBut HELL TO THE NOOOO\n\nTo keep it"}, {"username": "Dawn Teach", "comment_text": "Never have I had them keep it.\nI would not even allow them to keep it. They usually take a photo copy."}, {"username": "Jen Klemm", "comment_text": "Does everyone keep their passports in the room safe? I have heard you should carry it with you. Which is the safest bet?"}, {"username": "Richard Rodriguez", "comment_text": "Never give your passport to anyone."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "Not in England"}, {"username": "Fiona Mac", "comment_text": "Ours did also watch for tourist taxes n hidden charges"}, {"username": "Lois Ann Layman", "comment_text": "No they are not allowed to do that. You make copies and keep copies one in your carry on and in you suitcase and keep the original with you at all times."}, {"username": "Camille Mccoy Lmt", "comment_text": "No."}, {"username": "Jeanne Bissell", "comment_text": "No, tell them to make a copy."}, {"username": "Liane Sabina", "comment_text": "Never did we experience that."}, {"username": "Kris Beacham", "comment_text": "Might be for the raggedy crappy ones. The ones I’ve stayed in only need the passport at check in.\n\nThat’s it."}, {"username": "Vivien Paulik", "comment_text": "At past they hold it. Nowadays they usually scan it or take a photo"}, {"username": "Valentina Daprile", "comment_text": "No they will note down your details and return to you. No Jolson"}, {"username": "Anthony Mckinney", "comment_text": "Fuck that"}, {"username": "Stefano Bressanelli", "comment_text": "The law in Italy requires a Copy of passport/\ndocument of Every guest. Normal thing . No worries!"}, {"username": "Peter John", "comment_text": "I remember years ago they used to keep your passport overnight - but these days they can make a photocopy or scan and give straight back."}, {"username": "Diane Dillon", "comment_text": "They used to try to do that. My dad ( military) refused. So he would make them take a copy or just write everything down. The last place in Portugal yesterday and the place i spent last night in Amsterdam both just wrote my passport number down"}, {"username": "Vicky Alger Skillman", "comment_text": "Question: Our hotel is taking CC to pay for room but requesting cash to pay the taxes? Is this normal?"}, {"username": "Andrea Karina Niazi", "comment_text": "No. They asked for them at the time of arrival at the hotel to confirm the online booking info."}, {"username": "Suzanne Sullivan", "comment_text": "No, they take a picture of it"}, {"username": "Sandy Michelle Duggan", "comment_text": "no, they need copies , then give them back, have just returned from my trip. No problems at all with passports"}, {"username": "Pai Ge", "comment_text": "Never in all my travels. Photocopy only."}, {"username": "Michelle Smith", "comment_text": "They can and do\nDepends on the hotel.\nHaven't had any issues"}, {"username": "Alicia Fancher", "comment_text": "Never had that happen. They take your passport when you check in but don’t keep it."}, {"username": "Heather Stokes", "comment_text": "Ours have just taken photos of copies of our passports."}, {"username": "Nadele Clark", "comment_text": "They just took a copy of ours"}, {"username": "Antonio Ferranti", "comment_text": "No. They should request them, make a copy for their records and immediately return it to you."}, {"username": "Justin Louis", "comment_text": "I stayed in Rome and no issues - they took a copy and we kept the passport in the room safe."}, {"username": "Martha Heller", "comment_text": "Some do."}, {"username": "Rose Stolarek", "comment_text": "No . We were never ever asked anywhere we travelled in Europe. Travelled to Italy many times and never been asked there as well. They do make a copy but they do not hold your actual passport"}, {"username": "Isa Van Wyk", "comment_text": "No def not"}, {"username": "Veronika Bisani", "comment_text": "Never"}, {"username": "Katty Veneno Perez", "comment_text": "Omg nooo"}, {"username": "Brian Osman", "comment_text": "No they don't hold your passport, it's actually illegal for them to do that, they generally want a copy, that's all"}, {"username": "Sara Bee", "comment_text": "No, they ask for your passport and ID to check you in, but they don’t hold on to it."}, {"username": "Michelle Cotoni", "comment_text": "This is interesting, my hotel in Palermo held it for 24 hours."}, {"username": "Stacey Esposito", "comment_text": "Nope. The input them into the system then give then back to you"}, {"username": "Christine Ann", "comment_text": "Never seen that. They take a copy of it"}, {"username": "Gianna Onesi", "comment_text": "They can take a pic from my phone but not keeping it."}, {"username": "Pk Yeung", "comment_text": "Common? Probably in some authoritarian countries like N.Korea."}, {"username": "Pat Maiorino", "comment_text": "No. Hotels just make a copy of your passports, then give them right back to you."}, {"username": "Michael Galan", "comment_text": "I'd love to know where you heard that.\nZero truth to it"}, {"username": "Simona Ptichka", "comment_text": "Not hold , the make a copy\nU keep passport in your room safe"}, {"username": "Kelly Ann", "comment_text": "Hotels took copies of our passport at checkin but never kept them …"}, {"username": "Dianne Novak Iadanza", "comment_text": "Well how than would you be able to carry it everywhere as some say you are supposed to do?"}, {"username": "Wendy Spano Bracco", "comment_text": "No. Just to take the indignation and hand it back"}, {"username": "Jeannine Carta Hanson", "comment_text": "Yes always."}, {"username": "Daniele Zarka", "comment_text": "Never happened to me, not once"}, {"username": "Matteo Basile", "comment_text": "First time I hear this… sometimes they just keep it for few hours to make the registration."}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "No. Not at all"}, {"username": "Trevor Brown", "comment_text": "No"}, {"username": "Liliana Shenton", "comment_text": "They just photocopied it on my recent travels in check in."}, {"username": "Hettie Tabor", "comment_text": "They used to do that but most now they scan or take a picture of your passport. I don’t give up my passport for anyone."}, {"username": "Tricia Teys", "comment_text": "One hotel kept ours for the duration but others just sighted it"}, {"username": "Trace Barron", "comment_text": "Quite often. It's standard practice and nothing to be concerned about"}, {"username": "April May", "comment_text": "Our lodgings took a photocopy and immediately returned"}, {"username": "Janis Dolce", "comment_text": "No they just check and report it"}, {"username": "ChriSteve Childs", "comment_text": "No just a copy never leave your passport with anyone"}, {"username": "Kary LeBlanc", "comment_text": "Been to 7 countries in europe for the past 2 years and this has never happened to me"}, {"username": "John Mynard", "comment_text": "We have been 3 times and have never had that happen."}, {"username": "Aubrey Roy", "comment_text": "Sounds weird"}, {"username": "Karine Brevet", "comment_text": "They never kept my passeports, but they took pictures. I never left them to anyone."}, {"username": "Loran Bertini", "comment_text": "No way would I let someone keep my passport. If they lose it you can’t leave the country! They can take as many pictures they need but they can’t take it from me. Also it is good practice to also carry a copy of your own passport."}, {"username": "Jennifer Gustafson", "comment_text": "None of ours did that they all took a photocopy to turn in. I would never turn mine in to anyone"}, {"username": "David Parks", "comment_text": "In 1984 they took your passport to send to interpol and held it for a day or two. Now they photocopy it and hand it back to you."}, {"username": "Lisa Flanders", "comment_text": "They will ask for it at every hotel, but ONLY to make a copy of it."}, {"username": "Sue Allanby", "comment_text": "That used to always be the case years ago but now I think they just keep a copy on their computer.\nI haven’t had to hand mine over (apart from check in) for a long time."}, {"username": "Kathryn Healy", "comment_text": "Yes, they used to do that, especially in the Middle East. Most places just make copies now though."}, {"username": "Romy Coops", "comment_text": "No no no - I would not allow that- that is akin to captivity"}, {"username": "Suzie LG", "comment_text": "Nope 👎"}, {"username": "Viraf NZ", "comment_text": "Not at all"}, {"username": "Romana Svítková", "comment_text": "The hotel we recently stayed in kept our passports overnight but then they were returned."}, {"username": "James Carr", "comment_text": "No"}, {"username": "Carol Brewer", "comment_text": "Do not let them, bring color copies of your passport and give them that instead. I had to harass a front desk for 2 days and get firm to get my passport back."}, {"username": "Emma Whiting", "comment_text": "We were asked for our passports at check in and they didnt hand them back, there was a bit of confusion on our part (language etc) if they were asking to keep them for the entire stay or not but we asked for them once we'd put our stuff in the room and they were given back with no issue!"}, {"username": "Greg Baker", "comment_text": "We’ve stayed in Florence cortona and Rome and they do ask for passports to make a copy then we get them back."}]}, {"id": "2205706926495052", "text": "🇮🇹Sirmione🇮🇹 at Lake Garda.\ndrone shot 📸\nreal nice place to visit 👌🏻", "link": "facebook.com/groups/1373361046396315/permalink/2205706926495052/", "likes": 13, "comments": [{"username": "Matty Van", "comment_text": "Louise Ronan"}, {"username": "Alisha Frank", "comment_text": "Terry Frank"}]}, {"id": "2205712089827869", "text": "Good morning, flying into Pisa this afternoon .. Says a 5 minute drive from where we are staying .. is there buses regularly or will it be a Uber ? If so what are the names so we can download the app or check services x", "link": "facebook.com/groups/1373361046396315/permalink/2205712089827869/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "I don't think Uber is in the area."}]}, {"id": "2205714479827630", "text": "After reading all the comments about driving in Italy we have almost decided to get a private driver so we can enjoy the scenery.\nWe are visiting in April 2024 from Australia & land in Rome where will have 4 nights .\nWe need a driver or drivers to take us from Rome to Naples & Pompeii, Matera, Sorrento then back to Rome for our flight to France.\nThis is over a 10 day period from 10/4 to 20/4.\nLooking for recommendations for drivers for 2 adults in there 60s.", "link": "facebook.com/groups/1373361046396315/permalink/2205714479827630/", "likes": 7, "comments": [{"username": "Nancy Koehler Barboni", "comment_text": "The trains are good in Italy. I would take the train from Rome to Naples and then pick up a driver for the Sorrento etc and then fly Naples to Rome or train Sorrento to Rome."}, {"username": "Heather Hills Jacobs", "comment_text": "Venice Group Services helped us!!"}, {"username": "Graham Sherlock", "comment_text": "Just use the trains so easy and a tenth of the price of a private driver"}, {"username": "Jenny Kendrick", "comment_text": "Good idea i wouldnt tackle the Amalfi Coast road"}, {"username": "Vanessa Durkin", "comment_text": "Better to take trains easy quick efficient and cheap we did venice rimini pisa florence rome salerno amalfi and capri without any problem at all"}, {"username": "Dani Stewart", "comment_text": "That is a shame- we are from Australia and love driving over there and have never had a problem"}, {"username": "Rhonda Wicks", "comment_text": "We are training"}, {"username": "Carissa Lawson", "comment_text": "I used Touring Italy and we had a driver and a tour guide. They were fabulous with communication and picked us up at our hotel!"}, {"username": "Jane Lilibet", "comment_text": "Train"}, {"username": "Rita Scotto Epifanio", "comment_text": "I think it’s smart to get a driver. Not so much for the driving part, but parking in small towns isn’t easy."}, {"username": "Dafne Vassetti", "comment_text": "Trains are great if you want to go to Naples and then you can get a private driver from there.\nI think the private driver will be super useful if traveling towards the South especially in the Matera area (which is beautiful ❤️)\n\nHaving a private driver, yes is more expensive, but I totally understand than being on vacation, it's really stress free. Also you can stop in smaller towns and stop along the way if you want to. Also, sometimes drivers know places that are not part of the touristy itineraries - like places to stop for lunch, incredible views, etc.\n\nIf you decide to be picked up in Naples it would be best. Try this company https://\nncc-napoli-car-s\nervice.business\n.site/\n?utm_source=gmb&\nutm_medium=refe\nrral\n\nYou can send them an email and share itinerary and days and they will tell you what's the price."}, {"username": "Rebecca Yeoh", "comment_text": "I recently used Rainbow Limos, I found them via many good reviews and they certainly lived up to the hype. They are very reliable and great communicators. You have the option of being driven from Rome, but also consider getting a high speed train from Rome to Naples as the Trenitalia trains are amazing! You can get picked up at Naples train station (they stand at the gate with your name on a sign). Fellow Aussie here…good idea not driving, that was one of the most stressful experiences of my life…being on the other side of the road didn’t help the situation!! https://\nwww.rainbowlimos\n.com/"}, {"username": "Jaime Cleek", "comment_text": "The train is so easy for Rome to Naples and even Pompeii. Not sure about Matera"}, {"username": "Geoff Plus Jann Mains", "comment_text": "In May 2024 we are staying in San Marino Then going to Rimini station to Rome by train.\nWe want to go to Lazio for a few days.\nDo we have to go to Rome then to Lazio.\nOr can we go to Lazio from Rimini.\n\nThankyou for any information.\nJann New Zealand ."}, {"username": "Suzanne Sullivan", "comment_text": "I used Daytripper to book a driver"}, {"username": "Stacey Esposito", "comment_text": "We are from nyc and drove due to the places we wanted to see. It was lovely. No issues. Driving in the city was interesting but only to get to our hotels before dropping off the rental car. We drove in one day from Venice to verona to see juliet s house, then continued to maranello to see the ferrari museum. And then finally arrived in florence. My husband dropped us off at our hotel in the ztl district and then returned the car to hertz. I gave the hotel our license plate to enter it in the system to avoid a ticket. When we left florence we rented another car and drove to sorrento. We drove to pompeii and then dropped the car off In rome the day before our flight home"}, {"username": "Mary Anne", "comment_text": "We used Guemar Travel. Fabulous service."}, {"username": "Felicia LoCascio Whitney", "comment_text": "Driver in Rome\nhttps://\nwww.driverinrome\n.com/reviews/\nexclusive-best-o\nf-rome-vatican-\nmuseum/10"}, {"username": "Domenica Calvene", "comment_text": "Aussie here..just returned, trains are very easy to navigate and enjoying the views with no stress.We drove in smaller towns of Abruzzo but didn't drive in Rome.They are crazy drivers🤣 no one indicates they just go with the flo first in best dressed...inter\nesting how we never saw no road rage.And God help you if your trying to cross the road.lol.We used a private driver from airport to hotel on arrival organised by accommodation but also used them privately.\nThe company is Shuttle limousine Rome Tours..\nWe had a couple of different guys 1 was call Fabrizio.(+39)3\n392494602.\nStill kept his buisiness card."}, {"username": "Frances Barnes", "comment_text": "We used this guy. Couldn't fault him. He picked us up from Napoli and took us to Sorrento. Used him to drive the Amalfi coast.\nhttps://\nwww.facebook.com\n/toninodriver"}, {"username": "Donna Watson", "comment_text": "Rosario - +39 338 341 7643. Great guy"}, {"username": "Donna Watson", "comment_text": "Also we are in our 60’s. We used the train mostly but we used Rosario when we got into Naples late not wanting to take public trains in the dark"}, {"username": "Glenn Todd Webb", "comment_text": "Easy car tour Naples"}, {"username": "Maria O'Callaghan", "comment_text": "That is a great idea. Trains are very good."}]}, {"id": "2205719439827134", "text": "Hey there looking for advice on places to visit in Italy. I've loved my first two trips this year to Cagliari and Genoa and looking for more coastal gems to discover.\n\nCan anyone reccomend any fairly decent size city's on the coast with lots to do in terms of museums, gallery's, eating out options which have a fairly easy and close transfer to the nearest airport?\n\nLooking to head over again early September thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2205719439827134/", "likes": 1, "comments": [{"username": "Carmela Losavio Wiltshire", "comment_text": "Amalfi coast!"}, {"username": "Nadia Filice", "comment_text": "Amalfi, Sorrento, positano portofino"}, {"username": "Alice Francesca", "comment_text": "Bari/Brindisi and Ostuni/\nPolignano a mare etc"}, {"username": "Dafne Vassetti", "comment_text": "Palermo. Has an Airport, has the beach, has the history, has great food, plenty to do and the locals are friendly ❤️"}, {"username": "Maria Brozou", "comment_text": "Napoli is my favorite one"}]}, {"id": "2205722406493504", "text": "Hi, we are off to Lake Garda next week, staying in Garda. We will be relying on public transport and wondered if there are any'must do's'. We are staying in a hotel HB so any lunch or fantastic Gelato recommendations, would be great. We are hoping to purchase a hop on/off style ticket to visit destinations around the lake, any advice with this? 1st time visitors...\nThank you for reading🙂", "link": "facebook.com/groups/1373361046396315/permalink/2205722406493504/", "likes": 2, "comments": []}, {"id": "2204594899939588", "text": "Hi there, my parents are heading to Italy (Rome, amalfi, Sicily) next month and my mom wants to buy her first designer bag there! Is there a price different between buying at the airport vs say at a store in Rome? (I know VAT is already removed at the airport so it looks cheaper, but I’d like to know if there is truly a price difference). She’s thinking Dior or Chanel or Celine.\n\nEdit to add: she does know these are French designers. It is just what she wants! And she won’t have a chance to go to France.", "link": "facebook.com/groups/1373361046396315/permalink/2204594899939588/", "likes": 12, "comments": [{"username": "Stacy Prestigiacomo", "comment_text": "If you buy at a store you collect tax back at airport too. We were just there found bags to be at least a few hundred cheaper"}, {"username": "Meredith Williams", "comment_text": "la rinascente dept store in rome had all the brands 🤩 super helpful w the vat process too!"}, {"username": "Huong Worley", "comment_text": "A lot of times I found more selections at City center than airport, it depends on what you are looking for. Prices are almost the same after you claim VAT tax."}, {"username": "Debby Finn Martino", "comment_text": "The stores in airport don’t have as much inventory. Also, Chanel is not really cheaper in Italy. The other designers are cheaper"}, {"username": "Jennifer Smith", "comment_text": "Rome May be best selection. Agree with the large department store that has all brands. They make it easy."}, {"username": "Sue Allanby", "comment_text": "All airport stores add their mark up"}, {"username": "Colita Ellis Wittenkeller", "comment_text": "I think if you buy an Italian brand then it’s less expensive but maybe not for others. In Paris, we bought a Louis Vuitton bag and it was much less than buying in US."}, {"username": "Allanah Licciardello", "comment_text": "Sorry to jump on this post, but when you claim for tax back at airport do the products have to be unused? Like shoes not work etc?"}, {"username": "Tracy Foss", "comment_text": "I heard there was an outlet mall outskirts of Florence? I would google"}, {"username": "Amy So", "comment_text": "The stores in Rome near Spanish Steps have the best inventory."}, {"username": "Amy So", "comment_text": "Also may consider making an appointment if she can."}, {"username": "Gary W Anderson", "comment_text": "Check duty free price on arrival, check prices in Italy then buy the bargain"}, {"username": "Pirkko Storer", "comment_text": "In Rome there are all the designer shops and you can buy duty free, also without tax or VAT. And the price difference is big."}, {"username": "Kateryna Fedyushkina", "comment_text": "You will get tax free however ,go to Roman flagship stores"}, {"username": "Mindy Marshall Lavin", "comment_text": "The only problem with waiting to buy at the stores in the airport is you run the risk of them not having the bag you want . If you are flexible and not looking only for a specific bag then it’s fine."}, {"username": "Carter Boughner", "comment_text": "Those are all French so not sure they would be that much cheaper."}, {"username": "Karen Landini", "comment_text": "Be sure you understand how VAT reimbursement works, how to get the proper paperwork from the shops, and what to do at the airport. So many people never get their money because it is a precise process."}, {"username": "Jenny Payne", "comment_text": "I would buy from La Rinascente in Rome I buy my good things there 🌻"}, {"username": "Caroline Piliere", "comment_text": "What is a VAT tax? I want to buy a purse in Rome before we leave."}, {"username": "Rachel Tarrant", "comment_text": "You do know those are French designer bags, not Italian, right?"}, {"username": "Sue Allanby", "comment_text": "Don’t mean to be rude but wouldn’t it be more appropriate to buy an Italian Designer bag if you are visiting Italy?\nThe ones mentioned would be mementoes purchased from France surely?"}, {"username": "Clelia Minucci", "comment_text": "She has to visit the dolce and gabbana store in Palermo 😍"}, {"username": "Julie Ronci Zito", "comment_text": "There’s an outlet mall in Sicily also! Gucci❤️"}]}, {"id": "2205179509881127", "text": "Can anyone recommend a driver service from Rome to Sorrento? My wife and I need it for August 19. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2205179509881127/", "likes": 3, "comments": [{"username": "Michelle Anderson- Rowland", "comment_text": "Check on the Viator or Get your guide app... Or you can check with your hotel that you're staying at my hotel in Naples set mine up for me"}, {"username": "Amy Clark", "comment_text": "We just used Roberto from Sorrento Car Tours from Naples to Sorrento with a atop at a pizza place in Naples and a guided tour of Pompeii on the way to our hotel. We also used him from our hotel in Sorrento to Naples airport for our departure! He was awesome. I'll post his card. We just got home yesterday from the most amazing 2 week trip!! 🍷🇮🇹❤️🍋"}, {"username": "Rebecca Yeoh", "comment_text": "I used Rainbow Limos (based off their good reviews). They are exceptional with great communication. Would recommend 👌🏼 https://\nwww.rainbowlimos\n.com/\ntransfers.php"}, {"username": "Regina-Rich Krett", "comment_text": "Welcome Pickups"}]}, {"id": "2205187096547035", "text": "Has anyone visited the palace at Caserta?", "link": "facebook.com/groups/1373361046396315/permalink/2205187096547035/", "likes": 4, "comments": [{"username": "Stephanie Share St John", "comment_text": "Yes! Loved it! The walk to the waterfall is long but pretty. Inside the palace us beautiful."}, {"username": "Ettore de Vita", "comment_text": "It’s called ….\nREGGIA DI CASERTA\nIt’s beautiful"}, {"username": "Annamarie Di Maio", "comment_text": "La Reggia is amazing!"}, {"username": "Stella Kevin", "comment_text": "Yes beautiful and the grounds! Just heaven"}, {"username": "Miyuki Kanno Paul", "comment_text": "Yes! Royal Theater only opens to public on Saturdays and Sundays from 10:30 to 1:30. Only small group of 20-30 can enter at the time. It’s guided but only in Italian. If you want to see the palace fully, visit during the weekend. The garden is looong. Elderly people purchased the shuttle service to/from the top of the fountain. It’s about 2 mile each, 4 mile round trip walk, so be prepared!"}, {"username": "Heath Conn", "comment_text": "Yes. It is wonderful but surrounded by a very trashy and sketchy area."}, {"username": "Elena Eugeni", "comment_text": "It's an amazing place and in Caserta you will find the Pizzeria that was acclamed as Best in Italy for a couple years in a row"}]}, {"id": "2205190376546707", "text": "Hello, , which esim do you recommend to be able to use there? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2205190376546707/", "likes": 1, "comments": [{"username": "Gianna Onesi", "comment_text": "Airailo or orange"}]}, {"id": "2205191769879901", "text": "Anyone wanting to just visit St Peter’s basilica, I was there at 1230 today, took only 10min to get through the security, moved pretty quickly. We were in and out in an hour. If you’re just wanting to see the church and not the museum etc", "link": "facebook.com/groups/1373361046396315/permalink/2205191769879901/", "likes": 11, "comments": []}]