[{"id": "2200618947003850", "text": "Would anyone be kind enough to share a good Airbnb in this area that’s about 233euros/night (in Oct, for 4 people)? We found one but it doesn’t allow early check-in or dropped luggages.\n\nTIA 😌", "link": "facebook.com/groups/1373361046396315/permalink/2200618947003850/", "likes": 0, "comments": []}, {"id": "2200620767003668", "text": "does anyone know anything about Hotel Perla in Bologna?", "link": "facebook.com/groups/1373361046396315/permalink/2200620767003668/", "likes": 1, "comments": [{"username": "Sue Kreger", "comment_text": "No I don’t know that hotel, but I would recommend Hotel Corona D’Oro which I stayed at in 2019. Rick Stein stayed there when he did his Long Weekend series, stunning! Also I went on a fantastic food tour of balsamic vinegar, prosciutto and parmigiano reggiano cheese factory and the tour ended with a four course lunch…….. I’d say the best food tour I have ever taken …..look up Italian Days Food Experience."}]}, {"id": "2200653960333682", "text": "Hii! Debating between taking the train from Milan airport to Venice or renting a car and driving.Any tips or advice on which is easier/ quicker would be appreciated!!!", "link": "facebook.com/groups/1373361046396315/permalink/2200653960333682/", "likes": 1, "comments": [{"username": "Marie Gaynor", "comment_text": "The train is comfortable and efficient ( check for any scheduled strikes first though)"}, {"username": "Connie Wilson", "comment_text": "Much quicker by train and no hassle with parking once you arrive in Venice. On the other hand, having a car would allow you to make stops in Lake Garda and Verona along the way."}, {"username": "Benedetta Vanni", "comment_text": "Venezia is not the right town to go to by car (many residents do not even own one!) so i think train is a better option. There's a high speed line connecting Milano and Venezia."}, {"username": "Alice Francesca", "comment_text": "Train.and you CAN stop in Lake Garda (Desenzano) and Verona.(train station is about 15 minutes from the center)"}, {"username": "Peach Panfili", "comment_text": "Take the train. No cars in Venice"}, {"username": "Jenn Messina Babore", "comment_text": "Train would be easiest."}, {"username": "Gillian O'Callaghan", "comment_text": "Train for sure.....really\neasy...direct trip, 2.5 hours, goes right to the Grand Canal. I booked all my train trips on Trainline."}, {"username": "Krissy DaRusso", "comment_text": "Train"}, {"username": "Heather Hills Jacobs", "comment_text": "Venice Group Services is a private transfer company. They are great and reliable!!"}, {"username": "Virgz Van Møøre", "comment_text": "Train"}, {"username": "Miyuki Kanno Paul", "comment_text": "You cannot drive into Venezia"}, {"username": "Jules Earl-Rossiter", "comment_text": "I would take the train....as with driving you have the rental plus parking fees... more convenient and probably a lot cheaper....🙃"}]}, {"id": "2200620530337025", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2200620530337025/", "likes": 1, "comments": []}, {"id": "2200715616994183", "text": "Good evening!\nThis is a different type of question than i have seen here, but I need some advice or suggestions!\nWe are going on a Mediterranean cruise in a couple of weeks. One of the days will be spent inआणखी florence.\nI am trying to decide what to do while there. Out of these two options… what would you recommend?\nAn 8 hour tour “ The Jewels of Cinque Terre” or the hop on, hop off bus?", "link": "facebook.com/groups/1373361046396315/permalink/2200715616994183/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "Firenze does not have a port. I guess your cruise will stop in either La Spezia or Livorno. If the stop is La Spezia, then go to Cinque Terre. If your stop is Livorno, then go to Firenze. (Choice by shortest path, so you don't waste time and make the most of your few hours here!)."}, {"username": "Amber Frick", "comment_text": "We just did this tour two weeks ago. It’s a large boat/ferry that drives past all 5 towns and you stop at 3 of them and get some free time to explore on your own. The lunch was awful but the guide and towns were wonderful. It was nice to see all of the areas and get pictures from the water"}, {"username": "Gianna Onesi", "comment_text": "Walk around Florence is so scenic"}]}, {"id": "2200526187013126", "text": "Planning a trip to Italy next sept. Hiking the Dolomites for sure. Then thinking Amalfi Coast and/or Cinque Terra? We love hiking, walking and nature but not into museums. are these 2 spots too similar for just exploring???\nAlso Matera a possibility 🤷‍♀️ any advise??? And maybe Venice\nThanks!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2200526187013126/", "likes": 2, "comments": [{"username": "Graham Sherlock", "comment_text": "Cinque Terre over Amalfi anyday"}, {"username": "Lesley Eagle", "comment_text": "Would you not consider the dolomites then lake Garda and on to cinque terra? All three areas are excellent for walking"}, {"username": "Dimitri Pianese", "comment_text": "You like nature? Discover Abruzzo region!!!!! You won't be disappointed at all!!!!!"}, {"username": "Robin Burrell", "comment_text": "Not similar at all. Both areas have good hiking, although Ligurian Coast around Portofino and Santa Margarita is great hiking. You tube has some videos of some tricky trails. You won’t be disappointed. Dolomites are awe inspiring. Wish I was younger again."}, {"username": "Meghan Tan", "comment_text": "The Dolomites and Amalfi are very far apart. I would stay in Northern Italy (Dolomites + Liguria) A plethora of amazing hikes + stunning views and less touristy than Amalfi."}, {"username": "Steve Grossman", "comment_text": "It will take a whole day to get from the Dolomites to amalfi"}, {"username": "Gary W Anderson", "comment_text": "You’ll love both"}, {"username": "Phyllis Snyder", "comment_text": "Yes!"}]}, {"id": "2200596583672753", "text": "Hello everyone! Looking for recommendations\nfor NON TOURISTY food places in all of Amalfi Coast/ Capri. Authentic. Delicious.\nThanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2200596583672753/", "likes": 13, "comments": [{"username": "Terina Kwiatkowski", "comment_text": "Ravello is Beautiful! Quieter than most places in the Amalfi"}, {"username": "Daniel Taylor", "comment_text": "Lara Jupp"}, {"username": "Tony Palombino", "comment_text": "So I’ve been here for over 30 days traveling all over Italy. I posed the same questions in various forums and of course everyone has their favorite. With all the recommendations\n, I looked for a consensus on particular restaurants and ￼wrote those down, and here is what I learned. Restaurants have bad days. There were several restaurants that were highly recommended by a majority only for it to be not so great, It could be a server who has a bad attitude or the chef or main cook is off that day or maybe I ordered the wrong item. Honestly, it was like a 50-50 split based on the recommendations\n. Conclusion, recommendations\nare good including the review-based apps, one of the things that I do that kind of narrows down the possibility of a bad meal or experience is I usually go to these review apps, click on the latest reviews and look for the last 5 to 10 reviews to see if I notice a negative trend , if you see things mentioned like bad attitude, bad service, the food was just OK I would eliminate those. I did have a lot of luck of just walking down side streets, finding a hole in the wall and having a delicious meal and then recommending that same restaurant to friends for them to have a bad meal lol! Anyhow, that’s my two cents. Enjoy yourself!\n￼"}, {"username": "Kath Milburn", "comment_text": "Book a food tour in Sorrento, they take you to all the authentic places."}, {"username": "Noel Flood", "comment_text": "Go where locals go .cheaper also"}, {"username": "Sherene Pipkorn", "comment_text": "Unfortunately there is nothing non touristy about the Amalfi coast and most definitely not about Capri. Capri is like a theme park"}, {"username": "Alice Francesca", "comment_text": "Le tre sorelle Positano, just on the beach.it s a family run restaurant.Exce\nllent food and I am Italian!\nOf course the Amalfi coast or Capri are very touristic, especially this time of the year"}, {"username": "Andrew Rubery", "comment_text": "My advice would be to stay away from restaurants on the main strip or in the main square. Try a trattoria (smaller cafe style restaurants) down a side alley. These are less visited by tourists, less expensive, and a more authentic Italian experience. In these places do not expect them to speak to you in English. Learn some Italian phrases. There is so much free resource on the internet that there is no excuse not being able to speak some Italian. Learn to say can I have a table for 2. Where is the bathroom. Can I have the bill please. Can I have another (glass of wine). A little Italian goes a long way. Trust me. Also use the Google translate camera app to translate the menu into English.\nLastly, avoid any restaurant that has pictures of the food outside the restaurant and or on the menu.\nAvoid Amalfi. It’s so touristy. Go to Sorrento. See Positano from the sea.\nAvoid Capri as it’s very expensive and touristy. Visit Ischia instead."}, {"username": "Colleen Sommerin", "comment_text": "Minori"}, {"username": "Luca Lookone Ferrentino", "comment_text": "I'm from the area.\n\nIn Amalfi \"trattoria da Gemma\"\nIn Capri \"da Giorgio al cucciolo\""}, {"username": "Joan Belserene Forcheski", "comment_text": "Minori is probably the least non touristy. Quaint, not over crowded & wonderful restaurants. Easy ferry access too. No steps."}, {"username": "Yolanda Frenkel", "comment_text": "Had a wonderful , unforgettable experience in Sorento, up on the stairs, small street to the right from the central street of the market. Have been there few years ago, hope it still exists."}, {"username": "S Christian Everett", "comment_text": "https://\nwww.casamele.com\n/\n\nIn Positano, not touristy but off the charts delicious!\n\nWe’ve been 4 times and it keeps getting better!\n\nThey are open for dinner & also have daytime cooking classes"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Everyone’s opinion on food is different, but look for those neat little small tucked away places !"}, {"username": "Stacy Prestigiacomo", "comment_text": "Maria Grazia and Ristorante del bona del capo had amazing food"}, {"username": "Matthew Livio Conti", "comment_text": "looking for 'non-toursity' food...in the most touristy places in the country. Want authentic? I'd go to a town you've never heard of - one that doesn't get tourists. You'll probably save half your money, have a great meal, meet real Italians, and help a restaurant that needs the business."}, {"username": "Noralis Rodríguez Coss", "comment_text": "Le grottelle in Capri. I’m still dreaming with their pasta con polpo. It was their special that day and I understand they are family owned."}, {"username": "Bernadette McKay", "comment_text": "Azzuro in Sorrento not strictly Amalfi Costa but most restaurants in Procida"}, {"username": "Peter Cetani", "comment_text": "Go 10 blocks away from the tourist area."}, {"username": "Priscilla Spyridis", "comment_text": "Quanto Basto Sorrento"}, {"username": "Sharon Milligan Martin", "comment_text": "We found the small outside tables on the water in Sorrento were very good. It is a walk down and then back up. If you can do it, it's with it."}, {"username": "Jason Esposito", "comment_text": "Hopefully you will get Sonja as server. Wonderful time\nCapri"}, {"username": "Giulia Cardamone", "comment_text": "Hotel Bonadies in RAVELLO\nGlorious rooftop restaurant. Second to few view. Exceptional traditional fare."}]}, {"id": "2200603363672075", "text": "Husband and I are heading to Italy in late September (1st time). We will be going from Lake Como to Cinque Terra to Finale Ligure to Milan using the train. Any advice/tips? Should we buy tickets ahead of time or at the stations?", "link": "facebook.com/groups/1373361046396315/permalink/2200603363672075/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Finale Ligure is ok but make sure you take the short bus trip to VARIGOTTI,10 minutes away.it s an old village without cars, on the beach, colofrul, quaint, and the sea is amazing.\nhttp://\nturismo.comunefi\nnaleligure.it/\nen/varigotti"}]}, {"id": "2200610420338036", "text": "Hello everyone. Looking at going to Lido Di Jeslo, in May 2024.....recommendations for hotels. TIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2200610420338036/", "likes": 0, "comments": [{"username": "Sue Gorman-Ellens", "comment_text": "Definitely Principe Palace on the piazza Mazzini. We have stayed a couple of times and it seems like many people return year after year. Some for over 20 years !The location is fantastic , cross the Piazza, two minutes down the street, and you’re at the beach, they have all their own sun lounges on a section of the beach that you don’t have to pay for. The food is amazing. We are vegan and the chef cooked us, fresh delicious, amazing food every evening. Some of the bathrooms in the rooms could do with a little update but I they everything you need and the rooms are cleaned and the sheets and towels are changed every single day. We￼ had a room facing the piazza which is good the rooms at the back just overlook the streets and although it’s noisy when there are things going off outside once your patio door is closed, the roads are quiet .￼There are lots of activities and entertainment on the piazza and you can sit and watch from the lovely bar area outside the hotel 😃"}]}, {"id": "2200618553670556", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2200618553670556/", "likes": 5, "comments": []}, {"id": "2200621020336976", "text": "Just returned from 8 days in Italy! Strongly recommend going to Sirmoine and enjoying Lake Garda. It was our favorite stretch of the entire trip! We got there by train at Desenzano stop and took a taxi.\n\nVeryआणखी walkable, lots of great shopping, cafes and restaurants. If you go there highly recommend splurging at Tavernetta Maria Callas for dinner!", "link": "facebook.com/groups/1373361046396315/permalink/2200621020336976/", "likes": 19, "comments": [{"username": "Alycia Morgan-Rsnmn", "comment_text": "Thanks. We have Lake Garda on our itinerary for next year’s trip!!"}, {"username": "Anita Clayton", "comment_text": "It's a lovely place."}, {"username": "Stefano Follador", "comment_text": "Sirmione is a Real gem."}, {"username": "Shelley Phillips", "comment_text": "Can you recommend a Good place to stay near there?"}, {"username": "Vitya Volkov", "comment_text": "It's a good choice."}]}, {"id": "2200622537003491", "text": "Hello my wonderful group! Would anyone have recommendations for tours in the Tuscany region visiting the beautiful smaller towns? We are spending 3 nights in Sienna and was hoping to explore the region and drink some good wine!", "link": "facebook.com/groups/1373361046396315/permalink/2200622537003491/", "likes": 1, "comments": [{"username": "Simone Pfenninger", "comment_text": "Val d'Orcia - Pienza, Montalcino, San Quirico, Bagno Vignoni"}, {"username": "Ana Ka", "comment_text": "We usually rent a car and travel ourselves… we loved Siena btw! The cathedral and frescoes in palazzo publico were out of this world. For tours we used appy guide video tour. It’s well paced, great voices and overall very interesting! As for tuscan town San Gimignano is a gem! Just make sure not to miss frescoes of saint fina at their duomo!"}, {"username": "JeriLynne Clifford", "comment_text": "We don’t drive in Italy. We hire drivers a few times here and there. While it might be a bit expensive it is less stressful, we don’t have to worry about drinking and driving and if you divide by the number of total days it ends up cheaper.\nHere is who we use.\n\nhttps://\nwww.montalcinowi\nnetours.com/"}]}, {"id": "2200634383668973", "text": "Where can we find the best gelato 🍨\nin Milan, Cinque Terre, Lake Como?", "link": "facebook.com/groups/1373361046396315/permalink/2200634383668973/", "likes": 0, "comments": [{"username": "Kirsty Manning", "comment_text": "I don’t know about best, but this one in Milan was pretty good!"}, {"username": "Jolie Carbone", "comment_text": "Milan:\n-Umberto very limited flavours but super good and authentic, old fashioned gelato. I reccomend the crema with raspberry sauce and whipped cream. The coffee packs a punch, it’s like a very strong espresso.\n-la gelateria della musica. A good stroll from the Navigli (use all the mosquito repellent you have, they’re brutal near the river) and it has a bit of a line. For good reason, it’s so good! I recommend the basil and lemon fiordilatte and the pistachio with salt."}, {"username": "Virgz Van Møøre", "comment_text": "Everywhere when they will be covered"}, {"username": "Lara Grom", "comment_text": "Pavè milano ciacco milano"}, {"username": "Mercedes Amaya", "comment_text": "Best gelato/ricotta cheese and fig 😋"}]}, {"id": "2200635633668848", "text": "Hi!\nWe are at Amalfi and trying to book a private boat tour for Amalfi coast.\nAny suggestions? TIA!!", "link": "facebook.com/groups/1373361046396315/permalink/2200635633668848/", "likes": 0, "comments": []}, {"id": "2200644530334625", "text": "We are planning a delayed honeymoon to Italy in November. Can anyone that has traveled during this time please let me know what you brought to wear? I was thinking a peacoat and sweaters. I want to be warm but don’t want to overdress. Is it too cold for long sleeved dresses and a coat?\n\nI have also included our current itinerary below.\nWhat wouldआणखी you recommend based on our current selections?? I’ve been dying to go to Amalfi Coast but I heard it’s pretty much shut down during this time of year but would still love to go if it’s worth it. Venice is our backup.\n\nRome - 2 days\nFlorence - 2 days\nAmalfi coast OR Venice - 2 days\n\nWhat are our best options for migrating between locations? Are there trains going to and from each destination? If you booked a separate transfer as well, do you have a recommendation on a company to go with?\n\nRecommendations on restaurants, tours, classes and sights also welcome💜💜\n\nThe rest of our trip will most likely be in Switzerland or Hungary.", "link": "facebook.com/groups/1373361046396315/permalink/2200644530334625/", "likes": 3, "comments": [{"username": "Lizzie Bretag", "comment_text": "When you say 2 days so you means 2 nights?"}, {"username": "Graham Sherlock", "comment_text": "Forget Amalfi, not worth it and not enough time, you barely have enough time as it is. Do Rome, Florence and Venice ... trains are best weather should be mild to cool, could get cold at night. Light layers are best and have an umbrella..... waterproof your shoes."}, {"username": "Kerri Armitage", "comment_text": "I went to Venice in December and didn't need a coat just wore a jumper dress"}, {"username": "Dave Conroy", "comment_text": "I'd stay North and miss Amalfi. You can use Trainline App or website to book trains easily. Some very fast trains are worth looking at, standard and first/business class depending on budget unless you like checking the scenery. Temperatures for different times of year in the different cities you visit can be checked via Google or a decent weather App. North will be colder than South but TBH hard to predict these days with climate change. Essentially, pack light but for variable weather, so low-weight layers and have a way of covering say legs and arms (tights and sweater maybe) for cold days. Always worth trying to stay carry-on bags only to cancel the risks of lost bags - particularly painful if you are also moving from city to city. Also, it helps to book an AirBnB or similar with a washing machine to minimise the need for overpacking and ease of getting on and off flights and trains and taxis and such."}, {"username": "Lisa Clancy", "comment_text": "High risk of aqua Alta in Venice in November, just be aware"}, {"username": "Lucrezia Folger", "comment_text": "Either Venice or Amalfi Coast, been to both in the winter. Bother are beautiful, nothing is shut down as Christmas shopping for shops is still needed. As far as comparing, you can't they are both magnificent, and one of a kind. As far as less time traveling, Doing, Rome, Florence and Venice makes more sense. Personally, with that short of time, I'd do Rome 4 days, Florence or Venice 2."}, {"username": "Steve Grossman", "comment_text": "Are you going to northern italy or southern Italy. It's a huge difference"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Loved a long extended November trip in Rome. A few days of rain…no problem. Will take that over heat and crowds. Amalfi Coast shuts down at end of October. Consider Florence over Rome and do Tuscany and day trip to Cinque Terre. Venice is magical for a Honeymoon spot. Have visited in both October and February."}, {"username": "Andria Saia", "comment_text": "It will be in the 60-70 degree range in the south - we have done Rome and the southern coast at Christmas and I describe it as “flip flop and sweater weather”😊"}, {"username": "Tonsia Keytel", "comment_text": "Have been told Cinque Terre is pretty much closed by that time of the year."}, {"username": "Laura Uribe", "comment_text": "We usually spend two months that ends the second week of November. It’s still fairly warm around that time. Only once have we been cold and that was one short night in Milan. Seldom have I had to wear anything more than jeans and a sweater if it’s a cooler day. And in 2019 I never even wore my slacks and long sleeve shirts. I wore shorts and tops right up to the day we left."}, {"username": "Miyuki Kanno Paul", "comment_text": "Amalfi coast is pretty much shut down by November"}, {"username": "Alexandra A Welker", "comment_text": "I visited Italy in the second half of November and traveled from Rome to Venice, Bologna, Florence then back to Rome. It was cold for me (I'm usually cold 😀) and it rained/\ndrizzled some of the time. I wore mostly sweaters, peacoats, scarves, jeans/corduroy pants and sometimes a hat."}]}, {"id": "2200641593668252", "text": "Arriving late to my hotel in Murano, prob around 7-8, are there still restaurants open in Murano open at that time? I heard they close early on Murano", "link": "facebook.com/groups/1373361046396315/permalink/2200641593668252/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200647207001024", "text": "First time in Rome this October. Looking for hotel suggestions priced well. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2200647207001024/", "likes": 1, "comments": [{"username": "Kevin Wilkins", "comment_text": "We stayed at Colonna Suite Del Corso and loved it. Very comfortable and in the perfect location!"}, {"username": "Debora A. Diaz", "comment_text": "Hotel Nazionale was very nice and I thought reasonable. Great location."}, {"username": "John Chesare", "comment_text": "We stayed here last month…very nice…"}, {"username": "Diana Granado", "comment_text": "Domus Australia, seems to have a personality on its own, reasonable price as well"}, {"username": "Annie Gerke", "comment_text": "Hotel triano was nice"}, {"username": "Diane Plott Miller", "comment_text": "Our travel agent uses Hotel Quirnale for her bookings. She said she has never received complaints about it."}, {"username": "Genevieve Bastien", "comment_text": "Bluehostel in Monti\nHost was amazing and recommended so many wonderful tips and restaurants\nHave a great trip !"}, {"username": "Janice Vaznonis", "comment_text": "In October-I’ll be staying here: Harry's Bar Trevi Hotel & Restaurant. Can view the Trevi Fountain from the roof top"}, {"username": "Lisa Marie Black", "comment_text": "Hotel Artemide"}, {"username": "Coll TC", "comment_text": "Residents Gonfalone- have stayed three times, lovely central apartments owned by a hotel, affordable, clean, fantastic"}, {"username": "Rich Graham", "comment_text": "Visit http://\nfattoriapoggioal\nloro.com/\n?lang=en"}]}, {"id": "2200649180334160", "text": "Looking for recommendations on what area to stay in Rome?I’ll be there 6 nights, looking for more local stuff .. neighborhoods, restaurants, cafes and such . I can travel to the big tourist attractions. Thank you !!!", "link": "facebook.com/groups/1373361046396315/permalink/2200649180334160/", "likes": 2, "comments": []}, {"id": "2200650537000691", "text": "Can someone please explain travel insurance? How do I get it when booking everything without travel agent ? What should I have covered ?", "link": "facebook.com/groups/1373361046396315/permalink/2200650537000691/", "likes": 1, "comments": [{"username": "Kit Nader", "comment_text": "Just go n to the net and do a search for travel insurance. Its not expensive. You can insure for anything. Cancellation of holiday .... loss of luggage etc. But most importantly insurance for accident and illhealth. Should yiu find yourself in hospital abroad you want insurance to cover those costs!"}, {"username": "Kay Rendall", "comment_text": "I Check on line for quotes, mainly with larger companies that I know and trust.\nCheck the fine print, like unlimited medical, total covered for, lost luggage, exclusions for pre-existing medical conditions, I pay extra to be covered. Hire cars , sports etc. Just do a lot of research, even very expensive ones can cover very little.\nSome credit cards offer free travel insurance, if whole trip booked on them. Can be high excess, or age restrictions."}, {"username": "Leslie BC", "comment_text": "Go to Allianz web site to book. They're excellent and I always use them when I travel anywhere"}, {"username": "Terry Pisano", "comment_text": "Squaremouth.com\n. You can side by side compare many policies and pick the one that best meets your needs and pricepoint."}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "There are many to choose from but this is the one that I went with for me self and family.\n\nhttps://\nwww.imglobal.com\n/"}, {"username": "Tricia Wisehart", "comment_text": "You can buy through Triple A."}, {"username": "Voula Ladas", "comment_text": "You go about it like everything else you do when planning a trip. Do the research, and act accordingly. Go online and organise a quote with at least a couple of companies. Everyone’s quote will be different in accordance to your age, health cover requirements , things you want covered , and activities you want to do in your chosen destination. It’s super easy. It’s not cheap, but it definitely gives you some peace of mind. Hopefully you won’t need to use it."}, {"username": "Richelle Trezise", "comment_text": "Google travel insurance, the type country leaving and countries going, when leaving and day arriving back,the choose the best one for the price. Unlimited medical is a must and Unlimited cancellation plus covid cover very simple. Most important have it in place the day you start booking everything"}, {"username": "Lisa Martinson", "comment_text": "Call Allianz & get an annual policy if you travel often."}, {"username": "Annette Mayer", "comment_text": "We will only use Alianz based on experience . Look on line and chose what best suits you but make sure you take medical evacuation"}, {"username": "Brooke Summerville", "comment_text": "Some debit cards include travel insurance. See what your bank has to offer. What country do you live in?"}, {"username": "Carlie Lee", "comment_text": "I’m an agent and would be happy to book it for you."}]}, {"id": "2200652430333835", "text": "Thanks everyone for the helpful information on this site. We have booked 10 day car hire in mid September through Alamo direct as we are picking up in Dubrovnik and dropping car in Trieste (Italy). Cross border charge was very reasonable as I emailed Alamo direct for confirmation - but car hire for a very small car was AUD1200. I see posts on hereआणखी where car hire is as little as Euro12 a day which is a huge difference to our booking. Am wondering what sites these cheaper rentals are booked through? Any recommendations would be really helpful. We haven’t paid for our car or provided credit card details yet, so can change if needed. Thanks again and gave a great day 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2200652430333835/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "You will not get cheaper rates because crossing border and besides croatia isnt given any better rates in case you rent one town and return in other thousand of km away."}, {"username": "Lloyd Davies", "comment_text": "We booked a small car automatic through SixT for 18 days in Italy. $4000 AUD. Ridiculous."}, {"username": "Jann Kinsela", "comment_text": "Not much better looking at Hertz AU. Trying to get a vehicle for 4 adults with 4 bags- hell."}, {"username": "Melanie Matthews Stuprich", "comment_text": "I have rented many cars in Italy and I have never seen 12/per day. If you do find that, it probably doesn’t come with miles or it’s a horrible company. I think what you got is very reasonable and the going rate. Stick with that and a reputable company."}, {"username": "Msk Away", "comment_text": "OMG how exciting!!!!"}]}, {"id": "2200650707000674", "text": "Looking for recommendations on location to stay in Rome. We would like to be walkable to all attractions. Is there a particular neighborhood you could recommend I focus my search?", "link": "facebook.com/groups/1373361046396315/permalink/2200650707000674/", "likes": 2, "comments": [{"username": "Kevin Wilkins", "comment_text": "We stayed at Colonna Suite Del Corso, near the Pantheon, perfect location! We walked everywhere 🙂"}, {"username": "Penny Bellofatto Westberry", "comment_text": "We enjoyed the W"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "City center/\nhistoric district."}]}, {"id": "2200653227000422", "text": "Has anyone here used a tour company. Not necessarily guided tours but where they plan an itinerary that you approve and they arrange everything for you from that point forward? Especially if you are a first time visitor.", "link": "facebook.com/groups/1373361046396315/permalink/2200653227000422/", "likes": 3, "comments": [{"username": "Andy Burns", "comment_text": "Following for a guided tour company."}, {"username": "Angela Marsala-Gaydos", "comment_text": "I’d be interested in that type of tour"}, {"username": "Rhonda Russell", "comment_text": "Have used a few and they were amazing. Trafalgar, Insight and Bunnick have brilliant tours. Everything is taken care of, accommodation, entrance fees most meals. They have guides and you also get free time to explore."}, {"username": "Barbara Was", "comment_text": "We have planned a trip to Rome, Calabria, and Sicily this September/\nOctober with JayWay travel. Daniel has been excellent with suggestions and arranging hotels, train tickets, drivers and tours. Each suggestion can be altered as desired.\nWe have been to Italy many times over the years. I have always done my own planning. This was just much easier and hopefully will be as good as I am expecting."}, {"username": "Thressa Oliver", "comment_text": "Just did perillo\nTop notch!!"}, {"username": "Cassandra Goodgame", "comment_text": "I did for my first trip to Italy on my 50th birthday. Used Audley Travel and they arranged everything from hotels to private drivers to vineyard tours, etc. Pricey but fantastic!"}, {"username": "Wendy Harrison", "comment_text": "I would imagine this type of bespoke tour, especially if accompanied, would be very expensive in Italy. We've done similar in SE Asia and in Peru where it was a relative bargain."}, {"username": "Lydia Springer", "comment_text": "We are going to use Butlers Bus Tours - a company that was recommended on this site. They'll set up everything for you or just the vehicle and driver/guide. I've communicated with them and like them a lot. We are selecting our itinerary and accommodations and they're doing the rest. They will accommodate any size group (we are three)."}, {"username": "Stacy Derouin", "comment_text": "We have a travel agent that we worked with to create a wonderful trip. Ron was wonderful in guiding us through his recommendations\nfor flights, intercountry transportation and accommodations in the cities we wanted to visit within the budget we wanted. Perfect if you don't want to do all the legwork yourself, but aren't interested in group tours."}, {"username": "Elena Elkind", "comment_text": "Second trafalgar!"}, {"username": "Sharon Menegoni", "comment_text": "I have been to Italy twice with Trafalgar and had a wonderful time on each trip!"}, {"username": "Donna Mangone", "comment_text": "Always travel through an agency."}, {"username": "Patty Stadulis-Hagan", "comment_text": "I am a travel advisor, and we work closely with great vendors to meet your needs and price point! Patty's Life Without Regrets Travel"}, {"username": "Lori Hagen", "comment_text": "We are going to go that route. You don't pay them, they get paid from the places that they book for us. You have complete final say and they will follow your budget. It just seems to be the way to go if it's your first time. They are extremely knowledgeable too."}]}, {"id": "2200658360333242", "text": "Can someone explain whether buying an Italy rail pass is worth it, if you still have to pay for a seat reservation on most high speed trains? Would it not be the same to just boom point to point? Can I get advice from people that have used the passes. And, can they be used on regional trains? Just weighing up whether to buy a rail pass.", "link": "facebook.com/groups/1373361046396315/permalink/2200658360333242/", "likes": 1, "comments": [{"username": "Marissa McLean", "comment_text": "I have never bought an Italy rail pass, I don’t find it worth the money, I just book the cheapest trains I can find. I’m also a budget traveller, but that’s just my personal opinion on the passes"}, {"username": "Blanca Gil", "comment_text": "Italian trains are very inexpensive. You can buy point to point tickets on Trenitalia - prices vary by class and usually not a huge difference. Even traveling from France or Germany to Italy, I have not used a rail pass because I didn’t see the savings."}]}, {"id": "2200660240333054", "text": "We are touring Italy for a week before our cruise. What is the weather to be expected the first week of November? What is the best areas to explore and ones to avoid this time of year?\nAny advice, tips and tricks are appreciated! Grazie! 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2200660240333054/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "Might be rainy. Not cold yet (around 10°C)."}]}, {"id": "2200660446999700", "text": "Could I please have some recommendations for a nice restaurant in Sorrento, Italy", "link": "facebook.com/groups/1373361046396315/permalink/2200660446999700/", "likes": 4, "comments": [{"username": "Victor Segovia Jr.", "comment_text": "Tasso"}, {"username": "Cheryl Gorfinkle", "comment_text": "IL BUCO"}, {"username": "Tara Roed", "comment_text": "Small and casual but very good food and we went no problem with a reservation - Piennolo Land Food. We also ate at semola one night when we were tired…it was right next to our hotel. It’s basically just pasta but done very well. Enjoyed it a lot"}, {"username": "Donna Napoli", "comment_text": "Donna Sofia"}, {"username": "Barbara Asaro Sciuto", "comment_text": "Restorante Zi Ntonio and Trattoria Antica"}, {"username": "Kally Trahearn", "comment_text": "Depends on what you call nice. My favourite restaurant in Sorrento was not a fancy place. It's called La Cantinaccia del Popolo. Look at the comments on TripAdvisor. You cannot book ahead, you have to go there and wait for a table suitable for the size of your party. If you don't want to wait too long, go at 6.30pm and you should be one of the first to be seated when they open at 7pm. Locals eat there, it's got a small but perfectly formed menu, great service and 3 types of complimentary limoncello on offer after you've eaten. And it was the cheapest meal we had by far.\n\nFauno Bar in Piazza Tasso is also quite nice. Not anything too exciting, but lovely all the same, with great service and a great place to people watch."}, {"username": "Billie Begley", "comment_text": "Billie Begley"}, {"username": "Billie Begley", "comment_text": "Can’t say enough about O Parruchhiano. It is 100 years old and in a lemon orchard. Prices were decent."}, {"username": "Billie Begley", "comment_text": "You have to book in advance."}, {"username": "Teresa Marina", "comment_text": "I really enjoyed d’Antonio"}, {"username": "Julie Tran", "comment_text": "Cucu! Highly recommended its a mutual friend's of mine who owns it"}, {"username": "Patti Warren", "comment_text": "Here are recommendations\nfrom our host. We loved Da Emilia’s on the Marina and Semola:\n\nRestaurants\n1) Zi n’tonio\n2) il parrucchiano\n3)Kebab Ciampa ( kebab made in an Italian way\n4) fuoro\n5) abate\n6) semola ( good pasta)\n7) da franco (pizza)\n😎 inn bufalito ( good mozzarella di bufala and meat\n9) Trattoria dei mori\n\nMarina grande restaurants\n1) da emilia ( cheap and good)\n2) soul and fish ( very good)\n3) il delfino ( expensive but very good)\n\nIce cream shops\n1) Da David\n2) Raki\n3) primavera"}, {"username": "Geoff Roush", "comment_text": "Zi Ntonio is the best"}, {"username": "Stephanie Collier", "comment_text": "Opaŕruchiano , la Fenice and Giginos are my favourites"}, {"username": "Andrew Mircovich", "comment_text": "Taverna Allegra , Cafe Latino and Zi Ntonio Al have great food and very reasonably priced"}, {"username": "Jill Edgington", "comment_text": "TavernAllegra Sorrento is beautiful and delicious with wonderful people!"}]}, {"id": "2200749740324104", "text": "Just wondering if it’s easier and more economical to purchase a hair straightener with - 230 V in Rome ( or anywhere else in Italy as we are touring around).\n\nI was confused thinking I could still use our Canadian hair straightener over there with some sort of adapter but I was mistaken.\n\nAny tips where I could purchase it in Rome and approximate cost so I know I’m not being gouged .\nTIA 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2200749740324104/", "likes": 2, "comments": [{"username": "Benedetta Vanni", "comment_text": "Specialised department stores: Media World, Trony, Euronics, ...\nBe aware that temperature settings will be in Celsius degrees"}, {"username": "Fran Nelson", "comment_text": "I found a dual voltage one here (USA) that took abroad. Read the labels carefully. It was not a expensive. Also check Amazon."}, {"username": "Virginia Lane", "comment_text": "I’d purchase a dual voltage off Amazon. I’d rather do that then search for one on vacation."}, {"username": "Patty Beemer", "comment_text": "My CHI brand irons are dual voltage. I thought they all were nowadays. Check on the power supply."}, {"username": "Bea Kuckens", "comment_text": "Tool Science makes a good flat iron for about $50, dual voltage, available on Amazon. Use with regular adapter (American to European). Get before you go, be ready to roll upon arrival, don't waste time shopping for a flat iron."}, {"username": "Cindy Neal Norvell", "comment_text": "I actually bought a nice one in Ireland some years back for about $25. It was in one of their pharmacy/drug stores. I knew it would be completely safe for future trips."}, {"username": "Joyce Blackburn", "comment_text": "Or bring converter to use current one"}, {"username": "Sue Ellen Thomas", "comment_text": "Buy dual voltage in states that way you can use it back home as well. Just be sure to switch it back when you return."}, {"username": "Laura DeCicco", "comment_text": "€20 at a drug store in Rome."}, {"username": "Alyssa Brown-Ruiz", "comment_text": "I bought a converter and mine still fried!! Don’t risk it if you have a good/expensive straightener. Ended up buying one in a drugstore (in Germany, but I know they’re available most places!! Cheaper than US too)."}, {"username": "Stephanie Power", "comment_text": "I’m in Italy right now now and have been using my straightener with an adapter. So far so good"}, {"username": "Sonia Read", "comment_text": "Michael Strijder see i should just leave mine at home......"}, {"username": "Michelle Rooney", "comment_text": "I believe the cheaper straightners like Target or Kmart work not ghd ones🙃"}, {"username": "Isabelle Panagapka", "comment_text": "I bought a dual voltage one on Amazon before our trip. I used it once the whole time since with the extreme heat/humidity, I had to tie my hair up constantly, and couldn't bother with how it looked lol"}, {"username": "Bianca D'Amore", "comment_text": "I purchased a curling iron in a pharmacy in Rome. It was €16 and honestly it works better than any of my American ones lol."}, {"username": "Pilar Vasallo", "comment_text": "Erika your exact question. Read comments."}]}, {"id": "2200786370320441", "text": "We are taking a day trip from Sorrento to Capri on Aug12z How full are the ferries there and back? Any other tips are welcome.", "link": "facebook.com/groups/1373361046396315/permalink/2200786370320441/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Did read somewhere that August 12th is public holiday. Ferries will probably run, but may be fewer...More busy."}, {"username": "Genevieve Bastien", "comment_text": "Pré book through Ferry Hopper and then it’s super easy\nYou go to the ticket office to print your tickets once there (try 25 mins prior to departure)\nDon’t be concerned if line ups\nIt goes super fast and so worth it"}, {"username": "Nicki Gill", "comment_text": "Thanks for the info!"}]}, {"id": "2200814450317633", "text": "Our fantastic trip to Naples and Pompeii 😍", "link": "facebook.com/groups/1373361046396315/permalink/2200814450317633/", "likes": 3, "comments": []}, {"id": "2200679086997836", "text": "Re: Venice. Has anyone docked on a cruise ship in Trieste? How did you get 1) into Venice or 2) to the airport?", "link": "facebook.com/groups/1373361046396315/permalink/2200679086997836/", "likes": 1, "comments": []}, {"id": "2200683126997432", "text": "Looking to visit Italy next year- thinking of Sorrento area but can be influenced otherwise. Time around June. Is there a location without crowds? I hate tourists and crowds but since it’s my first time visiting I need to stick with more well known areas. Thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2200683126997432/", "likes": 1, "comments": [{"username": "Jaime Cleek", "comment_text": "You’re going to be a tourist. 😀 I think a super popular destination may be crowded. June is pretty busy for tourism. We are going on august to Sorrento for a few days and only booked because we found a great villa."}, {"username": "Giovanni Pianigiani", "comment_text": "Agree with Jamie: just search here, at least one every 3 posts is about Sorrento/\nAmalfi (and the area is relatively small) expect tons of tourists, especially in that time of the year"}, {"username": "Karen Schmidt", "comment_text": "My husband is not a big crowd person. We are going to Ischia instead. Lots of places off the beaten track."}, {"username": "Andrea Bourke", "comment_text": "We are currently in praiano half way between amalfi and positano absolutely loving it as not crazy busy and views are amazing"}, {"username": "Renae Larcus", "comment_text": "It starts getting busy in June wherever you are in Italy. That being said, I love Sorrento as a base."}, {"username": "Phyllis Snyder", "comment_text": "June is a very bust tourist month- but Sorrento, will be busy, is a lovely town and easy access Amalfi coastal towns. If you want beach towns and less tourists look into the other coastal towns on the Adriatic Sea. Or beach towns above the cinque terre- Liguria region."}]}, {"id": "2200686656997079", "text": "So has anyone in USA received any updates on the new visa requirements being established for the EU in 2024?", "link": "facebook.com/groups/1373361046396315/permalink/2200686656997079/", "likes": 0, "comments": [{"username": "Kathryn Healy", "comment_text": "It’s just an online ETIAS form, not a visa. $8 USD. Kids are free."}, {"username": "Penny Bellofatto Westberry", "comment_text": "And they keep pushing the start date off..."}, {"username": "Shelley Perelmuth Sperling", "comment_text": "Still can’t do it online. Signed up for updates"}, {"username": "Gillian O'Callaghan", "comment_text": "The changes are semi global so a lot more countries than just US. Scheme has been getting postponed annually starting in 2021."}, {"username": "Victoria Moorhead Murrow", "comment_text": "Don’t worry about it. It probably won’t even happen next year."}]}, {"id": "2200686893663722", "text": "Thinking about staying in Ischia. Any recommendations for places to stay?", "link": "facebook.com/groups/1373361046396315/permalink/2200686893663722/", "likes": 2, "comments": []}, {"id": "2200699126995832", "text": "Has anyone done this dinner in Tuscany? https://www.getyourguide.com/san-gimignano-l527/tuscany-romantic-vineyard-dinner-experience-t170682?lang=en&_pc=1,2&date_from=2023-09-08- and if so, is it hard to get to San Gimignano from Florence without a car?", "link": "facebook.com/groups/1373361046396315/permalink/2200699126995832/", "likes": 21, "comments": [{"username": "Marc Spiegel", "comment_text": "Following...."}, {"username": "Brenda Kelley Reese", "comment_text": "Following"}, {"username": "Heather Sechrist", "comment_text": "We did not do the evening dinner. We did the afternoon lunch in AC. However they were setting this up as we left and it looked beautiful. If it is anything like the lunch, there are five courses and big helpings. Come hungry! The wine was good too. 😉"}, {"username": "Nancy Brennan Carrow", "comment_text": "Jodi Brennan sharing for your upcoming trip."}, {"username": "Honor Mathieson", "comment_text": "Looks great! Love the romantic part of having dinner with loads of other people!"}, {"username": "Naomi Collado", "comment_text": "Now I wanna do this!!!!"}, {"username": "Bill Shafer", "comment_text": "I’m booking this!!!"}, {"username": "Charise Addicks", "comment_text": "I’m really sorry, but I went there for lunch and the food was terrible. Almost inedible. Their wine is fine, totally drinkable, but the food was not. It’s very touristy."}, {"username": "Carolyn Laemmle", "comment_text": "If only"}, {"username": "Wendi Dusseault", "comment_text": "We did! Celebrated a milestone birthday with my entire family there! It was magical. Cannot recommend enough!!!"}, {"username": "Frank Borba", "comment_text": "We did this, they moved us indoors into the tasting room for dinner without notifying us beforehand, which isn’t the experience we wanted or paid for. The grounds were very pretty and the wine was fine but the food was not good at all. Cold lasagna with over cooked pasta. When we brought up our concerns to the general manager, he was almost dismissive and tried to romanticize it. “It’s okay, you have all this wine and good company, what more can you ask for?”"}, {"username": "Maud Palmen", "comment_text": "Michael Sloen"}]}, {"id": "2200697453662666", "text": "Looking for a place to get a custom leather jacket", "link": "facebook.com/groups/1373361046396315/permalink/2200697453662666/", "likes": 0, "comments": [{"username": "Anthony Sperduti", "comment_text": "Florence"}]}, {"id": "2200696326996112", "text": "Hi, we are flying into Catania September 12 and leaving from Palermo on the 24th. We are thinking of going to Ortigia first then hiring a car to visit south east Noto etc. We have to be back in Taormina by Sept 21. Any suggestions for the middle of our trip? Would like to possibly see Stromboli. 2 adults and 2 young teens. Many thanks for your suggestions 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2200696326996112/", "likes": 0, "comments": []}, {"id": "2200704700328608", "text": "Does anyone have an opinion on Hotel Perla in Bologna? or ... looking for a recommendation for a hotel or apartment, 2 weeks, from 6 Sept, center of Bologna ... thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2200704700328608/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200707020328376", "text": "On our way from Lanciano to Rome, I chose a place I never heard of to just explore and have fun. Has anyone been to L’Aquila? Suggestions? We will only be there one day. Grazie!!", "link": "facebook.com/groups/1373361046396315/permalink/2200707020328376/", "likes": 0, "comments": [{"username": "Deanna Hinsz", "comment_text": "My mom was born there and I still have family there. I will be going as well for the first time to visit. I don't believe it's very touristy at all. We will be visiting Fontecchio, which is in L'Aquila- it's a small, medieval village."}]}, {"id": "2200705170328561", "text": "I want to go the Vatican and Colosseum on the same day. Which should I do in the morning and which is best for the evening time?", "link": "facebook.com/groups/1373361046396315/permalink/2200705170328561/", "likes": 0, "comments": [{"username": "Connie Wilson", "comment_text": "That is a lot to see in one day, but if you must, visit Vatican first and Colosseum later in the evening."}]}, {"id": "2200711836994561", "text": "Long shot, but has anyone done an ebike tour from Ortisei? Any recommendations for a fairly easy but scenic ride, 4-6 hours? There's so many different routes/options, and so far the websites I've looked atआणखी aren't very informative. I found one good one (clear info, at least), but they only go on certain days and our dates don't match up. Thx!", "link": "facebook.com/groups/1373361046396315/permalink/2200711836994561/", "likes": 2, "comments": []}, {"id": "2200713820327696", "text": "Looking for a nice side down restaurant to eat at in Naples. Doesn’t have to be fancy.", "link": "facebook.com/groups/1373361046396315/permalink/2200713820327696/", "likes": 0, "comments": []}, {"id": "2200718290327249", "text": "Is it really cold in Florence at the end of November?", "link": "facebook.com/groups/1373361046396315/permalink/2200718290327249/", "likes": 4, "comments": [{"username": "Michelle Casillas", "comment_text": "Depends on what really cold is to you. During the day my children and I wore jeans and a sweater but needed a jacket at night. Some nights were brisk enough to need a beanie as well. My husband however was in jeans a t-shirt during the day and then a jacket at night."}, {"username": "Frank Hunt", "comment_text": "Yes"}, {"username": "Gemma DeVoldre", "comment_text": "Yes"}, {"username": "Ewa Kolodziej", "comment_text": "Yes , sometimes snow too and rain"}, {"username": "Simone Miglietta", "comment_text": "Around 10/15 degrees during the day. In November it could rain but absolutely not snow"}, {"username": "Nicola Ramoso", "comment_text": "Naaah, and you can always cover yourself up more"}, {"username": "Diane Hamilton", "comment_text": "We’re going first time mid November\nSuper excited 🇮🇹"}, {"username": "Cindy Hall", "comment_text": "Last year in December- on Christmas Day- we were sitting outside in the sun without coats on having lunch in Piazza della Signoria in Florence."}, {"username": "Phyllis Snyder", "comment_text": "January & February are colder."}, {"username": "Lynn Francisco Casella", "comment_text": "CA weather starts cooling off Med climate"}, {"username": "Jill Rosenfeld", "comment_text": "No it was beautiful last november"}, {"username": "Betsy Kirkhope", "comment_text": "I had to buy a real coat"}, {"username": "Debora A. Diaz", "comment_text": "Last year in mid November it was 60’s during the day and 40’s at night. It was good for a lot of walking."}, {"username": "Odalis Chavarria Mancera", "comment_text": "My husband and I were in Italy for our honeymoon last December and the weather was amazing! He wore jeans and t-shirts the entire time and I wore leggings and long sleeve tops and that was enough. Sometimes a little too warm for long sleeves but we run hot"}, {"username": "Romina Lauretig Toscano", "comment_text": "No"}]}, {"id": "2200718526993892", "text": "So, I know wine is really big over there, but what are some other cocktails that we can try?", "link": "facebook.com/groups/1373361046396315/permalink/2200718526993892/", "likes": 104, "comments": [{"username": "John Rodriguez", "comment_text": "I can’t even count how many Aperol Spritz I’ve had! This that heat that killed the dinosaurs! Lol"}, {"username": "Rita Levi Montalbano", "comment_text": "Spritz"}, {"username": "Toni Quatrini Bannister", "comment_text": "I had a peach Bellini and a strawberry Bellini."}, {"username": "Kristina Ruk", "comment_text": "AperolSpritz is rather popular, but its good if you like bitter tastes..and btw go and try different and you will know which you like ;)"}, {"username": "Pat Shimalla", "comment_text": "Vodka tonic with a lime"}, {"username": "Michelle Smith", "comment_text": "Aperol spritz, limoncello,"}, {"username": "Hollie Barcheck Juersivich", "comment_text": "Apreol Spritz"}, {"username": "Paola Bobko", "comment_text": "Aperol spritz, limoncello spritz, Negroni, Bellini, gin tonic with Malfy lemon gin. And as a digestive Amaro del Capo 🙂"}, {"username": "Vanessa O'Donnell", "comment_text": "Aperol spritz, Hugo… there are many options."}, {"username": "Payal Sharma Madan", "comment_text": "Negroni, Spritz, Hugo, Grappa, Limoncello, Bellini...whate\nver you can spot on the menu!"}, {"username": "Vince N Cindy Erno", "comment_text": "I lived in Italy for a few years and my experience was they make a great Aperol but don’t ask for a margarita or anything else. Grappa is very strong, lemon cello is a must after dinner digestive. An Italian after dinner staple."}, {"username": "Krissy DaRusso", "comment_text": "Everyone will tell you the Aperol Spritz but I’m going to recommend the Hugo Spritz. It’s a bit lighter and I find it really refreshing. I’m not a huge drinker but I’m getting about two of these down a day."}, {"username": "Rose Marie", "comment_text": "Limoncello"}, {"username": "Melissa Doran", "comment_text": "Limoncello spritz is my new favorite! It taste like lemonade, which is dangerous because you don’t taste the alcohol. So yummy!"}, {"username": "Julia Ruby", "comment_text": "Martini Bianco"}, {"username": "Sandra Kent", "comment_text": "Pina colda"}, {"username": "Reshma De Cruze", "comment_text": "Aperol Spritz and Mojitos"}, {"username": "Jan Grube Christiansen", "comment_text": "You can get all the drinks and cocktails that you also can get in the US, plus so much more ! 😊"}, {"username": "Angie Mattin", "comment_text": "Spritz of any sort! Limoncello spritz, Hugo spritz, coconut spritz, Campari spritz, Aperol spritz… 😍"}, {"username": "Steve Savva", "comment_text": "Aperitivo spritz is big, really if and great with the snacks they offer you"}, {"username": "Anne Carroll", "comment_text": "A Negroni is an Italian cocktail, made of one part gin, one part vermouth rosso and one part Campari, garnished with orange peel. It is considered an apéritif. A traditionally made Negroni is stirred, not shaken; it is built over ice in an old-fashioned or rocks glass and garnished with a slice of orange. Very nice too!!"}, {"username": "Daria Dandolo", "comment_text": "Everything with bergamot."}, {"username": "Teresa Vozza", "comment_text": "Limoncello Spritz"}, {"username": "Teresa Vozza", "comment_text": "Limoncello Spritz"}, {"username": "Christa Anne", "comment_text": "Our friends - who are from Italy and always have been (as in non-expats) and who all have equivalent to master's degrees or higher and eat fine food drank \"sex on the beach\" when we went out after dinner! 🤣🤣🤣 we were laughing at them. My partner who is 1/2 Italian and myself drank spritz's, lots of vino and amaro. We were in Roma, Bologna and Genova for the most part."}, {"username": "Teresa Vozza", "comment_text": "Peroni beer"}, {"username": "Deborah Coram", "comment_text": "Down south they make the most delicious version of an Aperol Spritz, called a Salerno Spritz. It is made with Dry Ginger rather than Soda and has Rosemary, fresh ginger and toasted cinnamon stick in it! Like OMG!"}, {"username": "Shirley Nicholls", "comment_text": "Aperol Spritz"}, {"username": "Christine Ashton", "comment_text": "Hugo spritz!"}, {"username": "Dixie Kotylak", "comment_text": "Aperol spritz is my new fave drink in Italy! ❤️❤️👌🏻"}, {"username": "Lydia Reginelli Marlow", "comment_text": "Aperol Spritz is really popular there"}, {"username": "Josette Legris Hughes", "comment_text": "Prosecco, limoncello"}, {"username": "Dan Carr", "comment_text": "Grappa"}, {"username": "Lori Harrison", "comment_text": "Also try a Hugo, so delicious!!"}, {"username": "Vince N Cindy Erno", "comment_text": "Aperol spritz is the summer cocktail of Italy."}, {"username": "Suzie LG", "comment_text": "Aperol Spritz"}, {"username": "Clarissa Rava", "comment_text": "Negroni if you want something strong. Aperol spritz if you want something easy"}, {"username": "Katie White-Meade", "comment_text": "Limoncello"}, {"username": "Gelinda De Grandi", "comment_text": "If you like bitter taste, I suggest americano, or negroni! Or spritz with cynar"}, {"username": "Èirinn Kelly", "comment_text": "Gin"}, {"username": "Michelle L Williamson", "comment_text": "Limoncello"}]}, {"id": "2200722433660168", "text": "Folks, we are planning a one day trip to Naples & Pompeii...my itinerary has Autostrada del Sole as the mode of transport from Rome to Naples....is it possible to do it comfortably in a day or is it a stretch? Also please advise the most efficient mode of transport...train or coach? Thanks a ton!!", "link": "facebook.com/groups/1373361046396315/permalink/2200722433660168/", "likes": 0, "comments": [{"username": "Dave Conroy", "comment_text": "Fast train, change to normal train at naples central direct to Pompeii. Check Maps and trainline for options."}, {"username": "Irene Oda", "comment_text": "I would split into two days. Naples has so much to see and experience. It's a gritty city for sure. But my goodness the art work, churches, museums, street foods as well as regular experiences. People watching is fun. Naples is a very unique city."}]}, {"id": "2200723670326711", "text": "We plan to travel to Italy in October 2024. Has anyone used Bologna as a base? What is the best way to get around without a car?", "link": "facebook.com/groups/1373361046396315/permalink/2200723670326711/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "There's a ton of posts about trains in this group. Just look for them."}]}, {"id": "2200722560326822", "text": "Must eat restaurants in Rome? Would prefer options that are not super “touristy”. 🙂 Will be there next week!!", "link": "facebook.com/groups/1373361046396315/permalink/2200722560326822/", "likes": 1, "comments": []}, {"id": "2200728050326273", "text": "How is the weather in May? Rome, Florence, Venice.", "link": "facebook.com/groups/1373361046396315/permalink/2200728050326273/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "Excellent. Sunny but noy hot yet. Make sure you wear sunscreen and sunglasses every day."}]}, {"id": "2200738396991905", "text": "Need advice .. Heading to Croatia for 7 nights then flying into Rome. I have 6 night to make my way up to Zurich by train to fly home.\nI’m want to experience northern Italy a little . Where shoud I stay ! Florence ? Milan with a tour to lake Cuomo Maybe end my visit explore Zurich?", "link": "facebook.com/groups/1373361046396315/permalink/2200738396991905/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "Milan is closest to Lake Como"}]}, {"id": "2200741596991585", "text": "Hi. My husband and I are planning to go to Europe, London, Italy and France\nDo we need visa for any of these countries? (American passport)\nTy.", "link": "facebook.com/groups/1373361046396315/permalink/2200741596991585/", "likes": 1, "comments": [{"username": "Allison Mir", "comment_text": "Not at the moment. Could change next year"}]}, {"id": "2200739100325168", "text": "Hi, for Venice our accommodations are not on the island. Is it easy to get across?", "link": "facebook.com/groups/1373361046396315/permalink/2200739100325168/", "likes": 0, "comments": []}, {"id": "2200750550324023", "text": "We are going on a cruise in September leaving from Rome and returning to Rome. We have the first few days all set thanks to comments and suggestions here but what would you do on your last day in Italy if you were flying out of Rome airport early the next morning? Where would you stay? What would you do? What one thing would make your last day unforgettable?", "link": "facebook.com/groups/1373361046396315/permalink/2200750550324023/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "Enquire about \"parco archeologico di ostia\": it's a very rich excavation site of roman ruins, close to the seaside and the airport."}]}, {"id": "2200763590322719", "text": "Going to Italy for the first time in 2 months, 9/28-10/16. Any recommendations for clothing then. Will it still be warm? Most of the clothes I plan to take are on the cooler side, but could be layered with a light jacket or sweater? We will be in Rome, Sorrento, Florence and Milan.", "link": "facebook.com/groups/1373361046396315/permalink/2200763590322719/", "likes": 8, "comments": [{"username": "Kay Rendall", "comment_text": "Sorrento, Amalfi can be chilly in the evenings.\nOften in a woollen sweater, scarf jacket, slacks in Positano at dinner that time yr. Will be back October 2023, can't wait."}, {"username": "Lucrezia Folger", "comment_text": "I'm sorry to make this suggestion, but googling past years can be helpful, more helpful than other peoples guess. When I have gone that time of year it is still quite warm."}, {"username": "Nancy Jones Bruscino", "comment_text": "We stayed in Umbria at that time of the year. It was gorgeous weather. Mostly 70’s and cooler evenings."}, {"username": "Marie Cuzzi", "comment_text": "It’s usually mid 70’s during the day mid 60”s at night\nPerfect weather"}, {"username": "Sherry Gilliam Patrell", "comment_text": "We were there last year at that time and it was very warm. I wore short sleeve dresses the entire time. I think only once did I wear a sweater and it was because my dress was sleeveless and we were going into churches. This is coming from a Michigan girl though, so high 60's - mid 70's is considered very warm to me ."}, {"username": "Erica Senes Tombesi", "comment_text": "It's usally still warm.\nPs remember that in Italy we use Days/months/\nyear, just in case!"}, {"username": "Valerie Collanton", "comment_text": "I would bring layers. I went to Florence, Capri and Rome last year around the same time and it was still in the high 70s, low to mid-80s. But it can get cool. So a light jacket that you can wear a sweater under would probably work best. I would not bring a heavy jacket."}, {"username": "Jenny Payne", "comment_text": "Very warm, I wear only linen silk,cotton & if you stay in airb&b take those washing sheets ( size of a tissue) rather then going to buy liquid, often people leave washing powder behind. wear the best sneakers & sandals in the world ( lots of walking) crossbody bag🌻"}]}, {"id": "2200767270322351", "text": "Any restaurant recommendations for Como? We are there tomorrow.", "link": "facebook.com/groups/1373361046396315/permalink/2200767270322351/", "likes": 0, "comments": [{"username": "Geraldo Prioriello", "comment_text": "Geraldo Prioriello"}]}, {"id": "2200767346989010", "text": "Hello I’m new here. Planning to surprise my mom with a trip to Italy in 2024. She’s in her 70’s so mobility is a bit of a concern for us, as she can’t walk very far in 1 shot.\n\nI have no idea where to begin planning this bucket list trip for her. Shes waited her whole life to go. She’d love to see Rome and the Vatican and I want to see Venice andआणखी maybe see Naples since that where her grandparents were born.\n\nI’d like to know when the best time of year to go would be and if there are tours that cater to seniors by supplying scooters or something she can get around in.", "link": "facebook.com/groups/1373361046396315/permalink/2200767346989010/", "likes": 5, "comments": [{"username": "Dave Conroy", "comment_text": "I'd go October to have less heat and crowds. I'd do less but use 'honest' pay via app taxis to get around. I'd focus on her interests. Stay as much as reasonable in one place to avoid the hassle of packing and unpacking. I would definitely get her views on interests and such rather than guess. The fast train to naples is a good option if you want to stay there 2 or 3 days."}, {"username": "Jenny Payne", "comment_text": "I go to Italy twice a year and I’m taking a friend in October, nice (usually) I have been going for 16 years to Italy so what I would do arrive in Rome have a few days (jet lag) I’m from Australia so it’s 23hours so I usually have 3 days, train to Naples (fast train I use Italo company ask for seniors discount and not much difference in 1st and economy (from memory, I was there in February). Stay , I’m sure you will have family to sort out that for you. Then I would take the fast train to Florence or go straight to Venice. I’m 72yrs old and the thing I tell everyone try and get really fit then have the best walking shoes ( wear them in) cross body bag with a few zips & don’t take the world . I have a backpack, cross body bag and cabin size case. 🌻"}, {"username": "Kristen De Landre", "comment_text": "What a lovely thing to do! 😊 Look at golf cart tours and I have read they do a special tour at the Vatican on train or something, search that? Or maybe someone has done that and will share their info. Enjoy."}, {"username": "Francoise Coupal", "comment_text": "I believe you can rent scooters in Rome. There is also the golf cart tour of Rome, that you and your mother might like. If you take any trains, check out Saler blue as they offer support for those with mobility issues. They will take you to your train and you can buy your ticket through them. They are located in the main train stations."}, {"username": "Pilar Vasallo", "comment_text": "What are beautiful place to visit with mom. Have fun and know that you’ll need new Visas starting in 2024."}, {"username": "Tracy Foss", "comment_text": "Not sure what your budget is private drivers tours might be the way to go. Definitely golf cart tours I have booked in Rome & Florence &go in late October less crowds warm but not hot. I'm sure she will be happy to be there & whatever you manage to see will be perfect in her eyes❤️"}, {"username": "Eva McLean", "comment_text": "Sept/Oct/Apr/\nMay are probably good times in order to avoid excessive heat and craziness of tourists.\n\nDefinitely google ‘tours of Rome for seniors’ or tours of ‘’Vatican’, Venice’, ‘’Naples’ or ‘any￼where else you’d like to go’ for seniors.\n\nKeep in mind these tours might not be ‘your’ ideal but I promise you they’ll be worth it if your mom feels loved.\n\nI’ve been traveling 50+ years (since before my 20’s). Many different kinds of trips, a few different travel partners ….\n\nNow, as I approach 70 myself and reflect on my own travels, the trips I took with my mom\nduring HER 70’s are always the first ones to come to mind. I would not trade one minute of those memories for anything else …."}, {"username": "Liz Cooper", "comment_text": "I was there last year at 80. I rented a place in Rome and stayed nearly a month. I was in Monti district close to all kinds of transport. I walked to the Colosseum and to wonderful churches, some very old and three of the major basilicas including the glorious Santa Maria Maggiore. I walked to Termini station. I took the metro to other places . Everyone was friendly and helpful. My cane kept me steady on the sometimes rough surfaces.\n\nYou could easily take fast trains to Naples, Venice and Rome.\n\nKeep luggage really minimal so you can lift it onto trains.\n\nHave fun."}, {"username": "Louisa Curvelo", "comment_text": "October for sure, golf cart tours"}, {"username": "Laura Uribe", "comment_text": "Venice may be a challenge due to the stairs up and down for the multitude of bridges. Be sure wherever you stay has an elevator and that it goes to all floors. There are a lot of buildings without them. Also, the ground floor is zero. The first floor is one story up. Read the reviews diligently so you don’t get an unpleasant surprise. Even with all this diligence, we still ended up in a 3rd floor walk up in Venice because they “upgraded” us. We had originally planned on only having to climb up one story.\nHope you have a wonderful time!"}, {"username": "Maureen DiNatale Johnson", "comment_text": "I was there in May & used a transport chair . We did the golf cart tour which was a wonderful overview of all the major sites. I also booked a wheelchair tour of the Vatican using my transport chair. It was 1 on 1 (my husband came also). It was about 3 hrs & a great overview . The tour guide was excellent & had access to elevators etc. & was very accommodating."}]}, {"id": "2200768800322198", "text": "Doria Grand Hotel, Milan any information on this hotel?\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2200768800322198/", "likes": 0, "comments": []}, {"id": "2200769403655471", "text": "Best ideas for 24h in San Gimignano?", "link": "facebook.com/groups/1373361046396315/permalink/2200769403655471/", "likes": 0, "comments": [{"username": "La Cinzia", "comment_text": "Visit Volterra, very near to San Gimignano"}, {"username": "Vince N Cindy Erno", "comment_text": "Enjoy the amazing Duomo. The food wasn’t my favorite…. But the views and shops are great."}, {"username": "Vince N Cindy Erno", "comment_text": "Ur also close to Florence, depending on your translation"}]}, {"id": "2200773986988346", "text": "We are arriving in Rome from California at noon (nonstop red eye). Am I crazy for wanting to do a golf cart tour that evening? Hotel check in is 2 and they would pick up there at either 3 or 730. The kicker is that I will have a 5 and 8 year old with me. If it helps, I’m not worried about the 8 year old, he runs on fumes and prayer, and the youngerआणखी has lower sleep needs in general too, just not as low as him. 730 feels too late but maybe even the 3 is too much.. I just thought it would be a nice intro, a way to maximize time, and a cool thing to do to keep everyone alert to bedtime. Thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2200773986988346/", "likes": 23, "comments": [{"username": "Susan Lowry Lamb", "comment_text": "I never plan anything big the arrival day. I never know how good any of us might be feeling."}, {"username": "Lori Knackstedt", "comment_text": "A strategy that works very well for us and our children is to check into the hotel, take a three hour nap and then go explore the city for several hours to get on the right time zone . ￼"}, {"username": "Lisa Valdovinos", "comment_text": "We flew to Rome nonstop from CA on United. It was over night. We landed dropped off our luggage and explored the area. I’m not sure how it would be with the kids."}, {"username": "Celeste Marflak", "comment_text": "We did the golf cart tour out first day in Rome & it was the perfect thing for us. The guide (Achilles) was fun & knowledge. Great way to see city. The children should love it. Not sure which time would suit your family best but we did later one. All adults in our group. Enjoy"}, {"username": "Jamie Derrick Moore", "comment_text": "We are doing the golf cart tour the day of arrival. Figured it would be a good way to see some sights without having to walk ourselves since we’ll likely be tired. We also only have 2 nights in Rome so have to maximize our time. Do what you feel is best - everyone travels differently!"}, {"username": "Ben Poupard", "comment_text": "My second time in Rome, just arrived yesterday. We spent the first day acclimating to the time change.\n\nThe most beneficial thing we did was explore our neighborhood. We found a supermarket, grabbed some coffee, then gelato, then an enoteca, and a few restaurants that interested is.\n\nIt will be different enough to be stimulating without pushing you or the kids past their comfort level, plus you'd be a short walk from your stay if you need to cut it short and nap!"}, {"username": "Wendy Spano Bracco", "comment_text": "If your flights delayed that’s the only issue. Otherwise I don’t see an issue with it."}, {"username": "Debi Sicurella Krulisky", "comment_text": "Exactly what we are doing 💜"}, {"username": "Andrea Ferretti- Kearney", "comment_text": "California to rome non stop? Jet lag is real! I’d rather just explore the city and walk around the first night. It’s insanely busy in Rome and it can be overwhelming."}, {"username": "Allison McAdam", "comment_text": "We (with 16 year old son) did the SFO-Rome nonstop last month and then a 5pm golf cart tour - it was great!!"}, {"username": "Joseph Pisaniello", "comment_text": "Coming from west coast your behind about 9 hrs give yourself sometime to recupe you will appreciate the nxt day"}, {"username": "Bea Kuckens", "comment_text": "We usually get settled in to our lodging, get some basic supplies, scout out places to eat, etc. It's \"Zombie Day\" for us, just trying to stay up until about 9:00 p.m. to get our bodies adjusted to local time. Everyone is different with sleeping on the plane (we basically can't) and jet lag. The kids will probably sleep fine and be raring to go ;)"}, {"username": "Rita Sanza", "comment_text": "I've just left Italy. 3.00 in the afternoon it's just to hot at the moment. The last 4 weeks have been so hot I almost got sick. Could not go out before 8 or early in the morning. Make sure you all drink lots of water. And enjoy your holiday"}, {"username": "Sara Silence", "comment_text": "730 absolutely."}, {"username": "Kathy Griffith Fish", "comment_text": "I think the 3 is a good idea because the best thing to do is stay busy the first day, then go to bed a little early (like 9 for adults). Then you feel pretty good and acclimated the next day."}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "I remember someone posting that they were eliminating golf cart tours."}, {"username": "Michelle Hebert Frederick", "comment_text": "I’ve seen several comments that it is best the hit the ground running when you arrive. I guess kinda wear yourself out completely so you sleep well the first night and adjust better with less jet lag. I have no clue or experience, just repeating what I’ve read."}, {"username": "Debra Lang", "comment_text": "We are going to Italy in September and scheduled a golf cart tour just a few hours after arrival where they pick us up at our AirBnB. Felt like it would be a good way to get our bearings without having to walk. I think you should do it, kids and all."}, {"username": "Jenny Clough", "comment_text": "We were in rome for 2 days. We did 15k and 18k steps! Make sure your kiddos have good shoes!\n\nI took an overnight flight and took sleeping medicine. I would give the kids melatonin or benadryl to help them sleep. That being said, we were pretty tired. We walked about a mile to get food and sites on the way, then went to the hotel and passed out!\n\nI highly recommend any tour that has a guide to give you the amazing history."}, {"username": "Lorie Olychuck", "comment_text": "Crazy."}, {"username": "Sutheree Lovell", "comment_text": "Golf cart tours? I'm intrigued?"}, {"username": "Kathy Smith", "comment_text": "I booked a tour the day we arrived then got hit with a 5 hour flight delay and I was out that money so I wouldn’t book anything next time so close to arrival. I did a golf cart tour a couple of weeks ago and it was the best. I highly recommend."}, {"username": "Jane Eichhorn", "comment_text": "As adults we’d manage it. 3:00. Put it in perspective. That’s if all your flights go off in time and there’s no luggage problems."}, {"username": "Lisa Webb Bruce", "comment_text": "I would suggest 3 pm"}, {"username": "Jennifer Tarin", "comment_text": "I would choose the 7:30 in case there are delays with your flight or customs. Better safe than sorry"}, {"username": "Nina Aggarwal", "comment_text": "Definitely not enjoyable the day of arrival - we traveled to europe from California and even acclimated on the east coast for a few days so our time difference was only 6 hrs - you don’t necessarily sleep well on the plane and it hits you suddenly and kids can get cranky when exhausted. We found it easier to adjust with an earlier bedtime the first day ( 6 pm) and the kids slept 12 hrs straight lol so they really were exhausted! But it made getting up earlier easier for following days."}, {"username": "Mindy Grossman Sepinuck", "comment_text": "Can anyone recommend a nice hotel with breakfast? Also, if they had airport transfers that would be great too! Thank you!"}, {"username": "Elena Eckley", "comment_text": "Nap 😴 and then go. You’ll be on PT. Enjoy"}, {"username": "Julie Koziol", "comment_text": "Their sleep requirements makes me smile. My boy was like that too! He never slept a whole night until he was in nursery school. Removal from grandma’s mandatory afternoon naps did it."}, {"username": "Alexandra A Welker", "comment_text": "Go for it, the 3pm schedule, that's one way to get acclimated to the time difference."}, {"username": "Diana Sideris", "comment_text": "We did that\nIt was a nice way to see Rome and the kids loved the golf cart. You can also customize it . We were tired by the end of it but it was better than walking around and helped with the time change for us and maximized our time"}, {"username": "Marissa McLean", "comment_text": "Personally I think the best intro to any city is to just walk around the neighbourhood on your own, no tours just get situated, especially on the day of arrival it’s no fun to start the trip off with go go go. Check into your hotel, Relax, wander around, find a cute cafe or restaurant and familiarize yourself w the area"}, {"username": "Reagan Bramston", "comment_text": "Would not organise anything on your arrival day. Wonder around & get your bearings, find somewhere to eat.... why start with a go go go itinery... what if your plane is late, kids tired, sick etc unforseen crap always happens."}, {"username": "Donna Ley Mitchell", "comment_text": "Too much for the kids"}, {"username": "Tracy Foss", "comment_text": "I'm doing the same thing ! But we are 2 older adults & I know the best way to conquer jet lag is try to adjust to the time change ASAP . However that being said only you know your children maybe they can fall asleep on the cart if need be ? We were in Paris years ago & my oldest didn't adjust well the first 2 days were a nightmare . Have a great trip I guess go with the flow"}, {"username": "Lucrezia Folger", "comment_text": "What airline is non-stop from Ca? I can’t find one from any airport."}, {"username": "Chrystal Stevens Bisonet", "comment_text": "I wouldn’t plan anything the first day, in case of flight delays."}, {"username": "Lynn Dye Shell", "comment_text": "Yes, do the golf cart tour. We loved the one we did. The kids will enjoy riding on it and you can see so much without walking in the heat. It’s a great way to acclimate yourself to the city."}, {"username": "Stacy Derouin", "comment_text": "We always hit the ground running-it helps us get over jet lag faster, even when our son was young. I'd absolutely do it."}, {"username": "Laura Uribe", "comment_text": "You are likely going to be exhausted and ready for bed by 7. I can’t count how many times we have settled for cheese and crackers rather than wait for a restaurant to open. A good night sleep and you have minimal or no jet lag the next day."}, {"username": "Coco Cole", "comment_text": "Do it!!"}, {"username": "Kim Butler Oam", "comment_text": "I’d do the 7.30 so you can all have a rest and eat. A golf cart ride is a great way to get orientated when you first arrive, I didn’t know about them or I would have done that, I usually take the hop on hop off bus first thing and find it’s great, though in Rome you can just roam around everywhere and find wonderful pc’s of history wherever you go.\n\nI’d be worried you’d all fall asleep taking the 3 pm ride 😂😂."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "I think it’s great to do it when you get there - but if anything happens with your flight, it will stink."}, {"username": "Phyllis Snyder", "comment_text": "I think it’s a good idea! Or just walk on your own."}, {"username": "Kathy Flood", "comment_text": "Do the earlier one."}, {"username": "Anne Sarno-mcilwrath", "comment_text": "100% do it"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Do the later one. It will be cooler and you will have time to relax after your long flight."}, {"username": "Bonnie Loftspring", "comment_text": "I knw they say don’t do this BUT this works for me & the many people who do it this way. Hotel NAP while drowsy & groggy, then off you go Ready to adjust to new time. This works, honest. I only do it this way"}, {"username": "Lori Imhoff", "comment_text": "We hit the ground running with a 3 hour bicycle tour!"}, {"username": "Debbie Jones Schilling", "comment_text": "That sounds fun. Do you get to drive the golf cart or are you a passenger? More info on where to book please."}, {"username": "Suzy Palmer", "comment_text": "We’re doing the same thing but chose an evening golf cart tour just in case there’s a delay with flights. We figured we could get situated, freshen up, and then take the tour. We also thought it would be fun at night."}, {"username": "Jeff McLellan", "comment_text": "I would do it the following day and just wander around trying to stay awake the first evening."}, {"username": "Patricia Turner", "comment_text": "Do it! We did an e bike night tour the day we arrived and it was so fun and a great way to see the city. We were not tired after a day of travel and throughly enjoyed it! But that’s my family and we love to pack in as much as possible!"}, {"username": "Gina Gallardo Tolomeo", "comment_text": "We did this and it worked out fine for us. Afternoon golf cart tour that we wanted was not available so we did the 7:30 tour. It was perfect. Mind you it was my husband and I and are 12 yo son so I can’t speak for how it will work for your littlest. Note: we did end up napping for 2 hours in early afternoon. This helped us. Good luck!"}, {"username": "Marty Harte", "comment_text": "Here now with 16 and 17 yr olds. Flew overnight NYC, Landed 8:30 Roman time. First day walked Spanish steps and around various parts of rome. I’d think with younger kids the golf cart is a great idea if you think they’ll be up to it after the long flight."}, {"username": "Karin Hoffner Gilbert", "comment_text": "My daughter and I are arriving at 730 am, and our golf cart tour is at noon!! I thought it would be a perfect introduction to the city, then we would have a better idea as to where we want to go later and the next day"}, {"username": "Bridget Gieseke", "comment_text": "Don’t plan anything the day you arrive. Get to your hotel, get situated, wander around near the hotel and figure out where things are. Get some dinner and get some sleep… and be raring to go the next day.\nYou will be exhausted, kids will be exhausted, it will be hot and there a good chance your flight could be delayed. My personal preference is never plan anything, day of arrival, when traveling anywhere."}, {"username": "Sue Kinsey", "comment_text": "We did a golf cart tour the first night and it was great - gave us a good overview. 3:00 is too early, you need to allow for flight delays."}, {"username": "Carolyne O'Hagan", "comment_text": "For the adults I'd say yes. But only you know your kids. You have to consider whether it would not be a great experience if the kiddos are too tired. I'm from Ireland and remember trips to Disney where my kids were overtired and it wasn't pleasant. We did Italy last year with my sister and brother who flew in from States in the morning. We all stayed going until about 10pm that night."}, {"username": "Sylvie Hogg Murphy", "comment_text": "Everyone here makes a good point! I’ve been traveling to Rome on those overnight flights from CA and the east coast for years, and I have had success with the both the hit-the-ground-\nrunning / early dinner / early-ish bedtime approach as well as the afternoon-nap / early evening stroll / normal Roman dinner time approach. It also depends on how much time you will have in Rome overall, which kind of dictates how okay you are going to feel about not having something in place that first day. I personally think golf cart tours in Rome or anywhere are a really good way to get an overview and orientation without having to think about anything or deal with reading a map. Anyway you slice it, you *will* be tired that first day and the less you have to get your brain in gear to be in charge of leading the family around, the better it will be! My advice is to let someone else take the wheel—book the golf cart tour for 7:30 and grab a nap and shower at the hotel in the blazing hot afternoon. Gives you some wiggle room too vs the 3pm in case the flight is delayed. I would definitely make sure the tour can include some stops for pizza and gelato as we all know keeping the kids (and yourselves) fed will be key to everyone’s success! Then, to bed, and you’ll be in good shape adjusting to the time change. The golf cart tours also cover a lot more ground than the typical radius of what you can realistically explore on foot, such as the Aventine keyhole, the big fountain on the Janiculum, etc. Hope this helps!"}, {"username": "Elizabeth Yu", "comment_text": "I wonder what the weather forecast is for tomorrow. I just looked it up. It’ll be pretty warm at around 3 pm, like close to 90 degrees."}, {"username": "Allison Taeger Wilson", "comment_text": "We loved our golf cart tour - great idea to keep up and active your first day. It's the best way to overcome jetlag!"}, {"username": "Mindy Svoboda Seering", "comment_text": "Having just finished our Rome and Greece trip(we started at Chicago), I enjoyed the travel day without excursions. Everyone is tired. We were a 7 hour change and it was 7:30 AM in Rome when we landed. I traveled with 17 and 20 year old. We looked around when we first got there and relaxed in the afternoon and dinner and bed. Then ready to go the next day. I think a tour that day would have ruined our 2 week trip with that packed in the beginning"}, {"username": "Joanne Diaz", "comment_text": "We hit the ground running. A golf cart tour is really nice, you get to see so much. Have fun"}, {"username": "Nancy Day", "comment_text": "I'm planning a trip in spring (no kids 3 senior ladies)but thought we would do golf cart tour arrival date too.Seems logical and gives you a good overview ,I think kids would enjoy it and keep them interested for awhile without having to completely exhaust them with walking after the flight...just an opinion"}, {"username": "Mary Anne", "comment_text": "I’d be cautious about a 3.00 booking. Any delays and you’ll miss it."}, {"username": "Paul Stewart", "comment_text": "I personally never book anything for the day of arrival. There are too many variables, late flights, baggage issues etc. That way if you are a few hours late it’s no big deal"}, {"username": "Lisa Kelly", "comment_text": "Do it! We arrived in Heathrow at noon and had a layover/flight to Rome, getting us to Rome at 9:00 pm. We went out to dinner. We slept about 2 hours on the overnight flight. It’ll be great!"}, {"username": "Kristyn Carpenter", "comment_text": "We did a golf cart tour at 2pm last week. It was a great way to beat the heat with some shade and the breeze from the cart. Highly recommend!"}, {"username": "Graham Sherlock", "comment_text": "Do it, do the later one though in the evening, evenings are so much nicer than the heat of the day"}, {"username": "Sue Sherwood", "comment_text": "I would do the later. Stay up late and sleep in. Get rid of the jet leg."}, {"username": "Thelma Gipson", "comment_text": "You will be exhausted, specially traveling with kiddos."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200774966988248", "text": "I leave for my trip on Sunday!!! My husband only wanted 1 night in Florence and I’m struggling with planning the city with so little time. Our train from Venice gets us to Florence around 11am and we leave at 11am the following day. We are staying just outside the city. What is best to experience in my 24 hours??", "link": "facebook.com/groups/1373361046396315/permalink/2200774966988248/", "likes": 11, "comments": [{"username": "Barbara Bastianini", "comment_text": "With such an inadequate time in Florence why would you stay outside the city? Staying in the center would at at least have allowed you to maximize your time there by letting you get a better feel for this amazing place. Waking up early to discover Florence during her morning hush is a real treat. Watching a sunset from the Piazalle Michelangelo and then wandering the night time streets is also a great experience. Since you’ve chosen to stay in a place that might preclude these wonderfully charming experiences & on top of that only scheduled a single day there I question how much you’ll gain by going.\n\nYou’ll be rushing around too\nmuch during your single day trying to include too much in too\nfew hours to really enjoy anything. With such a short time there I question if you’ll be able to absorb even the slightest bit of the unique charm and atmosphere of one of the best cities in Italy. Florence is capable of seeping into your soul & enriching you. But you have to give it half a chance to do so.\n\nIt’s too late now to rethink your planned itinerary. So at this point you’ll just have to live with the plans you’ve already made. No one can do everything on any one trip, so on this trip all you’ll get is a glimpse of Florence. Look at what Florence has to offer and try to do the one or two things that most appeal to you. Then move on to your next destination\n\nSince your husband insisted on one day there you should have him plan out the day. Take the stress off yourself and let him deal with this decision he made."}, {"username": "Bill Casper", "comment_text": "One day is better than nothing. Book a day tour to take in all the main sites and no need to listen to the negative people on here."}, {"username": "Patty Beemer", "comment_text": "If at all possible, at least change your reservation to something in town. That way, you can see everything on foot and go to your room to take a breather now and then."}, {"username": "Rachael Richardson", "comment_text": "You can go all the main sights in that time you maybe just won’t be able to go in to museums etc , it’s quite a small town so walkable\nGo and see the Duomo, pointe vecchio , the view from piazzle Michelangelo\nThen go to the wine window down borgo san frediano\nThen maybe boboli gardens?"}, {"username": "Carey Matthews", "comment_text": "Walk the city. Relax, enjoy."}, {"username": "Chrystal Stevens Bisonet", "comment_text": "Just make the most of your time! 24 hrs is better than nothing. Way to compromise with your husband. 😊\nBook Accademia to see the David upon arrival. Then, visit the Duomo and mercato centrale and ponte vecchio.\nAlso might want to check out tours on Airbnb experiences."}, {"username": "Laura Uribe", "comment_text": "Duomo and David at Accademia. Short walk in between. Otherwise walking and enjoy the city."}, {"username": "Jennifer Cederholm-Wasescha", "comment_text": "If you only have 1 day do the tourist bus"}, {"username": "Ken Lerch", "comment_text": "Wow. Where to start? I’m torn between saying that you should skip Florence altogether or try to meet the challenge. But here goes. First, staying outside of town is a mistake. Getting there and returning to town will eat up time. And you can’t enjoy the night. Florence is a museum and church city. Do you care about these things? Do you care about the Renaissance? If yes, do the Academia/\nUffici/Duomo Museum group with walks through town. If you don’t care about this stuff, stay outside: climb the campanile, go to P. Michelangelo, eat big meals, cycle down the river. All you’re gonna get is a taste. Make it a good one."}, {"username": "Dana Green", "comment_text": "Ugh. Did you reserve David or Uffizi Tix? If not, go to the Duomo and Ponte Vecchio."}, {"username": "Carla Haigh", "comment_text": "We spent a day in Florence now it was busy but we did the cathedral and dome. Went to see the bridge with the shops in and went to the square with fake David and Santa Croce. We did want to go and see the real David but you really need to book to go there. Then we walked around the food market before getting the train back to Lucca.\n\nWe are thinking of going back soon to see Florence again. But it just wonder around the streets and actually go over the other side of the bridge with the shops on it. We just didn’t have time the first time around. We did what we could when we where there."}, {"username": "Anita Gopal Pharand", "comment_text": "What about booking a tour of the city. They will bring you to the must sees."}, {"username": "Charleen Siegler Schuss", "comment_text": "See David and walk around, get lost, pop into the Duomo"}, {"username": "Lisa Zarlingo Smith", "comment_text": "If I only had one day I'd start at the Central Market, have lunch and walk around, pre book skip the line tickets to the Accademia Gallery early afternoon and see David, leave there and walk to the Doumo because it's AMAZING (even if you only see the outside) , head to Piazza della Signoria for a good look around (maybe get a gelato) and most certainly end the day at Piazza Michelangelo for the amazing sunset. I'd eat dinner in Oltramo because we found better food and prices in that neighborhood."}, {"username": "Andrea Jane Whittington", "comment_text": "Try World Trail scavenger hunt, takes you round all places of historic and cultural significance whilst informing you on the way and you also pass many eateries and drinking poo spots."}, {"username": "Ian Fawkner", "comment_text": "Rule of thumb - always do two nights in every place - otherwise you are ‘out on the street’ at 10 am every time - with luggage if you cannot store them - no fun"}, {"username": "Steve Grossman", "comment_text": "First of all, you're outside of the city, so you're gonna start at one p m. Go to viator and catch the afternoon no line viewing of david and the Cathedral.\nAfter that walk the center city and go to the ponta vecchio. Then go have a great dinner . you can do with just about every restaurant. Then get ready to leave the city."}, {"username": "Martine Huguet-Latour", "comment_text": "In one day i would see the Accademia, lunch at All'Antico Vinaio , walk to ponte Vecchio, eat in Santo Spirito ( Gusto pizza) then go watch the sunset at piazza Michaelangelo while drinking a Prosseco ! 😉😍"}, {"username": "Ειρήνη Δεγρέση", "comment_text": "Take the Hip-Hop bus. Stop at Piazzale MichelAngelo and see the whole city from there. A walk at the banks of Arno, Ponte Vecchio and there you are in Piazza della Signoria. Take a coffee in Piazza della Rpepubblica, in cafe Gilli, maybe, one of the oldest in Europe. If you are not an art scholar why spend half a day to admire Davide in Galleria? So many copies of it around the city, you can not tell the difference. You are visiting a city, you don't take exams. Enough with Florence and its fallacies."}, {"username": "Lenora Faustino", "comment_text": "I've seen some clever plans in the comments. My two cents would be to find a place to store your luggage for the day upon arrival. Then head to lunch at the San Lorenzo market. If you can, find a bike tour that will take you to the main sights. Then walk, walk, walk as much as you can to get a feel for the incredible vibe of the city. I have been to Florence so many times and I still have not been to either the Uffizi or the Academia 😬 because whenever I get to Florence, I just want to explore the city and not be in a museum all day. One day, I will do it though. If you have a chance to get into one of the main churches (Duomo, Santa Croce or Santa Maria Novella), go for it... they're as beautiful inside as they are outside. Then pick up your luggage and head up to piazza Michelangelo at sunset before checking into your hotel. And make sure to have a good ice cream before you leave."}, {"username": "John Selvaggio", "comment_text": "Go see the Duomo, have a gelato then go to the Piazza Michelangelo, see the replica of David and take a panorama picture of Florence. Walk thru Pompei in sweltering heat, go home and watch \"The Medici\" series on Netflix and see why you should have visited Florence. Hopefully your husband will watch tv. Speaking of that, I'd watch a 15 minute YouTube on Pompei, and if I couldn't stay in Florence, I'd go to the springs in Saturnia instead!\nhttps://\nwww.google.com/\nsearch?client=sa\nfari&hl=en-us&q\n=saturnia&tbm=i\nsch&source=lnms\n&sa=X&ved=2ahUK\nEwjAn4y1_K-AAxU\nVATQIHSytBRMQ0p\nQJegQIDBAB&biw=\n430&bih=732&dpr\n=3#imgrc=Gs_Ump\nZxMsNr5M&imgdii\n=WhHS5q9PVoJwOM"}, {"username": "Jen Alexitch Rachow", "comment_text": "One day is a short time but I suggest head towards the Duomo, check out the Academia-see the David go through the Ufizzi and visit Mercato Centrale. And of course get some Gelato. Also the sunset on one of the Arno bridges is pretty nice. That is about as much as you can do in one day"}, {"username": "Margorie Madrid", "comment_text": "I was in Florence 2 days and I wish I would have stayed at least 3 😩 not enough time for such a beautiful city"}, {"username": "Jann Kinsela", "comment_text": "With such limited time I would store my luggage at the train station and buy skip the line or a Florence Pass - with timed entries- pick your bags up after a day of touring and then check into the hotel."}, {"username": "Shari Osborn Klarich", "comment_text": "One night doesn’t even give you one full day. Two nights gives you only one day. I’m speaking from experience. Your minimum should be three full days, which means four nights."}, {"username": "Megan Leigh", "comment_text": "😂🤣😂 Goodness! This is the least helpful thread of comments ever, lol. \"Leave your husband\" (even though obviously in jest) & \"spend more time\" & \"change your accomdations\" aren't helpful for someone who is leaving in 2 days & plans are set. Just answer the question of how one might best spend 8 hrs in the city if that is all the time they have this trip."}, {"username": "Marianella Flynn-Morales", "comment_text": "In such a beautiful city put YOUR happiness first. Being a wife and mother many sacrifices made, for this one fill your cup first and you’ll be happy you did."}, {"username": "Stephanie Gibson", "comment_text": "Segway tour and cooking class"}, {"username": "Susan Vogel", "comment_text": "Book direct for David with a set time .\n\nIf you want U can book direct for the uffuzi gallery u can also add in - pitti palace and boboli gardens as they have a deal for the 3 together. Or separate . Or skip it .\n\nwalk- eat shop ."}, {"username": "Olga Pasfield", "comment_text": "I'd do the Jop on, Hop off bus"}, {"username": "Dave Conroy", "comment_text": "Ditch the husband and stay longer 😂"}, {"username": "Shelley Bowen Glassman", "comment_text": "For sure go see the sunset"}, {"username": "Linda Tibbles", "comment_text": "This is difficult to get much in if you are staying outside city. Try to book a walking tour to do."}, {"username": "Benedetta Vanni", "comment_text": "Palazzo Pitti and Giardino di Boboli."}, {"username": "Jamie Bly", "comment_text": "Hirer Maria through your local tour guide. Expensive but you’ll get to see all the highlights of Florence in 6-7hrs. She was a life savor for us."}, {"username": "Peter Morgan", "comment_text": "After 1 day in Florence, your husband should just go, anywhere, and you should remain in Florence ( preferably for a week)\nThere might be something wrong with your husband if he thinks one day in Florence is enough. It’s not.\nHow long have you had him ??"}, {"username": "Penny Williams", "comment_text": "Honestly, I would just walk around the central part of Florence and take it all in. Include the Duomo, the Ponte Vecchio, the Uffizzi, all easily walkable from the train station. Stay very near the station."}, {"username": "Bonnie Scoullar", "comment_text": "Well I certainly wouldn't let my husband make all the vacation decisions.\nCompromise .... Tell him you want to stay for a week and then compromise to 3 or 4 days."}, {"username": "Julie Levin", "comment_text": "Golf cart tour - you'll hit all the big things in just about 2 hours and then you can have the rest of the time to wander wherever you like."}, {"username": "Dann Hrusch", "comment_text": "Duomo, Accademia and Ponte Vecchio."}, {"username": "Victoria Moorhead Murrow", "comment_text": "You need more than 24 hours in one of the most beautiful and important Italian cities."}, {"username": "Gena Diaco Penland", "comment_text": "We did a golf cart tour and that was a great way to see the city!"}, {"username": "Kate Piszczek", "comment_text": "Why donu need to listen your housband😵‍💫 just stay longer ,one day even one week is not enought 🤷‍♀️"}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "#1 thing to do is get skip the line tickets for the Accademia to see The David. Schedule the rest of your time around that, including taking a walking tour of some sort or just wander with a good map to hit some of the highlights of interest to you. Rick Steves guide has good info/maps. Finally, schedule a food tour for the evening where you'll get a chance to taste a variety of local specialties from several different places (rather than just one restaurant) and get a bit more on the history and culture of the city along the way. You'll be amazed at what you can fit into 24 hours with some good planning. Have fun!"}, {"username": "Debra Fergison Canova", "comment_text": "1 day is not enough"}, {"username": "Randy Webb", "comment_text": "You will regret if you miss Accademia Gallery of Florence (Galleria dell'Accademia di Firenze).."}, {"username": "Eric Parks", "comment_text": "Wait, husbands can do that?? ((Flips thru Husband Manual))"}, {"username": "Linda Snaring", "comment_text": "My favourite was seeing David, but we ￼ bought our tickets months ahead of time. The line was so long!!!!"}, {"username": "Cecilia Mejias", "comment_text": "With so many people visiting and with the heat you might be ready to move on after 24 hrs.\nI would just get the ticket for the Galleria, visit Ponte Vecchio, do a walking tour and enjoy a fantastic gelato"}, {"username": "Diana Smith", "comment_text": "Just walk around and enjoy your day…:))"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "One week in Florence is not enough. Can you move days from other towns. If your going to Venice for more then two days move some from there."}, {"username": "Lucrezia Folger", "comment_text": "Nothing, don’t schedule a thing. Walk and explore on your own for the short time you have."}, {"username": "Lana Watson Famiano", "comment_text": "IMO you don’t want to miss The David."}, {"username": "Billy Nash", "comment_text": "It will be extremely crowded and the lines yesterday around the Duomo where ridiculous. Get up at 6am and enjoy the city before the masses get up…."}, {"username": "Bianca Hillier", "comment_text": "Florence has been my favourite city by far in all of Italy!! Book visits to galleries asap if you’re only here for a day as they sell out quite quickly! You must go to the gallery which the statue of David and the Uffizzi gallery! Piazzale Michelangelo for sunset and just get lost in the city 🤍 I didn’t find the inside of the cathedral that amazing (I wouldnt of waited 1.5 hours in line if I had known) but found the outside breathtaking! Walking tour definitely if you’re only here for 24 hours!"}]}, {"id": "2200776380321440", "text": "I will be coming to Milan, Cinque Terra and Venice the last week of October and first week of November. Are their any nice hot springs within easy reach? I’m not planning on renting a car unless it makes sense to. I’d also love to stay at an agriturismo with a good experience for teens for a couple nights if you have any recommendations.", "link": "facebook.com/groups/1373361046396315/permalink/2200776380321440/", "likes": 0, "comments": []}, {"id": "2200778010321277", "text": "Trattoria Za Za or Trattoria Dall’Oste??", "link": "facebook.com/groups/1373361046396315/permalink/2200778010321277/", "likes": 0, "comments": []}, {"id": "2200778550321223", "text": "Do you need to wear masks in any attractions etc still?", "link": "facebook.com/groups/1373361046396315/permalink/2200778550321223/", "likes": 0, "comments": [{"username": "Jamie Bly", "comment_text": "No just came home from there."}, {"username": "Paola Bobko", "comment_text": "No need anymore, no restrictions of any kind anywhere 😉"}, {"username": "Bassam N Ziadat", "comment_text": "No"}, {"username": "Oldriska Balouskova", "comment_text": "Absolutely not"}]}, {"id": "2200785310320547", "text": "We are going to Italy in January. Looking at visiting (coming from Switzerland) Milan, Portifino, Venice and fly out of Rome. Is 7days enough? And how is best to navigate in order to visit each? TIA (btw this group is amazing)", "link": "facebook.com/groups/1373361046396315/permalink/2200785310320547/", "likes": 0, "comments": [{"username": "Dean Pecorari", "comment_text": "7 days will never be enough"}, {"username": "Scott Perry", "comment_text": "If it were me, I’d spend the entire week in Rome. Of course everybody travels for different reasons. I found out this summer that, if you’re not careful, you can lose an awful lot of time just going from one place to another. I had to switch apartments in Genoa this summer. Even though the apartments were only a few blocks from each other, because of check in/out times, I lost a good 5 hours that day."}]}, {"id": "2200786430320435", "text": "Hi there! We are a party of 8 (4 of them are kids) going to Florence, Venice and Rome at the end of November over thanksgiving break! We have 8 days to see these towns after removing travel days.\n\nWhat are the main things to see?\nAny cooking classes you recommend ?\nOr fun things to do with kids ages 10-15?\nHotel and restaurants you love?\n\nTHANK YOU!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2200786430320435/", "likes": 3, "comments": [{"username": "Kim Bagshaw", "comment_text": "Oh boy! There is so much to do in just one of those places! I highly recommend the Vatican Museum, the Trevi Fountain, the Coloseum, Spanish Steps, lots of food, wine and gelato in Rome! Thats just the tip of the iceberg. Look for a City Pass, sometimes you can skip the lines w those. We used them this year in Ireland and Germany."}, {"username": "Susan Wheeler", "comment_text": "I just got back a few weeks ago. You will love it!!"}, {"username": "Kim Lacy Miller", "comment_text": "Ahhhhh…you convinced Mike! I’m jealous. 😉"}]}, {"id": "2200786773653734", "text": "I’m just headed home from my Italy/Switzerland vacation. We did 2 nights Sorrento, 3 nights Rome, 3 nights Florence, 2 nights Venice. For everyone who posts itineraries and is told to eliminate a destination because “it’s too much,” I can say I am very happy with how my trip went. You do not waste an entire day traveling, as so many say. The regional trains get you between the cities in 1-2 hours. We would drop our luggage off as soon as we got to town and begin exploring.\nI’m definitely not saying we weren’t busy, but that’s how we travel.", "link": "facebook.com/groups/1373361046396315/permalink/2200786773653734/", "likes": 7, "comments": [{"username": "Joanne Diaz", "comment_text": "I totally agree, we hit the ground running, didn't waste a minute. It was GREAT!!!"}, {"username": "Anita Gopal Pharand", "comment_text": "Thank you for your post. I think that by travelling you waste time, so why not do 2-3 nights in one place. I am going with three other people and I am p,and I g the itinerary. I 109% agree with you."}, {"username": "Jared Diaz", "comment_text": "Can't wait to be back!"}, {"username": "Mo Dee", "comment_text": "Agreed. Sometimes I even add an extra night on the front-end and arrange an early check-in. Train travel days are not wasted! Just a few hours to rest or nap."}, {"username": "Billie Begley", "comment_text": "We were a group of 7 seniors and we hit different destinations. We came home tired but loving our trip and Everything we saw."}, {"username": "Lisa Kessler Scherr", "comment_text": "I agree 100%. We spent 3-4 nights in each city and we were traveling for 26 days. We found the train travel very relaxing and it was a little down time from the sightseeing. It was perfect!"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Good point! One has to know their travel style. We rather savor than rush, but that’s not for everyone."}, {"username": "Abe Michelson", "comment_text": "If you are happy & had a wonderful time. That is all that matters. I personally like to do more in some of those cities. I haven’t made it Rome yet. Honestly. I would do 7-9 days myself. Florence I did but would do 5 days….most being day trips to other cities. Venice-3 days. 4 if you go to Verona."}, {"username": "Dixie Kotylak", "comment_text": "Sounds perfect! I wish we would have planned multiple nights each place we were…packing up stuff many nights in a row got to be a bit tiresome to me…but I treasure every moment! Absolutely fell in love with Italy and the people!"}, {"username": "Lisa Valdovinos", "comment_text": "💯 similar experience and it was awesome 🤩"}, {"username": "Ron O'Brien", "comment_text": "Just be sure to factor in time and stress for all location changes: pack & hotel check out, transport to rail station, wait for train, train ride to next location, arrival/ disembark at new location, transport to new hotel, check in at new hotel and get settled in room, gain situational awareness and develop exploration plan …… . Yes, experienced travelers can do it all in stride, but most travelers should factor in at least half a travel day (sometimes more). Be prepared for your room not being ready and you having to either wait or leave your bags and come back later."}, {"username": "Johanne Guérin", "comment_text": "Good for you 😊"}, {"username": "Jenny Wadkins", "comment_text": "Thanks for this post. We're going to Italy/\nSwitzerland in Sep and we're staying only 2-3 nights in places. This is also how we like to travel. We never like to stay more than 3 nights anywhere we go. I'm very excited about our itinerary. I just see the train trips as some rest time, because otherwise we never sit still!"}, {"username": "Cathy Schreck Brucker", "comment_text": "Can you share the Switzerland part of the trip? How did you get there? Was it a tour or did you do it by yourself? Please and thank you!"}]}, {"id": "2200809796984765", "text": "Will be in Italy the entire month of September so thinking about getting a SIM card to use there instead of paying $10/day to my wireless provider. Anybody have advice or recommendations on a brand to use, and should I get it here in the United States before I go, or purchase it when I get to Italy? Any help is appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2200809796984765/", "likes": 30, "comments": [{"username": "Fiona Cameron", "comment_text": "Airolo esim… just google it. You keep your own number and can make calls through Whatsapp or Messenger, esim is data only."}, {"username": "Kathy Damaren Ingram", "comment_text": "When you set to Italy buy one there at the TIM store or Vodafone. They have tourist packages for the month. We did this and it was very easy and much less expensive."}, {"username": "Nadia Filice", "comment_text": "I buy Airalo esim card 1 day before I fly out it’s $20-$30 USD for data only for a month"}, {"username": "Miyuki Kanno Paul", "comment_text": "Unlock your phone before leaving the States. TIM mobile offers tourist special rate SIM. Bring your passport to the nearest TIM store once you arrive"}, {"username": "Teresa Hernandez", "comment_text": "Vodafone worked for me. $30. Just make sure you get your phone unlocked."}, {"username": "Liz Cottrell", "comment_text": "Verizon charges $100 for 30 days"}, {"username": "Patti Porter", "comment_text": "If it’s AT&T they don’t charge more after 10 days"}, {"username": "Lester Smith", "comment_text": "First off, make sure your phone is GSM. Most are these days but a CDMA will not work there at all."}, {"username": "Tara McCloud Odebrecht", "comment_text": "GoogleFi includes international coverage at no additional cost.\n\nVerizon is $10/day or $100 for the month."}, {"username": "Marcello Leone", "comment_text": "I was just there for almost a month. I just opted to get a SIM . TIM has a tourist package thst itlwas $30 for 70 gigs etc. Super easy to do at the airport took 10 min by the time I jumped into my rental data was there. Esims and relying on what's app and FB is limiting."}, {"username": "Shannon Packard", "comment_text": "You can try Holafly"}, {"username": "Roxanne Franquelli", "comment_text": "Best advice-call carrier and ask. Weigh the options."}, {"username": "Lash Mink", "comment_text": "Orange esim you can call and text too"}, {"username": "Lydia Della Barba", "comment_text": "Use the “what’s app”.\nBoth the caller and receiver must have the app. Free."}, {"username": "Sarah Folkard", "comment_text": "Hello techie people..... thank you in advance for your assistance. My Airola app says that i have successfully installed my esim, but it is showing as not activated. Does it auto activate once i arrive in Italy, or have i missed a step?"}, {"username": "Nora Parisi McAdam", "comment_text": "Just added WhatsApp thank you so much!"}, {"username": "Nora Parisi McAdam", "comment_text": "Janel Allen"}, {"username": "Jennifer Ames Dexter", "comment_text": "I live in Italy- cell service here is CHEAP! I take my US sim out if my phone (at $20/day?!). WhatsApp is great WHEN you have WiFi.."}, {"username": "Kevin Smith", "comment_text": "Try Holafly.\n\nhttps://\nesim.holafly.com\n/\n?cq_src=google_a\nds&cq_cmp=20388\n958075&cq_term=\nholafly&cq_plac\n&cq_net=g&cq_pl\nt=gp&gad=1&gcli\nd=CjwKCAjw8ZKmB\nhArEiwAspcJ7tcz\nZbVj3E9oylIk28j\nI8EiIdyT26Me50F\nItG8PrWYEWmprWX\n5VdkBoCrq8QAvD_\nBwE"}, {"username": "Patty Ham", "comment_text": "Get T-Mobile"}, {"username": "Krisztina Kellenyi", "comment_text": "If you have ATT the international plan is $10/day for 10 days the rest of the billing cycle is free. If you don’t use the phone for a day, there is no charge. Additional lines are $5 each,"}, {"username": "Larry Reinier", "comment_text": "Get an esim like Holafly or similar"}, {"username": "Maria Sullivan", "comment_text": "Buy a 25 euro SIM card at Vodafone and put into an old phone you have . Then use your normal Fone to hotspot and use WhatsApp . I’m in Australia and do this and it is. Very successful and only spend 25 euro as of last year prices for 1 month plan unlimited data and Fone calls in Europe ."}, {"username": "Christine Ann", "comment_text": "Airalo. We have been here for over three weeks. It’s been awesome"}, {"username": "Plane Shummer", "comment_text": "Bought a Vodaphone sim. No issues."}, {"username": "Cheryl Barowski", "comment_text": "Get a card when you get into whatever city you’re in- just make sure your phone provider has unlocked your phone. It’s a lot cheaper in the city vs. The airport and its a lot cheaper than Verizon’s $100 for the month of International- you’ll get more minutes to talk if you have to call back home, more texts and I believe unlimited data, depending on which one you choose. Find them at electronics store, comany names in Italy are Vodaphone and Tim."}, {"username": "Jon Ayres", "comment_text": "I purchased the international plan from Verizon. It was well worth it."}, {"username": "Mary Savage Dixon", "comment_text": "If you have att they cap the daily charge at 10 days."}, {"username": "Melissa Elliott", "comment_text": "If you have AT&T, I think you can add an international calling plan for $15/month."}, {"username": "Mateo Torres", "comment_text": "Thank you all for your helpful comments and recommendations\n, I truly appreciate it!!! I decided to switch from ATT to T-Mobile, aside from getting international data and text included at no extra cost, I’m also paying $10 less per month and don’t have a cap on high speed data usage. Very happy with my decision. Thanks again, everyone!"}, {"username": "Ann Applegarth Veith", "comment_text": "Been living in Italy for 4 months. It depends if you plan to travel outside of Italy. I have a Windtre Sim card. $25 a month, unlimited mobile data. 300 minutes to call the US. ***There is no SMS texting in this plan. There are roaming charges if you go outside Italy.\nIf you have ATT mobile it is $10per day for international, but it Max's out at$100 per month. A friend uses Tmobile, she is traveling around the world, she kept Tmobile since she is going to several different continents. She said it is very reasonable."}, {"username": "Karen Albertyn Wood", "comment_text": "Airalo esim worked well and very well priced"}, {"username": "Lacy Rieber", "comment_text": "Check with your wireless company. I paid $100 for 30 days, rather than $10 a day."}, {"username": "Frank Dragna", "comment_text": "ATT caps at 10 days $10 per billing period. Additional lines were $5 a day."}, {"username": "Ryan Monahan", "comment_text": "My wife and I bought sims at the Rome airport. 50€ for both. 70gb plus talk and text. Worked great the whole time we were there."}, {"username": "Kim DeHaven", "comment_text": "My t-mobile plan INCLUDES international data and text...nothing extra....didn't\nhave to do a thing!"}, {"username": "Allan Olexa", "comment_text": "I use fhe Verizon plan when I stay over 9 days...$100 for the month."}, {"username": "Frank Dragna", "comment_text": "Check out the WhatsApp. May help with some of the minutes/data concerns. As much as we spent on our trip, we had no concerns about dropping an extra couple of hundred bucks on additional phone charged. Drop in the bucket. YMMV."}, {"username": "Fetchin Gretchen", "comment_text": "Get when you arrive. I like Vodafone most places but depends on the country. Europe is so much less than US for a month. I have paid from $10 to $35 per month for up to 200 gb( that was France for $20 per month). Go on google Bard AI and ask your question as is there and see what suggestions come up"}, {"username": "Chantal Campeau", "comment_text": "Try this application, I heard it works very well. I might use it next time! Airalo"}, {"username": "Tom Cannon-Bailey", "comment_text": "Verizon just purchased yesterday going for 3 weeks in seitz, italy and greece. Unlimited data texting $100 for 30 days vs 10/day. Good luck"}, {"username": "Carey Matthews", "comment_text": "Coming from Canada 🇨🇦 where we are regularly raped $$$$$$ wise for mobile devices... we purchased at Vodafone sim card for $20euro 1st month at the Airport on arrival. Had issues with delayed activation and went to a Vodafone at Termini Station the next day. All got sorted. When in Tropea, we extended for a second month at their Tropea Vodafone location for $15euro."}, {"username": "Mel Aknee", "comment_text": "Mel Aknee"}, {"username": "Michael Hansen", "comment_text": "Not italy but Europe- We arrived via France and bought a 1 month bouyages telecom 30gb plan including text talk and data for €40. Only country it doesn't work is Switzerland."}, {"username": "Laura Uribe", "comment_text": "If you have Verizon, they also have a $100 travel plan for 30 days. Completely different plan from the $10 a day program. Must be cancelled when you get back or automatically renews."}, {"username": "Bill Casper", "comment_text": "AIRALO"}, {"username": "Maria Gatto", "comment_text": "We bought Airlo SIM cards at Rome airport for $45 - 50mb bad they set it up for us works great"}, {"username": "Gina Van Antwerp", "comment_text": "Iliad was great! For about 22 Euros you get 150GB, unlimited talk and text. Italian phone number but you can still use WhatsApp with your normal number to message people. Phone must be unlocked. We got ours at the shopping center underneath the train station in Florence."}, {"username": "Frances Younger", "comment_text": "If you do an eSim - please first make sure your phone is eSim compatable."}, {"username": "Renee Rundle Stoneham", "comment_text": "I usually buy right at the airport they set it up easy peasy.\n\nHowever this year due to the counties I was visiting I needed more than EU.\nI bought a 3 SIM from Amazon and it was great! Plenty of data and worked great! It was $25 for a month and 30GB data."}, {"username": "Jayne Carroll", "comment_text": "Do not use GigSky- absolutely awful!! Ended up using like 7 packages instead of 1 , just kept burning up data even times when I couldn’t have been on & customer service kept saying just purchase and when you get home we will have escalated and be able to resolve… nope once home they just kept replying appears you used the data"}, {"username": "Lori McNamer", "comment_text": "When my daughter was in Austria studying abroad for college, we used “WhatsApp” free and amazing. Download the app on your phone and you can text and call. She traveled all over Europe and we never had a problem. Going to Italy in September and how will be using ‎”WhatsApp” to call home and text."}, {"username": "Shirley Lewis", "comment_text": "I have bought many SIM cards on many trips to Europe, last year it cost about $40 for 1 month, unlimited data and voice ... never a problem, just like home! 🙂 I would go with Wind or Tim ... unless someone has a reason for another company."}, {"username": "Shelly Stowell", "comment_text": "TIM store. $35 for 30 days"}, {"username": "Ellen Basham", "comment_text": "I bought a SIM card at the TIM store in Florence. Unlimited data phone and text. I think it was $40 Euros"}, {"username": "Margie Franzen Springelmeyer", "comment_text": "Anyone use WhatsApp?"}, {"username": "Angela Koots", "comment_text": "We stay a month at a time and always get an Italian Sim. This past month we went with Vodafone. It cost my husband and I 10 euros each for 200GB of data each.\n\nOnly catch is that you will have a new Italian phone number. Not an issue though if you use What’s App or Facebook Messenger for Video calls back home.\n\nDon’t buy your SIM at the airport kiosk as you will pay much much more for the tourist version. My daughter paid 60 euro at airport vs mine at 10 Euro at a Vodofone store in town."}, {"username": "Maria Coladangelo Ducca", "comment_text": "First make a physical visit to Verizon to find out your options . Use WhatsApp. It is free . Sort out your communication here in US prior to running around at your holiday destination"}, {"username": "Jaci Rummel", "comment_text": "We have T-Mobile and added the International plan just before we left. Within 2 days we had to buy international cellular and they doled it out 5 gb over 5 days which was used up in one day. I bought another 50 gb but it didn’t kick in until after the first 5 days expired. In the meantime, I husband’s phone didn’t work at all! We were on a cruise and updated our plan there. It was the only time we were both able to use our phones. My daughter had Verizon. No problem.\nTo make matters worse, our T-mobile went up to $179/mo for 2 phones and that was after international calling was removed. You would be better off getting 2 prepaid phones in Europe."}, {"username": "Sandy Tadken Shaffer", "comment_text": "My husband is using Verizon 100$ but I bought a SIM card from Tim it was about 20 euros for the month and another 10 for the second mknth"}, {"username": "Jaime Cleek", "comment_text": "I think some have said Tim. ESims are really popular too if your phone can do that"}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "Airalo esim is the best"}, {"username": "Jennifer Nguyen", "comment_text": "Orange e-sim for Europe\nhttps://\ntravel.orange.co\nm/en/offers/\nLast year I used for Orange e-sim for Italy, Spain, France, etc. whenever the cruise stop at the ports. It is an e-sim, so it is pretty convenient. When I got off an airplane , I just switched to Europe Orange e-sim. It works fine. I bought the Orange Holiday Europe for only $40 for 14 days with 20 gb. There’s a cheaper plan for $20 plan with 8 gb, but that’s too little for me because I use map a lot for directions, Facebook, Snapchat, etc. I even use it for FaceTime with my family, so I don’t have to pay long distance bills. If you have your phone plan, you can use it too, but it is $10/day. Orange is cheaper if you travel 2-4 weeks. It is up to the individual to see what’s best for you."}, {"username": "Anna EClar", "comment_text": "Is your provider Verizon? It caps at $100 for the month. Just FYI in case.\nI’ve seen posts about the SIM’s here and how it can be an issue for banking apps etc.\nnot sure about that but just using my phone"}, {"username": "Harris Dee", "comment_text": "Verizon user, paid the $100 for the month"}, {"username": "Lisa Howard", "comment_text": "Sims Direct"}, {"username": "Nicola Amy MacDonald", "comment_text": "Vodafone sun when you get there. I got mine at the time train terminal downstairs. €20 for a month and 200gb plus calls and text. I had great reception and even called home to Australia without issues."}, {"username": "James Carr", "comment_text": "Who is your carrier? I have T-Mobile and I can add international voice, text and 15GB data for $50 a month, one time payment."}, {"username": "Alice Francesca", "comment_text": "Iliad is the cheapest and works perfectly.9 Euros pm"}, {"username": "Jennifer Saporito", "comment_text": "Sapphire"}, {"username": "Betsy Davis", "comment_text": "Definitely Airalo esim, best customer service, too. And you can download before you go."}, {"username": "Deanna Nunes Corbin", "comment_text": "We bought 3 of these on Amazon before our trip. They are a UK# but work in EU. Only 12g of data instead of the 50 it shows in the picture. We have been here in Europe for 3 weeks and no issues. Have made local calls and maps, Google, email social media with no issues in Italy, Switzerland. Austria and Germany. Was easy to register the cards before our trip and just put them in our phones when we landed. Our 20yr old ran out of data and we went to a electronics store (cheaper than Vodafone) and purchased another and they activated it right there"}, {"username": "Lea Tenzer", "comment_text": "Vodafone..not from airport!"}, {"username": "Roxanne Curzi", "comment_text": "I feel like $100 to use my own phone, sounds fine. How much cheaper is getting a whole new Sim card? I assume you still have to pay for the service. How do you know your phone would even work with it? Don't US providers sell phones that are specific to their network? I don't see why getting an esim would be a preferred option. So many people post about this, and I really don't get it."}]}, {"id": "2200794943652917", "text": "What’s the difference between agriturismo bookings vs airBnb bookings? TIA 🇮🇹🍷", "link": "facebook.com/groups/1373361046396315/permalink/2200794943652917/", "likes": 1, "comments": [{"username": "Benedetta Vanni", "comment_text": "Agriturismo is only a category of accomodations such as hotel and b&b. Agri-turismo means you'll be staying in an actual farm that's doing agriculture and rents accomodations too. My grandma and uncle run a farm with an agriturismo, they rent out fully equipped apartments. You can find them on AirBnB, which is just a booking platform. Just to give an example."}]}, {"id": "2200202553712156", "text": "Our favorite restaurants in Venice and a must go to in Burano. Reservations highly recommended.", "link": "facebook.com/groups/1373361046396315/permalink/2200202553712156/", "likes": 120, "comments": [{"username": "Shaun Fagan", "comment_text": "Deborah Fagan"}, {"username": "Lynn Clemens", "comment_text": "Mark Clemens"}, {"username": "Jacqueline Nisbet", "comment_text": "Are all these in Venice"}, {"username": "Bernadette Sarmiento", "comment_text": "Thanks for sharing -will be in Venice 8/17-19"}, {"username": "Valerie Nicole", "comment_text": "We had a similar experience in Venice with some yummy sea bass they prepared at the table for us! So good!"}, {"username": "Tracy Foss", "comment_text": "Thanks !"}, {"username": "Trace Barron", "comment_text": "Peter Barron Kennedy Barron"}, {"username": "Jennifer Fleming Moore", "comment_text": "Nancy Fleming Cartee"}, {"username": "Cindy Breneman Hattrich", "comment_text": "O.m.g! I will be there in august and will hunt down this restaurant."}, {"username": "Sheila Schiffman", "comment_text": "Lisa Johnson"}, {"username": "Lisa Brierley", "comment_text": "Dannielle Yardley 💯"}, {"username": "Julie McIvor", "comment_text": "Lynette Pitt"}, {"username": "Sue Mason", "comment_text": "Excellent thanks"}, {"username": "Judene Hansen", "comment_text": "Looks beautiful, wonderful!!!!!\nSharon Roberts Crossley😍😍"}, {"username": "Barbara Johnessee", "comment_text": "What is the name of the restaurant in Burano? Please!"}, {"username": "Jill Brothers", "comment_text": "Can the boy on the right be our waiter please"}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Theresa Sorrentino Pagan", "comment_text": "How do you make reservations? Are they online?"}]}, {"id": "2200337190365359", "text": "Ladies! We are preparing for a 3 week Italian adventure. I understand that Italy is hot this time of year and don’t want to overpack for cooler “what if’s” if I can avoid it! What was on your recent packing list? What were your “must have” items? What were your most versatile? Should we plan to dress for dinner? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2200337190365359/", "likes": 37, "comments": [{"username": "Maria LaPietra Guerrero", "comment_text": "Sundresses! baby powder (although the one in Italy is better). Never used jeans, capris or shorts. Sandals. I never wore my sneakers and lived in my flipflops."}, {"username": "Zelda Sanchez-Kamath", "comment_text": "small light colored umbrella, hat (foldable), small bag to carry water & sandals. I would change to sandals or flip flop bc feet got so hot in sneakers with the heat."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Been here a week and a half so far. Cool dresses or skorts are the most comfortable. Dinners aren't fancy. Actually, some nights were just too hot to eat. (But we did anyway, because we're in Italy). Nobody cares what you look like. Where whatever you're comfortable in when its really hot."}, {"username": "Gwen Erisman", "comment_text": "Dresses and sneakers! I brought one light sweatshirt for the plane ride, and I’m glad I did! The rain jacket is a great idea. We got caught in Venice having to get to the train station during a downpour. We have the carryons from Rick Steves, and they are perfect. We pack with his traveling cubes, and it has made all of the difference. Pajamas in the front pocket, so you don’t have to dig for them that first evening. Have a wonderful time!!\nhttps://\nstore.ricksteves\n.com/shop/p/\nrolling-carry-on"}, {"username": "Renae Larcus", "comment_text": "My best advice is to Minimize the shoes you take. So what if your shoes don’t look perfect with your outfit? Dress for comfort. In hot weather a white pair of trainers and a pair or sandals should do it. I wear light dresses or skirts/ tops. Mix and match. It’s ok to wear something more than once. I do carry on only for 2 weeks and I always over pack."}, {"username": "JoLynn Waters", "comment_text": "Portable fan and small blue tooth speaker for music or audible books"}, {"username": "Bev Jean", "comment_text": "We are going August 28 to September 8 do you think will still be warm?"}, {"username": "Rachael Richardson", "comment_text": "Unless you going to a top notch hotel or restaurant no one cares that you look a sweaty mess , which I did in the heat ! 🥵 I packed shorts vest tops,strappy dresses and something to cover shoulders/\nknees in churches etc - heat will be around for a while"}, {"username": "Catherine Sincovich Kerr", "comment_text": "Does anyone have good sandal recommendations\nfor walking all day that are at least somewhat cute?"}, {"username": "Coleen Greer", "comment_text": "Can you find lotion, shampoo and conditioner, hair spray in any markets?"}, {"username": "Tamara Valdez", "comment_text": "Following"}, {"username": "Bek Strempel", "comment_text": "My husband and son have just left after experiencing 2 of the hottest weeks on record. They were mostly in their shorts or underpants 🤣 they never even put a jacket on. I would pack light!"}, {"username": "Lj Downs-Ahearn", "comment_text": "Take a coat 😭 worst decision of mine was not bribing a coat/umbrella with me !!"}, {"username": "Jackie Walters", "comment_text": "How hot will it be the first week of September? I have no clue what I’m doing! Haha"}, {"username": "Jessica Brown Ramirez", "comment_text": "Just got back yesterday from a 14 day trip. 💯 liquid IV. All 3 of us managed with a carry on luggage and carry bag/backpack and we still overpacked. We wore the same things over and over because of the heat. I had 1 calf length athleta skirt with zipper pockets and a black or white tank and wore it 4 or 5 days…easily hand washed and hung to dry. 1 very light tank romper, 3 thin/light sundresses, 2 swimsuits (only needed one), a thin linen blouse for covering shoulders a religious sites and museums. Good white sneakers and Birkenstocks. Never touched my pants shorts, wore my long tank/maxi dress once and was very overheated. Two thin tshirts for sleeping. Light undies and bras easily washed and hung to dry by morning. I use laundry detergent sheets…so, I’d just take a water bottle, add half of a laundry sheet, shake it and do the laundry in the sink or shower. It was super easy! Have a wonderful time!"}, {"username": "Davina Downs", "comment_text": "Large brimmed sun hats are a must 💖"}, {"username": "Andrea Wurster Vizzari", "comment_text": "Just heading back from Amalfi, Rome, Florence, Turino. The only thing I used the entire time were sundresses. Super light weight with no sleeves. I packed like 1 scarf for churches but it’s so boiling you only need it there. Teva sandals were amazing and I didn’t feel under dressed in the black ones. The only place I wish I wore athletic shoes were Pompeii and the Colosseum. I didn’t even touch the dresses I brought with sleeves, or pants, shorts, tennis shoes, makeup, a hairdryer (and these are all things I do daily back home). Just be comfortable because everyone is a sweaty mess too. The neck-fans really helped too. Have a blast!"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Decided not to bring my Denim jacket as it weighs a ton. Light flowy maxi dresses and skirts with a few short dresses. 1 pr linen pants. 2 Linen tops. A fun dress for lounging in the am with coffee or running into town for errands. Vionic sandals, wedge sandal, slides. We aren't doing lots of walking. Wrap for cooler evenings."}, {"username": "Phyllis Snyder", "comment_text": "Just pack good walking shoes- a few outfits. Buy anything else when you get there."}, {"username": "Sonita Sandhu", "comment_text": "I’m surprised some have mentioned a jacket. No need you will never wear it. I never took one. I don’t wear scarves as it’s too hot for them. I took one white linen shirt which I love to wear on all my trips. Had a few shorts as I was also in Croatia. No need for pants. Stick to a few dresses and maybe a couple nicer ones. I change for dinner sometimes. One good pair of sandals that you can wear with everything and maybe sneakers if you are doing any type of hiking. I did 3 weeks with carryon and a bag and did laundry once."}, {"username": "Rachel Anne Jeffrey", "comment_text": "Thin rain jacket for storms."}, {"username": "Amy Kaye", "comment_text": "In Italy now and this right here has been my #1 thing I am so glad I brought! We had two and bought cold water everytime we needed it and filled them so we always had water, 3 regular sized water bottles filled 2 of these. Also imperitivr that it has the top like this, so you can easily carry it! I couldn't have survived last week in Venice without it! I'm 50 years old and have never experienced heat like I did last week here (I am sure all the walking contributed - my son said I was acting like I was walking a Vietnam death march🙄)"}, {"username": "Danielle Gervais", "comment_text": "Portable fan, hand fan"}, {"username": "Sara Jane Rawlings Burton", "comment_text": "What sort of temps in Athens mid september please"}, {"username": "Gail Horth", "comment_text": "Athought, trained karate for years, hung my Gi outdoors after every training session, at least 3/week, washed the gi only once/week, it always smelled like fresh air. Maybe an idea"}, {"username": "Lynn Conklin Olson", "comment_text": "In those temperatures, if you would just bring sundresses, white sneaker￼s or comfortable walking sandals and a light sweater to cover your shoulders or a scarf and you will be fine. And they all roll up very easily. We got back last month. Wish I had not packed any pants, the Jean jacket, the raincoat."}, {"username": "Kristen Rozansky", "comment_text": "I’m in the Piedmont region right now. Heroes of the trip include a reusable water bottle, Liquid IV, short light dresses that were easy to hand wash in the sink, Thigh Society cooling shorts (for under the dresses), Ripskirts, mega babe Bust Dust (powder), a hand held fan, Birkenstocks, backpack, power adapter and back up battery/\ncharger. It was actually quite chilly last night in Acqui Terme and people were wearing sweaters. I doubt that is the case all over Italy, however. At least in this area, anything goes for dinner. The same day dresses are fine for dinners."}, {"username": "Pate Mears", "comment_text": "I would not carry any black clothes as it draws heat. I would take a comfortable skirt, slacks and shorts. often, a shawl or scarf comes in handy. When we go to a really nice restaurant I wear a skirt or dress. I also take a junk necklace with me for fun and evening wear. Be sure and carry a purse with a shoulder strap and zipper. Have a wonderful time."}, {"username": "Wendy Davis Love", "comment_text": "Sundresses and Comfy shoes\nI took linen pants and they never left my suitcase!"}, {"username": "Pat Bickford Johnson", "comment_text": "Debbie Peck Thomas\nLisa Sahlin\nGuess I’ll leave my jean jacket at home"}, {"username": "Starla Dawn", "comment_text": "I enjoyed wearing linen there."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Yes linen and cotton. A lights shawl … I did only a black and white clothing so I can mix match and wear them more than once."}, {"username": "Romina Lauretig Toscano", "comment_text": "Good news...Rome is fresher today 😀"}, {"username": "Stacey Esposito", "comment_text": "Linen clothes and bring liquid iv powder for your water bottles. Don't laugh last night I was not feeling well at all I know I was dehydrated. I drank 2 of those and felt like myself. It's been a week in rome and venice sweating all day. Today it's beautiful in florence."}, {"username": "Marisa Milanese", "comment_text": "Liquid Iv!!!! In sorrento and it saved us multiple times"}, {"username": "Heather Sechrist", "comment_text": "Linen, skorts, light shirts. And electrolytes (I use ultima)."}, {"username": "Candice Connelly Johnson", "comment_text": "Lots of sundresses that went just past the knees. I packed a shawl for the ones that were sleeveless to where in churches. That along with a few pair of shorts and tops rolled everything tightly and it all fit easily in a carry on. Worked for me but I am not terribly high maintenance when it comes to what I wear. I went for easy and comfortable."}, {"username": "Lisa Valdovinos", "comment_text": "Dresses"}, {"username": "Delia Miscella Wroblewski", "comment_text": "Sun dresses-portabl\ne fan"}, {"username": "Kathy Johnson Schaefer", "comment_text": "Second portable fan!"}, {"username": "Mary Patzke", "comment_text": "I always bring a colorful scarf. For me, if my neck is warm, the rest of me will be warm. I know, I’m weird!"}, {"username": "Janet Isaacs Lanza", "comment_text": "All I wore was dresses. Above the knee if you can, and linen is most comfy, wrinkles and all!"}, {"username": "Amy Moran Weltin", "comment_text": "Portable fan and cooling towels. My 5 friends all teased me before we left about them,but once we were there they were like.. you were so smart! Also, extra bras as the sweating is real!"}, {"username": "Krystle Waggy Konečný", "comment_text": "Dresses and sneakers! I also brought a raincoat; it doubled as those “what if” chilly days and rain!"}, {"username": "Laura Cary Veeder", "comment_text": "Cotton dresses w/ a small scarf tied around my purse to throw on in churches. It’s so hot, you won’t need anything at night."}, {"username": "Michelle Lynne", "comment_text": "Linen clothes and conditioner !!"}, {"username": "Molly Elizabeth", "comment_text": "Sundresses, sundresses, sundresses. The easiest and most comfortable thing. I ended up wearing the same 4 dresses I brought.\n\nLiquid IV and I’m SO thankful I brought Mega Babe thigh rescue….lol. We bought little 2 euro hand fans in Florence, so ain’t stress if you don’t have room for actual fans in your luggage."}, {"username": "Claire Evans", "comment_text": "What is the dress code for the cathedrals? Does it have to be long dresses and covered shoulders?"}, {"username": "Suzanne Calpito Ragsdale", "comment_text": "Do not bring that denim jacket. I always bring one for cooler inside areas and I looked at it with disdain every time I had to pack it up and take it to my next location. Never used it! I wore certain dresses that were cool and comfy several times."}, {"username": "Alice Francesca", "comment_text": "We encountered an abnormal heatwave (40+ celsius) now it s goung back to normal ( 30's celsius)"}, {"username": "Katy Cattoni", "comment_text": "Ruth Cattoni"}]}, {"id": "2200493543683057", "text": "Any preference on trains in Italy?\nÍtalo, Frecciarossa, Trenord, Intercity, etc.", "link": "facebook.com/groups/1373361046396315/permalink/2200493543683057/", "likes": 5, "comments": [{"username": "Hagar Mohsen", "comment_text": "F"}, {"username": "Marco Edoardo Massa", "comment_text": "Italo and Frecciarossa are the fast train connecting the main cities, i prefeir Frecciarossa but are almost the same.\nFrecciabianca/\nFrecciargento are a little slower and connecting the minor cities.\nIntercity and Trenord are going almost everywhere but are the slowest and the service Is not very good on some routes."}, {"username": "Gabriele Fordini Sonni", "comment_text": "The majority of the trains are run by the state company Trenitalia, of which Frecciarossa is a subsidiary. Two exceptions are Italo, wich sorely operates on the high speed lines, and Trenord wich is only partially public.\nIf it's available for your route you should always book Frecciarossa or Italo trains.\nIf you go on the Trenitalia website (https://\nwww.trenitalia.c\nom/) you will be able to buy a ticket a reserve a seat for all the routes in Italy.\nOtherwise, go for Italo https://\nbiglietti.italot\nreno.it/"}, {"username": "Benedetta Vanni", "comment_text": "Let's try to make this clear.\nCompanies: trenitalia, NTV, trenord.\nNTV only provides for high speed trains (italo).\nTrenord only manages regional trains in the northern regions\nTrenitalia provides for both high speed (frecciarossa, frecciargento),\nintermediate speed (frecciabianca,\nintercity) and regional trains."}, {"username": "Oriana Delle Cave", "comment_text": "Freccia!"}, {"username": "Victoria Laverty", "comment_text": "Italio"}]}, {"id": "2200529670346111", "text": "Tell me everything !!!\nThe below cities are booked for 2.5 weeks in Italy 🩷\nGive me all the restaurants, day activities, attractions, special moments in every city! - I want to immerse myself in Italy 🇮🇹 travelling this August !!\n\n1. VENICE\n2. CINQUE TERRE\n3. FLORENCE\n4. ROME\n5. SORRENTO - Capri, Amalfi Coast, Positano\n6. NAPLES\n\nPLEASE !! No negativity - looking forward to reading everyone’s recommendations 🩷", "link": "facebook.com/groups/1373361046396315/permalink/2200529670346111/", "likes": 129, "comments": [{"username": "Anna Cappeluti", "comment_text": "While you’re in Sorrento be sure to try Donna Sophia, we ate some of the best food there, particularly their stuffed zucchini flowers, spaghetti con vongole ( with clams ) and one of the best Tiramisu you’ll find - we tried plenty! 😂 it gets really busy there so be sure to book, it’s worth it 😊😊 enjoy your holiday. 🇮🇹"}, {"username": "Rob MacFarland", "comment_text": "Just SEARCH all that the group has posted on your topics of interest since ... FOREVER :)"}, {"username": "Bellafab Fabrizio", "comment_text": "In florence go to All’Antico Vinaio for foccacia! The best sandwich u will ever eat. Check it out on tik tok"}, {"username": "Bellafab Fabrizio", "comment_text": "Get the get your guide app and book a gondola ride through there much cheaper along with other things u can book"}, {"username": "Sonita Sandhu", "comment_text": "Maybe leave Naples. Never been as haven’t had a desire to go there. Spent 4 days last August in Sorrento and did day trips from there. Half day in Capri and even less in Positano as I thought there would be more ferries going out but there aren’t so take an early one. Pompeii is easy to get to from Sorrento by train if you are interested. I loved Sorrento! It was nice just relaxing and taking it all in."}, {"username": "Nicole Moffett", "comment_text": "Nicole Moffett"}, {"username": "Nicole Moffett", "comment_text": "When in Amalfi, you can take a quick walk over to the neighboring town of Atrani! It’s a small, quant fishing village that is much less crowded than Amalfi. Try eating at “Le Palm” in Atrani-best seafood pasta and beautiful outdoor dining right on the water. And cool side note-when my husband and I went there this past October, the movie The Equalizer 3 with Denzel Washington was being filmed so you’ll see all the places in the movie!"}, {"username": "Aaron Howton", "comment_text": "Best pizza in my life was in Positano, Puppeto’s on the beach. Great little boutique hotel"}, {"username": "Nancy Ely", "comment_text": "Having lived in Italy and, if this is your first trip to Italy, I would recommend that you do Venice, Florence, one of the beautiful Tuscan hill towns, and Rome. You will not be zig-zagging throughout the country and spending your time with the mechanics of transportation and checking into new accommodations . Save the rest for other trips."}, {"username": "Sony Ucciferri", "comment_text": "tell me too please ! 🙏🏼"}, {"username": "Angela Limneos", "comment_text": "Hi Jasmin Lubbers can recommend AmalfiDrive4You\n- we used for private transfers and an amazing coastal drive from Sorrento down to Minori with stops in Positano, Ravello, Amalfi and lunch in a private beach tower."}, {"username": "Marie-Eve Côté", "comment_text": "Florence : aller souper au Osteria Pastella et choisir les pâtes au parmesan et truffes. Le parmesan est flambée au brandy sous vos yeux, à votre table 😍"}, {"username": "Venessa Menzagopian", "comment_text": "You must book Enzo from sorrento maxi tours and do a day tour from Sorrento to Amalfi, positano and Ravello. He picks you up from your hotel and its all day. He was truly a blast and made it so much fun for us! Ask for Enzo though.\n\nCapri we just got the ferri over and went to the blue grotto got off there and went to Anacapri to do the chair lift"}, {"username": "Ginger DiGalbo Katz", "comment_text": "This is a lot for 2.5 weeks. Don't forget travel time between each of these places"}, {"username": "Jennifer Schoenmakers", "comment_text": "Florence-Via Tourabuoni-(des\nigner clothing road), best wine Bar- Procacci. Also, @falconeri for cashmere clothing at good prices."}, {"username": "Lisa Vivolo", "comment_text": "Immerse yourself by letting the locals guide you. And wander the streets aimlessly and find hidden gems in the people and places of the most beautiful country in the world !!"}, {"username": "Victoria Morrow", "comment_text": "F"}, {"username": "Jean E Snyder Spinell", "comment_text": "Following"}, {"username": "Eve Pizzano", "comment_text": "My opinion… Don’t bother with Naples. I found it filthy and extremely crowded. Go straight down to the Amalfi coast. Don’t miss Sorrento, Positano, boat ride to and around Capri, the town of Amalfi and Ravello."}, {"username": "Anita Haynes Dawson", "comment_text": "Why does everyone assume people can do multiple trips to Italy? I won't be able to. This is a great post with wonderful info given. I can't wait to see and experience all these places this fall."}, {"username": "Donna Demarkis", "comment_text": "Love Naples. So few on this page recommend it. Such a shame.\nThere are several free walking tours of Naples that can be found online. The one I took met at the Piazza Dante. Travel all over the world, and fell in love with Naples, even though I’m not a city person. Please take time to walk the streets of Old Town. Just use a crossbody bag, and watch out for the little munchkins who walk closely in old town."}, {"username": "Sarah Jo Stimmler", "comment_text": "I lived in Italy just north of Venice for three years. I recommend walking as much as you can in each city to find the hidden gems. When you are in Venice you should take the ferry to Murano to visit the glass blowing shops, they are amazing. Visit some of the local grocery stores to get cheap wine...it's all so good! Driving can be scary if you're not used to being very aggressive and sharing the road with bicycles and motorcycles. People in Italy drive very very fast all the time, so if that's an issue maybe hire a driver or use taxis if needed. Also pick pockets are very bad the further south you go so make sure you secure your money in a safe place at all times while you're out. I hope you enjoy your trip! Just take time to breathe it all in, it's such a beautiful place."}, {"username": "Michele Rivera", "comment_text": "Jackie Grace"}, {"username": "Emily Rubini", "comment_text": "when in naples take a day trip to pompeii its about 30 mins by train absolutely beautiful x"}, {"username": "Carrie Smith", "comment_text": "See the sun set from the Piazza Michelangelo in Florence, takes around 40mins to walk up from the centre but worth it. Great atmosphere and the view 😍"}, {"username": "Sarah Hirsch Keller", "comment_text": "We just got back from a 17 day trip to all the exact same places except we did Ischia instead of Naples. After that long a trip and sightseeing so much, it was so nice to unwind on a gorgeous island with lots of sand beaches and very lush. They are known for their thermal hot springs. We visited one and it was the best day to relax and unwind and was truly gorgeous. Naples is another big city. We came back saying if we could change anything it would have been to spend more time in Ischia. We were there for 3 nights.\n\nGet tickets ahead of time for tours to save yourself time doing it there. I had a fantastic tour guide in Rome. I’ll get her info for you."}, {"username": "Scott Bingman", "comment_text": "The Amazing Race! 😊 But if you feel like you can do it! Do it!\nYou’ll hit some spots that you’ll wanna go back too and spend more time to explore and see sometime. I’ve been to every one on your list love them all!\nSorrento being a favorite!! So many trips back to that area. While in Capri see the grottoes, use\nGianni Tedesco CapriWonderful/\nGianni’s boats. Tell him Scott Bingman sent you. 😊\nLoved the lemons in Amalfi, visited the ceramic store, shipped back a beautiful Amalfi vase! Positano\nWow short drive from Amalfi\nWe always rent a car and drive the coast. Some day if you can go see Lake Como for a Janes Bond trip\nYou might run into George Clooney and family shopping around there since they own a home there\nTheir favorite restaurant is the Black Cat 🐈‍⬛ in English"}, {"username": "Fernando Leon", "comment_text": "Go near of Nápoles to Capadocia . In Capri go to swiminng around the island"}, {"username": "Catherine Nichols", "comment_text": "We just came back from Europe to Australia and some of the highlights were a sunset boat cruise with Sea Breeze from Monterosso to see all 5 towns, swimming and light meal, and also a golf cart evening tour with Rolling Rome. Both were great personal tours with local knowledge. Have a great time."}, {"username": "Karen Busch", "comment_text": "Rick Steve’s has a travel book on cinque terre. Best to buy that and read it. Tells you everything you want to know. It’s pocket size."}, {"username": "Phyllis Snyder", "comment_text": "Good line up- but maybe skip touring Naples and spend mor time in Rome or Sorrento."}, {"username": "Donna Heitmann Clay", "comment_text": "So many great smaller places to visit. Went in mid June, loved Lucca and Sienna. And not over run by tourist."}, {"username": "Mc Mo", "comment_text": "Cinque Terre\nAbsolute stunning 🤩\nGet trains to all 5 towns"}, {"username": "Carolyn Balding", "comment_text": "Courtney Elizabeth would love if you could share with me 😊 thank you"}, {"username": "Stephanie Gandy Riley", "comment_text": "A friend of mine who is an annual traveler to Italy highly recommends dinner at Trattoria Cecio in Rome. I put it on my list for my trip in early June."}, {"username": "Laurie Gies Forseth", "comment_text": "The 1st 3 names I'm doing in April for 2 weeks!! Feedback would be gracious.. enjoy"}, {"username": "Jeff McLellan", "comment_text": "Overnight in Capri if you can. Evening there was completely different experience.\n\nCinque Terre do a sunset boat cruise with Hello Cinqueterre it was the best way to see the villages.\n\nFlorence - Osteria Pastella (book a reservation)\n\nSorrento - O'Parrucchiano La Favorita need to call 15 days in advance for reservations. It was one of our favorite spots.\n\nRome - Tonnarello in Trastevere is worth the wait\n\nBest way to see Amalfi towns is by boat too.\n\nNaples - do a guided tour with Ludoviguida you will not regret it. Fun and educational she is great."}, {"username": "Jane Eichhorn", "comment_text": "Venice - Riva Rialto\nCinque Terre -Riomaggiore Stephan’s sunset cruise ( booked through Air BnB yet"}, {"username": "Paula Andrea Rojas", "comment_text": "Marlon Rodriguez"}, {"username": "Mandy Folchi Oddieo", "comment_text": "Following."}, {"username": "Zyania Seijas", "comment_text": "I just have some suggested dos and donts for Rome in regards to food!\n\nDon’t follow tiktoks advice on:\n-la fortunata\n-tonarello\n-Mr 100 tiramisu\n\nDo:\n-mimì e coco\n-two sizes (not great but better)\n-ambasciata d’Abruzzo\n\nThe tourist food places are seriously overcrowded and overrated 😕 It was to be expected but I was still disappointed to know I could have eaten better food elsewhere and didn’t"}, {"username": "Denise Haverda", "comment_text": "We are on our last day in Italy. We’ve been in Europe since July 3. We stayed a week in Praiano and did the Amalfi coast. Then moved to Florence, Rome, Venice and Cinque Terr. Today back to Rome to fly out tomorrow.\n\nIt’s been amazing but you have to factor in travel so you will loose a couple of days and maybe not get to see everything you want.\n\nWhen we get home I’ll make a post with all our adventures!\n\nAnd, yes, Italy shuts down in August."}, {"username": "Jennifer Cook", "comment_text": "Kathy Zink Russell"}, {"username": "Jozanne Sbitney", "comment_text": "Cooking classes in Venice! Hiking from Vernazza to Montorosso in Cinque Terre! Amazing!!! Have so much fun!"}, {"username": "Cara-lyn Alpin", "comment_text": "This is our itinerary for 16 days. Yes we've missed things out but we want to experience walking round the cities and finding little hidden gems. We have booked what we feel we definitely want to see/do."}, {"username": "Cindy Valero-Wamsley", "comment_text": "Great suggestions!"}, {"username": "Chloe Hinson", "comment_text": "We did Pisa, Cinque Terre, Rome, Naples & Sorrento in 9 nights. So it’s more than doable. Granted Pisa we only stopped for the day after our flight however we saw what we wanted to.\n\nCinque Terre- We love cooking so did a school up in the hills overlooking Monterosso. This was called the Cinque terre cooking school. It was amazing. Also taking a ferry between the villages is so fun. We stayed in Riomaggiore. Vernazza is pretty for dinner. I’m so sorry I can’t remember the name of the restaurant but it’s right near the water 🙈\n\nRome- Got engaged here in 2020 & love it so we’ve already done all the ‘usual’ tours. This time we walked & walked & we did a cool Vespa & side car tour. You have a rider so don’t need to worry about driving & you go around sights you wouldn’t necessarily go on your own. You then stop off for coffee or gelato in Trastevere.\n\n- Naples we only stayed for one night . We did a fabulous Pizza making class right near Castel Nuovo via Get Your Guide.\n\n- Sorrento: we did Pompeii & Vesuvius (well we didn’t get to because the weather was terrible they closed it) going back next year!\n- We had a vintage fiat that took us around the sorrento coast & had pictures & videos. That was beautiful despite the weather. This was via Positano Dolce Vita on Instagram.\n- Positano/\nAmalfi & Ravello- Another trip via get your guide, but my husband broke his bearm & we couldn’t go. Same with a Capri tour again via get your . We’ve booked our trip next year to do a honeymoon redo 😂\n-Hotel Loreli for sunset drinks- WOW\n-There’s also a cute little land train that takes you around sorrento, down to the front etc & that was lovely, you get earphones to hear the history of places as well which was great. It runs all day up to 11pm. We did it 6.30 before drinks & dinner & we had it to ourselves. This was €7.50!\n- Shopping streets & Piazza Tasso are just so pretty. Well it all is.\n- Unfortunately because our trip was cut short in sorrento & was stressful etc with hospitals & his arm & the potential for surgery we couldn’t fully appreciate everything or immerse ourselves into the food so I don’t have restaurant recommendations\nas we only had two dinners & a lunch & to be honest that’s a blur 😂"}, {"username": "Rochelle Donaldson", "comment_text": "Tamara Pitt this is so overwhelming"}, {"username": "Taran Whitburn-Cassin", "comment_text": "Spend as little time in Rome as possible. See the sites in a day on a vespa. Can book private tours at the colloseum when you get there to skip the que. Rome is dirty and it stinks and the people aren't as nice."}, {"username": "Maria Brozou", "comment_text": "Try the sorbillo pizzeria in naples. Incredible!"}, {"username": "Nariman Dergam", "comment_text": "Interested"}, {"username": "Maggie Williams Dryden", "comment_text": "https://\nwww.alfornodella\nsoffitta.it/en/\nCacio e Pepe pizza with truffles will change your life."}, {"username": "Maggie Williams Dryden", "comment_text": "Mistertaxidrive\nr Napoli should be your first call for Naples/Amalfi coast tours/\ntransportation."}, {"username": "Francesca Romano Brown", "comment_text": "Spend the night in Capri! Sunset is incredible from Anacapri - profile pic is from my family bed & breakfast. Chair lift in Anacapri to Monte Solaro!"}, {"username": "Sarah Hadjinian Kirakossian", "comment_text": "Rome\nEmma’s\n\nFlorence\nPauli\nMalazesta\nTrattoria ZaZa\n\nVenice\nCipriani\nFlorian for drinks and dessert\n\nMilan\nBiffi"}, {"username": "Elisca Roberts", "comment_text": "Following"}, {"username": "Gwen Erisman", "comment_text": "You have to do the pesto making class in Cinque Terre at Nessum Dorma! Also while in Venice get drinks and listen to the music at St. Mark’s Square before dinner!❤️"}, {"username": "Fran Scher", "comment_text": "Did a 6 hour food and walking tour through the back streets of Naples. It was fantastic. Delicious, interesting and wonderful way to see Naples."}, {"username": "Sheree Cheramie Vadell", "comment_text": "I would highly recommend a food & wine tour in Rome…in the Trestevere area…The best thing we did!! They take you to all of these hidden gems and OMG the food is so good."}, {"username": "Sheree Cheramie Vadell", "comment_text": "We loved our golf cart tour in Rome. Very cool way to see the city. Also, one of our favorite restaurants is a place called Old Bear!! Get the eggplant!! make a reservation online This place is really good. We’re from New Orleans, we know GOOD FOOD!! ￼If you like Carbonara, Osteria de Fortunato was fabulous. We loved the food in Rome especially!!"}, {"username": "Valerie Collanton", "comment_text": "Take a boat tour when you are in Capri. We did the one that leaves from the dock and it wasn’t very expensive (I can’t remember how much it was). But it was so beautiful and it will be a great way to cool off a bit !"}, {"username": "Rachael Richardson", "comment_text": "With restaurants it’s difficult as you are not always in the area at the right time , we just looked at the menu - if it had what we wanted to eat we googled to see reviews - never had a bad meal in 17 nights !"}, {"username": "Alana Marie Sult", "comment_text": "I would do the \"free tour\" in Florence about the Medici. Lunch of gnocchi at Osteria Santo Sprito and of course the best Gelato in Florence at La Carraria"}, {"username": "Rachael Richardson", "comment_text": "2 places to get a view - sunset Michelangelo piazzle Florence and communal garden sorrento"}, {"username": "Tara Foster", "comment_text": "Following!"}, {"username": "Karen Bowman", "comment_text": "I would be interested in knowing where you are staying for these locations"}, {"username": "Kathy Flood", "comment_text": "Venice book the wine tour with rowvenice.com. It was amazing!"}, {"username": "Pamella Hardy", "comment_text": "It’s a lot of destinations for 2.5 weeks .."}, {"username": "Meghan Tan", "comment_text": "Many places/ restaurants close for much of August so you may want to call ahead."}, {"username": "Gina Rovello Keenan", "comment_text": "Sounds wonderful but that is a lot in 2.5 weeks! Are you spending more than 2 nights in any area? You are going to spend a lot of time traveling. Can you eliminate 2 places to spend more time in each to enjoy?"}, {"username": "Ivette Lugo", "comment_text": "i have the same itinerary except not going to Rome, stay an extra day in Capri, check out zuma in capri"}, {"username": "Renae Larcus", "comment_text": "Yikes. That’s a lot for 2.5 weeks. I would stay either north or south of Rome."}, {"username": "Yasmine Marie", "comment_text": "You can definitely do it. We did 7 cities in 10days we were there and was in awe of everything. Wouldn't recommend too much time in Rome, 2 days max."}, {"username": "Danielle Moore", "comment_text": "Honestly, I would only do northern or mid to southern. 2.5 weeks and all these places you might really miss out on really feeling like you are in the culture"}, {"username": "Danielle Moore", "comment_text": "For instance, we are going 17 days and doing Rome, cinque terre, and Florence. Spread out so we get to see everything and really enjoy without all the extra travel"}, {"username": "Kadie Mcgugan", "comment_text": "Cameron Holliday"}, {"username": "Kathy Strickland", "comment_text": "I would say Naples and Ischia"}, {"username": "Linda Freese Haggard", "comment_text": "Following"}, {"username": "Wendy Wood Cullum", "comment_text": "Send me your email\nI’ll send u my recent itinerary"}, {"username": "Wendy Wood Cullum", "comment_text": "Path of the Gods hike in amalfi is to die for. Look up fullsuitcase for exact directions.\nShe also gives u great tips for all cities"}, {"username": "Brian McGraw", "comment_text": "You won’t be able to do all that in 2.5 weeks.\n\nNot without skipping some pretty major stuff.\n\nYou could honestly spend 2.5 weeks just in Rome and maybe get to one other.\n\nCandidly, I’d leave Rome for another trip.\nOr Naples / Amalfi for another trip."}, {"username": "Rosemary Barbetta", "comment_text": "Don’t forget you have to travel from one place to the next."}, {"username": "Sar Malco", "comment_text": "Florence- 2nd time to visit, stayed 6 days & used it as a base to visit Siena & San Gimignano. Part of the experience is finding restauranrs & cafes then chill & soak up the vibes of the place. So, for a 2.5 week trip, ideally 3 places, 4 maximum. I'd start by prioritizing which 3 or 4 to visit."}, {"username": "Nora Parisi McAdam", "comment_text": "Following"}, {"username": "So Heila", "comment_text": "Following"}, {"username": "Deborah Probert Medina", "comment_text": "I think it’s plenty of time. You are just going to have really full days."}, {"username": "Krina Desai", "comment_text": "Following!"}, {"username": "Karen Espinoza", "comment_text": "2.5 weeks is enough time\nEnjoy every minute\n\nCinque terre\nGet the train tickets and the park on this app"}, {"username": "Martha Hughes", "comment_text": "#4: walk to every site .. along the way you'll see great little or even hidden spots and lesser known sites . download the Rick Steves orientation walking tour or another .. you'll love it . walk to the Vatican, to Trastevere . to the Borghese Gallery, through the Borghese gardens . to the Spanish Steps . to the Colosseum . to Aventino, to Centro Storico, to Monti."}, {"username": "Phyllis Snyder", "comment_text": "It’s a good line up of cities."}]}, {"id": "2200530777012667", "text": "Can anyone recommend a private tour of Herculaneum from Naples? We’re staying in Sorrento and will take the train to Naples. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2200530777012667/", "likes": 1, "comments": [{"username": "Barbara Brosnan", "comment_text": "Joe Bananas, we used them several times over our 16 day trip and they were nothing short of fabulous each time. Joe Banana Italy"}, {"username": "Glenn Todd Webb", "comment_text": "https://\nwww.easycartourn\naples.com/\n\nWe had pick up and drop off at hotel, and guide. Great service. We used them to Ravello and Casertes too."}]}, {"id": "2200534940345584", "text": "Hi\nWe will be staying 2 nights in Rome after our cruise. We booked those nights at the Royal House Hotel across from the Colosseum.\nHas anyone stayed there ? If so, ￼ what was your experience? ￼\nThanks !", "link": "facebook.com/groups/1373361046396315/permalink/2200534940345584/", "likes": 2, "comments": []}, {"id": "2200535157012229", "text": "How can I use my curling iron and straighter in Italy? All the adapters I look at say they aren’t compatible.", "link": "facebook.com/groups/1373361046396315/permalink/2200535157012229/", "likes": 20, "comments": [{"username": "Jill Ehlers", "comment_text": "Does the hotels usually have blow dryers?"}, {"username": "Grace Sulsenti", "comment_text": "Walmart has converters & adapters in the travel section."}, {"username": "Kate N Karim Al-Azzawi", "comment_text": "I bought a dual voltage l’ange straightener and used an adapter. Easy Peasy."}, {"username": "Kim Storcella", "comment_text": "Madison Storcella"}, {"username": "Sylvie Hogg Murphy", "comment_text": "This is what I do, as someone who cares about how their hair looks when on vacation in Italy! - get a blowout every 2-3 days. Hair salons are EVERYWHERE (parrucchiere) and it’s usually no issue to just walk in. That way you can get a professional look (straight = lisci, straightening iron = piastra, wavy = mossi, volume = volume, blowout = piega) and it will only cost 20-25 euros."}, {"username": "Karen Riley", "comment_text": "Converter"}, {"username": "Melanie Souza Piva", "comment_text": "Don’t believe it when it says compatible. It won’t be. I had converters, adapters, everything. Still burned up my low voltage hair dryer. Buy one there, trust me."}, {"username": "Di Ganibe", "comment_text": "Rica Alimagno"}, {"username": "Melita Gray Brantley", "comment_text": "Most hotels we stayed in had a hair dryer either in the room or available upon request. I bought a rechargeable flat iron on Amazon that has become my travel staple."}, {"username": "Susan Davis Reever", "comment_text": "Buy one over there. Works so much better."}, {"username": "Catherine Gomez", "comment_text": "Most accommodations will have blow dryers. I would suggest buying a curling iron/\nstraightener there so no adapters or converters needed. I saw a curling iron for sale at a small electronics shop. In the UK they are called curling tongs 😊"}, {"username": "Gabriella Villasenor", "comment_text": "I Bought a dual voltage curling iron and used an adapter -and honestly it was so hot and humid these past few weeks my hair frizzed as soon as I walked out the door- I ended up wearing buns"}, {"username": "Jenny Frank", "comment_text": "I dont know why ppl are having a hard time with this; I just plug my iron in the adapter and done (no, its not dual voltage)."}, {"username": "Jeanne Bissell", "comment_text": "I bought a small iron in Italy. I have one for UK also. Maybe 20euros…"}, {"username": "Jennifer Eversman Smyre", "comment_text": "As long as the iron or straightener runs on 110/220-240 and 50/60hz you only need an adapter to change the US plug to a European one."}, {"username": "Donna Prues Conlon", "comment_text": "Following"}, {"username": "Beth Casella", "comment_text": "I got two off of Amazon, both said they were compatible in Europe. When we got there one worked and one didn’t. 🤷🏻‍♀️\n\nFiguring out your hair tools is part of the experience! 🤣"}, {"username": "Jan Soto", "comment_text": "buy an adapter from amazon"}, {"username": "Sandee Sheldon", "comment_text": "Honestly it’s so humid in Italy in the summer it was hard to control my hair. Just give up and wear a cute hat!"}, {"username": "Sylvie Bourcier", "comment_text": "Buy a cheap one at the destination"}, {"username": "Karen Arsola", "comment_text": "No one cares"}, {"username": "Annmarie Chenoweth Burmeister", "comment_text": "It will most likely blow up. I’m here now. 7 out of 7 girls blew hairdryers and/or flat irons."}, {"username": "Michelle Parrott", "comment_text": "Rob Parrott!!"}, {"username": "Christine Ann", "comment_text": "I bought travel ones"}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "My daughter had hers burn up. Guess her blow dryer was too high voltage for the converter? It was an 1800 one."}, {"username": "Jean Mason", "comment_text": "I ordered mine from Amazon and it worked perfectly"}, {"username": "Jeannie Fritter", "comment_text": "My beach waver was dual voltage and we just brought the plug adapter and it was fine!"}, {"username": "Kit Nader", "comment_text": "Just use the right adaptor. I'm from uk mine worked fine if u r from America I guess its different. You could buy one there."}, {"username": "Sandy Burton", "comment_text": "These worked for me. Ordered from Amazon"}, {"username": "Chamila Zacky", "comment_text": "I need my Dysin airwrap, heard it can stuff up with the adapter. Any recommendations\npls, I love the comb attachment to fry my hair and straighten."}, {"username": "Lana Watson Famiano", "comment_text": "I have a dual voltage curling iron that I have used for years in Italy with no problem. I simply use an adapter. If your appliances are not dual voltage you need a converter to convert the voltage from 220 to 110."}, {"username": "Martha Hughes", "comment_text": "I was in Trapani, when my curling iron blew-up. It worked in Palermo just fine : regular curling iron (not dual voltage) combined w/\nconverter (not adapter). I asked the staff at the hotel and walked all over the \"new\" part of the city to find a curling iron. Not. So my recommendation: buy a new dual voltage curling iron now and use a converter."}, {"username": "Peggy Ryan Lundgren", "comment_text": "I would just get a blowout once a week and bring dry shampoo. It’ll be part of your fun then too. 😊"}, {"username": "Suzanne Carver Musashe", "comment_text": "Will blow fuses"}, {"username": "Kathleen Gilligan Beddis", "comment_text": "I had an adaptor and it worked just fine"}, {"username": "Roula Abaci", "comment_text": "Just buy one there my daughter just picked one up for €20 not worth bringing your own"}, {"username": "Paula Smith Lemmon", "comment_text": "Dual voltage is a must. Then a converter"}, {"username": "Gina GC", "comment_text": "This is what you need. Been to Tahiti, Italy, So Africa - it works everywhere. Get it on Amazon around $22 US. There are several different types"}, {"username": "Lucrezia Folger", "comment_text": "Go natural. Let you hair do what its meant to do."}, {"username": "Tracey Ann", "comment_text": "Go to CAA I got mine there. They have one for italy. I brought my straighter. And used adapter to charge phone. No issues"}, {"username": "Olga Plitt", "comment_text": "Leave them home and wear your hair natural. Free yourself on vacation."}, {"username": "Valerie Bartolone", "comment_text": "I bought one in Italy and I take it whenever I go back. Nothing too expensive but enough to to the job"}, {"username": "Gail Naylor Bottone", "comment_text": "Hotels will give you an adapter"}, {"username": "Laurie Cardarella Denny", "comment_text": "I took my beachwaver curling iron (it is dual voltage) and used an adapter for the plug. Worked great, no issues. They often advertise sales on Facebook."}, {"username": "Michele Liggett", "comment_text": "I bought this on Amazon but haven't used it yet. Also got dual voltage conair travel dryer. Looking for a small dual voltage curling iron to take."}, {"username": "Diane Mallow Brown", "comment_text": "A lot of hotels provide them"}, {"username": "D'Anna Hohe", "comment_text": "Italy (as well as the rest of Europe) uses higher voltage AND has wall outlets that require different shaped plugs. You need to worry about both if you are taking electric appliances there. Be aware that the terminology used online is often inconsistent and confusing.\nMany electronics like phones, iPads and laptops are already dual voltage (check the label on the back, it should say something like 110 - 240 V). For these, you only need an adaptor which “adapts” the plug to the shape of the wall outlet.\nIf your appliance is not dual voltage, you will need both an adaptor and a converter. A converter “converts” the voltage coming from the wall (220V) to the voltage (120V) needed by your appliance. If you don’t use a converter, you will trip a breaker, burn up your appliance and/or start a fire.\nThe problem for travelers is that most appliances with motors or that heat need a lot of power (watts), and the converters needed are very heavy.\nThe best thing to do is buy a dual voltage appliance and then only an adaptor (specific to country or area) is needed wherever you travel.\nAnother option would be to buy a 220V version in Europe.\nIf, however, you want to try a converter, check that label again for the wattage and make sure that the converter is adequate for the wattage of your appliance."}, {"username": "Carey Mundy", "comment_text": "I bought a European one ona trip and use it! Not that pricey"}, {"username": "Gianna Onesi", "comment_text": "Buy a European one on amazon"}, {"username": "Stephanie Gandy Riley", "comment_text": "Assuming the same for blow dryers?"}, {"username": "Jenny Arena", "comment_text": "Buy an inexpensive one there. I brought mine, used converter and it still fried my flat iron."}, {"username": "Christine Pinto Kulp", "comment_text": "I would t bother…when you go out in the heat and humidity, it won’t have made a difference. Ponytails are best!"}, {"username": "Evie Slavic", "comment_text": "I bought them there. I've brought mine in the past and tried using an adaptor but they fry every time after a few days."}, {"username": "Gina Winterstein", "comment_text": "I have one (straightener) I bought while in Italy because mine was ruined when I tried it. I'll sell it to you and mail it to you. A really good one. Let me know if you are interested."}, {"username": "Jeanine Henson-Zagar", "comment_text": "I appreciate the responses about converters and adapters! To all who try to convert me to not using an iron… not everyone’s hair is like yours, ponytails don’t work for all and that was not the question asked."}, {"username": "Lindsey Mitchell", "comment_text": "In 2022 I took a converter plus my american hair tool (dryer with brush attached) and it didn’t work well. It would turn on but always smelled like something was burning so I tried not to use it. Learned my lesson & bought an Italian hair dryer when I was there last month. I stayed for 2 weeks in Italy & the dryer (bought from a grocery store w/ ionic technology worked great & probably cost about $40.) for me~ it was WELL worth the money to buy something there that I knew would work. {Did such a nice job, kind of wish I could use it at home.} I also plan on traveling to Europe yearly going forward for work so I’ll be able to take it back with me in the future. 🫶🏼"}, {"username": "Adeline Alex Tanfara", "comment_text": "Need 220 volts converter"}, {"username": "Samaria Braman", "comment_text": "F"}, {"username": "Joanne Sharam", "comment_text": "Macey"}, {"username": "Dianne PorŦer Wilson", "comment_text": "I blew out an adapter with my American hair dryer...buy one made for Europe."}, {"username": "Annette Tamminga", "comment_text": "Well this want confusing at all. 🤦‍♀️"}, {"username": "Bernadette Sarmiento", "comment_text": "I bought on Amazon 220v then used an adapter - used it in Croatia Spain"}, {"username": "Maria Badamo DeSocio", "comment_text": "I would get ones that are dual voltage."}, {"username": "Lisa Flanders", "comment_text": "Walmart has one that converts to all European outlets, and has 3 usb ports, as well as a light on it.\nWe used it in the UK, Greece, Italy, Switzerland, and France."}, {"username": "Alexandra A Welker", "comment_text": "If your flat iron/curling iron isn't dual voltage then you will need a converter. If it's dual then you need an adapter, buy the universal kind. Plenty of choices in Amazon. Mine looks like this. 👇"}, {"username": "Letty Veronica", "comment_text": "This worked great for me last week into my adaptor and it is a combo"}, {"username": "Laura McSweeney", "comment_text": "I used a dual voltage flat iron with a converter. No problems"}, {"username": "Janis Nunez", "comment_text": "Get a dual voltage iron and an adapter. Your good to go. Enjoy! I’m heading home from Italy now."}, {"username": "Amy Holbrook", "comment_text": "I use this brand at home. It’s a great product and works in Europe.\n\nhttps://\nlangehair.com/"}, {"username": "Starla Dawn", "comment_text": "Well I ended up looking like Kramer in the episode where he tanned too much."}, {"username": "Kyna Martin Autrey", "comment_text": "I just always use an adapter for the country I’m going to and have used my straightener for weeks and weeks in the UK and Europe. Just make sure the straightener is dual current"}, {"username": "Christy Geis", "comment_text": "I ordered a dual voltage straightener off Amazon for about $30 and just use a plug adapter. It works great!"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "I brought mine and an adapter and never used them"}, {"username": "Elissa Lattanzi Carrano", "comment_text": "Put your hair in a pony tail, no body is looking. Enjoy your trip😉"}, {"username": "Michelle Plutto", "comment_text": "I gather hotels\nIn Europe dont have blow dryers??"}, {"username": "Bea Kuckens", "comment_text": "I just used the same adapter that I used for everything else and had no problem 🤔"}, {"username": "Michelle Evans Greene", "comment_text": "Bring a dual voltage hairdryer curling iron and flat iron"}, {"username": "Tina Moreman Hunter", "comment_text": "Type C is very common and it will work in Italy."}, {"username": "Vasthi Cheddar", "comment_text": "Unless they are dual voltage You need a converter, not an adapter"}, {"username": "Lynda A. Lavin", "comment_text": "Always buy an adapter IN the country you are going to."}, {"username": "Kristi N Doug Leonard", "comment_text": "Wanted to save space in my suitcase, so when we were in Italy, in March, I brought a dual voltage travel size flat iron. Takes a little more time to use, but worked fine & I love the little size. Bringing it on our cruise to Alaska next month."}, {"username": "Lawrence J Morello", "comment_text": "Please forgive me me for intruding on this nice person's post. Against all recommendations\n, I just brought my small kitchen appliances with me in my move to italy. Some were my mothers and I couldn't part with them, and some were too knew to leave. I know I will need a converter. Does anybody know if just one converter will work for all of them? Thanks."}, {"username": "Mary Skvarch", "comment_text": "I buy that stuff there."}, {"username": "Cassandra Gartner", "comment_text": "Buy a converter in the travel section at Target/\nWalmart, etc"}, {"username": "Gaye Watkins", "comment_text": "Mine worked. We bought a bag of 6 or 7 adapters (could be used world wide). We did fine."}, {"username": "Anne Raindrop", "comment_text": "The odds are, no matter what you use, it will burn out. Don’t take your expensive ones. I only have one Revlon wand that hasn’t combusted."}, {"username": "Marianne Kathleen McCrary", "comment_text": "I had to buy my Dyson in Roma, the adapters wouldn’t work."}, {"username": "Leslie Henise Kelly", "comment_text": "I bought a dual voltage one and a converter from Amazon and it worked great"}, {"username": "Sandra Kingsley", "comment_text": "Most accommodation will have a hairdryer!"}, {"username": "Kathy Prittie", "comment_text": "Do the hotel rooms have hair dryers?"}, {"username": "Whitney Meyers", "comment_text": "You can’t you buy an Italian one. Lol it will blow the fuse each time"}, {"username": "Lyn Pappas Dahm", "comment_text": "Only if they are dual voltage"}, {"username": "Cynthia Crowe McSwain", "comment_text": "You need a converter plus a plug adapter. Or buy a dual\nvoltage model plus at least one plug adapter. You need the Type L plug adapter for Italy."}, {"username": "Linda Miller", "comment_text": "You need a converter not an adapter!"}, {"username": "Fetchin Gretchen", "comment_text": "Add a converter"}, {"username": "Katherine Aube", "comment_text": "Just buy when you get there or stay where they offer a blow dryer etc\nSo much easier to purchase … stores all over sell what you need"}, {"username": "Connie Iacozza Brazzoni", "comment_text": "I used a converter and it fried my straightener. Be careful"}, {"username": "Fran Nelson", "comment_text": "Just buy a dual voltage curling iron and straightener. Honestly- we blew fuses abroad. Annoying and embarrassing 🙈"}, {"username": "Renae Larcus", "comment_text": "Leave them home. Haha. Seriously though. Your life will be easier"}, {"username": "Tana Muraro Sheets", "comment_text": "I bought a dual voltage straightener on Amazon that worked just fine."}, {"username": "Bobbie A. Lewis", "comment_text": "Order an adapter from Amazon."}, {"username": "Myleene AP", "comment_text": "I would just buy a travel one that is dual voltage, we bought a mini hair straightener, iron( for clothes) , hair dryer -all mini —online and we have used it several times going back to Europe"}, {"username": "Sharon Bowns", "comment_text": "Sharon Bowns"}, {"username": "Corinne Cavallaro", "comment_text": "I purchased this from Amazon and used it in Rome for my curling iron. Worked great with no issues."}, {"username": "Celia Bertone", "comment_text": "I would just buy one there or order ahead of time with European plug"}, {"username": "Diana Occhipinti", "comment_text": "￼ Just got home yesterday and I ended up slicking my hair back in a bun. It was so damn hot."}, {"username": "Phyllis Snyder", "comment_text": "Just buy when you get there."}, {"username": "Gillian O'Callaghan", "comment_text": "You're confusing adapter and converter. Adapters adapt the plug so yours will fit in different hole configurations.\nIf you live in US you will need i) your curling iron and straightener to be dual voltage ii) a converter if they're not.....or buy them in Italy and not worry about either."}, {"username": "Christine Sanci-Gentile", "comment_text": "Buy one when you get there. The ones that we bought said they were compatible and didn't work."}, {"username": "Ivette Lugo", "comment_text": "buy a European outlet"}, {"username": "Cherie M VanCleave", "comment_text": "Get a converter\nDifferent than an adaptor because it converts the voltage\nEven if you get a dual voltage appliance you will need an adaptor plug"}, {"username": "Cherie M VanCleave", "comment_text": "Look on the bottom of your appliance and it will tell you voltage\nPhones are dual voltage and computers usually"}, {"username": "Jan Mitchell O'Daniel", "comment_text": "I bought a travel blow dryer on Amazon with dual voltage specifically for a recent trip to Italy. Even with dual voltage, an adapter, and advertising on the package saying it would work, it did not. Worked for about 5 minutes and then dead. My advice—do without curling irons and flat irons, etc. Use only the blow dryer provided by the hotel."}, {"username": "Cherie M VanCleave", "comment_text": "https://\nwww.ricksteves.c\nom/travel-tips/\nphones-tech/\nelectric-adapter\ns-converters"}, {"username": "Sandra Maldonado", "comment_text": "Buy one when you get there."}, {"username": "Rasha Za", "comment_text": "I wouldnt"}]}, {"id": "2200535787012166", "text": "I am trying to decide which places in Italy I want to visit so I can build my itinerary. I am looking for wine vineyard recommendations, please.", "link": "facebook.com/groups/1373361046396315/permalink/2200535787012166/", "likes": 5, "comments": [{"username": "Alice Francesca", "comment_text": "https://\nwww.winetourism.\ncom/\nwineries-in-lang\nhe/\n\nPiedmont"}, {"username": "JeriLynne Clifford", "comment_text": "Langhe and Tuscany would be my choices. We actually have done both in the same trip.\nWe have hired drivers to take us to the wineries."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I would advise you to watch some Rick Steves videos. They will give you a better idea of what you will want to see. Avoid July/August if you can."}, {"username": "Renae Larcus", "comment_text": "Tenuta Torciano outside of Siena. Ate dinner in the vineyard. Lovely."}, {"username": "Jud Luli", "comment_text": "En toda Italia tienes vino ...yo te recomiendo en la Toscana a Montepulciano donde tienes el conzorsio del vino nobile de Montepulciano donde es una sala con más de 80 vinos para catar, y Montalccino en los dos sitios la uva predominante es el Sangiovese... Una vez ahí infórmate q bodegas puedes ver o por las carreteras encontrarás muchas bodegas y puedes pararte en la que más t guste. Yo este año voy más al norte en la zona de Verona hasta bolzano y visitaré las zonas de Valpolicella, Soave y Alto Adige..Tienes la zona del sud Puglia y costa Amalfitana, Venetto, Sicília también tienes buenos vinos ... te recomiendo elegir una zona de Italia y después informarte de esa zona."}, {"username": "Rosa Pulsoni- Mandaradoni", "comment_text": "Went several years ago and stayed in Sienna.\nDid a couple of wine tours that took us to different villages and wineries in the area.\nLoved it.\nBooked it all through our hotel."}, {"username": "Miyuki Kanno Paul", "comment_text": "Do you like any particular Italian wine? There are so many to choose from, so I recommend a bit of research on Italian Wine and regional specialties. For example, Chianti and Brunello di Montalcino are in Toscana. Lambrusco is in Emilia-Romagna.\nProsecco is in Veneto.\n\nOnce you identify your wine region, then start building your itinerary! You probably need to rent a car, though"}, {"username": "Gayle Moores", "comment_text": "On our last visit to Italy we stayed in Siena and took a wine tasting tour combined with a stop in Monteriggioni a medieval walled town. Our first stop was Poggio Amorelli in the Chianti region close to Siena.The vineyard is run by the Mazarrini family who are owners. They took us on a guided tour explaining the production process and we did a wine tasting with small plates of Tuscan eats. Their Chianti Classico wines are very good and considered certified Chianti wine. They also sell their own aged balsamic vinegar which is made in Modena at their own vinegar factory. They also have their own vinegar farm there. We got to try some of it as well. We really enjoyed the experience and came home with a bottle of aged balsamic vinegar. The bottle of Chianti wine we bought we enjoyed in Italy."}, {"username": "Stefano Follador", "comment_text": "Italian wine producer here, fell free to DM me if you want.\n\nI suggest you to download FIVI app, it’s an association of small family wineries all over the country, it could help you build your itinerary and you could find some hidden gems.\n\nItaly produce wines all over the country. So there is a lot of options. Where are you thinking to go?"}, {"username": "Judy Jamieson Pisano", "comment_text": "Which area of Italy? I can recommend wineries in Piedmonte, Tuscany, Campagna, Puglia, Etc…"}]}, {"id": "2200537703678641", "text": "Best water bottles to carry around? Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2200537703678641/", "likes": 3, "comments": [{"username": "Bill Shafer", "comment_text": "Bottled water is cheap in Italy, we usually buy a case of it when we get there and refill our bottles either at the hotel, or at one of the many water fountains if you are in Rome"}, {"username": "Joy Buenaflor", "comment_text": "Yeti. Insulated. Keeps water with ice, ice cold!"}, {"username": "Michelle Lacson", "comment_text": "hydroflask! its a bit heavier/bigger than regular plastic water bottles, but the insulation to keep it cold for hours is a must for italy rn!"}, {"username": "Darrah Horton", "comment_text": "The best is going to be what fits in your bag (IMO). I used my hydra flask so that my water stayed cool on those hot days walking around."}, {"username": "Sherri Wills", "comment_text": "I got these collapsible water bottles"}, {"username": "Sara Silence", "comment_text": "I'm totally against plastivwater bottles, but regretted bringing mine with me. It was a hassle, I did better off just buying one and filling it up when needed. I carted a mostly empty hydroflask across three countries. BUT at home I would have that full of coffee or hot coffee all day."}, {"username": "Thomas Jensen", "comment_text": "There's public waterpost all over town and it's for free."}, {"username": "Melissa J. Webster Groenewegen", "comment_text": "So I haven’t been back to Italy in a long time, and I was living in Europe at the time so I could drink the local water…but now I’m wondering how you are filling up your water bottles with “safe” water? In addition, I remember that anything refrigerated is expensive and I don’t remember seeing ice for sale anywhere, so how are you filling up your bottles?"}, {"username": "Voula Ladas", "comment_text": "Frank Green range of bottles are great ! I’ve purchased the larger 2 L size as I’m intending on doing some long hikes on my next trip . For the other days I will just half fill it . They have smaller ones too. I have purchased a sling for it so I don’t have to carry it , or keep taking it out of my bag . Sling was sold separately . (It’s not from Frank Green company. It’s the Baggu brand )"}, {"username": "Kyna Martin Autrey", "comment_text": "We bought a disposable bottle of water at a supermarket and then just filled it over and over, this nothing to pack in or out."}, {"username": "Jeneen Patterson Brewer", "comment_text": "Jeneen Patterson Brewer"}, {"username": "Kuusik Aimi", "comment_text": "These are best:\nhttps://\ntakeyausa.com/\nproducts/\noriginals-insula\nted-water-bottl\ne?_pos=3&_fid=0\n902f7fcc&_ss=c&\nvariant=4022700\n8905325"}, {"username": "Lisa Schalig-Winter", "comment_text": "Just finished 3 weeks in Italy. We brought collapsible water bottles. They probably would have been fine if it wasn’t so hot. Water was warm within a few minutes. I wish I had my hydro flask."}, {"username": "Jennifer Spatrisano Moran", "comment_text": "Yeti. Hands down."}]}, {"id": "2200537863678625", "text": "We are celebrating a birthday and an anniversary with family and friends in June 2024. We hope to rent a villa in Tuscany (or Umbria) for 10 of us and I’m trying to please everyone! Our needs: swimming pool, 5 bathrooms, and 5 bedrooms with AC. Our wish list: walkable to a village, and 60-90-minute drive to a beach. Suggestions for where our dream villa should be? Would love to hear about your experiences, pros, and cons, and recommendations. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2200537863678625/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "Emmavillas is the right site for you!\nThey have stunning properties in Tuscany and Umbria.\nThis is their site for Tuscany.\nI highly recommend the Val d'Orcia valley, so look near Pienza, San Quirico d'Orcia, Montalcino"}, {"username": "Tom Manno", "comment_text": "Check out the villas for rent at Tuscany and More."}]}, {"id": "2200543533678058", "text": "Do you feel you can walk Florence on your own, or is a tour guide a good idea?\nOur hot spots would be the Accademia Gallery, Duomo, Giotti's Bell Tower, Piazza della Signoria. If anyone has another recommendation, please share! We are not interested in other museums/galleries. Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2200543533678058/", "likes": 5, "comments": [{"username": "Alice Francesca", "comment_text": "The center is absolutely walkable on your own.just ask for a map at your hotel"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "https://\nvandam.com/\nmapstore_title.p\nhp?id=43\n\nThese laminated maps are great. All the major sites, easy to read.\nThe Rick Steves Audio guides are free and also great. Just download the tours onto your phone."}, {"username": "Kathleen M Miller", "comment_text": "Download Rick Steves Audio Europe app. He has several audio guided walks in Florence, Rome and Venice."}, {"username": "Lushan Yao", "comment_text": "Florence is compact and walkable, and you can download Google map for use offline."}, {"username": "Gena Diaco Penland", "comment_text": "Definitely walkable. We did a guided private tour of the Academia gallery and it was great! Our guide was amazing and we learned SO much that we had no idea about. We booked it through Viator."}, {"username": "Murphy Aileen", "comment_text": "Buy a map at any magazine stand. Florence, such a beautiful, and walkable city"}, {"username": "Dana Green", "comment_text": "Those are all very close to each other. Very easy to get to all of them."}, {"username": "Miyuki Kanno Paul", "comment_text": "Rick Steves guidebook and his audio are your best friends!\nDo not miss Palazzo Pitti, Musei del Bargello, and Cappelle Medicee for Michelangelo’s famous “Day and Night” and “Dawn and Dusk” to your list. This renaissance town is full of art"}, {"username": "Rosemary Herger", "comment_text": "Florence is walkable"}, {"username": "Barbara Bastianini", "comment_text": "Florence is a very walkable city. No tour guide is needed."}, {"username": "Michelle Robertson-Leathley", "comment_text": "Tony Leathley"}, {"username": "Liz Cooper", "comment_text": "I have always prepared ahead and walked cities on my own. Love the little surprises I get when I’m paying attention to the city not a guide."}, {"username": "Jeff McLellan", "comment_text": "Super walkable."}, {"username": "Lisa Kelly", "comment_text": "On your own"}, {"username": "Lori Ossowski", "comment_text": "We used Guru walk.com for a two hour walking tour one morning. The walk covered a few of the places you mentioned, and the guide was entertaining. He studied as an architect and showed us details we would have overlooked. Felt free to ask questions at the end. He gave us great meal suggestions. Guruwalk offers free tours with tip offerings. We tipped 10 Euro each."}, {"username": "Madeline Caporale", "comment_text": "Yes, exploring Florence on your own is totally doable."}, {"username": "Wendy Harrison", "comment_text": "It's very compact and walkable."}, {"username": "Kathy Kibbe", "comment_text": "I would get a guide to take you through the Uffizi - both to skip the line and to hear about the most important pieces and the history behind them - the rest of Florence is very doable on your own"}, {"username": "Blanca Gil", "comment_text": "The best part of Florence is it’s a walkable city. You will not get lost and you will always find something interesting wherever you go."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200545437011201", "text": "Hi all, we are departing from Milan Malpensa in a couple of weeks, with hold luggage. easyJet\"s site has made me nervous, on one page it said 'this airport is big, allow at least 3 hours to reach the gate'. Then on the next page it says 'bag drop opens at 1pm. Gates close at 2.30'.\n\nBoth things cannot be true surely? Has anyone any experience of this?\n(And yes, ditching the hold luggage is something we have considered, but the reasons we paid extra for it still stand, so we only want to do that as a last resort).", "link": "facebook.com/groups/1373361046396315/permalink/2200545437011201/", "likes": 0, "comments": [{"username": "Frank Hunt", "comment_text": "It’s no bigger or difficult than any other airport."}]}, {"id": "2200547473677664", "text": "We are thinking about a self guided Vespa tour in Florence/Tuscany. Is it easy to ride around the streets?", "link": "facebook.com/groups/1373361046396315/permalink/2200547473677664/", "likes": 0, "comments": [{"username": "Whitney Meyers", "comment_text": "Yes"}, {"username": "Alice Francesca", "comment_text": "Tuscany is quite big, choose a town and drive around there"}]}, {"id": "2200549473677464", "text": "Going to Sardinia for the first time end of September before we travel to Rome for the Ryder Cup. Best city to stay in? Best hotels? One of the few Italy areas I have zero familiarity with.", "link": "facebook.com/groups/1373361046396315/permalink/2200549473677464/", "likes": 0, "comments": [{"username": "Simone Pfenninger", "comment_text": "Hotel Romazzino, a Luxury Collection Hotel, Costa Smeralda"}, {"username": "Kay Rendall", "comment_text": "Loved Alghero, Flew direct from Rome. so much history, beaches nearby, and Cagliari, flew in to 1, bus,train south, then flew out to Italy"}]}, {"id": "2200553377010407", "text": "Cruising next week suggestions for things to see visit at port Livorno , Genoa , Sicily and Naples", "link": "facebook.com/groups/1373361046396315/permalink/2200553377010407/", "likes": 2, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Naples : Capodimonte and San Elmo, Via Toledo, Duomo, Chiostro Di Santa Chiara, Lungomare, Castel dell'Ovo, Teatro San Carlo, Palazzo Reale, Piazza del Plebiscito, Monte della Misericordia, Capella San Severo. Taste gelato at Gay Odin, pizza portafoglio, pizza frita, fiori di zucca fritti, sfogliatella. Train to Pompei. Ferry to Ischia, Procida, Capri."}, {"username": "Leila Myftija", "comment_text": "Livorno: take a walk through the city center to see the canals (\"fossi\"). Besides that, there's really not much to see.\n\nIf you're staying more than a day, go see the smaller towns around Livorno."}]}, {"id": "2200556110343467", "text": "Ciao a tutti e tutte! I'm an EU student, and I'll be studying to UniBo for the whole academic year! Anyways, since I'll be in Italy, I want to see as much as possible - but, I'm stuck, and don't know any places up north, and close to Bologna. If you can leave a comment of any places that you have visited, or any archeological sites or museums. I'm also thinking about traveling to Rome, so if you can recommend places to visit, any hostels, or places to eat. Grazie mille! x", "link": "facebook.com/groups/1373361046396315/permalink/2200556110343467/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "Parma and Ravenna are very close to Bologna and definitely worth a visit (maybe by train on a sunday? Regional trains are inexpensive). Firenze, Milano and Verona are also very easily reachable by train (high speed, more pricey). If you like outdoor activities, you will find the Appennino Tosco-Emiliano very interesting and rich (that's the mountain chain between the region of Bologna and the region of Firenze)"}, {"username": "Scott Perry", "comment_text": "An entire year in Bologna? I'm so envious. If you find yourself at Guero on via Goito for cocktails, please tell Alberto and Daniele \"Hi\" from Scott. My favorite museum in Bologna is the Archaeological Museum. Modena is just about a half hour away by train, and you can get to Verona in about an hour and a half."}]}, {"id": "2200559153676496", "text": "We have a week to 10 days available . . . Would you recommend Amalfi Coast or Sicily?", "link": "facebook.com/groups/1373361046396315/permalink/2200559153676496/", "likes": 10, "comments": [{"username": "Kathy Wayment", "comment_text": "Sicily"}, {"username": "Jane Lisa", "comment_text": "Only you can decide what your interested in seeing. Watch some YouTube videos by Rick Steves on Italy. He’s wonderful!"}, {"username": "Mariya Terzieva", "comment_text": "For 10 days I would do both ;)"}, {"username": "Alice Francesca", "comment_text": "You can see Ravello, Positano and Amalfi in 5 days.You could visit Taormina, Catania and the surrounding areas in the last 5."}, {"username": "Carole Tarlap", "comment_text": "10 days.....SICILY\n!!! You should be able to see all of the best in that time 💥"}, {"username": "Frannie Kaplan", "comment_text": "Both? :) but if you want to pick just one probably sicily, you can cover the whole island"}, {"username": "Constantine Matsos", "comment_text": "Getting around in Sicily will be somewhat more challenging than the Amalfi coast. If you have only a week pick one and explore that part of Italy. If you have 10 days, you could do both, but it could get hectic depending on how much you want to see and do. Lots to see on the Amalfi coast and in Sicily. My wife and I have been to both, but did them on separate trips. We did the Amalfi coast twice, spending one week on the first visit and three weeks on the second visit. We spent two weeks in Sicily, exploring the entire island using Palermo and Taormina as home bases. Train service can be unpredictable in Sicily. We did use the train to get to Cefalu from Palermo, but otherwise we hired a car and driver to explore the rest of the island.\n\nThe Amalfi coast can be explored by bus or boat service. It’s best to hire a car and driver if you want to explore the entire length of the Amalfi coast. If you like driving, you could also explore the coast by car."}, {"username": "Lina Stump", "comment_text": "Sicily 💯"}, {"username": "Peter Doyle", "comment_text": "Sicily"}, {"username": "Gail Holler", "comment_text": "Amalfi coast."}, {"username": "William Blanton", "comment_text": "Always fair to ask for those who have been to both Sicily and Amalfi, otherwise the people responding have a one sided biased view."}, {"username": "Whitney Meyers", "comment_text": "Sicily"}, {"username": "Lisa Abrams Argento", "comment_text": "Sicily!!"}, {"username": "Maria NoBa", "comment_text": "Amalfi!"}, {"username": "Pietro Di Sorbo", "comment_text": "Ten days is enough to visit the Amalfi and Sorrento coastline and the little costal towns from Castellammare di Stabia to Vietri other then Capri.\nA decent visit of Sicily required at least 15 days."}, {"username": "Suzanne Mills", "comment_text": "Florence"}, {"username": "Maria LoSurdo", "comment_text": "Sicily! ❤️"}, {"username": "Greta Sangster", "comment_text": "Sicily"}, {"username": "Loretta Coccodrilli", "comment_text": "Amalfi"}, {"username": "Lorraine Saliba", "comment_text": "Yes! ❤️"}, {"username": "Raymond Capkin", "comment_text": "Sicily or Cinque Terre"}, {"username": "Sharon Howard Wall", "comment_text": "Thank you all for the responses. 😊"}, {"username": "Rupama Schwartz", "comment_text": "Sicily!!"}, {"username": "Angela Falletta DiGiampietro", "comment_text": "Sicily for sure"}]}, {"id": "2200556553676756", "text": "Hi all!\nWe’re arriving in Bergamo airport after 11pm and need to get to our accommodation in the centre of town. Any suggestions as to the best way to get into town at that late hour?", "link": "facebook.com/groups/1373361046396315/permalink/2200556553676756/", "likes": 0, "comments": []}, {"id": "2200569867008758", "text": "Going to Rome at the end of September. Staying for 3 days/nights. Want to do skip the line and private tour of the Vatican, colleseum, catacombs. Any recommendations on who to use and any other suggestions like a ghost tour?", "link": "facebook.com/groups/1373361046396315/permalink/2200569867008758/", "likes": 30, "comments": [{"username": "Linda Tibbles", "comment_text": "Check out Viator, and Get your guide web sites. They offer reserve now ,pay later."}, {"username": "Dina Garrett", "comment_text": "Linda Williams, Julie Franco Mellow, BillandAngala Verley"}, {"username": "Shane McClain", "comment_text": "City wonders tour was great we just did it 2 weeks ago"}, {"username": "Robert Stone", "comment_text": "Viator offers a small group personal tour of the Vatican at night. Great tour."}, {"username": "Joanne Hopkins-Lucia", "comment_text": "You are going to skip the majors !"}, {"username": "Tammy Jess Mercer", "comment_text": "Skip the line does not exist at the Vatican. You need to get in line with everyone else regardless what the tour companies tell you. We did appreciate the narration of the tour company and would definitely book through them again but don’t expect to get ahead of the crowd."}, {"username": "Steve Grossman", "comment_text": "Viator"}, {"username": "Jazz Caldwell", "comment_text": "Look up Yuval Lahav here on FB - he does tours and is an incredibly sweet young man!"}, {"username": "Jennifer Sharpe", "comment_text": "Expedia"}, {"username": "Beth Casey Murphy", "comment_text": "Vatican direct tickets\n\nhttps://\ntickets.museivat\nicani.va/home"}, {"username": "Beth Casey Murphy", "comment_text": "Coliseum and other archeological sites direct tickets\n\nhttps://\nwww.coopculture.\nit/en/products/\nticket-colosseum\n-forum-and-pala\ntine-_24h/#55"}, {"username": "Jennifer L. Harris", "comment_text": "Liv tours"}, {"username": "Patti Aparo", "comment_text": "Suzanne Denise Bono"}, {"username": "Neville Spargo", "comment_text": "We are in Rome at present and just did the Vatican tour , we booked directly with the Vatican online and did the 7:30am tour which included breakfast at the end of the tour. This is the way to go! there was almost no one there during our tour. When we came out , OMG, the queues for tickets and just to get in wound around. the block, and all standing in the extreme heat conditions , temps at 39 deg C. BTW - the breakfast is huge ! Best deal."}, {"username": "Alan Monroe", "comment_text": "Do not book through Viator/Trip Advisor. They took my money for Coliseum tour, but I never got the tickets. Despite proving I paid and that I couldn’t download the tickets, they denied any wrongdoing and I was out $115. Had to purchase tickets on site and paid a few more dollars- but wasn’t ripped off like Viator did to us."}, {"username": "Marla Davison Danis", "comment_text": "The Tour Guy or Airbnb adventures! Also download Rick Steves App"}, {"username": "Laura Torres Palomino", "comment_text": "We used Viator with no problems. I urge you to buy the “before the crowds” tour. It’s extra, but worth every single penny!! Go later and it will be a hot and smelly, shoulder to shoulder nightmare 😩"}, {"username": "Jayne Dawson Meyer", "comment_text": "Perilo Tours!!! Won't be disappointed!!!"}, {"username": "Rhonda Bean Hendershot", "comment_text": "VIATOR!!!"}, {"username": "Emma Butcher", "comment_text": "Booed all our trips with Viator"}, {"username": "Linda Pitler", "comment_text": "Viator with no issues at all b"}, {"username": "Ania Kubica", "comment_text": "Ania Kubica"}, {"username": "Michelle Bergman Davis", "comment_text": "We used a combo of Viator and Get Your Guide. I highly recommend doing the colosseum underground tour, so worth the extra money!"}, {"username": "Debra Indorato", "comment_text": "Chiara Antonelli Tourist guide"}, {"username": "Raymond Capkin", "comment_text": "200000 people there for Ryder cup"}, {"username": "Stephen McMillen", "comment_text": "Viator app"}, {"username": "Al Filizetti", "comment_text": "Chiara Antonelli tour guide. She took 5 of through Vatican museum. She also does the Colosseum and other tours. She has a degree in history and art learn a lot from her.find her on Facebook"}, {"username": "Enas Mourad", "comment_text": "Get your guide are very good and well organized , head out vatican tour is very good as well early online booking saves you money I paid 20 Euros extra for colosseum tour at the place as I didn’t book earlier but it was a very good I didn’t regret it"}, {"username": "Sheree Cheramie Vadell", "comment_text": "Dark Rome tours are great. Much smaller groups.(usually\n15-20) We enjoyed all of our tours through Dark Rome."}, {"username": "Jasper C. Acton", "comment_text": "Dark Rome, website, for catacomb tour."}, {"username": "Richard Stein", "comment_text": "We just did the Coliseum with Livtours two days ago, it was great and informative. We did not wait in line anywhere."}, {"username": "Helen Clare", "comment_text": "Get your guide"}, {"username": "Rose Valerio", "comment_text": "My cogina did the 5am unlock the doors tour of the Vatican and loved it. It was $$"}, {"username": "Ann Moore-Pak", "comment_text": "Hopefully it wont be ridiculous. Go early!! I used viator."}, {"username": "Margaret Mackenzie", "comment_text": "We booked with Viator and did an early morning Vatican tour. Be aware there were still crowds at the gate but it moved fairly quick. We also did an upper and lower Coliseum with viator which included Palatine as well."}, {"username": "Rachael Richardson", "comment_text": "Get your guide\nTiquets or Headout are all good agents to use for skip the line tickets -"}, {"username": "Mary Evans", "comment_text": "Viator. Thru have great tours. I use them gif my clients. Lots to choose from."}, {"username": "Lisa Valdovinos", "comment_text": "Viator"}, {"username": "Kathy Smith", "comment_text": "If your there for a short time I highly recommend a private golf cart tour. We did a four hour tour and we were able to see so much and get around so much easier. We were a big fan of this."}, {"username": "Dawn Muscarnera", "comment_text": "Viator"}, {"username": "Whitney Meyers", "comment_text": "Golf cart tour"}, {"username": "Ville Lignell", "comment_text": "Pay."}, {"username": "Brian Yonks", "comment_text": "The Vatican City Tour is 4 hours by itself, the Colleseum/\nForum is 4 hours, if the tour is done right. That's 2 days right there. I would do early AM tours so you have the rest of the day to walk and explore."}, {"username": "Sherry Gilliam Patrell", "comment_text": "Book directly through the Vatican. We did the early tour with breakfast and it was spectacular. We were the first group in and it was cheaper than the 3rd party groups."}]}, {"id": "2200562217009523", "text": "Hi everyone, we have booked a 7 night stay in Venice in October with a central hotel.\nI am wondering if I should purchase museum/attraction tickets before we go or get them when we are there, any ideas? Which ones should I pay particular attention to? I heard about the museum pass, what does this in tail?\nI love just walking around and exploring.\nAlso, I would love to take a water bus/taxi to hotel or a near stop off point, would I be best to purchase before or when I get there?\n\nAny other ideas or suggestions would be great. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2200562217009523/", "likes": 0, "comments": []}, {"id": "2200565257009219", "text": "Is Italia Rail a good site for booking train tickets? It has far more options that Trenitalia and allows me to pay in Canadian $.", "link": "facebook.com/groups/1373361046396315/permalink/2200565257009219/", "likes": 0, "comments": []}, {"id": "2200573213675090", "text": "In Venice right now - can anyone recommend a great restaurant on a canal for tomorrow night? Not the Grand Canal but a quieter one? My husband and I went to one years ago but can’t remember where it was….", "link": "facebook.com/groups/1373361046396315/permalink/2200573213675090/", "likes": 11, "comments": [{"username": "Maria Centritto-Conway", "comment_text": "I just went on a gondola ride last night through quiet sestieri. The gondolier recommended Quaranti Ladri."}, {"username": "David Barcus", "comment_text": "Ristorante al Vagon in the Canarregio area."}, {"username": "Carolyn Risi O'Dea", "comment_text": "Ristorante Riviera. Excellent food and great atmosphere."}, {"username": "Ruth Simmons", "comment_text": "Al Timon in the Jewish Ghetto"}, {"username": "Steven Ciochon", "comment_text": "Ristorante Cantinone Storico - I ate hear when I went in May and it was pretty good."}, {"username": "Stacy Prestigiacomo", "comment_text": "Ristorante sempione was great ! If u are 2 people u can eat on balcony overlooking canal"}, {"username": "Kacy Cole", "comment_text": "Rio Novo. It was excellent!!!!"}, {"username": "Cory Moody", "comment_text": "Osteria fanal del codega"}, {"username": "Bennett Richards", "comment_text": "Trattoria da Remigio\n\nhttps://\nwww.google.com/\nsearch?q=Do+Remi\ndgio+venice&ie=\nUTF-8&oe=UTF-8&\nhl=en-us&client\n=safari#"}, {"username": "Kathy Flood", "comment_text": "If you have time sign up for the wine tasting... RowVenice.com"}, {"username": "Wallace Clavelle", "comment_text": "https://\nmaps.app.goo.gl/\nvbsipTX6eYEyJfhM\nA"}, {"username": "Jen Lew Nontha", "comment_text": "Our hotel concierge recommended this place right on the water in a quieter neighborhood. The best pistachio pasta and house red/ and white we had the whole trip. Ristorante Casa Bonita: https://\nmaps.app.goo.gl/\nsHvJk6y7SnAy5ht3\n6?g_st=ic"}]}, {"id": "2200574503674961", "text": "💒💒Hello. I am trying to buy tickets for the Last Supper in Milan and am in the official site. My research indicates as does the site that the tickets are 15 Euros plus 2 more Euros for whatever. But every time slot I click on adds an additional 8 Euros to the ticket. I believe this is for a guided tour. But I dont want that, I just want a ticket to go in and see it. Can anyone help explain how to get the ticket without paying for a guide? I cant seem to figure that out on the site. Thank you in advance. Screen shot are helpful 😊🙏", "link": "facebook.com/groups/1373361046396315/permalink/2200574503674961/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "Anyone ?"}]}, {"id": "2200576910341387", "text": "I am planning to go to Italy in mid January. I just read the news about ETIAS implementing travel authorization requirements. The website is suggesting not to make any travel reservations until your application is approved. I am now concerned about making my travel plans. The website is not yet allowing applications and there is no way of knowing when they will. Should I go ahead with my travel plans?", "link": "facebook.com/groups/1373361046396315/permalink/2200576910341387/", "likes": 6, "comments": [{"username": "Hilary Annette", "comment_text": "Following because I am also worried about this."}, {"username": "Laura Uribe", "comment_text": "Make sure you have either insurance or can cancel the reservations."}, {"username": "Renae Larcus", "comment_text": "Plan your trip. Apply when it’s open."}, {"username": "Liane Weighill", "comment_text": "Following as we are going in January also"}, {"username": "Eric Maurer", "comment_text": "Hopefully it's not the same people who are in charge of the Pantheon site 😁"}, {"username": "John Adams", "comment_text": "Thanks for the info. I will be in this year and plan to return for the next several years. I was unaware of ETIAS. I'm following it on Facebook.\n\nAgain, thanks!"}, {"username": "Aydee Carranza", "comment_text": "Following, planning to visit in March"}, {"username": "Steve Mathison", "comment_text": "If you are not a criminal or trying to sneak into the country. What are you worried about. It just a extra for security."}, {"username": "Colleen Dawson", "comment_text": "Yes, I would definitely plan the trip. It’s for citizens of countries where you do not need a visa to travel to the 30 countries listed as well the 4 micro countries. Since it’s not a visa but an authorization to travel you should be ok ."}, {"username": "Gillian O'Callaghan", "comment_text": "There's no firm date yet.....already\nbeen postponed in 2021, 2022, November this year. Check monthly for updates.....dou\nbt it'll happen in January but if so you'll apply online just like everyone who goes to, or is in transit in, the US."}, {"username": "Lauran Cantwell", "comment_text": "From what I've read, most applications are expected to be approved in 3-4 days. Who knows if that is correct but that's what it's saying."}, {"username": "Elena Paonessa", "comment_text": "Plan your vacation. It’s really not a big deal. Both Canada and the USA have similar entry requirements for visa exempt foreign nationals (eTA and ESTA) and people still come to vacation here."}, {"username": "Susan Lowry Lamb", "comment_text": "2024."}, {"username": "Starla Dawn", "comment_text": "More restrictions is not a good direction."}, {"username": "Rachel Cox", "comment_text": "It'll be fine, go ahead with your plans. We Europeans have needed to do this to travel to the US for years. It's just another thing on the \"to do\" list, but nothing to worry about. It's always really basic questions like \"are you a terrorist, yes or no\"."}, {"username": "Kathleen Blasi", "comment_text": "Hope this helps, enjoy your trip!\n\nhttps://\netias.com/\netias-frequently\n-asked-question\ns"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "I don't think this will start until summer 2024. The approval process is supposed to only take 96 hours, or less, so just a couple of days. Hope this helps"}, {"username": "Monique Armbrister", "comment_text": "Monique Armbrister"}, {"username": "Sian James", "comment_text": "This has been in the pipeline since 2020 & pushed back multiple times. I wouldn't be surprised if it's pushed back again! I'd personally start planning & see what happens closer to the time.....that's\nwhat I plan to do"}]}, {"id": "2200577193674692", "text": "Just wanted to post here as we, myself and hubby had the most hospitable time in Montecatini Terme which allowed us to then visit Florence and Lucca (walled city) by rail! Can’t express how much we enjoyed and obviously looking for our next trip next year, Cinque Terre 😍 please feel free to pm me with any questions ♥️", "link": "facebook.com/groups/1373361046396315/permalink/2200577193674692/", "likes": 17, "comments": [{"username": "Joe Arndt", "comment_text": "We were in Montecatini for 4 nights as a base for the Tuscany region and thought it was great. We also took the incline up to Montecatini Alto one evening and it was awesome, so beautiful!"}]}, {"id": "2200580583674353", "text": "I am curious about the Trevi fountain. The overhead photos look like the building attached on the back side looks like the building goes on for blocks. What is in the rest of that building.thanks", "link": "facebook.com/groups/1373361046396315/permalink/2200580583674353/", "likes": 52, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "The Palazzo Poli is a palace in Rome, Italy, that was altered in the 18th century to form the backdrop to the Trevi Fountain. In the 1830s, Princess Zinaida Volkonskaya threw lavish parties in this palace.\nMaria Cristina Misiti, director of the National Institute of Graphics, had the idea to turn the building into a museum to help visitors learn more about the history of Rome and its inhabitants. The Palazzo Poli houses the Institute's collection of copper engraving plates dated from the sixteenth century to the present"}, {"username": "Emmanuel Bautista", "comment_text": "Just an FYI, you can tour the inner workings of the fountain. Most people don't know this but a tour is available for those interested."}, {"username": "Melanie Sartuche", "comment_text": "We saw this in April, we just walked in. I think it was 7 or 11 euros"}, {"username": "Tracy Foss", "comment_text": "Wow thank- you for asking great answers"}, {"username": "Cindy Sguazzin", "comment_text": "I, too, am most grateful for the question and for the answer! Thank you both!"}, {"username": "Jody Reynolds", "comment_text": "Love"}, {"username": "Sopra la Roccia", "comment_text": "Era un palazzo di una famiglia nobile, ora credo sia sefe di musei e di scuole arrtistiche"}, {"username": "Lisa Cottrell", "comment_text": "There is a great rooftop bar on the corner across from the fountain where you can escape the crowds and look down on it ! And bonus, you can have a glass of wine !"}, {"username": "Stacy Bernard Gonzales", "comment_text": "Thank you for the info will definitely add to my must do. Love this site tons of valuable information."}]}, {"id": "2200584250340653", "text": "If staying in a VRBO or AirBnB rental is it tradition to leave a tip for the hosts?", "link": "facebook.com/groups/1373361046396315/permalink/2200584250340653/", "likes": 2, "comments": [{"username": "Pam Neary", "comment_text": "I always buy some Scottish themed gifts (I’m Scottish) whiskey biscuits etc"}, {"username": "Jennifer Avrett", "comment_text": "No"}, {"username": "Jane Lisa", "comment_text": "No"}, {"username": "Michelle Thorpe", "comment_text": "No"}, {"username": "Betsy Sidman", "comment_text": "No"}, {"username": "Terry Jackson", "comment_text": "No"}, {"username": "Karen Rozzano", "comment_text": "No"}, {"username": "Lee D'Angelis", "comment_text": "No"}, {"username": "Deanne Tetrault", "comment_text": "No"}, {"username": "Kim Geary Keidel", "comment_text": "No"}, {"username": "Dave Conroy", "comment_text": "No"}, {"username": "Doris Boudreau", "comment_text": "No"}, {"username": "Shawn Galbraith", "comment_text": "Absolutely no\nOne airbb I really loved I left a small gift that matched the decor."}, {"username": "Susan Brown", "comment_text": "Thanks everyone!"}, {"username": "Meredith Holloway Helbon", "comment_text": "Not when they’re trying to charge me an $140 cleaning fee…🤷🏻‍♀️😆"}, {"username": "Melinda Brown", "comment_text": "No"}, {"username": "Karen Albertyn Wood", "comment_text": "No"}, {"username": "Carol Fahy", "comment_text": "No"}, {"username": "David Perillo", "comment_text": "No"}, {"username": "Brandy Humphrey Jacobs", "comment_text": "No"}, {"username": "Renae Larcus", "comment_text": "No"}, {"username": "Rhona OConnor", "comment_text": "I always bring a few small Irish gifts for people I meet that I like."}, {"username": "Kim Swenson", "comment_text": "The caretaker of our VRBO in AnaCapri was incredibly kind and helpful to us during our 10 day stay; we left her a card and a monetary gift."}, {"username": "Linda Parent", "comment_text": "No"}, {"username": "Pao Magnoler", "comment_text": "Airbnb. You don't need to tip."}]}, {"id": "2200583290340749", "text": "Just came back from a two weeks trip across Italy. We have seen so many unbelievable, beautiful places and met many incredible and friendly people . My kids and I will always remember these days. We stayed oneआणखी week near venice and explored the city and the near PO Delta. Then we travelled to Rome, Florence, Milano and Cinque Terre. We saw tuscany and Lake Como. And we have eaten icecream in san gimignano. Next year We will be back.", "link": "facebook.com/groups/1373361046396315/permalink/2200583290340749/", "likes": 1641, "comments": [{"username": "Giuliana Chemello-BigDog RPht", "comment_text": "Gorgeous pictures. A trip like that can change your life"}, {"username": "Katy Cattoni", "comment_text": "I'm going to get some ideas for next year 😁"}, {"username": "Phyllis Snyder", "comment_text": "You covered a lot of ground in 2 week’s time! Awesome photos!"}, {"username": "Adolfo Vazquez", "comment_text": "Adolfo Vazquez"}, {"username": "Katy Cattoni", "comment_text": "Ruth Cattoni look 👀"}, {"username": "Mary Agozzino Derrick", "comment_text": "It's a country that steals your heart"}, {"username": "Gary Trignani", "comment_text": "Wow. you did a lot! great pictures. So glad you enjoyed your visit to Italy. I understand you are already thinking about your next trip back to Italy."}, {"username": "Lynette Leone Watkins", "comment_text": "You take wonderful photos! Memory keepsakes!!! So glad you had a great experience!!"}, {"username": "Penny Bouchard", "comment_text": "Awesome...I am starting to research for next October 2024 and want to do venice, lake como and cinque terra."}, {"username": "Scott Heran", "comment_text": "Great photos!"}, {"username": "Tina Vrochidis", "comment_text": "Tina Vrochidis"}, {"username": "Julie Griffin Smith", "comment_text": "Wow! Sounds amazing!"}, {"username": "Marz Barr", "comment_text": "Did you drive?"}, {"username": "Carmen Martin", "comment_text": "Carmen Martin"}, {"username": "Selena Orlov", "comment_text": "Amazing 😍"}, {"username": "Sue Savage", "comment_text": "Beautiful pics!"}, {"username": "Nada Zakkour", "comment_text": "Italy , is amazing country ..we went twice within one year .. love it 😍"}, {"username": "Sandi Assie", "comment_text": "That will be us in a few years!"}, {"username": "Francesca Arena", "comment_text": "Yes, Italy, the country I was born is a most fascinated country."}, {"username": "Deanna Wieman", "comment_text": "Love Love 🇮🇹! These are great photos!!"}, {"username": "Ruth Cattoni", "comment_text": "Wow! Amazing!"}, {"username": "Bunny Brown", "comment_text": "Wonderful pictures! We can’t wait to go in September!!"}, {"username": "Andrea Romano", "comment_text": "Andrea Romano"}, {"username": "Dee Martini", "comment_text": "Hi im planning on doing similar next year with my son, did you do a tour or just on your own adventure and travel by train in between?"}, {"username": "Andie Buikema", "comment_text": "These are the places we are planning on visiting next summer. Would you mind sharing a brief itinerary with me. Not sure how much time we need at each place etc."}, {"username": "Cindy Donaldson Fouts", "comment_text": "Would love it if you don't mind privaye messaging me with the places you stayed in. We are going next year for 3-4 weeks and would love to visit the places you mentioned."}, {"username": "Val Pierce", "comment_text": "There's NO place like Italy! The food, people, culture, history, and scenery are spectacular everywhere you go!"}, {"username": "Pamela J. Roe", "comment_text": "Thank you for sharing."}, {"username": "Connie Vitale Kohler", "comment_text": "Connie Vitale Kohler"}]}, {"id": "2200587397007005", "text": "Favorite hotel in Florence? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2200587397007005/", "likes": 5, "comments": [{"username": "Jim Kelleher", "comment_text": "Palazzo Guadagni in Oltrarno, on Piazza Santo Spirito."}, {"username": "Mat PO", "comment_text": "Villa San Michele and Four Seasons."}, {"username": "Clint Madsen", "comment_text": "Pendini 💕😃❤️"}, {"username": "Pam Armenia O'Brien", "comment_text": "Westin Excelsior"}, {"username": "Meredith Williams", "comment_text": "Hotel Plaza Luchessi"}, {"username": "Julie Levin", "comment_text": "Plaza Hotel Lucchesi"}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton Garden Inn"}, {"username": "Kathy Flood", "comment_text": "We stayed here and loved it. https://\nwww.palazzoguada\ngni.com/\n?utm_source=goog\nle&utm_medium=o\nrganic&utm_camp\naign=GoogleMyBu\nsiness"}, {"username": "Samantha Murphy", "comment_text": "We liked Hotel Pendini."}, {"username": "Marina Dermenjian", "comment_text": "Constantini"}, {"username": "Marti Krauss", "comment_text": "Hotel silla via dei renai"}, {"username": "Sha Fogster", "comment_text": "Sina Villa Medici"}, {"username": "Anna Brooke Herrington Harris", "comment_text": "Continentale. On the River. Excellent service. Rooftop bar."}, {"username": "S Christian Everett", "comment_text": "Hotel Garibaldi Blu.\n\n4 stars , right in Piazza Santa Maria Novella. Which is a small\nIntimate piazza, 5\nMin walk to train station.\n\nStill walkable to many other attractions and piazzas\n\nLove the way the windows and shutters open out and you can see the church and cafes in the piazza at night. Beautiful"}, {"username": "Christine Marcum Good", "comment_text": "Thank you for the information"}, {"username": "Margaret Liggieri Markman", "comment_text": "Just returned hotel lungarno\nPerfect location"}, {"username": "Renae Larcus", "comment_text": "Hotel Roma"}, {"username": "Candy Mattiello", "comment_text": "The J and J Historic House…"}, {"username": "Michael Collins", "comment_text": "We loved St Regis!!"}, {"username": "John Schmitt", "comment_text": "Hotel Duomo"}, {"username": "Susan Steinbach Permutt", "comment_text": "I stayed at the Hotel Bernini which was lovely and a great location"}, {"username": "John Chesare", "comment_text": "We stayed here last month…. Had a wonderful time…"}, {"username": "Gina Spyker Fairfield", "comment_text": "Hotel Santa Maria Novella. Beautiful rooms overlooking the piazza and a good location for walking. This was the view from our room."}, {"username": "Nancy Kirby", "comment_text": "Hotel Alessandra! Wonderful and best location"}, {"username": "Stephen Slaughter", "comment_text": "Lungarno!!!"}, {"username": "Chelli Bawcom Montgomery", "comment_text": "Grand Hotel Cavor was wonderful!"}, {"username": "Anne Brawley", "comment_text": "Kraft hotel is lovely.Rooftop pool and terrace with stunning views."}, {"username": "Janis Parker", "comment_text": "Spadai"}, {"username": "Carey Mundy", "comment_text": "Hotel Brunelleschi- lovely boutique hotel near the Duomo"}, {"username": "Kirsten Abrams", "comment_text": "Brunelleschi"}]}, {"id": "2200607530338325", "text": "Hi , travelling from Australia to Italy for a few weeks . Do we need visas or any sort of documentation aside passports ?", "link": "facebook.com/groups/1373361046396315/permalink/2200607530338325/", "likes": 7, "comments": [{"username": "Dave Conroy", "comment_text": "Check official channels for this stuff. Takes 20 seconds on Google."}, {"username": "Helen Ewing", "comment_text": "You just need your passport if you travel this year. Next year you'll need a special visa too.\nIf you plan to drive, you'll need an international driver's license, get it from RAC in your state."}, {"username": "Shelley Howard", "comment_text": "nope .. just passports"}, {"username": "Jenny Payne", "comment_text": "Register with Smart traveller it’s a government web site 🌻"}, {"username": "Annette Sparks", "comment_text": "Depends when you are travelling. Visas are being reintroduced later this year."}, {"username": "Bella Brown", "comment_text": "Dont need any other documents aside from your passport up until around November 🙂"}, {"username": "Victoria Laverty", "comment_text": "No"}, {"username": "Alice Robinson", "comment_text": "Google is your friend"}, {"username": "Gillian O'Callaghan", "comment_text": "Kiwi here and just spent a month in Italy.....you only need your passport. You'll use it a lot as you need to show it at all your accommodations."}, {"username": "Mika Whyte", "comment_text": "If it’s under 90 days and for holiday purposes, no visa needed as per smart traveller"}, {"username": "Dianne Merrick", "comment_text": "Helpful info from smart traveller site eg current notice"}, {"username": "Kay Rendall", "comment_text": "I am taking copy of my Covid vacinations, just in case things change. Though I am away 3 mths. Also carry copy license. Original of Medicare card. Just in case there is hospital visit. Not charged if u can produce, but u need to be prepared just in case. Enjoy your trip. I will be back August for 9th trip."}, {"username": "Kem Irvine", "comment_text": "Hey, just wondering how to put up a question for this group. I have joined and did post a question but I never saw it come up,thanks for any help please!!"}, {"username": "Maria Antidormi Corica", "comment_text": "I’m from Australia and in Italy at moment and only needed Passports."}, {"username": "Phyllis Snyder", "comment_text": "Please go on the official Italian website and get all needed updates on entry requirements."}, {"username": "Mia Catalano", "comment_text": "No, only passports! But I have covid certificates aswell just incase they ask."}, {"username": "Rosa Morabito", "comment_text": "Short answer…. Don’t need any other documents. Not even a drivers license should you be driving."}, {"username": "Francoise Coupal", "comment_text": "Nothing like leaving things to the last minute!"}]}, {"id": "2200609290338149", "text": "Is there any saving if we purchase train tickets online in advance in the US from Rome airport to Rome Termini train station or is it the same price if I purchase upon arrival at Rome airport? if yes, what website should I use? many thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2200609290338149/", "likes": 0, "comments": [{"username": "Pao Magnoler", "comment_text": "You can purchase your tickets once you get there or you can go to https://\nwww.lefrecce.it/\nChannels.Website\n.WEB/#/\nsearch-results?h\nandoff=true&ref\nerrer=www.googl\ne.com"}, {"username": "Louis Des Forges", "comment_text": "Just buy when you arrive as there is no discount for buying in advance. If your flight is cancelled and you arrive a day late you would end up having to pay for a new ticket."}, {"username": "Benedetta Vanni", "comment_text": "Regional trains and Leonardo Express have fares that do not vary in time. High speed and intercity trains should be booked in advance in order to get the best price."}]}]