[{"id": "2208433556222389", "text": "Hi everyone!\n\nTraveling end November to the Dolomites - Just starting to plan details itinerary, and notice all ski resort, cable car/lift are all remain close.\n\nWe are family of 3, and booked hotel in Bolzano for 3 nights and return train tickets. Our original plan was using train/bus to get around the Dolomite’s.\n\nWhat alternative activities would you suggest to seeing the beautiful mountains and lake? Get a driver? Would love the feedback!\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208433556222389/", "likes": 0, "comments": []}, {"id": "2208416539557424", "text": "Has anyone rented a car from Rome Termini and drove to Sulmona Italy and then up to Venice and Florence Italy? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208416539557424/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Jerry Kiger", "comment_text": "Thinking about Rome Florence Venice over 7-10 days driving vs trains … interested any input not sure car parking at day stops or over night"}]}, {"id": "2208388132893598", "text": "Hello! We’re traveling over the holidays to celebrate my daughter’s sweet 16 (rather than a party- win for mom!) and will stop in Florence for a couple of nights. I called Costco travel and booked an itinerary however I can cancel some of the hotels. We need a room for 2 adults and 2 teens. She booked us at Plaza Hotel Lucchesi. I’ve read someआणखी not great comments on here about it. I think the preference would be to stay closer to the Duomo. Any recommendations for alternative hotels? It’s hard to find hotels that fit 4. Open to Airbnb type as well if highly recommended in the same area. Grazie mille!", "link": "facebook.com/groups/1373361046396315/permalink/2208388132893598/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2290\n21-Reviews-FH_H\notel_Calzaiuoli\n_Firenze-Floren\nce_Tuscany.html"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Go to a booking site and enter the number of people traveling, your budget, preferred area, etc. That will give you and idea of what is available."}, {"username": "Charleen Siegler Schuss", "comment_text": "Look on Hotels.com for quad rooms"}, {"username": "Greg Saba", "comment_text": "We use booking dot com. They have hotels and apartments and generally plenty of reviews to make it less \"random.\" The last time we were there, we rented an apartment in the Oltrarno area (other side of the Arno), less crowded, more local, and still only a 5-10 minute walk to all the crowds."}, {"username": "Kim Geary Keidel", "comment_text": "We stayed at Santa Maria Novella Hotel and loved it!"}, {"username": "Janet Messanelli Bozzone", "comment_text": "We stayed at the Hotel Albani Firenze. They have suites and family rooms. Close to the Santa Maria Novella train station."}, {"username": "Kate O'Connor", "comment_text": "We just stayed there last week in an apartment at La Maison du Sage right near Santa Croce. It was top notch."}, {"username": "Eleana Flores", "comment_text": "We booked through Apartments Florence directly (they are also on Airbnb) and had a wonderful 3 bedroom apartment a block from the duomo called “Oblate Exclusive View”, but they have lots of other listings.\nHave an amazing trip!"}, {"username": "Janet Cabot", "comment_text": "We have stayed at Plaza Hotel Lucchese three times and loved it. Great breakfast, nice staff and bonus rooftop bar with views of the city and Santa Croce ( photo). We’re definitely not budget travelers and have high standards; this hotel has always meet expectations. Yes, there are closer places to the Duomo but everything is walkable from the hotel. Love the location on the Arno. I can also recommend Hotel l’Orologio. Staying there next month as it is closer to train station. Also a place to consider if you change hotels."}, {"username": "Colleen Sommerin", "comment_text": "My friend just stayed at hotel Pendini, 2 adults 2 teenage girls. She said it was very good. Large room, one bathroom. Clean and well located."}]}, {"id": "2208347629564315", "text": "Ok I need some suggestions Going to Italy for two weeks so far we have Venice, Florence, Cinque Terre on our agenda after skipping a cruise in order to see more of Italy. Looking to take our time to really enjoy each destination Recommendations??? Have been to Rome and a few places south of there already. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208347629564315/", "likes": 0, "comments": []}, {"id": "2208327352899676", "text": "So just how bad are the crowds in June? Unfortunately, our jobs are busy except June but I'm hearing that's a bad time to visit. We're hoping to spend time around Florence, Venice and most time around the Dolimites. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208327352899676/", "likes": 4, "comments": [{"username": "Madeline Caporale", "comment_text": "One of the busiest and most expensive months to travel in Italy, and particularly in the very popular urban areas such as Florence, Venice, and Rome. Plan accordingly."}, {"username": "Kim Geary Keidel", "comment_text": "We went the last week of June, first week of July. That was the only week we could go. It was crowded, but it was fine. We had a wonderful time!"}, {"username": "Laura St James", "comment_text": "First two weeks of June are a wonderful time to visit. It was starting to get crowded but no too crazy. Warm but not too hot."}, {"username": "Val Kilgallon", "comment_text": "I think it depends on what you are used to. We went in mid to late June and the only place that felt untenable were the Vatican crowds after 9:00. a.m. If you book the 7:30 official tour you will be fine. Otherwise, the only other really jammed place was the trevi fountain. The museums and other sites were fine. As long as you booked your tickets in advance. Nobody wants to stand in a line waiting to buy a ticket in the summer heat in Italy! It certainly felt less crowded than midtown Manhattan in the summer, and we had a wonderful time. As long as you dress for and expect the midday heat - take breaks indoors! - you will still have a wonderful time!"}, {"username": "Dunia Aldyni", "comment_text": "I went in July the crowds is crazy but not stop enjoying our trip 😍😍😍early morning and late night is good time to discover Italy 🇮🇹🥰🥰🥰"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We just arrived home from our trip. Yes, it was very crowded in the tourist areas. It never stopped us from doing things and we never had a problem dining. No reservations and still walked in and got a table. If we had to wait, it was short. Longest wait was at the Accadamia in Florence. We didn't get advanced tickets, but it still wasn't too bad. About an hour wait and that was our longest in all of Italy. Pack your patience and just enjoy!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "To visit Italy maybe June is not the best month of the year but definitely is the best month of Summer: normally not too hot and not overcrowded."}, {"username": "Debbie Milne Jenkins", "comment_text": "I find 1st week of June is good - people are still tied up with weddings and graduations. Whatever time of year I go, I plan to do the spots that will be most crowded as early in the day as possible. Head down side streets to avoid crowds. And, as someone else suggested go and enjoy and don’t let the crowd interfere with your good time."}, {"username": "Roz Fawcett", "comment_text": "We went 13th June started in Naples , Capri , Sorrento , Amalfi and back to Naples for 3 days , out of all of them Capri harbour was the busiest spot and one the last ferry went it was really quite peaceful . We honestly didn’t find it bad at all"}, {"username": "Jill Medrano Casey", "comment_text": "We were there the last two weeks of June. It was crowded, especially Rome, but I felt very manageable."}, {"username": "Rachael Richardson", "comment_text": "We went from 6july-23july we had no problem it was nicely busy everywhere we went but some people on this site do go over the top about crowds 😂 it’s a touristy place, that is what adds to the atmosphere , we never had a problem doing anything , just be organised but also go with the flow !"}, {"username": "Kim Aranha", "comment_text": "Look - it is all relative - everywhere is busier in the summer but if that is the only time you can go than I assure you that you will cope - go as close as the beginning of the month to avoid the crowds as much as possible !\nBut crowded cities is not unique to Italy. I go to New York a whole lot and that can be crowded.\nItaly is wonderful any time you can go. Don’t let people talk you out of it if it the only month you both can go —— just do it ! 🤣"}, {"username": "Kim Aranha", "comment_text": "Let’s put it this way …. Disney World with two kids during summer school vacation is way worse …."}, {"username": "Mary Anne", "comment_text": "Late June. Venice,during the day, was crowded with cruise ship passengers. Once they left, or if you went a few streets back from St Marks Square, it was fine."}, {"username": "Lisa DiDonato Hayden", "comment_text": "We were told to avoid July (crowds and heat) and August (many places closed). We spent the majority of June in Italy and had a wonderful time!!"}, {"username": "Rhona OConnor", "comment_text": "Just go to places that are not crowded.... Everyone in this group are going to the same few places...... There is lots of amazing places to see in Italy. I was there in June and had no problem in Bologna, Pescara and Bari. No crowds!!"}, {"username": "Delphinia Salamin", "comment_text": "I’m on same situation that I can only travel around end of May and in June. So I booked few in Rome and one week in other parts. I can’t worry about the crowds, just do my best to get morning tours and deal with crowds"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I was in Italy the last 2 weeks of June. We went to Venice Florence and Sorrento. The crowds were not too bad. We planned ahead of time and purchased tickets to museums and places we wanted to visit. I think if you plan it and purchase skip the line tickets you’ll be ok. Good\nLuck."}, {"username": "Rebecca Yeoh", "comment_text": "This was taken at 8.45am, 2nd June 2023"}, {"username": "Roxanne Franquelli", "comment_text": "Teachers schedules unfortunately on our northeast only allow for July and August."}, {"username": "Sophie Rebecca", "comment_text": "We’ve come to Milan, Venice, Florence and Rome in August and although it is busy it doesn’t seem uncomfortable or too crowded. We’ve managed to eat/ drink/ do trips very easily! We also haven’t found any of the places overly expensive, so I guess people’s opinions are subjective and it’s all about what you’re comfortable with and use to. It also hasn’t been too hot, Infact a little cooler than I’d have hoped in some places!"}, {"username": "Irene Oda", "comment_text": "June through August is crowded. We don't have much choice either. So we adapt. Either visit places of interest very early in the mornings or visit other communities- lesser known places and avoid the crowds- until such time we are able to return or choose a different time of year."}, {"username": "Alison Dutton", "comment_text": "We went the beginning of June and it was okay, it was hot but not so unbearable. As for crowds the usual tourist spots were crowded but we found that if we went early in the day it was much better and we also found some lovely quiet areas and churches just off the beaten track that were lovely. We also bought our skip the line tickets before we left the UK and it saved all that standing around in queues. We would definitely return in June."}, {"username": "Cheryl Swiatko", "comment_text": "We went in June and loved it…..Rome, Sorrento, Amalfi, Positano, and Florence."}, {"username": "Barb Krieg-Stepien", "comment_text": "Crowds didn’t seem to bother us. Just have to get on the mindset that it’s going to be crowded. The heat! Now that is another story 🥵"}, {"username": "Kelly Huntley Clark", "comment_text": "We were in Florence during the last two weeks of June, and while of course it was crowded near the tourist attractions by midday, we found it easy to escape the crowds. I think how you plan your sightseeing will have the biggest impact on your experience! 🙂"}, {"username": "Elaine Catino Tsangarides", "comment_text": "A lot more crowded this year than last yet. Was there in late may early June this and was surprised that there as many people as mid-July last year. However don’t let that bother you! You will always find times there are less people and when you can’t, enjoy the vibe!!"}]}, {"id": "2208303042902107", "text": "Can anyone translate this for me? We are coming into the Ancona port and I want to go to the Passo del Lupo trail which leaves out of Sirolo I believe. I want to know where I need to leave from, and what time and where they will pick us back up from and what time.", "link": "facebook.com/groups/1373361046396315/permalink/2208303042902107/", "likes": 0, "comments": [{"username": "Giovanni Pianigiani", "comment_text": "This is the schedule on weekdays (which include Saturdays) from 1 sep\n-from 17/sep onward the grey cells won't run on saturdays\nnota 1: runs only on schooldays\nnota 2: runs only from 3 oct, on schooldays\n\nYou may want to try gogle maps or some dedicated apps like moovit for an integrsted view of all possible options"}]}, {"id": "2208298549569223", "text": "🏰 Exploring the stunning beauty of the Royal Palace of Caserta in Italy! 🇮🇹✨ A majestic masterpiece of architecture and history. Truly a must-visit destination! 😍 #TravelItaly #RoyalPalaceCaserta #BucketListAdventures", "link": "facebook.com/groups/1373361046396315/permalink/2208298549569223/", "likes": 28, "comments": [{"username": "Jonathan Barlow", "comment_text": "Rieley Allpress"}]}, {"id": "2208459019553176", "text": "Hi, has anyone tried athotel website for booking hotels ?? Is it reliable ? Like booking.com ?", "link": "facebook.com/groups/1373361046396315/permalink/2208459019553176/", "likes": 0, "comments": []}, {"id": "2208442116221533", "text": "Staying in Sorrento late September and trying book trains to Naples and Pompei in advance - is it worth it? Can we just buy tickets on the day/day before? Will trains be booked up? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2208442116221533/", "likes": 2, "comments": [{"username": "Kally Trahearn", "comment_text": "Just turn up. The Circumvesuvia train will take you to Pompeii - get off at Pompeii Scavi. The same train will take you all the way to Naples if you stay on.\n\nThe price isn't any different if you buy in advance or pay on the day. Be mindful, there are LOTS of pickpockets and scammers around who will try to help you board (while they're robbing you) or brush past you as they move through the train. Keep your bag in front of you, with your hand directly over it."}, {"username": "Gena Kona-Mancini", "comment_text": "If you have to get to Rome after for whatever reason that Naples-Rome train should be booked in adance it's much cheaper to do so for the fast train"}, {"username": "Jules Blumke", "comment_text": "Walk up and buy same day."}, {"username": "Amy French Baillie", "comment_text": "Buy same day… 2 options. Campania express or circumvesuvia"}, {"username": "Skye Birch", "comment_text": "you don't need to pre book"}, {"username": "Miyuki Kanno Paul", "comment_text": "Circumvesuviana\nSorrento line is a commuter train line. The train begins/\nterminates in Sorrento. It runs every 30 minutes. You just show up at the ticket booth and purchase tickets at the station. I highly recommend to buy round trip tickets(2 one way tickets) as the Pompeii Scavi station gets very busy. You validate your ticket at the machine and you are ready to go. The only exception is Campania Express."}, {"username": "Rachael Richardson", "comment_text": "It’s a local line just buy on the day they are very frequent, plenty of room on the trains , you don’t get a set seat it’s not like the fast trains"}, {"username": "Andria Saia", "comment_text": "You totally don’t need train tickets in advance - it is a local/commuter train😊"}, {"username": "Brian Osman", "comment_text": "Day before is best"}, {"username": "Suzanne Mills", "comment_text": "Same day"}]}, {"id": "2208437876221957", "text": "Landed at Romes FCO airport last night. Had prearranged for airport pick up through “ Movin Rome”. Excellent service. Highly recommend.", "link": "facebook.com/groups/1373361046396315/permalink/2208437876221957/", "likes": 0, "comments": []}, {"id": "2208437786221966", "text": "A question for anyone who has driven from Venice to Cinque Terra: How was the drive! Time? Scenic? Roads? Stops along way? Also, did you leave vehicle in La Speza whilst staying overnight in CT?\n\nHow does this drive compare with drive Venice to Florence? Time, scenery, roads??\n\nThank you for any advice.", "link": "facebook.com/groups/1373361046396315/permalink/2208437786221966/", "likes": 0, "comments": [{"username": "Michael Broadwater", "comment_text": "You don't wanna drive in Florence, park outside of the city if you can. Driving in Florence is a nightmare"}, {"username": "Ryan Monahan", "comment_text": "We found the times quoted on Google Maps was pretty accurate. Drove from CT to Florence, stayed 3 days then drove up to Lake Garda, then from there to Venice. The drive up there is beautiful. The drive from CT to Florence was not as beautiful as the other leg. When going to CT, park at the La Spezia Miglianara station and take the express into whatever town you’re staying in."}, {"username": "Beverley Milson", "comment_text": "Thought leave hire car outside city & taxi to accommodation ."}, {"username": "Antonio Aloè", "comment_text": "Drive on the highway direction Milano and then by Brescia drive south west directiin Piacenza and when indicated turn to Genova .In Genova get out of the highway and follow the Aurelia extremely scenery Nervi,bogliasco\n,camogli,santa marggerita,rapa\nllo,zoagli ,binassola,sest\nri levante,levanto\ntill monteross the first of the cinque terre.you cannot drive to the others but suggest take the hop on hop iff launch till la spezia.you go back to monterosso by local train take your car and drive further wherever you go."}, {"username": "Jerry Kiger", "comment_text": "Interested sim rental car drive pick up Rome, drive n stay in CT 3-4 days, then drive north Florence or Tuscany area. Sounds like there city places to park rental car for most part. Think want drive Italy vs trains to see rural spots."}, {"username": "Sarah Jane", "comment_text": "Beverley Milson did you end up deciding to drive? We are thinking of driving from Cinque Terre to Venice and wanted to see what your experience was like!"}]}, {"id": "2208432946222450", "text": "Hello - family of 4 ( 2 kids 11 and 15). We are going to Sicily, Rome, Venice, Florence. We have a few days to fit in another location. Any recommendations of something that is a bit different and something that is not out of the way? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208432946222450/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "Thinking Puglia maybe?"}, {"username": "निनावी सहभागी", "comment_text": "Hoping someone can help"}]}, {"id": "2208431969555881", "text": "Overnight ferry from Rome to Sardinia. What is everyone’s experience please? Did you get sea sick? Was it very choppy?", "link": "facebook.com/groups/1373361046396315/permalink/2208431969555881/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "Hoping it’s smooth"}, {"username": "निनावी सहभागी", "comment_text": "Hoping someone has done this"}]}, {"id": "2208423306223414", "text": "Hi guys, planning to do a 5 day trip to Italy this October. Will 4 days in Rome and a day trip to Florence be doable? Anyone who has tried it? What are your thoughts? Thanks in advance🙂", "link": "facebook.com/groups/1373361046396315/permalink/2208423306223414/", "likes": 0, "comments": []}, {"id": "2208415749557503", "text": "We are travelling from Sorrento to Rome and believe the best way for our family of 5 is to take the ferry from Sorrento to Naples and then the train to Rome. How reliable are the ferry schedules? We are due to arrive at Naples at 5:45pm and the train I am looking at departs at 6:40pm. Is that enough time to transfer between the port and train station? Also open other suggestions on getting from Sorrento to Rome but we will not have a car. Thank you :)", "link": "facebook.com/groups/1373361046396315/permalink/2208415749557503/", "likes": 0, "comments": [{"username": "Gena Kona-Mancini", "comment_text": "The ferries I took often arrived after they were scheduled to arrive. We took the train from Sorrento to Naples. It wasn't great (you may not get a seat) but there was a higher speed train (I think campagnia express) which costs more but was faster (less stops) and MUCH less crowded so more room to sit and put luggage! (I think €15 vs 4 for the regular train)"}, {"username": "John Vance", "comment_text": "Trains don’t always run on time in Italy. I recommend the fast train when available and go first class on the trains it’s not that expensive but definitely cleaner and more comfortable"}, {"username": "John Vance", "comment_text": "The train is 3 hrs Sorrento to Rome. I would think ferry and train would be a lot slower"}]}, {"id": "2208414436224301", "text": "Someone help out an old lady 😬 I have read SO many of your wonderful posts and blogs about where to find tickets for attractions. I finally landed on Get Your Guide. However, I am so confused about all of the different options to choose from. You don’t know who the vendor is until you book a ticket. How do you know it’s reputable? I will try toआणखी book tickets on Coopculture for the Colosseum, but that seems so stressful and like a lottery system to leave to chance. ￼ any thoughts on how to navigate third-party sites and what would the red flags be to avoid?", "link": "facebook.com/groups/1373361046396315/permalink/2208414436224301/", "likes": 2, "comments": [{"username": "Ann Applegarth Veith", "comment_text": "Another option is Viator....used it for the last several months in Italy, Albania, North Macedonia and Kosovo."}, {"username": "Gianna Onesi", "comment_text": "Get your guide is reputable I have been booking for October. You also don't need to pay up front can cancel ahead"}, {"username": "Lauran Cantwell", "comment_text": "I've never used Get your guide but I have used Viator. Same concept. It's basically a clearinghouse for all the tours and you don't really know who the actual tour operator is until after you complete the booking.\nI just take comfort (and faith) in that Viator has vetted these operators before adding them to their site to make sure they are legit and reputable. Also read the reviews before you book."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look at viator https://\nwww.viator.com/\ntours/Rome/\nOfficial-Colosse\num-Roman-Forum-\nand-Palatine-Hi\nll-Tour-in-Rome\n/\nd511-15932P15?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Janine Emma Lucas", "comment_text": "The vendor is listed in each tour info before you buy. The tour groups are all very reputable otherwise GYG and Viator wouldn’t use them.\nBy using the GYG/V platform you get full protection to cancel and refunds."}, {"username": "Fetchin Gretchen", "comment_text": "Check reviews esp recent ones and then go for it."}, {"username": "Helena O'Neill", "comment_text": "Have used get your guide for years, no problems. Where there are multiple options for similar tours etc, look at the star rating and how many reviews it has - I find the more reviews the more balanced they seem to be overall, then read the most recent / ones posted in the same month last year and I take it from there."}, {"username": "Dann Hrusch", "comment_text": "Coopculture is the official ticketing site for the Colosseum and have used multiple times. Not sure what you'd consider a lottery about it. You go on, pick your dates and purchase."}, {"username": "Rose Turdo", "comment_text": "Don't bog yourself down with appointments,wh\nen you get there figure it out."}, {"username": "Linda McShane Payne", "comment_text": "I use Viator"}]}, {"id": "2208414112891000", "text": "Planning to do day trips from Sorrento to,\n\nAmalfi\nPositano\nCapri Island\n\nAs I understand it Capri is an easy ferry ride.\n\nWhat is the best way to get to Positano and Amalfi.\n\nI'm thinking bus there and back from Sorrento leaving early and getting back late evening.\n\nOr is a private driver better ?", "link": "facebook.com/groups/1373361046396315/permalink/2208414112891000/", "likes": 1, "comments": [{"username": "Andrea Arango", "comment_text": "I think it depends on the time of day. If there will be a lot of traffic, then ferry might be best."}, {"username": "Holl E Bee", "comment_text": "We usually got bus there early in the morning and ferry back. Also, I wouldn’t miss our Ravello, I actually preferred it to Positano and Amalfi!"}, {"username": "Nancy Ann Paolino", "comment_text": "Sorrento to Amalfi is cheaper and cool by bus especially if sitting on right side. You can get on and off anytime.\nYou can do boat and see the coastline which is nice also but more costly.\nCapri there are ferries or speedboat."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nAmalfi-Coast-Dri\nve-Excursion-fr\nom-Sorrento/\nd947-7809P1?pid=\nP00070587&mcid=\n42383&medium=li\nnk&medium_versi\non=selector"}, {"username": "Kally Trahearn", "comment_text": "Cheapest way is by bus - pick it up outside Sorrento train station and make sure you get to sit on the right hand side (not drivers side) - this will give you the best views of the winding coastal road as you head to Positano. If you were to stay on the bus instead of getting off at Positano, it will take you into Amalfi. There is another bus you take from Amalfi to Ravello. Get to the bus stop early to get the best choice of seats and you will make the most of the day.\n\nBe mindful that buses returning to Sorrento can be quite busy, so you might prefer to get a ferry back."}, {"username": "Miyuki Kanno Paul", "comment_text": "Ferry from Sorrento stops at Positano and continues to Amalfi.\nFerry to Capri is nonstop.\n\nLeave Sorrento early. Have lunch at the destination and ferry back in mid-late afternoon. Purchase your return ticket right away as soon as you reach your destination. Don’t wait until it’s too late. Research on the ferry schedule. I know it won’t run all night.\nAssuming you’ll be doing this before October 31st. The ferry schedule will change drastically as of November 1st"}, {"username": "Carolina Widmer", "comment_text": "Following"}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Venessa Menzagopian", "comment_text": "We did a bus to positano but we preferred the private tour of only 8 people. Just remember the streets are very winding. We used this company who took us to Amalfi, Positano and Ravello.....our\ndriver was Enzo and he really made it so much fun for us"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208410899557988", "text": "Where should we stay in Rome and not cost a fortune? Ideally walkable - but can bus. Safety and cleanliness are top priorities", "link": "facebook.com/groups/1373361046396315/permalink/2208410899557988/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2407\n419-Reviews-B_B\n_Hotel_Roma_Tra\nstevere-Rome_La\nzio.html"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Check Monti area."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Check prices on a booking site. Everyone’s budget is different."}, {"username": "Felicia LoCascio Whitney", "comment_text": "Villa San Pio"}]}, {"id": "2208392509559827", "text": "I’ve been trying to find good airfare w/points to Rome in March. I found a great one-way to munic & since we’ve never been anywhere in Europe and want to ride a train, we were thinking about booking it & take the train to Italy. My bucket list is Rome for sure. We have 4-6 weeks depending on how much lodging ends up being.\nWhat are the for sureआणखी need to see places between Munic & Rome (or beyond)…. I know for sure Venice & Florence (and surrounding areas) & we would like to go to Pompeii… thinking 2-4 days each & probably a week in Rome. I can’t walk all day so we have to kinda take it easy… don’t bother w/places just good for hiking or bad public transportation for this reason.\nI had dreamt of a huge trip around Europe but I think lodging would be really high.\nPlz give me suggestions of perhaps a “centralized” spot we can rent an apt for a week & go for day trips.", "link": "facebook.com/groups/1373361046396315/permalink/2208392509559827/", "likes": 1, "comments": [{"username": "Deborah Schroeder", "comment_text": "What a wonderful trip you have planned. Florence is a good central location to the Tuscany region. Venice has some easy day trips by train or vaporetto. Get the vaporetto pass and use it, will save a lot of walking over lots of bridges. Rome is easily a week with a lot of walking so a good central location is the Monti area or the Pantheon area. The Monti area is closer to the train station and bus depot so easy to move around that way. Pompeii is a day train trip from Rome. Look at the FB site Romewise for lots of tips on Rome and Florencewise for that city. Another easy day trip by train from Rome is Orvieto to get that Etruscan experience. Look at the site Rome2Rio for train travel, distance, time and price. I understand budget and appreciate trying to stay in one. You can take a night train from Munich to Venice, but you won't see much, or you can do a day train with several changes. Sometimes a few more dollars spent will be cheaper because of convenience and time. Flying directly to where you want to go and leaving from where you want to end, it is pricier, but will give you more time to play. Just do a lot of research and get prices so you have an idea of the daily cost. Rick Steves' books really help with that."}]}, {"id": "2208391309559947", "text": "For those who have driven into Venice is it easy? We plan to rent car at airport and hopefully drive into Venice. Is that a good option? What’s best options for parking a car? We are booking hotel by airport.", "link": "facebook.com/groups/1373361046396315/permalink/2208391309559947/", "likes": 7, "comments": [{"username": "Aidan Wilson", "comment_text": "25 Euro per day to park outside where the water Taxis and Ferries operate from the mainland."}, {"username": "Susan Williams", "comment_text": "Getting a car to drive to Venice, then parking it outside the city is a total waste of money. Take the train to Venice from the airport/hotel. Then get your car when you leave Venice and drive farther into Italy."}, {"username": "Amy So", "comment_text": "Rent car after Venice, if you are arriving before 11 pm, take the aliguna ferry to Venice. Also, consider renting a hotel home in Venice. We stayed at hotel Campiello near the San Zaccaria ferry stop. Very convenient and no bridge to cross if you have luggage. Great breakfast also"}, {"username": "Miyuki Kanno Paul", "comment_text": "You can’t drive into the city. You’ll have to leave your rental car at the parking lot the whole time you stay in Venezia. Pick up a car as you leave Venezia instead"}, {"username": "Tami Sue", "comment_text": "I would rent the car after u leave Venice."}, {"username": "Cassie Ryan", "comment_text": "Don’t rent a car if you plan on staying in Venice for days"}, {"username": "Antonio Aloè", "comment_text": "Drive into Venice?Change substances/\nchange pusher..🤭"}, {"username": "Rachael Richardson", "comment_text": "Never seen a car in Venice ? You must have to leave them quite away from the centre"}, {"username": "Kristen Rozansky", "comment_text": "You can’t actually drive into Venice. There is a very large parking garage, Tronchetto, where you leave your car. I believe it runs about 25 euros per day. You then buy a ticket for a water taxi to area of Venice where you are headed. We just did this last week. We were driving from the Piedmont region, to Venice, then back to Milan. Very easy and well marked."}, {"username": "Renae Larcus", "comment_text": "Why do you need a car in Venice? You don’t. Take the train in from your hotel or just stay right in Venice. Easy to get around. On foot or vaporetto"}, {"username": "Jayne Shinko", "comment_text": "depends on what airport.... Rome, Florence, maybe. If you are flying into Venice, then you dont need a car."}, {"username": "Linda Pitler", "comment_text": "The trains are amazing. If you do drive, you will need both your State drivers license and an international drivers license that you can get at AAA for 30 dollars."}, {"username": "Timothy Milos", "comment_text": "only rent a car if you are planning on spending time in the countryside. If you are traveling city to city, use the trains. It’s much easier. Outside city centers it can make sense, but Venice to Bologna? Take the train."}, {"username": "Paul Anderson", "comment_text": "There are no cars in Venice at all! Boat taxi or the large bus boats."}, {"username": "Vlatko Jazz Mushkarski", "comment_text": "Best place to park a car is in the garage....."}, {"username": "Lee-Anne Stewart", "comment_text": "Not sure if this post is a wind up but I got the water taxi from the airport to Venice."}, {"username": "Toni Quatrini Bannister", "comment_text": "In Venice you take the water taxis or water buses right to your hotel. It’s all water there and you either walk or take the water taxis! We walked 12 miles a day to explore everything and took water taxis out to the islands!"}, {"username": "Vanessa Benigno Balajadia", "comment_text": "It would be cheaper and less stressful to take the train into Venice. Depending on your hotel, it should be a straight shot to Venice itself. If you are still considering the drive then Parcheggio San Marco is a good spot. There’s at least 2 parking garages directly next to each other. They’re costly and I also had to pay tolls on top of it."}, {"username": "Robin Terzi", "comment_text": "Take the train…forget the car"}, {"username": "Shirley Lewis", "comment_text": "do not NOT drive in Italy - it is insane"}, {"username": "Christine Matthews", "comment_text": "nope. take a train. so easy."}, {"username": "Bruce Piatek", "comment_text": "Take the train from airport. Easy and cheap."}, {"username": "Alison Roberts Yeh", "comment_text": "Struggling to understand why you would want a car for Venice, since you cannot drive there. Maybe we could better help you if you shared why you want a car. If that’s just your normal thought (fly to a city, rent a car), suggest you do not rent a car for Venice, as it’s an unnecessary hassle and cost. You won’t be able to use it while in Venice, so if you need a car for post-Venice, rent it then."}, {"username": "Federico Permutti", "comment_text": "If your hotel has a shuttle service to/from the airport, I would suggest taking that, then bus number 5 into Venice and back. The bus stop is on the ground floor in front of the airport terminal, tickets are 18€ return and there is a bus every 15 minutes (note: this is the ACTV public transport, don’t get on the blue ATVO coaches as that is a different company).\n\nThe bus will drop you off at the Piazzale Roma bus terminal, from where you can either walk or take a waterbus (vaporetto) to wherever you want to go. There is also a combined airport bus + vaporetto ticket that costs 18€ one way.\n\nAlternatively, for a more scenic ride, when you get to the airport terminal, go up to the first floor and go to the water docks via the moving walkway. Alilaguna waterbus services run every 30 minutes at 27€ for a return ticket. Note that this will take longer than the bus.\n\nLastly, if budget is not an issue, consider getting a water taxi from the airport. There are booths inside the airport arrivals area where you can book one. This will typically cost about 135€ one way, but it has the advantage of being the fastest way to get into town and seating up to 10 people. The fare remains unchanged up to 4 people, with a small surcharge for every additional person."}, {"username": "Etschi Bruckner", "comment_text": "nobody drives int Venice - doesn´t work, to much water! 😂"}, {"username": "Tracy Foss", "comment_text": "You some need a car for Venice take the water taxi from the airport . How many nights are you in Venice I wouldn't stay at the airport?"}, {"username": "Max Sorber", "comment_text": "Pick up your car after you are done visiting Venice\n\nWe picked it up at airport\n\nDriving to Bologna is well marked"}, {"username": "Irene Oda", "comment_text": "You cannot 'drive ' around Venice at all. There just aren't any roads in Venice."}, {"username": "Michelle Corrao", "comment_text": "No cars on Venice ."}, {"username": "Delphinia Salamin", "comment_text": "Thank you all for your responses. I’m closing the thread. Some of you found it funny I asked this question. But ask yourselves if you were visiting a foreign country and asking for guidance or information ℹ️ would you like it if someone laughed in your face? I don’t think so. When someone asks me for help or directions in New York City I take my time and help."}, {"username": "Ann Applegarth Veith", "comment_text": "Really can't drive into Venice Island,."}, {"username": "Plane Shummer", "comment_text": "Train is your best bet."}, {"username": "Joanne-Peter Hart", "comment_text": "No cars are allowed in Venice. Only boats. You will need to park at the big parking station on the mainland."}, {"username": "Bill Bowler", "comment_text": "You can't drive into Venice. Take the train."}, {"username": "Anna O'Connor", "comment_text": "There are no cars in Venice. It’s all water. Get a train to Venice and then use water bus and walking to get around."}, {"username": "Phil Derriaghy", "comment_text": "Tronchetto is best and take the ferry! Although you can try piazzale Roma but it’s pricey and busy .."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "You park in Venice Mestre, by the train station and take the train to Venice island"}, {"username": "Jill Giura DeRamo", "comment_text": "We drove to the main island and parked our car at the San Marco parking garage. We then took a private water taxi to our hotel. After that we only traveled by boat between islands. As everyone said, there are no cars."}, {"username": "Charleen Siegler Schuss", "comment_text": "Take a boat, train or bus from the airport. Rent a car as you leave Venice. If you rent the at the airport and park it in Venice the parking will cost ad much ad your hotel"}, {"username": "Cherol Hegge", "comment_text": "It is very easy to drive to Venice we parked at the Tronchetto then a ferry or water taxi from there."}, {"username": "Carol Taylor Tisdale", "comment_text": "I see no reason to rent a car unless and until you leave to drive further into Italy. Take water taxi or Alilaguna to the hotel."}, {"username": "Kristina Ruk", "comment_text": "You came to island and there 10 floors parking place snd leave your car there"}, {"username": "Carine Brys", "comment_text": "The train station terminal is right by a big bridge that leads you right into Venice."}, {"username": "Michael Wilkinson McLaughlin", "comment_text": "I have driven in and out. It’s not that bad. Do a little pre-studying on that area before going in and it will help boost your confidence."}, {"username": "Maggie Lodge", "comment_text": "Doesnt make sense ???\nYou would leave the car in a Car park as obviously you cannot drive in Venice so total waste of money 🤔"}, {"username": "Jona Guðmundsdottir", "comment_text": "I agree with renting the car after the stay..."}, {"username": "Carlos Arotinco", "comment_text": "Only way you can drive into Venice island"}, {"username": "Mike Guluk", "comment_text": "Rent a car at Venice mestre when you leave. Avis,budget and others. Unless you are leaving Venice the same day u arrive"}, {"username": "Ryan Monahan", "comment_text": "You can’t drive in Venice, it’s essentially an island. Drop the car at the rental office at the Venice airport and take one of the Alilaguna boats into the city to the stop closest your hotel."}, {"username": "Angela Huntenburg Russell", "comment_text": "TRAIN!!!"}, {"username": "Roland Trego", "comment_text": "If you are staying at the airport, just take the bus or a water taxi into the city. For the most part, you can't drive in Venice except when you come off the bridge into the city. There is a parking garage there."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Which airport? From Milan you could easily take the train, although you need to take a bus to the central station."}]}, {"id": "2208380906227654", "text": "Need some recommendations for a convenient but enjoyable area/city to stay in near MXP for a few days, before flying out... But not Milan.\n\nAlso, any recommendations for a place to stay near FCO (not Rome) that has easy access to a decent beach and Ostia Antica would also be appreciated.\n\nWe haven't settled on our return flight yet so trying to keep nearby options open for both Milan and Rome. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208380906227654/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g799531-d1491\n6730-Reviews-Fl\ny_Deco_Hotel-Li\ndo_di_Ostia_Pro\nvince_of_Rome_L\nazio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "You can stay on lake Maggiore https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g616180-d1770\n894-Reviews-Hot\nel_San_Carlo-Ar\nona_Lake_Maggio\nre_Piedmont.htm\nl"}]}, {"id": "2208376316228113", "text": "Which hotel would you recommend in Rome? Hotel hassler or baglioni hotel Regina?", "link": "facebook.com/groups/1373361046396315/permalink/2208376316228113/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2031\n40-Reviews-Bagl\nioni_Hotel_Regi\nna-Rome_Lazio.h\ntml"}]}, {"id": "2208377312894680", "text": "Which hotel would you recommend in Rome? Hotel hassler or baglioni hotel Regina?", "link": "facebook.com/groups/1373361046396315/permalink/2208377312894680/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2031\n40-Reviews-Bagl\nioni_Hotel_Regi\nna-Rome_Lazio.h\ntml"}, {"username": "Elena Innocenti", "comment_text": "Hassler"}]}, {"id": "2208367692895642", "text": "Hi, can anyone recommend a hotel or Airbnb in Ischia? We are visiting in April if anyone can tell us what sort of temps to expect (google weather is very varied) Thank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2208367692895642/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g580214-d5819\n11-Reviews-Hote\nl_Le_Querce_Ter\nme_Spa-Ischia_I\nsola_d_Ischia_P\nrovince_of_Napl\nes_Campania.htm\nl"}]}, {"id": "2208363709562707", "text": "What are some non busy tourists spots outside of Rome with little crowds. We want to explore Italy outside the major tourist attractions. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208363709562707/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nnarni/"}, {"username": "Robert Bélair", "comment_text": "Ostia Antica\n\nhttp://\nostia-antica.org\n/"}, {"username": "Ken Vecchia", "comment_text": "Orvieto so beautiful up on a hill all must go there. Umbria region I believe"}, {"username": "Miyuki Kanno Paul", "comment_text": "Any little hilltop town/village outside the big city is a gem❣️"}, {"username": "Edoardo Casolo", "comment_text": "Viterbo"}, {"username": "Melanie Brown French", "comment_text": "Following"}, {"username": "Paul Anderson", "comment_text": "Tivoli. Hadrians villa. Really worth seeing."}, {"username": "Donna Mangone", "comment_text": "Castrocielo, Rocasecca, Aquino, Monte Casino in the Appenine mountains between Rome and Naples. My father was from Castrocielo."}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Places with no train or regular bus service."}, {"username": "Karrie LeBlanc", "comment_text": "In Rome we visited these great spots that were not busy at all Palazzo Doria Pamphilij on via del Corso, Musuem of the Baths of Diocletian, National Gallery of Ancient Art Barberini Gallery and Palazzo Colonna - get ticket that includes garden. None needed advance booking. The Colonna is only open Friday and Sat morning to 1pm."}, {"username": "Sasha Melia", "comment_text": "The Carcalla Baths are in Rome, but when we went last August there was hardly anyone there, so it was a nice away from the crowds experience compared to everything else. They have a guided VR experience which is worth doing, so you can walk round and see the place as it once would have looked. It was quite cheap for tickets too. Worth seeing as they are HUGE!"}, {"username": "Gloria Di Francesco", "comment_text": "Nemi 😊"}, {"username": "Sandra Mueller-Hofner", "comment_text": "Sperlonga (one hour by train) is spectacular"}]}, {"id": "2208333402899071", "text": "How far in advance should I buy tickets for the Accademia and Uffizi Galleries? Looks like I can buy tickets now for March 2024. Wait or do it? 🤔 Will these sell out if I wait 2-3 months before?", "link": "facebook.com/groups/1373361046396315/permalink/2208333402899071/", "likes": 0, "comments": []}, {"id": "2208304432901968", "text": "For those who live where there are TJ Maxx or Marshall’s, I found some great finds the past couple of weeks! Same bag in black is sold in Amazon for $64!", "link": "facebook.com/groups/1373361046396315/permalink/2208304432901968/", "likes": 128, "comments": [{"username": "Amy Stolp", "comment_text": "Thank you!!💖"}, {"username": "Giuliana Vaccari", "comment_text": "Thank you for sharing!"}, {"username": "Darleen Jones Ellisor", "comment_text": "Good finds!"}, {"username": "Clayton Webb", "comment_text": "Nicole Webb"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "I thought mine was antitheft too but wasnt the case."}, {"username": "Tara Dix", "comment_text": "Compression bags are great, I used them for stuff that doesn't wrinkle too badly, as stuff does get wrinkled in them. Then I put dirty clothes in them."}, {"username": "Linda Norris", "comment_text": "I still roll with them & things stay pretty good!"}, {"username": "Lori Winchell Crestfield", "comment_text": "I found this tTravelOn Antitheft bag for $29. Of course I just paid $60 for a smaller one on Amazon"}, {"username": "Jessica Stewart", "comment_text": "Ron Stewart"}, {"username": "Jennifer Satter", "comment_text": "Jessica Baumgartner"}, {"username": "Charlotte Morris", "comment_text": "Thank you for sharing 🙏🏼"}, {"username": "Susan Tipsord", "comment_text": "Compression packing bags are awesome. Gives lots of extra room in your luggage!"}, {"username": "Elizabeth Florio Campanella", "comment_text": "I was just in marshalls yesterday. Did you find this by the purses or luggage? thanks"}, {"username": "Lori Charlene", "comment_text": "Deanna Guerin"}, {"username": "Anne Finseth", "comment_text": "Thank you fir sharing. How kind of you!!"}, {"username": "Kathy Brooks Taveira", "comment_text": "Thank you!"}]}, {"id": "2208286292903782", "text": "Going to be in Florence in November. Looking for a private tour guide to pick us up in Livorno, Italy and take us on a private tour to Florence and back. We definitely want to see the Accademia and the Uffizi Gallery, Florence. We would like recommendations of tour companies, please", "link": "facebook.com/groups/1373361046396315/permalink/2208286292903782/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Livorno/\nPrivate-Shore-Ex\ncursion-to-Flor\nence-from-Livor\nno-with-private\n-driver-guide/\nd22138-8647P167?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2208283536237391", "text": "I am trying to use the Trenitalia app. I created an account with my email address. When I make a ticket choice it automatically populates my info with my correct email but the app says it is an invalid entry and will not let me progress. I have manually entered the address with same results. Any suggestions or phone number I can call?", "link": "facebook.com/groups/1373361046396315/permalink/2208283536237391/", "likes": 1, "comments": [{"username": "Kara Ashley", "comment_text": "I’m having this exact same problem! I was able to purchase tickets a few weeks ago but not today! Did you find something that worked?"}]}, {"id": "2208268299572248", "text": "Misschien een idee voor iemand anders.\nWij verblijven momenteel in San Gimignano en zijn vandaag naar Colle di Val d’Elsa geweest. ( klein half uurtje rijden). Daar hebben wij de Elsa Trail gelopen.\nEen heen-आणखी en terugreis naar de waterval is ongeveer 5 kilometer (leukste is om te starten aan de kant van de Spugna brug)!\nWandelen & zwemmen is goed te combineren. Het water is heerlijk!", "link": "facebook.com/groups/1373361046396315/permalink/2208268299572248/", "likes": 74, "comments": [{"username": "Julie Van Berkel", "comment_text": "Beautiful!"}, {"username": "Kim Komar Henderson", "comment_text": "May I ask where you are staying at. I wanted San Gimignano to be our home base."}, {"username": "Linda Charlene Vaughan Osborne", "comment_text": "Beautiful"}, {"username": "Sandra Vilters-boer", "comment_text": "Prachtig daar. Wij hebben er ook genoten"}, {"username": "Dixie Kotylak", "comment_text": "Looks like heaven!"}, {"username": "Michelle Mullin", "comment_text": "Beautiful"}, {"username": "Wendi Dusseault", "comment_text": "Beautiful! We were so close and had no idea!!!"}, {"username": "Keryl Lesley Edwards", "comment_text": "Keryl Lesley Edwards"}, {"username": "Kim Glenn", "comment_text": "Joyce Shively next time"}, {"username": "Mary Andreotta", "comment_text": "Saved for my trip next year. Thankyou!"}, {"username": "Susan Hastings", "comment_text": "Beautiful. We were looking at staying a few days in San Gimignano, but we won’t have a car so will need to rely on the trains. Is there public transport available? Thanks for your help."}, {"username": "Rosilyn Young", "comment_text": "Mark Harris"}, {"username": "Cara Meyler", "comment_text": "Siân PhillipsGali Phillips"}, {"username": "Dora Whiteford", "comment_text": "Kyle Whiteford\nLeah Rogers\nBrittany Whiteford"}, {"username": "Kym Delle Coste", "comment_text": "Danny Delle Coste Lisa Kollmann Peter Kollmann 💙"}, {"username": "Natasha Welage", "comment_text": "Dat ziet er geweldig uit! Wij zijn er over 2.5 weken. Zou het nog warm zijn?"}, {"username": "Petra Stevens", "comment_text": "Bart volgend jaar?"}, {"username": "Dámaris Ojeda Fernandez", "comment_text": "Que bonito. 5km hasta llegar o 5km ida y vuelta? Es dificultad baja media o alta? Gracias"}]}, {"id": "2208263576239387", "text": "Is the Coliseum on the free Sunday museum list?", "link": "facebook.com/groups/1373361046396315/permalink/2208263576239387/", "likes": 0, "comments": []}, {"id": "2208244412907970", "text": "Are there any good restaurants in Venice with really worth it gluten free pizza and pasta?", "link": "facebook.com/groups/1373361046396315/permalink/2208244412907970/", "likes": 0, "comments": []}, {"id": "2208255196240225", "text": "Best walkable areas in Rome? Hotels? Airbnbs? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2208255196240225/", "likes": 6, "comments": [{"username": "Nancy Ann Paolino", "comment_text": "YES hotel"}, {"username": "Jill Wolder", "comment_text": "Stay in a hotel. You will have services readily available. Such as a concierge to guide you and help plan your time and set you up ."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2031\n40-Reviews-Bagl\nioni_Hotel_Regi\nna-Rome_Lazio.h\ntml"}, {"username": "Travis Menard", "comment_text": "The Cosmopolita Hotel Rome a Tapestry Collection by Hilton is in a great location and walking distance from many areas."}, {"username": "Carey Matthews", "comment_text": "From market in Campo Di Fiori, cross the pedestrian Ponte Sisto bridge to Trastevere, Rome's bohemian neighborhood. Meander towards the Santa Maria Basilica and Piazza /fountain for street performers, bars, restaurants....👍"}, {"username": "Costero Home", "comment_text": "https://\nwww.google.com/\nsearch?q=Best+wa\nlkable+areas+in\n+Rome%3F+Hotels\n%3F+Airbnbs%3F&\nrlz=1CAOTWH_enE\nS890&sourceid=c\nhrome&ie=UTF-8"}, {"username": "Emma Butcher", "comment_text": "Hotel Nazionale. Lovely hotel. Quiet yet everywhere is walkable"}, {"username": "Patrice James", "comment_text": "Thank you so much ❤️"}, {"username": "Amy French Baillie", "comment_text": "Stayed in Trastevere last week. Loved it as a base in Rome"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "All of central Rome is very walkable and safe."}, {"username": "Yuko Y Smith", "comment_text": "Near Campo de Fiori, Panteon, area"}, {"username": "Emmanuel Bautista", "comment_text": "Ancient Rome or now the center of the city is walkable. Everybody walked in Rome before the introduction of chariots. Start at the Colosseo."}, {"username": "Enrico Lecce", "comment_text": "Stay away from the center of Rome"}, {"username": "Mandy Pusateri", "comment_text": "We just booked an AirBnB yesterday. We went back and forth between and AirBnB and a hotel. For the money I felt you got more space in the AirBnB and our rental is within walking distance to areas we want to see."}, {"username": "Karrie LeBlanc", "comment_text": "If just 2 or 3 of you book a hotel. If more and you need more space then Airbnb is your better option. If you book an airbnb and it is an apartment make sure there is an elevator in building."}, {"username": "Patrice James", "comment_text": "There are two of us traveling together both ladies. Two weeks in October. I’m finding the hotels suggested are booked. We literally just found good airfare and decided …. Let’s do this… thanks for the input… keep it coming. It’s my first time to Italy"}, {"username": "Elisabeth Zarapi", "comment_text": "\" Fraterna domus \" chambres confortables et repas possibles, TB placé"}, {"username": "Marjie De Villa Lorica", "comment_text": "Loved our hotel in Via del Corso- walking distance to sights within the historic center, and with lots of nearby shops❤️"}, {"username": "Dann Hrusch", "comment_text": "My favorite so far was by the Pantheon. Most sites are no more than a 30 min walk away."}]}, {"id": "2208254832906928", "text": "Has anyone on here booked an Italy trip with Railbookers? If so, was it a good experience?", "link": "facebook.com/groups/1373361046396315/permalink/2208254832906928/", "likes": 0, "comments": [{"username": "Natalie Marie", "comment_text": "Natalie Marie"}]}, {"id": "2208254029573675", "text": "Can you buy a IDP in Italy when you’re there?", "link": "facebook.com/groups/1373361046396315/permalink/2208254029573675/", "likes": 1, "comments": [{"username": "Costero Home", "comment_text": "No, you have to get it from your country of Origin."}, {"username": "Giessica Bormio", "comment_text": "No."}, {"username": "Giessica Bormio", "comment_text": "You make it your country"}, {"username": "Stephen Dawson", "comment_text": "Italian law requires an idp or certified translation of your drivers lic you might be able to get the certified translation locally"}, {"username": "Miyuki Kanno Paul", "comment_text": "Get one at AAA. It’s good for one year"}, {"username": "Sandra Shoffner", "comment_text": "No"}, {"username": "Ettore de Vita", "comment_text": "Your USA DL would be sufficient."}, {"username": "Brice Blosser", "comment_text": "We were not asked for them at all."}, {"username": "John Bruckman", "comment_text": "You don’t need it in italy"}, {"username": "Karen Joyal Pastori", "comment_text": "Thank you all for your help. Our first time abroad and I need to have all my ducks in a row."}, {"username": "Gillian O'Callaghan", "comment_text": "No needs to be done in your home country.....IDL\nin most."}, {"username": "Bianca Balderas-Saenz", "comment_text": "We got it at AAA. Same day and they took my husbands pictures there as well. Super quick and easy."}]}, {"id": "2208168482915563", "text": "Been reading thousands of helpful posts. Thank you to everyone for sharing. Just starting to plan for May/June 2024. Is there a site that can help with choosing Air BNB’s? Would like to stay in city centers, but don’t mind 10-15 minute walks.", "link": "facebook.com/groups/1373361046396315/permalink/2208168482915563/", "likes": 1, "comments": [{"username": "Starla Dawn", "comment_text": "I had great success reading the reviews on the Bnbs and choosing super hosts."}, {"username": "Janine Emma Lucas", "comment_text": "Booking . Com"}, {"username": "Melanie Matthews Stuprich", "comment_text": "I usually read up about areas in cities and then type in that area to Airbnb to find a close by house/\napartment. Because I have been to Rome many times I searched Rome with Airbnb and lnew the different areas and chose one close to the Spanish steps. It’s using the research of google and Airbnb working together to find a good spot!"}]}, {"id": "2208204972911914", "text": "Hello everyone, could you recommend nice jewelry shops in Rome? Someone mentionned a shop near Spanish steps but I can't find the post Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208204972911914/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208336446232100", "text": "Where can I find the Italian flour they use to make their pizzas? I’ve had the lightest pizza and I know it’s not what the chains use in the USA. Someone, please tell me you agree🥹😅", "link": "facebook.com/groups/1373361046396315/permalink/2208336446232100/", "likes": 17, "comments": [{"username": "Stacy Derouin", "comment_text": "It's 00 flour. If you can't find it in your grocery store, you can definitely get it off of Amazon. We use it for pizza and sometimes pasta."}, {"username": "Alessio Esposito Inchiostro", "comment_text": "Most famous brand is Caputo."}, {"username": "Fiona Mac", "comment_text": "Remember semolina flour too for the base"}, {"username": "Elena Innocenti", "comment_text": "the difference is made not only by the kind of flour, but by the percentage between water and flour, the yeast and the leavening hours."}, {"username": "Linda Prunkel Reinhard", "comment_text": "00 flour. Amazon definitely has it. Whole Foods as well."}, {"username": "Joann Lynn", "comment_text": "Good question!!"}, {"username": "Madeline Caporale", "comment_text": "If you live in an area that has produce/\nspecialty markets that feature imported Italian foods they are very likely to carry it."}, {"username": "Sergio Milone", "comment_text": "I don’t know where you live and where you can get it. In my opinion best flour are: Molino iaquone Luna gialla, 5 stagioni, molino Caputo pizzeria. Caputo in Uk is sold by Amazon too."}, {"username": "Mariel Tinney", "comment_text": "I just visited America and got some at Costco"}, {"username": "Heather Stokes", "comment_text": "Pinsa is the best style and made as below."}, {"username": "Pamela Grad", "comment_text": "King Arthur Flour is a great source. They ship."}, {"username": "Alessandro Battxi", "comment_text": "Depends on the type of pizza, Caputo (nuvola), but there are others good as well."}, {"username": "KB Spector", "comment_text": "Look for the Caputo brand, 00 Pizzeria flour. Might be available on Amazon depending on where you live. (I know the GF version is)."}, {"username": "Roula Abaci", "comment_text": "Anyone have a good recipe for pizza dough ??"}, {"username": "Michelle Lynn Johnson Love", "comment_text": "Chris Love buys ours from Amazon in 50 pound bags!"}, {"username": "Jennifer Smith Ravanesi", "comment_text": "Caputo 00"}, {"username": "Amber Butler", "comment_text": "I order mine from oonie. We now make our own pizza and fresh pizza sauce too"}, {"username": "Joani Hayward", "comment_text": "Soft wheat vs. America's hard wheat. Amazon: Italian flour and you will find many choices."}, {"username": "Carla Bortnick", "comment_text": "Stop & Shop sells King Arthur Baking Company '00' Pizza Neapolitan Style flour. Also held by same company that owns Hannaford, Food Lion and Giant. Maybe check those supermarkets if they are in your area. I was surprised to see on my supermarket shelf."}, {"username": "Roger Elliott", "comment_text": "Coles Supermarkets in Australia.\nAustralia has so much better Pizza than Italy."}, {"username": "Patricia Famularo", "comment_text": "I just found it in ShopRite"}, {"username": "Lynne Neeley", "comment_text": "As others have mentioned 00. Surprisingly at my grocery store. I never looked before"}, {"username": "Laurie Bianchi", "comment_text": "Italian markets and deli carry 0 or 00."}]}, {"id": "2208333909565687", "text": "Sorrento", "link": "facebook.com/groups/1373361046396315/permalink/2208333909565687/", "likes": 53, "comments": [{"username": "Mindy Jo", "comment_text": "Robyn Mendenhall Gardner"}, {"username": "Robert Janssens", "comment_text": "magnific !!!!!!"}, {"username": "Amanda Monique Bartz", "comment_text": "Tammy Turalitsch… t minus 2 weeks"}, {"username": "Claudine Auclair", "comment_text": "Cant wait!"}]}, {"id": "2208327779566300", "text": "Hi!\n\nMy family and I will be staying in the Greve Chanti region next August for a family reunion. We found a villa through VRBO, but the owner are us book outside of VRBO and sign a contract. Has anyone done this before, if so, did you experience any issues with it? Also, when would be the best time to books flights for August?\n\nSorry for the silly questions, appreciate the advice!", "link": "facebook.com/groups/1373361046396315/permalink/2208327779566300/", "likes": 0, "comments": []}, {"id": "2208308332901578", "text": "Milan, Italy🥰", "link": "facebook.com/groups/1373361046396315/permalink/2208308332901578/", "likes": 709, "comments": [{"username": "Ken Vecchia", "comment_text": "I love looking at the Doumo. An awesome sight"}, {"username": "Angie Callejas", "comment_text": "Love the shoes."}, {"username": "Alice Bong", "comment_text": "The architecture 💕"}, {"username": "Sandra Paul", "comment_text": "@jenny Watson Would you have an Airbnb recommendation around the duomo area?"}, {"username": "Gary W Anderson", "comment_text": "What church?"}, {"username": "Halley Brooklyn", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Lisa Wylin", "comment_text": "Awesome!👍🥰"}, {"username": "Annette Saviano Citta", "comment_text": "Beautiful"}, {"username": "Nai La", "comment_text": "Looking great plu view"}, {"username": "Trevor Brown", "comment_text": "Nice little church!!"}, {"username": "Nie Xiaoqian", "comment_text": "I will arrive in Milan in mid-September and hope we meet😃"}, {"username": "Lana Kastrati", "comment_text": "Great picture ❤️"}]}, {"id": "2208306489568429", "text": "In September, will be taking the regional train from Naples to Sorrento, then a Sita bus from Sorrento to Positano where we will be staying a few days. Does anyone know if it is easy to find the Sita bus stop to Positano once we arrive in Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2208306489568429/", "likes": 1, "comments": [{"username": "Rachael Richardson", "comment_text": "Yeah the station is not big it’s at the front of the train station you buy the tickets at the tabac shop they are a couple of euros"}, {"username": "Miyuki Kanno Paul", "comment_text": "Another option is to take a ferry from Sorrento to Positano. You must purchase your ticket(both for you and for your luggage)."}, {"username": "Ibbu Mohd", "comment_text": "Better to take ferry than bus with luggage/\ncarryOns.\nFerryhopper- app - for amalfi coast ferries across multiple cities\nBuy tickets from as well, easier"}, {"username": "Jenny Payne", "comment_text": "Yes from the station outside look down and u will see some stairs go down them cross the road and u will see the bus on the right + u can buy tickets at the bus stop. Also there are two stops you can get off in Positano, the first one is if your on the hill and the 2nd one is if your close to the centre 🌻"}]}, {"id": "2208302526235492", "text": "We're traveling to Italy at the end of November (Venice, Pompeii/Naples, and Rome). We've read here as well as various places online that it's much less busy at this time. Is it safe to assume there's no need to buy \"skip the line\" entry? This is our first time there and have no point of reference. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2208302526235492/", "likes": 0, "comments": [{"username": "Gena Kona-Mancini", "comment_text": "There's honestly never a need for skip the line if your tickets are purchased in advance. The line ups you see are for people who didn't buy in advance"}, {"username": "Maria Brozou", "comment_text": "been there in November except Venice. We booked nothing in advance in Rome & Napoli/Pompeii and only had to wait at the colosseum because it was a free entry Sunday."}]}, {"id": "2208300092902402", "text": "Hello, heading to Italy in April 2024. Setting up accommodation for last night before flying out. Has anyone stayed at LA Brezza Marina B&B before near Rome airport?", "link": "facebook.com/groups/1373361046396315/permalink/2208300092902402/", "likes": 0, "comments": []}, {"id": "2208299862902425", "text": "Heading to Rome, Venice and Florence. I have celiacs so am not able to eat wheat. I’ve heard there are many gluten free dining options and markets in Italy, can anyone recommend any?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208299862902425/", "likes": 2, "comments": [{"username": "Jay Parekh", "comment_text": "“Almost” every restaurant I’ve been to, I saw options."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "They are everywhere. Celiac is very common in Italy."}, {"username": "Stacey Taylor", "comment_text": "Thank you all!"}, {"username": "Kristina Russell", "comment_text": "Lots of places had options, but here were a few of our favourite AIC (Italian Celiac Association) accredited GF restaurants.\nRome - Mama Eat Lab, Pandali\nFlorence - Ristorante Quinoa, Sgrano, Ciro & Sons\nGrocery stores had great GF sections too for snacks."}]}, {"id": "2208299749569103", "text": "Recommend hotel or air bnb Sorrento please ..mid range", "link": "facebook.com/groups/1373361046396315/permalink/2208299749569103/", "likes": 2, "comments": [{"username": "Emma Butcher", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d1254\n8989-Reviews-Ma\nison_Lauren-Sor\nrento_Province_\nof_Naples_Campa\nnia.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2898\n90-Reviews-Hote\nl_Villa_Fiorita\n-Sorrento_Provi\nnce_of_Naples_C\nampania.html"}, {"username": "Sandy Radican Shikaly", "comment_text": "Grand Hotel La Favorita.. 5 star property.. expensive but not as expensive as some"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Antiche Mura. Right in center of Sorrento. Stayed there 4 times . Fabulous"}, {"username": "Geoff Roush", "comment_text": "Imperial Hotel Tramontano Sorrento"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "grand hotel de La ville"}, {"username": "Jason Hobel", "comment_text": "We enjoyed Casa Evelina Sorrento. A nice little place that was very clean and good location"}, {"username": "Elisabeth Pekonen", "comment_text": "Hotel Rivage"}, {"username": "Julie Connolly Arruda", "comment_text": "Diamond Suite. Great location near Piazzo Tasso and a wonderful host."}, {"username": "Suzanne Sanderson", "comment_text": "Hotel Plaza Sorrento is lovely and central"}, {"username": "Lisa DiSalvo Timmoneri", "comment_text": "We stayed at hotel mignon and loved it! Would highly recommend it!"}, {"username": "Susan Shaffar-Redding", "comment_text": "Hotel Settimo Cielo. Outstanding views and family owned."}, {"username": "Bev Madill", "comment_text": "Enjoyed Sorrento Tower."}, {"username": "Lori Mongillo", "comment_text": "Hotel Brittania -Stefano and Giuseppe are amazing! Great location and price."}, {"username": "Brian LaMantia", "comment_text": "Hotel Christina"}]}, {"id": "2207682206297524", "text": "Trip to Italy is next October 26-?\nGood on shoes…NOW…during this travel frame into November…what do you pack?\n\nWhat I’ve read you don’t want to stand out as a “tourist” from USA…\n\nPlease be kind or choose not to reply…thank you kindly…", "link": "facebook.com/groups/1373361046396315/permalink/2207682206297524/", "likes": 0, "comments": [{"username": "Jeanne Eliason", "comment_text": "Sandals. I always wear them. I can walk for miles and they are nice enough for most restaurants. Otherwise one can buy shoes if you make a fashion error. We only go to Tuscany and Umbria. We have never stayed later than the very first of November."}, {"username": "Elena Innocenti", "comment_text": "sneakers"}, {"username": "Pamela S Honeycutt", "comment_text": "I have sneakers (w/\northotic inserts)however another post had many taking sandals(what kind) for good support & walking? Also spoke of alternating them…"}, {"username": "Pamela S Honeycutt", "comment_text": "I’m staying 7 days Palazzo Catalina…then wanted to go to Tuscany. Any tips, stays, information would be very appreciated."}, {"username": "Kit Nader", "comment_text": "By the way November is much cheaper for hotels in November...I'd think about going a week later if I were u."}, {"username": "Miyuki Kanno Paul", "comment_text": "Very sturdy, well cushioned shoes are must. I wear lightweight hiking shoes, pack backup shoes, and flip flops for inside the hotel rooms in case no slippers are supplied by the hotels. Once I got caught in flash flood in Ravello and had my shoes soaking wet. It took days and days to dry them. Luckily I had a pair of backup shoes. I never regret it"}, {"username": "Fiona Mac", "comment_text": "Flats sketchers or good walking boots"}, {"username": "Shelley Perelmuth Sperling", "comment_text": "Depends on your feet. Flat feet. High arches. Whatever you bring it has to handle lots of walking. Cobblestones. Staircases. Etc. I’m bringing good supportive shearers /shies that I know will work for my feet."}, {"username": "Patti Porter", "comment_text": "I mostly wore hoka gaviota"}, {"username": "Giuliana Vaccari", "comment_text": "For my Amalfi Coast itinerary: (so depending where you’re going exactly)\n\n- 2 pairs of sneakers (1 cute for everyday and 1 athletic since we will be hiking)\n- 3 pairs of sandals (1 pair for everyday, 1 that is dressier for evening, and 1 that is waterproof/\nbeach)"}, {"username": "Annette Mayer", "comment_text": "I take good sneakers and a very nice pair of loafers that are good for walking and use those as dress shoes. That's it"}, {"username": "Jennifer L. Mezzio", "comment_text": "Comfortable supportive sneakers/\nsandals and a pair or 2 of nicer shoes to go out at night. It’s cobblestone - trust me - you want COMFORT! 😁"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/3ON4hGS"}, {"username": "Lisa Adams Robertson", "comment_text": "Really don't worry about it at all. There is no way to look like a local."}, {"username": "Melanie Matthews Stuprich", "comment_text": "Honestly your shoes won’t be the main/only reason you stand out as a tourist from USA and from experience I say definitely wear what you feel is comfortable for walking all day! Even if they don’t know by looking at you, which they do, the minute you go to talk they will know exactly where you are from regardless. (Coming from an American living in Sicily right now) just wear what is comfortable, be aware of your surroundings, and pay attention. You will be fine!"}]}, {"id": "2208298366235908", "text": "Looking for fancy restaurant recommendations preferably with great views in Rome and Florence", "link": "facebook.com/groups/1373361046396315/permalink/2208298366235908/", "likes": 1, "comments": [{"username": "Jill Wolder", "comment_text": "La Pergola in Rome. Michelin starred. Great city view"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "In my experience great views mean inflated prices and mediocre food. Better to get your views with cocktails at a rooftop bar."}, {"username": "Miyuki Kanno Paul", "comment_text": "Great views of what? What is your expectation? It will be greatly helpful if you have any particular views you wish to have. It’s not going to be cheap regardless"}]}, {"id": "2208296659569412", "text": "Traveling from Canada: should I but a SIM card before I leave (from Amazon?) or wait and get one at the airport when we arrive in Venice? My phone plan is $16/day for international use…I’m thinking the SIM card is a better deal, I just don’t fully understand how it all works.", "link": "facebook.com/groups/1373361046396315/permalink/2208296659569412/", "likes": 24, "comments": [{"username": "Paula Rosati", "comment_text": "Airalo esim. Cheap, works great. I have no clue where to find my SIM card. Your next phone probably won’t have a physical SIM card."}, {"username": "Karine Brevet", "comment_text": "I bought one on Amazon before leaving. I changed my SIM card in the plane after landing. So I was ready to use my phone as soon as I arrived."}, {"username": "Lisa Alexander Blake", "comment_text": "We used Holafly - has worked perfectly so far! https://\nesim.holafly.com\n/"}, {"username": "Terry Koks", "comment_text": "You can get a sim card anywhere don't even worry about it it is so easy. You will however have a new italian phone number!"}, {"username": "Sarah Folkard", "comment_text": "We bought online - super easy - good price"}, {"username": "Mike Murray", "comment_text": "Treva Murray"}, {"username": "Colleen Dee", "comment_text": "Reading all of these comments - I feel like a technology dork. I will watch some Youtube videos to find out, but honestly I don’t even know where my sim card is.\nThat being said, my US carrier - US Cellular said the charge $10 a day or $35 a month per phone (we have 2) for 20 minutes use day. I plan on using our phone for all I do now, calls, text & to access emails, maps. That all being said…\n1. I have provided my phone # to all my booked hotels. Sounds like with a SIM changing my #, I will have to update once I know what my number is?\n2. I will be in Spain Italy & France. A sim works in all?\n3. Data… I seriously don’t have a clue. Based on normal usage as described, how much do I need?\n4. Whats App… What the what? I thought that was messaging like FB messages. You can make calls on both?\nSounds like I need to watch a bunch of YouTube videos, but greatly appreciate some guidance - as I seem to go down rabbit holes with YT & Google. I’m just trying to understand trains, & trams, etc. Where I live, we have cars, buses & Uber… We have train tracks, but only cargo trains.\nSorry for the long post but wanted to be clear on my extreme lack of knowledge & what I need. FYI - my husband & I will be using our phones to stay in touch as he hangs out in a pub as I roam. He doesn’t need internet- but I do to get to all my saved info, maps, FB for posting the kazillion photos I will take - etc. which leads me to, if I’m not in my hotel with WiFi - does a sim allow all that without WiFi?\nThank you in advance. 💕"}, {"username": "Marcela Boggio", "comment_text": "I stopped at the first cellphone store and bought a TIM sim card and a plan that last me my 30 days. It was a 70GB plan and it was good to use in all the countries of the EU. No issues at all! Paid 25 euros."}, {"username": "Alicia Burno", "comment_text": "Download WhatsApp for free in your phone and can make free calls to anyone who also has the app. We are in Rome now and had no problems calling"}, {"username": "Andri McKenzie", "comment_text": "If your phone is esim compatible download the Airalo app at home, buy the package that best suits you and use that. We did this recently traveling to Italy and Switzerland (bought an esim for each country) and it worked like a dream. Had signal before we even left the plane after landing. Also, Airalo explains in detail how to install - it’s really easy.\nHappy travels!"}, {"username": "DeanaMarie Yaklin", "comment_text": "Although the airport is convenient, they’re usually more expensive. Any cellphone store, and they’re everywhere, will be able to help you."}, {"username": "Karen Gregorchuk", "comment_text": "Courtney Greg"}, {"username": "Chris Franklin", "comment_text": "Airalo app. eSim. Top it up any time in any country. We love it."}, {"username": "Sarah Emerson Nelson", "comment_text": "I used Airalo eSim for my iPhone, but you can buy a SIM at the airport too like my friend did. My Europe plan was $60 CAD for a month - way cheaper for just Italy and for shorter. So either way, better than $16/day!"}, {"username": "Dave Mazzei", "comment_text": "From Canada as well. Last two years I’ve used Sim Corner on line ordering. One month 8 gigs unlimited texts and calls $33 Cad. Good for all Europe. Highly recommend"}, {"username": "Maria Teresa Calvaruso", "comment_text": "Absolutely! Best thing ever !"}, {"username": "Shirley Lewis", "comment_text": "I you buy in Europe you must have your passport with you"}, {"username": "Pamela S Honeycutt", "comment_text": "What if you have iPhone 13 generation up…aren’t they SIM card less?"}, {"username": "Kathryn Darroch", "comment_text": "Travis Vincent"}, {"username": "Mindy Jo", "comment_text": "Does your phone have to be unlocked to do this?"}, {"username": "Carol Gordon", "comment_text": "I used What's App. Wifi is everywhere practically."}, {"username": "Jules Earl-Rossiter", "comment_text": "Go for Tim SIM they are excellent....th\ney do a tourist SIM which lasts for 30 days and it's,14 .99 euro's and you can buy it from any Tim shop in Italy....it comes with 50 gb data and 200 minutes....just\nremove your sim and insert the Tim SIM you will have a different number but you can contact all your friends to let them know...🙃"}, {"username": "Rhona Veisfeld Modugno", "comment_text": "I bought mine in the airport in Rome when we landed. Cost 55 euros. They put it in snd I never had any issues."}, {"username": "Nadia Bartolini Santo", "comment_text": "I just got back I bought a sim on Amazon , worked great. Easy register it before hand switched it in the plane and it was ready no wait time ."}, {"username": "Crystal Goodfellow", "comment_text": "We are traveling from Canada and plan on using the unlimited data plan from Holafly. They also provide a European phone number to make local calls as well."}, {"username": "Kejdi Okej", "comment_text": "Buy a disposable phone with minutes"}, {"username": "Barbara McFarland", "comment_text": "Hannah Biller"}, {"username": "Logan Payne", "comment_text": "I did an e-sim ordered online and was 20 US for a 20GB data plan."}, {"username": "Sonia La Civita Filice", "comment_text": "I went to WINDTRE and got a SIM card for 30 euros. It included unlimited data and 300 international calling minutes."}, {"username": "Allan Olexa", "comment_text": "We bought/\nused an esim….downloaded like an app. We turned off our current sim then turn on the esim…on the Connections screen. It worked great. We had previously used the Verizon International plan but bought an Orange Travel esim which was quite a bit less expensive. We are returning to Europe in November so will use the same esim, just topping off data and phone minutes."}, {"username": "Wendy Lammerant", "comment_text": "We bought off Amazon and installed on our layover in Gatwick—and on the way home installed while waiting for luggage at Pearson."}, {"username": "Darcy Jessen", "comment_text": "Airalo esim is the way to go. Currently in Italy. No problems at all"}, {"username": "Daisy Yoo", "comment_text": "I will do estimates and bring a iPhone 7 and get a physical sim when I get there"}, {"username": "Renee Rundle Stoneham", "comment_text": "I got one off Amazon for the first time this last trip. It was great! I put it in on the plane, landed and had service immediately! 👍🏻"}, {"username": "Connie Iacozza Brazzoni", "comment_text": "I purchased mine from Rome airport. I used vidofone. Worked awesome. It was 45 euro for 50 gb."}, {"username": "Heather Toews", "comment_text": "See if your phone accepts an eSim. Airalo has been great for our international travel."}, {"username": "Tau Wen", "comment_text": "Best to get sim in Europe"}, {"username": "Lisa Alexander Blake", "comment_text": "Holafly has worked perfectly for us! Esim (no changing out cards) if you have a newer phone this will work- 20 days for $50!"}, {"username": "Kim Anne", "comment_text": "I buy from Amazon.. Orange\nTravelled to Italy 3 times and it worked perfectly everytime."}, {"username": "Charlie Charnigo", "comment_text": "When I went to Ireland from the USA last June myself and my 2 college age kids just used free WiFi and kept our phones in airplane mode. Worked like a charm. You can download all the maps and google translate you need before you go. Most places have free WiFi and in our case we usually only logged on at the hotel, or before the meal came. Once the meal comes the first person that touches their phone buys dinner."}, {"username": "Pashe Simpson", "comment_text": "Is a SIM card necessary?"}, {"username": "Dixie Kotylak", "comment_text": "I bought one off of Amazon, I was a bit reluctant on how it would work but it was easy! I just removed (and stored) my can SIM card, during my flight) put in the euro one, activated it, and it worked perfectly. 👌🏻Occasionally I received messages (in Spanish I think? ) that I couldn’t read, but it kept working so no worries! 👌🏻😉😊"}, {"username": "Jorge Ronay", "comment_text": "iPhone 14 doesn’t use SIM card"}, {"username": "Jen Belsito", "comment_text": "Hey! We are Canadian and flying into Venice also. My BIL is in Europe right now and they purchased ESIM cards for him and his wife. We are also getting it for myself, hubby and girls. Hubby will learn about it all tomorrow when he helps my MIL with her phone. Ours is all of Europe and the girls will be just Italy (we are going to Greece too). Our children are heading back earlier for school. Each of us will have 10g of data. It’s $19.00 for us adults each and $14.00 each for our young adults.\n\nIt’s $15.00 a day PER PHONE on our family plan. I refuse to pay $1000.00 just to use our phones."}, {"username": "Pam Simpson Wilson", "comment_text": "We used an e-sim card from airlo for data-worked great and much cheaper then adding with t-mobile"}, {"username": "Anthea Lawrence", "comment_text": "Download Airolo from App Store. Buy the esim for the country you’re visiting. You keep your same number without the roaming charges. I use it all the time when traveling and it works really well."}, {"username": "Megan Tarleck Jensen", "comment_text": "We bought an e sim - Airalo and it worked great!"}, {"username": "Ruth Korchinski", "comment_text": "How much data does an average person need for 16 days.. I see they have 2 GB.... is that enought?"}, {"username": "Mario Torre", "comment_text": "Following"}, {"username": "Debi McGrath", "comment_text": "Hello fellow Canadian, I will be buying a SIM card when I get to Venice. There is a store by the Rialto bridge where you can get one"}, {"username": "Teena Leuba", "comment_text": "Denise Bibby"}, {"username": "Jeff McLellan", "comment_text": "We bought Airalo esim but my wife still got charged for texts. Lesson learned."}, {"username": "Antonio Aloè", "comment_text": "Buy one at the airport if they sell them,vodafone or tim in Italy.."}, {"username": "Carmela Noble", "comment_text": "We are also from canada and my parents ordered an esim from Amazon and are using it there no problem. You just pop out your current sim and put in the other and that’s it. Certain areas are choppy for calls but they have been using WhatsApp no problem"}, {"username": "Linda Schauer", "comment_text": "Sarah Marie"}, {"username": "Steven Trembath", "comment_text": "Holafly"}, {"username": "Suzanne Mills", "comment_text": "Buy a disposable phone with minutes."}, {"username": "Sar Malco", "comment_text": "Bought one upin arrival. Much cheaper."}, {"username": "Sarah Urciuoli", "comment_text": "Esim from Airalo if your phone is compatible."}, {"username": "Marie Cunningham", "comment_text": "Just bought Holafly esim on line gives unlimited GB and free calls. Works a treat cheers. Set it up on arrival in 10 mins."}, {"username": "Elmina Babineau Perras", "comment_text": "While it may be slightly cheaper to get the SIM card at your destination, I like the convenience of having it with me before I land and you don’t have to provide any personal information to the seller. I usually install it as soon as we land.\nBut now I’ve started using an ESIM with Airalo, it is so much easier."}, {"username": "Sarah Louise", "comment_text": "We travelled from Canada as well and purchased an Orange Sim with data included from Amazon, had issues using a very old phone with it however it worked perfectly with our newer phone. To use it we just inserted it into the phone and has data roaming on, it was a life saver and much more affordable than the daily thing our cellphone provider offered. Might be worth reading up on to see if this is a good fit for you."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nairalo.pxf.io/\nq4WdGO"}, {"username": "Susan Maxwell", "comment_text": "Susan Maxwell"}, {"username": "Jaime Johnson", "comment_text": "Does Airalo include calls back home and texting or just data?"}, {"username": "Cherie Coe", "comment_text": "Quentin Coe"}, {"username": "Angela Koots", "comment_text": "We usually buy one once we get there as it’s waaay cheaper. Works the same except you won’t have your usual Canadian phone number.\n\nThey pop your SIM out and add a new SIM with new Italian number. When you get back home you can put your original SIM back in and you get your original phone number back.\n\nUse Facebook messenger or download What’s App to communicate with family back in Canada.\n\nMy daughter bought a one month plan…150 GB with unlimited European calling and text for 45 Euro at the Rome airport kiosk.\n\nI waited till I was in town and paid 10 Euro for 200G, unlimited calling and text within Europe. My husband paid 10 Euro and got 150 GB unlimited calling and text within Europe AND 200 minutes international calling. Great deals in town if you are willing to go without a phone for a few hours until you find a store in town. We used Vodafone but there’s also TIMS and WIND.\n\nLastly, during our most recent visit I purchased the mama Mia esim plan through AirAlo before we left but found it to be unreliable, hence the switch to an Italian SIM after just a day of being in Italy."}, {"username": "Costero Home", "comment_text": "We are CDN and spend 6 months a year in the EU and we both use Airlo."}, {"username": "Sandra Di Liso", "comment_text": "Buy SIM at airport when you land. So much cheaper. Just use What’s Ap to communicate."}, {"username": "Cheryl Barowski", "comment_text": "Don’t buy the SIM card until you get to the city where you are going. It’s more expensive at the airport."}, {"username": "Fetchin Gretchen", "comment_text": "I prefer getting on arrival myself or the day after in town as they put it in and activate for you etc. Outside Canada and USA, rates are much cheaper ...from $10 to $30 per month. I usually get Vodafone or Orange but have tried most of them! I keep my us sim in a safe place for the duration usually taped to the card from the new sim."}, {"username": "Ian Beyer", "comment_text": "Get a prepaid eSIM beforehand or on the way. No swaps needed, just activate it when you land."}, {"username": "Tanya Lee Knightly", "comment_text": "We buy one when we get there. At the airport. Cheaper! Paid 35 euros for 2 weeks in italy. Was able to call.home to Canada and had internet the whole time"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Check with your carrier. You may not need one. We have T-Mobile and were all set when we landed. Didn't need to change a thing."}, {"username": "Venette Macalinao", "comment_text": "I’m from Canada too! We’re leaving this week for Italy and Greece and I bought an eSim (Airalo). Used it when I was in Berlin and Prague last year and worked very well. If you’re curious about how it works or how to install it, there are plenty of YouTube vids out there."}]}, {"id": "2208296419569436", "text": "Heading to Positano at the end of the month and looking for recommendations on boat trips in Positano or Capri.", "link": "facebook.com/groups/1373361046396315/permalink/2208296419569436/", "likes": 103, "comments": [{"username": "Anne Simmons", "comment_text": "I have"}, {"username": "Erin Thompson", "comment_text": "Blue star Positano"}, {"username": "Dana Hebert Bendeck", "comment_text": "Following"}, {"username": "Flora Johnson", "comment_text": "Our tour group arranged our Capri trip from Positano… we stayed in Capri for 4 hrs. It was a separate excursion so we paid extra for it."}, {"username": "Denise Rivera", "comment_text": "Heading from Venice to Amalfi Coast by car at the end of this month. Any recommendations\non a particular car rental? Tks."}, {"username": "Billie Frances Swanda", "comment_text": "Stay at La Perla"}, {"username": "Linda McNelis", "comment_text": "Following"}, {"username": "Debra Barnett", "comment_text": "Try Blue Star Positano!"}, {"username": "Karen Gregorchuk", "comment_text": "Following"}, {"username": "Marysia Carr", "comment_text": "F"}, {"username": "Lheah Bilgera Gearon", "comment_text": "Mark Fern"}, {"username": "Alyse Attalla", "comment_text": "Thanks so much everyone for the information! Just trying to get a feel if private or shared boat is the way to go!"}, {"username": "Chantal Séguin", "comment_text": "Ischia, Forio Village!!"}, {"username": "MaiLing M Matthews", "comment_text": "Highly recommend Positano Charter company !"}, {"username": "Jasper C. Acton", "comment_text": "Less of a chance to get sick using the ferry system. Helps smooth out any roughness, and they don’t go when weather is rough either. Best choice, to Capri, Amalfi."}, {"username": "Jasper C. Acton", "comment_text": "Use the ferry system! Less chance of sickness, smoother ride. They don’t run if it’s very rough. Can go to Capri, and to Amalfi."}, {"username": "Debbie Mulford", "comment_text": "Following"}, {"username": "Gaye Kasprzak", "comment_text": "Following"}, {"username": "Elena Eckley", "comment_text": "Do not miss Ischia!!"}, {"username": "Lydia Leyla Cosgrove", "comment_text": "I spent 2 nights on capri (got the fast ferry from Naples - 1 hr)\nFrom Sorrento I think the ferry is 20-30 mins!\n\nWhen I was in capri my boyfriend and I did a full day (7hr) private boat trip with food. Think it was around 500€ for the day."}, {"username": "Penny Cato", "comment_text": "We took a ferry to Capri from Positano!! 🇦🇺🇮🇹🥂💕"}, {"username": "Karen Tanner Rogers", "comment_text": "Go EARLY morning!!!!! Extremely crowded"}, {"username": "Lorraine Marie Zalepa", "comment_text": "Take the ⛴ ferry"}, {"username": "Natalie Stamer", "comment_text": "Following"}, {"username": "Bob Madonna", "comment_text": "Was not a fan of Positano. Too many people with too much money. Try Camogli."}, {"username": "Amy Sasse Hesse", "comment_text": "Reach out to Carmine Barba at Amalfi Boat Tours! I have used Carmine several times over the past 5 years and he is very professional and knowledgeable, responsible boater! And he has a gorgeous boat! We just went on his boat on July 26th! Enjoy your trip! 😊"}, {"username": "Susan Bouchon", "comment_text": "We took the ferry from Sorrento to Capri, tried to get into the Blue Grotto but water too high and many boats waiting so driver went around the island and back to Marina, stayed overnight, then took a ferry to Positano. Took local bus to Amalfi then tour bus to Ravello for a day with ferry back to Positano from Amalfi to see everything from the water."}, {"username": "Michelle Hourston", "comment_text": "Following"}, {"username": "Carmine Barba", "comment_text": "Grazie Amy Sasse Hesse ❤️"}, {"username": "Joanna Journet", "comment_text": "Bluestar positano are amazing. I have been on several trips with them and loved them all. Bluestar Positano Boat Trips"}, {"username": "Ashley Czinege", "comment_text": "Not for the faint of heart!…. I just did an amazing boat day trip from Positano to Capri with Grassi Junior boat tours. Priced at 130 euros per person for the entire day.\n\nThey stopped mid way to Capri for us to go swimming. He stopped beside the blue grotto and went around the island of Capri….Just be sure to keep in mind… the smaller the tour; the smaller the boat… the smaller the boat the more you can feel the waves and the boat rocking. 3 people on my tour got sea sick and threw up. Most were feeling so sick. I was totally fine but just note that it can make you very queasy. Especially if you aren’t used to boats. I know lots of the people on my boat didn’t end up getting to enjoy Capri because they were feeling too sick to make it from Marina Grande all afternoon.\n\nIf you easily get sea sick, perhaps take the ferry to Capri. It’s much larger so you don’t feel the waves much. If the water is at the right level and not too wavy the day you’re there, I highly also recommend visiting the blue grotto inside if it’s possible!\n\nSide note, be sure to take a tour that allows you minimum 4 hours in Capri. Be sure to visit AnaCapri and take the chair lift to the very top! It’s the most breathtaking view in all of Italy in my opinion.\n\nJust things to keep in mind! 😄\n\nHave the best time!"}, {"username": "Marta Kleczkowska", "comment_text": "We just came back from Italy. We rented a boat from Blue star positano. Everything was great. I highly recommend them"}, {"username": "Nikki Nicholson", "comment_text": "We are going to Positano early October and are chartering a boat through Positano Rental Boats for 850 euros for the day. They have been so easy to communicate with through WhatsApp and have great reviews."}, {"username": "Lori Richardson", "comment_text": "Take the ferry then you can catch a tour on boat around Capri from there. Blue star I believe."}, {"username": "Rachael Brown", "comment_text": "Also keep in mind, all of august is an italian holiday. Positano/capri rentals will more than likely be booked up as Italians book far in advance for this month."}, {"username": "Lori Richardson", "comment_text": "Also take ferry to Sorrento. I usually stay in Amalfi but last trip this year stayed in Sorrento loved it"}, {"username": "Anthony Petittiano", "comment_text": "Lisa Ballenger"}, {"username": "Catherine Bartley", "comment_text": "We were just there and there were boats running all day from Porta Margherita to Positano!!!! Beautiful!!"}, {"username": "Lisa Aho", "comment_text": "Do you have any boating experience? We just rented our own without a skipper and it was amazing!"}, {"username": "Lisa Walkow Bonchonsky", "comment_text": "We used Plaghia Charter for a tour from Positano to Capri. It was a great day. I think the boat fit about 20 people. It was about $100 euros per person."}, {"username": "Gary Oroian", "comment_text": "We love Capri and stay a few days!! Private boat trips the only way to go!"}, {"username": "Linda Yanni", "comment_text": "We took the ferry from Sorrento to Capri. When we got there we went over and got on a boat for the Blue Grotto, transferred to the snack boat to get in the grotto - no problem, it is beautiful in there, then they returned us to Capri. We spent the rest of the afternoon exploring. Loved the chair lift to Ana Capri."}, {"username": "Sandra Lynn", "comment_text": "Weather in Malta in October"}, {"username": "Victoria Seidman", "comment_text": "Following"}, {"username": "Claire Jane", "comment_text": "We did a sunset tour of Capri booked through our Tui tour guide at our hotel. Beautiful as not as busy by night and seeing the sunset ❤️🇮🇹"}, {"username": "Mark Moylan", "comment_text": "Mandy McGurgan"}, {"username": "Pamela Jones", "comment_text": "Check out BlueStar Positano. They work off the beach"}, {"username": "Leslie Hunt Young", "comment_text": "Following"}, {"username": "Sandy Delle Mayabb", "comment_text": "Following! Where did you stay in Positano?"}, {"username": "Jayne Diliberto", "comment_text": "How's the weather for this the end of Oct"}, {"username": "Dawn Muscarnera", "comment_text": "La gattonero"}, {"username": "Patricia Cheyne", "comment_text": "Book with Grassi Junior!!! Amazing! Ask for Captain Clemente!!!"}, {"username": "Terri Courtney", "comment_text": "Oh I absolutely love Barbara Positano Boat Tours!!! AWSOME AWSOME people!!!"}, {"username": "Katie Post Greco", "comment_text": "We used Bluestar Positano from Positano. We did a half day private tour with my family of five. They were fantastic and reasonable. Highly recommend! Happy to answer questions"}, {"username": "Audrey Bauer", "comment_text": "Highly recommend this boat tour company. Did the Small group Amalfi tour. Stopped at Emerald Grotto! With no wait and then spent time in Amalfi."}, {"username": "Hunter Hughes", "comment_text": "Viman Charter is the best. Trust me!"}, {"username": "Maria D'Antino", "comment_text": "Following"}, {"username": "Coralie Wehlow", "comment_text": "Nikki Grace"}, {"username": "Dina Garrett", "comment_text": "BillandAngala Verley, Julie Franco Mellow, Linda Williams"}, {"username": "Lesa Knight", "comment_text": "My daughter and I are planning a trip to Italy in the spring and need help with some of our plans. Can anyone recommend a great travel agent or company that can help us? Thanks!"}, {"username": "Bonnie Brauner", "comment_text": "Without a doubt, Bluestar Positano\nWe sailed with them a few years ago and could not have been happier"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Positano/\nCapri-Boat-Tour-\nfor-Small-Group\ns-from-Positano\n/\nd33602-136733P9?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Positano/\nSmall-Group-Tour\n-to-Positano-by\n-Boat-at-Sunset\n/\nd33602-152010P13\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Sarah Stanford Bilder", "comment_text": "Following"}, {"username": "Clancy Mason", "comment_text": "Following!"}]}, {"id": "2208295082902903", "text": "Help Please fellow Aussies\nTravelling to Italy in 1 month.\nGot travel Card $100 Australian today is\n57.47 Euro should I lock some $ in at this rate or take chance and let it convert as we go along ??\nTIA\n\nShould", "link": "facebook.com/groups/1373361046396315/permalink/2208295082902903/", "likes": 0, "comments": []}, {"id": "2208294629569615", "text": "Hubby and are I considered catching an over night (sleeper) train from Munich to Florence. Hoping this will give an extra day in Florence rather than losing 1/2 day in flight travel. Would like to hear your experiences of the over night train… good/bad/ reasons for and against. Thank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2208294629569615/", "likes": 1, "comments": [{"username": "Fetchin Gretchen", "comment_text": "Have not done this in a long time but could be a good option though if you share with noisy people you may not get much sleep."}, {"username": "Tami Sue", "comment_text": "I've done one from Venice to Paris. It was a really bad experience. And it's cheaper to fly but u do need a hotel room. I will never do it again."}]}, {"id": "2208294549569623", "text": "Arriving in Venice at the end of December and I'm torn between the following hotels for 2 nights. Suggestions or personal experience on these hotels.\n\nHotel Firenze\nHotel Al Ponte Dei Sospiri\nHotel Cavalleto & Doge Orseolo\nHotel Colombina\nHotel Paganelli\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2208294549569623/", "likes": 0, "comments": [{"username": "Kristin Kornack", "comment_text": "..."}]}, {"id": "2208292032903208", "text": "Hi everyone! This forum has been super helpful throughout our planning process. I was wondering if anyone has done the lunch tour at the Vatican? If so, is that one of the “fast pass” type admissions or will we be waiting in line for hours? Tried to dig around to find out but wasn’t super lucky.", "link": "facebook.com/groups/1373361046396315/permalink/2208292032903208/", "likes": 1, "comments": []}, {"id": "2208290816236663", "text": "Local shopping recommendations for Rome, Florence, and Lake Como. Christmas ornaments, local arts and goods, etc.", "link": "facebook.com/groups/1373361046396315/permalink/2208290816236663/", "likes": 0, "comments": []}, {"id": "2208282019570876", "text": "Hi! Looking for info for those who have made car trips in Tuscany. I will be traveling with my mother and we are planning to have a car take us from Florence to Rome, with stops in some Tuscan towns along the way. Unfortunately, we both struggle with motion sickness so I’m now wondering if we’re crazy to consider driving hillside towns with any Italian driver lol. 🫣 Any I insight is appreciated. Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2208282019570876/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "rent a. car https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Pat Cirillo", "comment_text": "Are you fearing that Tuscany is ‘mountainous?’ It isn’t, really. Many of the towns themselves are way up in hills, but there’s a lot of driving done in the relatively flat valleys. There isn’t a lot of up-and-down that is noticeable unless you want there to be. To see some towns, you will need to be driven up and down a hill. But that can be avoided."}, {"username": "Greg Saba", "comment_text": "Are you able or willing to drive. I get motion sickness, especially if I am in the back seat, but no problem when I am driving. And, we have driven all over Italy, including Tuscany, Sicily and Sardinia. Pretty easy, especially once out of the larger cities."}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s nothing crazy like driving Amalfi coast. You’ll be fine. While riding, don’t look back, keep your head straight forward, do not read anything. Do not look down."}, {"username": "Alberta Brack McAviney", "comment_text": "No"}, {"username": "Jerry Kiger", "comment_text": "I want to do the same … rent car after Rome into Tuscany. Anyone know how hard, or easy, is it parking car in Tuscany in general? Would rather drive and explore not sure parking part. Need find place to stay as well (maybe they have park spot). Thank you!"}, {"username": "Suzanne Mills", "comment_text": "Train"}, {"username": "Nida Paul", "comment_text": "We took the a train between Rome and Florence but had a day trip to Tuscany and drive wasn’t much hilly at all. Train was really convenient to travel between cities but not as much view or options to sightsee during the train rides."}]}, {"id": "2208281892904222", "text": "I purchased my tickets on the Italiarail website. What app do I use to see them on my phone? I have the Trenitalia app, but it says it cannot locate my trip. Feeling worried...", "link": "facebook.com/groups/1373361046396315/permalink/2208281892904222/", "likes": 2, "comments": [{"username": "Kim Dixon", "comment_text": "Make sure you have most updated app. I just opened mine to tell you what it was called (Trenitalia) and it gave me a message said I needed to update app to see purchases. You should be able to create a sign in"}, {"username": "Lori Wroblewski", "comment_text": "Those are two different lines. Download both the italiarail and the trenitali rail app"}, {"username": "Roxanne Patti", "comment_text": "When I purchase mine it asked if I wanted them in my Apple wallet. They are all stored there in one place and easy to retrieve."}, {"username": "Shelley Frise", "comment_text": "We printed copies and took with us just in case."}, {"username": "Jennifer Walp Rydholm", "comment_text": "Thanks all! Unhas saved the email but bouncing the app so did a search through the app and loaded them there! Perfect."}, {"username": "Jackie Walters", "comment_text": "I believe Itali is different from Trenitalia"}, {"username": "Debbie Freedman Katz", "comment_text": "Do we use Trenitalia or Itali for Rome to Florence and then Florence to Venice?"}, {"username": "Ibbu Mohd", "comment_text": "Italotreno -app"}, {"username": "Kevin Robison", "comment_text": "To clear up any confusion ... Italiarail is a 3rd party ticket reseller. Trenitalia is the state run railway for regional and high speed trains. Italo is the other competing train company offering only high speed trains."}, {"username": "Fiona Cameron", "comment_text": "I cannot download Trenitalia app in Australia. Does anyone know if I can download once I get to Italy?? Thanks 😊"}, {"username": "Cris Wimer", "comment_text": "I took a screenshot and put in a “tickets” album in my photos. Easy to find. Deleted after use."}, {"username": "Maria Andreou", "comment_text": "I bought via Italia Rail for trenitalia because couldn’t access the app in Australia when I bought my tickets. the email I received had the tickets so just searched my email for the bar coded tickets when catching the relevant train. Worked just fine"}, {"username": "Tracey Purdy", "comment_text": "I have mine just in my emails."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208281079570970", "text": "I really love this group! We are headed to Rome and Sorrento in early September and would love feedback from anyone that may have booked with Carmine’s secret tour of the Amalfi coast. It’s an all day event with a farm to table lunch and just curious if anyone can comment on the experience. Many thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2208281079570970/", "likes": 0, "comments": []}, {"id": "2208277146238030", "text": "I am traveling to Italy in September! First time and so excited! After reading lots of posts on this site I’m slightly confused. I am gluten free due to gluten sensitivity(I’m not a celiac). I have heard that because the wheat in Italy is not gmo that it’s safe to eat the pasta, bread, pizza etc. However I’ve also seen posts referring to the fact there are many gluten free choices in Italy. Can anyone give me an answer on this?", "link": "facebook.com/groups/1373361046396315/permalink/2208277146238030/", "likes": 3, "comments": [{"username": "Alessio Esposito Inchiostro", "comment_text": "Gluten is gluten also in Italy.\nOnly thing I can tell you is that they noticed pasta Senatore Cappelli improves guts health for celiac people and performed some tests.\nAlso Italian pasta has less gluten than others because it has less proteins."}, {"username": "Melissa Hitchner", "comment_text": "Both are true. My work colleague who is gluten sensitive was able to eat bread and pasta in Italy, but she said she tried a number of gluten free options as well, which were delicious. Every body is different. If you have ways of managing symptoms if they flare up then I'd say try the pasta. If not, stick to gluten free."}, {"username": "Evelyn Brown", "comment_text": "Yes to both. I'm gluten sensitive and I'm able to tolerate it WAY more here. But if I'm not walking a lot or drinking enough water, I still have symptoms.\n\nItaly is very serious about protecting celiacs though, so I have found more GF options here than in Texas."}, {"username": "Kristen Paller", "comment_text": "I don't know that I would risk being sick while on a trip like this. Totally your choice, but it's definitely way easier to navigate ncgs and celiac there."}, {"username": "Alexis Albensi", "comment_text": "I am still eating fully gluten free when I travel there because I don’t want to risk feeling ill in Italy. There is a Gluten Free Italy page that I got a ton of recommendations\nfrom"}, {"username": "Iris Weber", "comment_text": "I saw a report a few days ago that wheat in Europe is „produced“ different than in US. Especially there are stricter regulations regarding pesticides which mostly are used in US before harvest. There are also „older“ types of wheat planted in Europe.That’s why there is still gluten in pasta etc but the consistence is different than in US. Pizza dough normally also rests at least one day before it is used which also helps. To be on the safe side ask for gluten free products which are widely offered in restaurants and supermarkets."}, {"username": "Andrea Marie", "comment_text": "If you have a legitimate gluten problem, you will need to eat gluten free in Italy. While Italy does grow a lot of wheat, and that wheat is a different variety than the wheat typically grown in the U.S…. Italy also imports a ton of wheat from the U.S. and other countries too."}, {"username": "Miyuki Kanno Paul", "comment_text": "Mention “Senza Glutine” when ordering and see what’s available to you. Many people who have trouble with gluten in the US (including dear friend of mine who grew up in Italia) say that they have no problems having pasta and bread while in Italia. If you are not Celiac, try it once and see if your body can tolerate. If you live in the US, Sunrise Flour Mill in MN has great flour that so many gluten sensitivities people rave about it. I do not have any gluten issues, but I enjoy their quality flour."}, {"username": "Bambi Harris", "comment_text": "I am gluten sensitive (and some fruit/dairy and a lot of other things haha). But vacation is not a great time to experiment with what 'might or might not' cause you a reaction. Every physical body is different. Yes they say italian food is less intense on the body, but there are so many gluten free options in italy you are better off not risking it. Being bloated and nauseous your whole trip is not worth the attempt.\nThere is a gluten free italy facebook page. Sensitive can accumulate to worse without proper maintenance, even nice italy food :-)"}, {"username": "Lauren Vassallo Beattie", "comment_text": "The wheat is different so it has less of the protein gluten. It doesn't contain hard chemicals either. With in doubt just ask for senza glutine."}, {"username": "Rhonda Smith", "comment_text": "I visited Italy this past May and am Gluten and dairy free. I asked each time before ordering….no problem…at times the chef came to speak to me …felt relieved…..I also did my own research ahead of time to know the restaurants that had options. Enjoy !"}, {"username": "Ingrid Zancoli", "comment_text": "Actually there are several choices here for a GF life, at restaurants you can ask about It and waiters can tell you what food is safe. If you Google AIC you can find the italian GF association with a lot of hints and where to find safe restaurants and shops. Anyway in general all the big supermarkets have plenty of GF products at good price and for other products it's written \"senza glutine\" on labels close to the ingredients list"}]}, {"id": "2208276772904734", "text": "I’m traveling with my family and 3/4 of us have medications which need to be refrigerated. Any suggestions on a cooler that is somewhat compact that keeps things cold for 12+ hours?", "link": "facebook.com/groups/1373361046396315/permalink/2208276772904734/", "likes": 0, "comments": [{"username": "Debbie DiOssi", "comment_text": "Try to stay in hotels with small refrigerators. Even if you bring a small cooler, ice is not always available."}, {"username": "Alan Dias", "comment_text": "I used a Yeti Rambler 30oz mug with some ice packs to travel (BOS - Rome with a layover) with my meds that needed to be refrigerated. Worked out well and was easy to pass through security checks with it"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/3OqWbSJ"}]}, {"id": "2208276682904743", "text": "Will be in Italy for Christmas what can I expect weather wise??", "link": "facebook.com/groups/1373361046396315/permalink/2208276682904743/", "likes": 30, "comments": [{"username": "Evie Gee", "comment_text": "My son was in Florence this past Christmas and it was mild. They didn't even need jackets."}, {"username": "Jeannie Morris Wierman", "comment_text": "Just google it a week before you go."}, {"username": "Eliz Fragoso", "comment_text": "Cold and possibly snow and nothing but beauty"}, {"username": "Steve Hinton", "comment_text": "🥶"}, {"username": "Bobbi Ann Martino", "comment_text": "How would Christmas in Tuscany be?"}, {"username": "Kai Wilhelm Tell", "comment_text": "Google is your friend."}, {"username": "Anita Lawrence Mundy", "comment_text": "Snow. Well it was when I was there in the November."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Winter"}, {"username": "Udo Stolarczuk", "comment_text": "Cold"}, {"username": "Stephen Clarke", "comment_text": "I’m heading to Malta for Christmas and Sicily for 2 weeks and new years"}, {"username": "Frank Hunt", "comment_text": "Very cool"}, {"username": "Rachel Milstein", "comment_text": "I was in Rome and Florence last December and it was in the 60s during the day but sunny so also felt warmer. We brought winter coats but barely wore them and wore jean jackets during the day. New Years Eve, I wore a light sweatshirt and was totally fine! I did bring my puffy winter coat to dinner one night but the weather was pretty mild!"}, {"username": "Billie Frances Swanda", "comment_text": "Cold"}, {"username": "Graham Sherlock", "comment_text": "Much better weather than July or August"}, {"username": "Miklos Verdes Kovacs", "comment_text": "Snow"}, {"username": "Brittny Lynn Selleck", "comment_text": "Cole Selleck"}, {"username": "Gordon Rose", "comment_text": "I wanted to go see the Dolomites but coming from Florida I know I’ll freeze"}, {"username": "Vickie Gush", "comment_text": "I'm doing the Best of Italy tour beginning of November . Hopefully it wont be freezing. Will they have there Christmas decorations out?"}, {"username": "Kelly Kester", "comment_text": "We had great weather in Italy for Christmas. Snowed in Venice but was beautiful and we wore our winter coats and boots. But all of the nativity and Christmas decorations were beautiful!"}, {"username": "Romana Lavrič", "comment_text": "I heard the weather will be. 🤪"}, {"username": "Douglas Martin", "comment_text": "Perfect less crowds average temp from 2-12c depends where. we go Boxing Day last year was so good Jen’s and jumper and jacket comfy and less expensive than peak enjoy love Italy"}, {"username": "Donnetta Coon Schaaf", "comment_text": "We’ve been there for Christmas twice now. We have been from as far north as Lake Como and only as far south as Pompeii. Both times the weather was brisk (but we are from Montana so it was delightful in comparison). It really probably depends on where you’re coming from. A light winter jacket was more than enough in the north and down south just a light fall jacket was sufficient for us. Christmas is such a magical time to be there though. Everything was far less crowded. Most things were open but not everything. However the best part was all the nativity scenes everywhere and the wonderful Christmas lights. We loved it!"}, {"username": "Dina Masey Laughlin", "comment_text": "We were in Italy last year 12/21-1-3. The weather was perfect, in the low 60s. We wore a sweater or light jacket. I think it was a gift of two weeks if unusually nice weather."}, {"username": "Helen Starkey", "comment_text": "We were in Bolzano for Christmas. Gorgeous days, blue skies, amazing Christmas markets. Certainly memorable."}, {"username": "Gina Schatz Chamberlain", "comment_text": "Arrived Jan.1 of 2020, great week to be there - decorations still up as it is epiphany week. Sales galore in stores as they do two major sales 2x a year and this is one of them. Stay in Rome or south of there and you should see highs during the day of 50s and 60s the further south you go."}, {"username": "Princess Queen", "comment_text": "Where?Milano Verona very cold,Firenze too,closer to French border Genova,San Remo warmer"}, {"username": "D'Anna Hohe", "comment_text": "Depends on where in Italy, but even if you choose one place, it still depends. Extremes are not likely! On Christmas Day in 2016, it was 72 degrees in Rome. The next year, it was twenty degrees colder. Check a weather app two weeks before you travel and pack accordingly."}, {"username": "Kejdi Okej", "comment_text": "Cold and icy"}, {"username": "Rossana Rotini", "comment_text": "What region are you staying in? Winters in Italy are very different depending on latitude, proximity to water or mountains :) let us know"}, {"username": "Amy Resnick Wolf", "comment_text": "I’ve done it twice. It is cool and can be cold (bring a scarf and gloves for sure) but can also be nice enough to not even need your coat. Layering is key. It’s not crowded and you’ll have an amazing time!!"}, {"username": "Fiona Mac", "comment_text": "Milan is beautiful at this time Christmas markets the tree in shopping centre swavorski crystal tree lights"}, {"username": "Cari Greco Auth", "comment_text": "Depends on what region. We were in Southern Italy last Christmas and it was warmer- in the 60s, however, Italians dress for the season and not the weather. I was wearing a a light sweater, but the locals were wearing puffer jackets with scarves. We usually go to the Veneto region during the holidays and I would say we see highs in the 50s, lows around 40 F."}, {"username": "Caroline Spence", "comment_text": "I spent my best Christmas in Lake Garda 2 years ago and was cold (-5C) like Scotland, but with blue skies, no snow… beautiful"}, {"username": "Kristina Ruk", "comment_text": "It depends where😉been in Rome, Florence ,Venice and Milan. Ones it was +2 Celsius, once it was +15C ;)"}, {"username": "Mellodee Davenport", "comment_text": "I have only been in Milan before Christmas and it snowed a little 2 days but I loved it living in Florida and the Christmas decorations were beautiful! Enjoy!"}, {"username": "Ken Vecchia", "comment_text": "Light during the day and dark at night. It gets dark late out there"}, {"username": "Carine Brys", "comment_text": "Maybe Google temp statistics for the region you are going to? I once visited Venice on Jan 1, and my feet froze!"}, {"username": "Janine Emma Lucas", "comment_text": "what region. Weather varies greatly north to south"}, {"username": "Lucrezia Ugolini", "comment_text": "It depends. Where I live it snows every year and the temperature might be quite freezing"}, {"username": "Edmond Nolan", "comment_text": "Wet"}, {"username": "Allan Olexa", "comment_text": "Where in Italy?"}, {"username": "Roberta Guidetti", "comment_text": "Allora, negli ultimi anni non fà tanto freddo. Direi che a meno 2/3 mi coprirei un po'."}, {"username": "Marcus Hiesler", "comment_text": "Cold and icy"}, {"username": "Sherri Leis Dillavou", "comment_text": "I was there this past Christmas and it was in the 50s and 60s"}, {"username": "Kerri Armitage", "comment_text": "We went to Venice mid December and didn't need coats, we wore jumpers"}, {"username": "Jessica Stewart", "comment_text": "Google says central Italy the highs in the upper 40’s to low 50’s lows in the upper 30’s to low 40’s for December"}, {"username": "Lynne Meyer", "comment_text": "Same climate at California: probably in 50’s"}, {"username": "Jacki Myers Leitch", "comment_text": "Great question! We will be in Verona, Venice, Florence in December as my daughter finishes her Study Abroad. I was wondering the same!"}, {"username": "Gianna Onesi", "comment_text": "Where in Italy what time frame? Google weather network and you will see!"}, {"username": "Kevin Andrews", "comment_text": "Italy is a big country. Where you are will impact winter weather significantly."}, {"username": "Jack Russo", "comment_text": "Tornados"}, {"username": "Antonio Aloè", "comment_text": "Do you know that Italy is more than 1.200 km long?"}, {"username": "Marco Brambilla", "comment_text": "In between -10 to 20 degrees"}, {"username": "Diana Sankara", "comment_text": "North or South? The Alps or the seaside? Sicily or Trentino? Florence or Turin?"}, {"username": "Corinne Cavallaro", "comment_text": "It’s best to check the weather on where you’re going a week prior. I was in Rome last Christmas and we had t-shirts during the day and sweatshirts at night. Go to the weather channel online and put in the info."}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "I was there and spent New Year’s. The weather was wonderful! It was about 60°F the entire time. I didn’t even need a thick coat. ￼"}, {"username": "Olga Olga", "comment_text": "We been in lake Como area begin of march and it is was really cold and in cinque Terry begin of April it’s also cold and rain"}, {"username": "Mark Spielman", "comment_text": "Italy is a big country, one must be more specific to a location, to receive a accurate response."}, {"username": "Carole Wortelmann", "comment_text": "U can google accuweather and guesstimate the weather and it depends what region as well. It will give you last years weather. Layer. Just layers and warm clothing. It’s December."}, {"username": "David Bach", "comment_text": "Cold (not freezing) and wet"}, {"username": "David Perillo", "comment_text": "Cold but awesome. Winter is a fun time to visit. Beautiful decorations. Few tourists. Great food. I did this with my daughter about 5 years ago. I was worried thinking am I making a mistake here? Couldn’t have been more wrong. Amazing 🤩"}]}, {"id": "2208274059571672", "text": "Hello! Trying to plan a last minute 25th wedding anniversary trip from US to Europe…. First half of September. Thinking Italy or Greece or maybe a combination of the two. We love food, wine and experiencing the culture/way of\nlife that these places have to offer.\nOpen to cruises as well as I think at this point in the game, it may be easier for planning purposes.\nDo any of you have recommendations on cruise lines, itineraries or other suggestions? I can’t seem to decide on what to do or where to go 🤪", "link": "facebook.com/groups/1373361046396315/permalink/2208274059571672/", "likes": 1, "comments": [{"username": "Kim Tisot Reinboth", "comment_text": "Norwegian has an Italy and Greece cruise but not sure of dates in the fall."}, {"username": "Debbie Milne Jenkins", "comment_text": "I did Norwegian with an itinerary with stops in those ports as well as others. My suggestion is that you Google last minute cruise deals and see what might be available for your dates. I love Windstar when I can catch a deal but I’ve traveled on Norwegian, Holland America and Crystal. They are all fine. It’s all about the itinerary for my husband and I and we’re good at finding work arounds for things that may not be optimal on one cruise line or another."}, {"username": "Miyuki Kanno Paul", "comment_text": "We only use ultra high end small ships like Silversea and Seabourn. Roma to Athens(or vise versa), 7 to 10 days. These ships can dock many ports where big ships cannot. It’s not cheap but you’ll only pay for super fancy wines and excursions. Everything else is included. We had a bottle of house champagne in our room every day.\n\nWe went back to Greece on our own as well. We flew into Athens from Roma,and took a high speed ferry along with Cyclades line. Mykonos(a day trip to Delos), Thira(Santorini\n), Naxos, and back to Athens. Then flew back to Roma, spent 4 nights and went home. If you visit Greece first, then you will be chronologically\naligned with history. You’ll recognize many Greek influences when visiting Italia. We did it the opposite direction that we were looking at sculptures and said “Didn’t we see this in Roma?” 😅"}, {"username": "Linda Mascaro", "comment_text": "Maybe do some research to make sure your destination and your wants/needs match up\nSome people like tours where everything is scheduled and planned\nOthers want more freedom and spontaneity\nI think preplanning and figuring all this out prior to booking is very important"}, {"username": "Tonsia Keytel", "comment_text": "Fly into Milan, go to Como or Garda, Cinque Terre. Can all be done by using the train. Have done a cruise before and just did a trip on our own around Northen Italy and so so much nicer!!"}, {"username": "Mandy Pusateri", "comment_text": "This September we are doing three days in Rome, two days in Venice and then a seven day Royal Caribbean cruise to the Greek Isles. I think it will be an amazing trip!"}]}, {"id": "2208273082905103", "text": "Hi,\n\nI am booking train tickets currently and I am struggling to figure out how to travel from Napoli Centrale to Pompei Scavi. I understand I have to take the circumvesuviana but I am not sure how to book the tickets. The idea of changing trains also worries me as we have a limited time frame to get from Napoli Centrale to our tour in Pompei. Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2208273082905103/", "likes": 0, "comments": [{"username": "Dann Hrusch", "comment_text": "I'm seeing direct lines that take around 35 mins with only a handful of stops. Google maps is a great place to find train info. After putting in your start an end point, change the icon from Car to Train in the top left."}, {"username": "Gena Kona-Mancini", "comment_text": "You don't have to book those in advance! They're commuter trains with no assigned seats and standing room available too so no sort of \"selling out\""}, {"username": "Gena Kona-Mancini", "comment_text": "The train runs about every 30 mins"}, {"username": "Bambi Harris", "comment_text": "you have to take it from naples garibaldi to pompei scavi along the sorrento line (we will be doing it next month) you can book campania express in advance along this route but you can not book circumvesuviana\nin advance"}, {"username": "Wahab Sidharta", "comment_text": "Join a day trip , getyourguide app"}]}, {"id": "2208270819571996", "text": "Looking for a good tour company for an April trip to Rome, amalfi cost and Sicily. We want a tour that offers some meals on your own and some time to explore on your own.", "link": "facebook.com/groups/1373361046396315/permalink/2208270819571996/", "likes": 0, "comments": []}, {"id": "2208270009572077", "text": "We want to take a 2 week trip in the summer to Italy either starting or finishing our trip in the Italian Rivieria. What is the best airline to fly into Rome or another large city? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2208270009572077/", "likes": 1, "comments": []}, {"id": "2208268399572238", "text": "Me and my family are coming to Italy for the first time from Japan at the end of the year and I have a few simple questions to start.\n\n1- do restaurants serve you water free of charge with your meal or do you have to purchase a bottle of water/bring your own water bottle?\n\n2- are meals more family style where you order a big plate of something andआणखी smaller dishes or more of individual servings?\n\n3- how’s the public toilets situation? Accessible? Clean? Do you have to pay? Go to a convenience store?\n\n4- are trash cans available or do we have to carry our trash of the day back to the hotel with us?\n\n5- any tips on specific Italian etiquette you would like to recommend?\n\nI know some people may find these questions weird but we just don’t want to go around embarrassing ourselves or offending locals.\n\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2208268399572238/", "likes": 49, "comments": [{"username": "Jeanne Eliason", "comment_text": "Bring your own toilet paper or kleenex just to be sure. Don't bring a water bottle to a restaurant as that would be considered not appropriate. Water is sold as either still or fizzy. I think you will find public bathrooms to be not as clean as on Japan. Some are very clean, others not so much. In Orvieto the public bathrooms are of the later, often with no running water to wash hands. However these were free. Water is a scarce commodity in hill towns."}, {"username": "Nina Truong", "comment_text": "F.\n\nI read in another post to pack the ends of your toilet paper rolls. I'm bringing that, as well as disposable toilet seat covers (sometimes no toilet seats), and individual packeted wipes to cleanse hands. I'm basically packing a public restroom kit concealed in its own belt bag that can be worn crossbody style across the chest area. Would help to put in euro coins/small bills as public restrooms may charge to use."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Restaurants offer individual servings but you are free to share."}, {"username": "Delia Miscella Wroblewski", "comment_text": "In restaurants, they will ask if you want Naturale or Frizzante and they will bring you a bottle for which you will have to pay. Meals are not family style. Most menus have appetizers, primi which are usuallly pasta dishes and secondi of either fish or meat. There will also be sides like salad. You can order whatever you want and you do not have to order one of each. Usually, they will bri g bread to the table, but never butter. Depending on where you are, it’s not always easy to find toilets. I stop at bars, order something small (water, coke), take the opportunity to people watch and rest and use their bathrooms. I was lucky in always finding clean toilets and toilet paper. There are trash cans on the streets. Etiquette is the same all over-friendly and respectful."}, {"username": "Rebecca Yeoh", "comment_text": "Meals were individual servings, pay for water although sometimes it is complimentary. Toilets were fine, you will have to pay 1€ unless at a restaurant (you can use tap/ credit card for the toilet). Trash cans are available. Around Rome they had free water fountains in the streets called Nasoni. They are great, definitely utilise them. The water is pure fresh spring water and cold. Don’t order a cappuccino after midday. When crossing the road at a zebra crossing the only way you will get across the road is to dominate so the cars stop or go around you. Just watch a local do it the first time and you’ll get the hang of it. Try to order off the menu and don’t make variations. If they get your order wrong just go with it. You will be given bread with every meal, usually in a paper bag, even if you don’t want it, it will stay on your table for the duration of your stay. Enjoy! Italy is an amazing place to visit."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "There is a charge for water\n\nIndividual meals, but we ordered a few and shared so we can taste more than one thing\n\nWe didn’t have any issue with toilets and did not need our own toilet paper. There were a few places we needed to pay 1 euro to use the toilet.\n\nWe didnt carry trash around. I was able to find trash cans\n\nGrazie = thank you; Per Favore = please; Il Conto perfavore = check please."}, {"username": "Julie Koziol", "comment_text": "I would suggest bringing your own toilet paper or a pack of single ply tissues. Someone posted to bring you'll pay a small fee (usually €0.50 to €1.00) by inserting Euro coins into a machine or paying an attendant. I did not have this experience. However, I’m bringing euro coins just in case!"}, {"username": "Jenny Payne", "comment_text": "Don’t flush toilet paper down the toilets in Florence,u will see a bin next to the toilet ,it is all to do with the sewer system from how it was build many years ago. Look up City of Florence tells you all about what not to do 🌻"}, {"username": "Miyuki Kanno Paul", "comment_text": "1. You purchase water either still or fizzy. It is customary to purchase water at a restaurant. Please do not bring your own.\n2. You can share a dish with another person, or ask them half portion.\n3. Carry some coins(50c, 1 Euro) with you. Even some restaurants employ toilet attendant and you must pay for the use. In a pinch, go to a bar and buy a water bottle or order coffee, then use the facility. You may want to carry tissue packets just like you always do in Japan.\n4. There are trash cans specifically for items such as recyclable, general, etc.\n5. No cappuccino after 11 am. Cover your shoulders and knees when visiting religious institutions.\nDon’t wear baseball caps or American sports gears. Avoid white sneakers if possible. You WILL stand out as a tourist.\nNo doggy bag. Either eat it or leave it just like in Japan.\nMake a reservation for lunch/dinner. People usually dine 8 pm or later.\nLearn “please” and “thank you” in Italian at least.\nAt a bar or café, if you sit down at a table, the price of your coffee goes up. Stand at the counter and drink it if you don’t want to pay extra.\n\nI highly recommended Rick Steves Italy guidebook. It’s your survival guide for pretty much everything for first timer like you"}, {"username": "Denise Ward", "comment_text": "I have not been to Italy yet, but recently went to Paris and we found it to convenient for us to stop in a restaurant for water and a small snack to share and fuel our bodies for more walking so we had access to their toliet. It worked for us since we were walking so much and didn't like to carry water bottles with us. Also we were able to taste more foods this way. There were 3 of us and we never ordered more than 2 plates of food and shared."}, {"username": "Jerry Kiger", "comment_text": "Prior postings said the app “flush” or something like that will show public bathrooms, is my understanding"}, {"username": "Diana Sankara", "comment_text": "You have to pay for your bottle of water, do not bring your own. Individual servings including pizza (one pizza each). If you want to share just tell the waiter to bring an extra empty dish. You generally have to pay for public toilets. Trashcans are normally available. Additional advice: do not tip unless you received exceptional service; when you do it's cash only to the waiter or left on the table so he'll find it when he clears your dishes. Avoid baseball caps. Don't ask to pay in USD. Don't say you're Italian. Don't ask for cappuccino with your meal or right after it. Anywhere. Ever. Finally, attempt to speak a few simple Italian words, they'll appreciate your effort."}, {"username": "Jill Medrano Casey", "comment_text": "We brought our own toilet paper but never needed it. We always made sure to use the bathrooms wherever we were and only had to pay twice on our two week trip, one was 1 euro, the other was .5 euro. Water is not included and is about 3 euros to purchase a liter. There are trash cans available. Crossing the street can be tricky - watch out for Vespas and bicyclists - and then go for it and don't stop."}, {"username": "Judy Galloway", "comment_text": "Search posts too"}, {"username": "Rhona OConnor", "comment_text": "🔹Toilet - Use ones in bars or restaurants. They are clean and have all the facility you need. Just order something.\n🔹Water - if you order bottled water you pay for it. Free tap water is available.\n🔹Meals - you order individual portions but you can share. We usually have 1 Starter, 2 Mains, 1 Dessert\n🔹Rubbish - there are lots of bins.\n🔹Italian etiquette - Learn how to say Hello, thank you and a few other words. You get a much better response if you make a little effort.\n🔹Clothing - someone said don't wear white runners - 90% of people wear runners. Forget trying to blend in. None of us are Italians and they know that!\nEnjoy your trip! 😁"}, {"username": "Ida Sfo", "comment_text": "When someone addresses you entering a store/\nrestaurant, you should respond with the greeting they have chosen. If they say \"Buongiorno,\" respond similarly, and if they say \"Ciao,\" do the same. I use \"Salve\" if the person is older or it's in a formal setting."}, {"username": "Cris Wimer", "comment_text": "Watch Rick Steves utubes on Italy travel. His books are a wealth of information as well. I used the Italy, Rome, and Florence & Tuscany books nonstop on our trip. Tore out sections for the area we were in for the day."}, {"username": "Alison Kanak Mazoch", "comment_text": "f"}, {"username": "Lori Wroblewski", "comment_text": "Not sure who said you don’t drink cappuccino after 11 bc everywhere I went offered it directly after the meal."}, {"username": "Yuko Y Smith", "comment_text": "1.you have to purchase water. Never free water like japan.\n\n2. individuals but you may shere.\n\n3. some toilet doesn't have seat! free at restaurant, cafe and hotel. other place they charge."}, {"username": "Margie Franzen Springelmeyer", "comment_text": "Why no baseball caps? 🤷‍♀️"}, {"username": "Graham Sherlock", "comment_text": "Just order one bottle of water often they are large and there is no point ordering much more than you can drink."}, {"username": "Tara Avery", "comment_text": "Tap water is free at restaurants. Bottled/\nsparkling is not free.\n\nYou can drink coffee/\ncappuccino throughout the day. It’s that Italians do not drink coffee with a meal other than breakfast. Some Americans, for example, will order coffee drinks with lunch or dinner, which is not something a local would do. They might wait for after the meal or drink in between meals. So, need a pick me up? That’s fine!\n\nI’ve dined at restaurants where the salad is served family style but the main course is not."}, {"username": "Jeannie Shaffer", "comment_text": "Why does Italy have no toilet seats and toilet paper? Is there a reason?"}, {"username": "Ally Dickerson", "comment_text": "You can bring your own water or purchase a bottle at the restaurant if you have a water bottle refill it every time you see a fountain, stay hydrated and don’t buy more rubbish then necessary ☀️, don’t be shocked if it slightly more expensive then the house wine.\nYou won’t really see any Italians sharing there food haha but you can get some sides to pass around or antipasto. Toilets aren’t necessarily clean, I rarely pay for the toilet, I try to go whenever I’m at an attraction or i duck into a bar to get a coffee or some water\nThere are bins around but be cautious about which bins you use. Don’t use a bin outside somebody’s house because they can get a fine. And if there is an option make sure you separate, plastic/\ncardboards/\nindifference/\nglass. Plastica/carta/\nindifferenziato/\nvetro\nPlease don’t make this country dirtier❤️ you can look at the back of packaging to see how to dispose of it\nLucky you will be here in winter so you will already be trying to cover up when you visit spiritual places.\n\nJust take your time! Don’t rush and soak as much culture in as possible, be safe, be yourself because nobody cares that your a tourist☀️"}, {"username": "Diane King", "comment_text": "Just be yourself and wear what is comfortable…….y\nou are on holiday. Go with the flow!"}, {"username": "Paola Coppi", "comment_text": "I love these questione, I am Italian so I'll try to answer:\n1- at the restaurant you have to purchase water bottles (1 litro -big- / mezzo litro- small). In a bar or cafeteria you can drink from your own bottle of water but order something else in the meantime. In the southern Italy they will provide you with a free glass of water in bars and cafeteria.\n2-in Italy people order one big individual dish and then, if they want, they let the other people taste a bite from their plate. Is some Pizzerias they do \"Giropizza\" and the pizzaiolo decides which pizzas to make and you receive several different slices of pizza, but in Naples for example there are only two traditional pizza tastes, Margherita and Marinara so better stick to these two kinds that are amazing. It is true that you can share the same dish with another person but it is considered rude to do this for more that one serving (we tend to divide dinner in Antipasto, Primo, Secondo and Dolce even if one can order just a Primo or a Secondo or just an Antipasto and a Dolce).\n3- public toilets in big cities are usually quite clean. In little towns better go in a cafeteria, drink a coffee or a juice and go at theirs. In supermarkets and shops there are almost never toilets (I remember them only in huge malls and at Aldi's and Lidl's).\n4-trash cans everywhere\n5- when you enter a place say out loud : Buongiorno/ Sera or Salve even in a Shop, museum hall, restaurant or bar, you can wave in English too; in summer we tend to drink iced drinks ( I know in China for example people prefer hot water) so asking for hot drinks would be perceived as uncommon but bartenders will do it as soon as they are sure of having understood well the order; in Italian cities near city centers there are plenty of bars and restaurants for tourists, so if you want to try authentic Florence/Rome/\nMilan /Venice food you'd better ask locals or move out from the center.\nWe eat, in the north, at noon for lunch and at 7/7,30 for dinner; in the south between 1 p.m/3 p.m for lunch and between 8,30 p.m and 11 p.m for dinner. German tourists that go on holiday where I live (Lake Maggiore, Piedmont) eat at 6 p.m, restaurants now known it and accept it. We don't like american style but I don't agree with somebody here that suggested you not to wear caps or socks and sandals. Do as you want, but of course Italians understand you are a tourist so maybe they will offer you to buy food or drink or supplies you don't need... Anyway these are just suggestions, we are very welcoming as people. We like helping everybody in need even just using gestures* if we don't speak the language. * we move a lot when we speak but it is complicated to explain"}, {"username": "Annelie Scheire-Cabello", "comment_text": "My plan is to buy a waist belt to hold my valuables (pick pocket I read are a real threat) and a small water bottle you can refill at public drinking fountains. There's even a map that locates them all! Bottled water is expensive so when I'm walking around I'm just going to use my own refillable one. We are going in September and I'm following the threads as well for advice 😀\nI'm still going to wear a small backpack but only for things of little value such as rain jacket or light sweater etc"}, {"username": "Miyuki Kanno Paul", "comment_text": "I am just suggesting/\nsharing what I’ve observed and learned by visiting Italia countless times. Since the author wanted recommendations\n, I simply answered and shared.\n\nYou can argue and debate whatever you want.\nI’m not your mother. You are an adult. Do what you want to wear. Use your own discretion😘\nHappy Traveling!!"}, {"username": "Christie Lisk Rogers", "comment_text": "It Italy now and I can’t tell tourists apart from locals. In the beach areas there are people in bathing suits and coverups and sandals…and tennis shoes. In the cities tennis shoes and sandals, shorts, dresses and slacks. We need to worry less about what we have on more about being kind and respectful. We haven’t paid to use a restroom and found little trouble communicating. We didn’t carry bathroom “stuff” ￼. We have ridden buses and ferries, cabs and cars and trains. We have been aware but never concerned and we have walked miles."}, {"username": "Terry LeBlanc", "comment_text": "There was a charge for water as it comes in a bottle.\nMeals were not family style and you order in segments (appetizers, salad, main course, etc.)\nRestrooms in public areas did charge but in restaurants were free. We never encountered a problem with cleanliness.\nThere are garbage pails available.\n\nHope this helps!"}, {"username": "Cristina Guerrero Rodríguez", "comment_text": "The toilets in public places aren’t as clean as we would like, but adapting is the key. I almost always found toilet paper, except for twice when I had to use some Kleenex I kept in my purse"}]}, {"id": "2208237909575287", "text": "Traveling to Italy late September. Would like recommendations\nfor a golf cart tour in Rome", "link": "facebook.com/groups/1373361046396315/permalink/2208237909575287/", "likes": 7, "comments": [{"username": "Diane Hamilton", "comment_text": "Same here. Although we’re going in mid- November 🇮🇹\nRome first 3 days, Florence 2days Venice 2days"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nBest-of-Rome-by-\nGolfcart-privat\ne-tour/\nd511-23570P17?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Gail Lafferty", "comment_text": "Rolling Rome was very good. Guide very friendly, knowledgeable, flexible! We were a group of 2kids, 2 parents, 2 grandparents. Perfect for an overview, hop on hop off at highlights."}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Please do a search of the group. This question is asked almost daily."}, {"username": "Anna Rinskaya", "comment_text": "We are going October 1st and I came across that a lot was booked in the days I needed. Rolling Rome was booked on my days so I booked last night with Turtle Golf cart tour"}, {"username": "Jennifer Smith", "comment_text": "I did a food and golf cart tour for 4 hours through Viator."}, {"username": "Tracey Purdy", "comment_text": "Liv tours organised a pub crawl sight seeing one for us"}, {"username": "Tony Buccheri", "comment_text": "Do not use Angel Tours. They canceled on us the night before, then said it was an error and we could rebook but it had to be at a higher rate. This happened to us twice in Rome (the other was a night time Vespa tour; \"equipment problem\") so have a back up plan ready..."}, {"username": "Rhonda Tawney Kline", "comment_text": "We did a 3 hour tour with My Best Tour. Loved it!"}, {"username": "Dave Colleen", "comment_text": "Jason with www.bigatours.c\nom is fantastic. Very knowlegdeable, great energy, and his crew is amazing too!"}, {"username": "Meg Johnson Ignacio", "comment_text": "We used Turtle Tour for a 3 hour golf cart tour the first day on Rome. It was awesome!"}]}, {"id": "2208258399573238", "text": "Buongiorno Monterosso! #reels #reelsinstagram #instagram #trending #viral #explore #love #instagood #explorepage #reelitfeelit #follow #photography #fyp #reel #instadaily #reelsvideo #like #आणखीmemes #foryou #music #facebookreels #facebook #facebookviral #reelsviral #reelsviralvideo #reelstrending #trendingnow #reelstrendingvideo #facebookpost #riomaggiore #monterossoalmare #manarola #corniglia #vernazza #cinqueterre #laspezia #reels2023 #ristoranteilgabbiano #paanokumitasafacebookreels #facebookreelssahod #facebookreelsearnings #metaverified #metaverifiedaccount #facebookreelsmonitization #facebookreel #fbreels #facebookreelssettings #facebookreelsincome #facebookreelsplaybonusprogram #facebookreelsvideo #facebookreelseligibility #facebookreelsviral #facebookreelspayout #facebookverified #bonassola #levanto #adsonreelsfacebook #adsonfacebookreels #adsonreelsmonetization #monterossobeach #monterosso", "link": "facebook.com/groups/1373361046396315/permalink/2208258399573238/", "likes": 0, "comments": []}, {"id": "2208252306240514", "text": "Trying to figure out is the bus shuttle taking us to train station?", "link": "facebook.com/groups/1373361046396315/permalink/2208252306240514/", "likes": 0, "comments": [{"username": "Louis Des Forges", "comment_text": "No its just the regional train."}]}, {"id": "2208249396240805", "text": "What is the best way to book a ferry from Naples to Capri? Should I pre-book? If so, what is the best company to book direct? I see Rom2rio has options to book a ticket but I prefer to book direct if possible.\n\nAlso, getting from the train station in Naples to the ferry port? Is it walkable? Google maps feels misleading on this one :) thanks all!", "link": "facebook.com/groups/1373361046396315/permalink/2208249396240805/", "likes": 0, "comments": [{"username": "Carolyn Chambers Rosamilia", "comment_text": "Wait until the day of. You never know what the weather or the conditions of the sea will be. It is not walkable from the train station to the port. You will need to take a taxi or bus."}]}, {"id": "2208248442907567", "text": "Looking for recommendations on which best Hop On Hop Off Bus company to go with in Rome. So many choices & if operate after 5pm using your day ticket. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2208248442907567/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nBig-Bus-Rome-Hop\n-on-Hop-off-Tou\nr/\nd511-39333ROMEHO\nHO?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}]}, {"id": "2208236842908727", "text": "Looking for a cooking class while we are in Florence, please share your recommendations. Also, if you have a favorite tour guide would love to have that info too!", "link": "facebook.com/groups/1373361046396315/permalink/2208236842908727/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nSmall-Group-Ital\nian-Cooking-Cla\nss-in-Florence/\nd519-5049COOKING\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}]}, {"id": "2208233626242382", "text": "I am planning a week long trip for May of 2024 and need help deciding which cities to visit. We would like to fly into Rome and stay there for the first few days then we are trying to decide if we just go to a the Amalfi coast/Capri or to Cinque Terre or both. I am trying to limit the amount of travel days and feel like three cities in a week might be too much. Any suggestions??", "link": "facebook.com/groups/1373361046396315/permalink/2208233626242382/", "likes": 9, "comments": [{"username": "Shelly Kentner Lehman", "comment_text": "Can’t do both not enough time. I loved Sorrento and Capri took a ferry there and spent one whole day there. Sorrento was a fun night life walking through the store’s restaurants and eating gelato, we had fun with the people."}, {"username": "Barbara Bastianini", "comment_text": "In my opinion with only a week, trying to fit both the Amalfi and the CT into just one week with Rome would be way too much. The Amalfi and the CT are in opposite directions from Rome so the transiting time would just take up too many of your limited hours. Plus, they’re similar and you’d kind of get the same seaside cliff town experience in both anyway, so making the effort to get to the two areas wouldn’t really provide you with with something different than going to one would.\n\nIt’s all personal preference but I’d pick the Amalfi."}, {"username": "Eugene Klein", "comment_text": "I agree that one week does not give much flexibility so the most you can realistically do is to split Rome 4 days and Florence 2-3 days"}, {"username": "Lucrezia Folger", "comment_text": "Rome is the most glorious city ever, 4 days, Amalfi Coast 3 days. You're young you'll be back, 7 days is a drop in the bucket."}, {"username": "Bill Dest", "comment_text": "Read Rick Steve’s books on visiting the 2 areas.Rome and the Amalfi coast should be 2-3 days to see it all."}, {"username": "Miyuki Kanno Paul", "comment_text": "If it’s only for a week, it’s too tight to do both coastal destinations. You may want to save one of them for the next visit"}, {"username": "Laura Uribe", "comment_text": "Rome and Cinque Terre. There are 5 towns plus La Spezia to explore!!"}, {"username": "Susan Orr", "comment_text": "We arrive mid day and have 4.5 days rome and then a half day travel to florence and then 3.5 days in florence. Total trip 10 days. Dont want to spread ourselves too thin."}, {"username": "Mary Brandon", "comment_text": "Rome - 3 days max. Train to Naples -go to Pompei￼ - go to Amalfi Coast (stay in Amalfi) and day trip to Positano and Capri. Personally, I wouldn’t do a trip shorter than 10-12 days. (If you count arrival & departure, you only get 10 full days. ) a week gives you only 5 full days.)\nIf you do 13-14, you could fly up to Florence (beautiful!) and fly out of there.\n👎try Not to connect in Paris, as that connection can take about 2 hours - you don’t want to miss your flight home.)\nTry to get a direct flight home from Italy!"}, {"username": "Maureen Rebello Hagerty", "comment_text": "Only a week including travel? I’d spend it all in Rome"}, {"username": "Rose Anderson", "comment_text": "You are wise to limit the number of places- you can’t see it all at once no matter how you do it - we have been to both CT and Amalfi and my fav is CT but Amalfi is like Rome- you have to see it at least once- since you will be in Rome, and your time is short- I would limit your travel days and do Amalfi this trip and save CT for next trip. From Amalfi you can see Positano - Capri and Sorrento as well as Pompei. We were told that hiking pompei is another fun thing to do in addition to touring the archeology."}, {"username": "Maria Delaney", "comment_text": "I would suggest the Amalie coast. I recommend you take a tour with Taxi Mister Cab Driver-Naples & Amalfi coast-"}, {"username": "Rose Turdo", "comment_text": "Land in Milan .. Leave from Rome"}, {"username": "Nancy Matheny", "comment_text": "I am not sure where you are traveling from and if you are including travel days as part of the 7? If you can increase by a day or two it would not be so rushed. We are going in October to 3 locations, 3 nights in each and 2 travel days back and forth to US."}, {"username": "Elizabeth Lupo DiVito", "comment_text": "I agree three cities in a week is way to much. You'll lose too much time to transferring towns."}, {"username": "Katie Marie", "comment_text": "I stayed in Rome 2 nights and that was more than enough. Agree with people saying 10-12 day trips. I just finished Florence for 4 nights and didn’t want to leave. I had JUST started to feel like I understood / was connecting with the place and meeting people.\n\nI was super tired the first 2-3 days of my trip and only got half days out of it so be prepared for that….\n\nHeaded to the amalfi coast now after being here a week. I wouldn’t have been anywhere shorter and I’m only going to stay in one town for 3 nights (still don’t think that’s enough, but oh well)\n\nProbably do amalfi coast! I heard there isn’t too much to do in CT."}, {"username": "Suzie LG", "comment_text": "I would go to Rome and then to the spectacular Amalfi Coast! Cinque Terre is pretty but Amalfi Coast is unforgettable!"}, {"username": "Dina Garrett", "comment_text": "We are going to fly into Milan (it was cheaper than Rome) going to Venice, Tuscany with day trips to Cinque Terre then down to Amalfi Coast and Fly out of Rome to Santorini Greece."}, {"username": "Pamela Dorigo", "comment_text": "Hi, I think you should choose between Amalfi coast or Cinque Terre, both you cannot do it in a week. you can stay in Rome and stay one night maybe in amalfi coast and then Florence is a good choice, not too far by train from Rome and very beautiful."}, {"username": "Elizabeth Erickson", "comment_text": "What’s really clear from these posts is that some people think breezing in to an incredible city that has existed for more than 2,000 years and snapping a few photos is “visiting that city.” You don’t have time to just sit back and enjoy really getting a feel of the city when you spend 1.5 days in Rome. Maybe it doesn’t matter that much to you. It’s a wonderful feeling to know a city well enough to easily navigate the public transportation system or find a favorite place. It’s kind of sad when I see people doing 4 cities in 7 days. I applaud this traveler for reaching out and getting some advice. Rome plus Sorrento with day trips to Pompeii and Capri is possible but don’t cut Rome short. It’s amazing."}, {"username": "Sonia Starinieri", "comment_text": "I would say you can't do both in a week. But both are beautiful in their own way. Either do Rome and head south to Amalfi coast or go to the north and you may be able to stop in Tuscany, Siena or Florence on your way to la Spezia and Cinque Terre."}, {"username": "Nick Erickson", "comment_text": "I recommend finding a fazoli’s or Olive Garden, great food."}]}, {"id": "2208233459575732", "text": "Trying to book a train from Milano Central to Bologna about 12 noon, after transferring from Como. However all fast train at that time say following day. Am I\nreading it wrong, doing something wrong or is there a problem on the 11th. Thank u for any help. When I planned the trip this was an easy train trip of 1 hr.", "link": "facebook.com/groups/1373361046396315/permalink/2208233459575732/", "likes": 0, "comments": [{"username": "Brenno Bianchi", "comment_text": "I think is just a problem with the geolocalization\nof your app"}, {"username": "Grace Scinto", "comment_text": "What day are you travelling? It’s Ferragosto in Italy so the train could be booked out?"}, {"username": "Federico Permutti", "comment_text": "Are you in the US? If so, it’s probably a time zone-related glitch. Try to adjust the time in your search, perhaps even to the day before you want to travel, and then just scroll through the options to your preferred date and time.\n\nAssuming you mean August 11th, there are plenty of available trains between Milan and Bologna, both on Trenitalia/\nFrecciarossa and on Italo."}]}, {"id": "2208228422909569", "text": "We are heading to Italy in September/October. We have planned our own itinerary but are looking at doing some day trip using tour groups. Has anyone used airbnb for their tours? How do they compare with Get your Guide or Viator?\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2208228422909569/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look at viator https://\nwww.viator.com/\nItaly/\nd57?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}, {"username": "Gena Diaco Penland", "comment_text": "We used Viator for 9 different tours and they were all great! No issues at all."}]}, {"id": "2208171842915227", "text": "Visiting Italy for a 12 nights and wanted to take a day trip to Lake Como, Verenna, from Milan. Do you happen to know some low-key must dos? It looks like the Villa's are amazing to tour, but wonder if you had any advice.\n\nI am not in the market for a 1200-2000 dollar private tour, but wanted to make the best of it :)", "link": "facebook.com/groups/1373361046396315/permalink/2208171842915227/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "have a look ere. https://\nwww.viator.com/\ntours/Lake-Como/\nLake-Como-Day-Tr\nip-from-Milan/\nd26113-2872ZV07?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Greg Saba", "comment_text": "Pick a good weather day. We stayed a few nights in Varenna. Took a ferry over to Bellagio. Went to a wonderful deli with piles of fresh rolls in the window. They made sandwiches, and we walked to beautiful Villa Melzi and had our pick of quiet spectacular spots for a nice picnic. Then, take ferry across to Lenno and hike to Villa del Balbianello (you may have seen it in films like James Bond). Return to ferry to Como, past George Clooney's home. Have a gelato in Como. Return to Varenna for a nice early dinner. And then back to Milan if you have to. Of course, you have to look at schedules to make it work well. I would prefer to spend a night in Varenna or Bellagio. Include a visit to Menaggio if you get a chance."}]}, {"id": "2208187422913669", "text": "Planning budgets for lunches and diners for family of 4. Light lunches and casual diners any suggestions how much to plan… thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208187422913669/", "likes": 3, "comments": [{"username": "Jeanne Eliason", "comment_text": "Where will you be in Italy?"}, {"username": "Lauren Neely", "comment_text": "we budgeted $150 for dinners and $100 for lunches for a family of four. After two weeks we definitely came in under budget but I prefer to have the freedom to enjoy while traveling and the possibility of coming home with cash afterwards!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Shop at a supermarket and have light meal in your place of lodging. We do it whenever we don’t feel like dining out, so we do picknicing in our room"}, {"username": "Ibbu Mohd", "comment_text": "Avg 100euros per family meal"}, {"username": "Angela Marsala-Gaydos", "comment_text": "Get bread, mozzarella, prosciutto, tomatoes and have a great lunch"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "50€ per day per person excluding wine/alcohol."}, {"username": "Karen Schmidt", "comment_text": "Pizza by the slice places all over the place. Best one was a focaccia based one in Venice…so amazing!! Panini shops available everywhere too. Gelato super yummy and not expensive. We generally had breakfast at the hotel/Airbnb, lunch as above and then dinner out. Every few days we “made” dinner. Either pasta/sauce/\ncheese or a charcuterie plate put together from the supermarket. I would say we did 50 euros per person per day max as an average including a nice glass of wine for the adults and water for the table"}, {"username": "Norma McElroy Frisina", "comment_text": "The pizza by the slice shops have the best pizza IMO. Also when in Florence there’s this famous sandwich shop that’s amazing!!!’ I believe they even gave two locations . You’ll have to ask locals because I can’t remember the street name but here’s a picture of their shop"}, {"username": "Katrien- Fien De Cock", "comment_text": "dinner 160/190€"}, {"username": "Rosalia Nastasi", "comment_text": "We were just there with a family of four, I'd say $50 euro lunch (think panini and a drink) and $70 to $100 euro dinner (pizza or pasta and drinks)."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208205659578512", "text": "Those who have taken a golf cart tour in Rome, do you prefer it at night or during the day? We'll be in Rome the first week of January. Also, which tour company did you favor for your excursion? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2208205659578512/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "in january it's better during the day https://\nwww.viator.com/\ntours/Rome/\nRome-by-Golf-Car\nt-Private-Tour/\nd511-7377P1?pid=\nP00070587&mcid=\n42383&medium=li\nnk&medium_versi\non=selector"}]}, {"id": "2208190512913360", "text": "Flying into Rome in June for a few days before a cruise, any suggestions on places to stay in Rome and suggestions on excursions while we are there?", "link": "facebook.com/groups/1373361046396315/permalink/2208190512913360/", "likes": 0, "comments": [{"username": "Greg Saba", "comment_text": "Have you been to Rome before? You can do it yourself. Colosseum, Trevi Fountain, Pantheon, St. Peters and Vatican Museum, Roman Forum and Palatine, Piazza Navona, Castel Sant’Angelo, Villa Borghese, Trastevere, Spanish Steps, Vittorio Emanuele Monument, Piazza del Popolo, Palazzo Colonna, and the many spectacular churches and cathedrals to name a few. Very walkable city, and it's easy to walk 10 miles without even noticing. We like Trastevere area for staying, but we also recently discovered an area just outside Vatican walls, Borgo Pio that we also liked. Closer to the center and the prices go up."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d3964\n772-Reviews-Rom\ne_Times_Hotel-R\nome_Lazio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nBest-of-Rome-by-\nGolfcart-privat\ne-tour/\nd511-23570P17?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2208180456247699", "text": "Can anyone recomend a Vespa for Amalfi coast", "link": "facebook.com/groups/1373361046396315/permalink/2208180456247699/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Amalfi/\nFull-day-tour-wi\nth-a-Granturism\no-Vespa-between\n-Amalfi-and-Sor\nrento/\nd33601-347961P1?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nOne-Day-Scooter-\nRental-to-Visit\n-Sorrento-Amalf\ni-Coast-and-Pos\nitano/\nd947-357417P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2208179506247794", "text": "Can anyone recommend a driver service to collect from naples airport and to Naples hotel on day of arrival", "link": "facebook.com/groups/1373361046396315/permalink/2208179506247794/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nNaples-Airport-N\nAP-to-Naples-ho\ntels-Arrival-Pr\nivate-Transfer/\nd508-128285P2992\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}]}, {"id": "2208163076249437", "text": "in the middle of September we arrive in Pisa, where is it advantageous to rent a car for 5 days, 2 people? possible prices, please", "link": "facebook.com/groups/1373361046396315/permalink/2208163076249437/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look at the airport https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "consider sicilybycar or hertz"}]}, {"id": "2208162036249541", "text": "Looking for recommendations for a driving service for 6 people from Milan airport to Lake Como.", "link": "facebook.com/groups/1373361046396315/permalink/2208162036249541/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Milan/\nMilan-Airport-Tr\nansfers-Milan-L\ninate-Airport-L\nIN-to-Milan-Cit\ny-in-Business-C\nar/\nd512-85439P315?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Kerry McMillen", "comment_text": "Cost us 90 eu just to get a taxi from Lecco to Varrena"}]}, {"id": "2208141059584972", "text": "Hello travelers my family of 6 will be traveling to Rome 3days, florence 3 days and Venice 2 days. We want to see Pompei on tour. Any suggestions would be appreciated as far transportation and tours and is one day enough to go and return to Rome. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208141059584972/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "have a look here https://\nwww.viator.com/\ntours/Rome/\nPompeii-Ruins-da\ny-trip-from-Rom\ne/\nd511-5034P49?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}]}, {"id": "2208644726201272", "text": "Join us on this exclusive experience! Stay comfortably seated on your sofa and embark on a journey into the heart of Naples, one of the world’s most vibrant cities and marvel at the splendours of the Royalआणखी Palace of Caserta!\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/naples-royal-palace-caserta/\n\n#italyiloveyou #art #italytravel #italytrip #italygram #history #virtualworld #VirtualTour #vacationmood #naples #naplesitaly #naplesinsider #caserta #casertaitaly #casertapalace #amalfi #amalficoast #amalficoastitaly #napoli #royalpalaceofcaserta #royalpalace #royalpalace", "link": "facebook.com/groups/1373361046396315/permalink/2208644726201272/", "likes": 8, "comments": []}, {"id": "2185211271877951", "text": "Incredible experience in a cave! Matera 😍\nThe idea of staying in minimalist stone cave rooms with antique furnishings lit only by candlelight is certainly not for everyone, but somehow Sextantio makes it… आणखी luxurious, comfortable, and relaxing 🥰 pure magic! The combination of cave living from a time past combined with a 5-star hotel experience make this place absolutely worth a stay!\nDiscover more: https://www.anrdoezrs.net/click-100692842-12291623?url=https%3A%2F%2Fwww.tripadvisor.it%2FHotel_Review-g187772-d1234089-Reviews-or10-Sextantio_Le_Grotte_della_Civita-Matera_Province_of_Matera_Basilicata.html%23REVIEWS", "link": "facebook.com/groups/1373361046396315/permalink/2185211271877951/", "likes": 35, "comments": [{"username": "Joyce Cornelius Herbert", "comment_text": "Where did you stay?"}, {"username": "Lauren Dawson", "comment_text": "Martin Dawson 🥰"}]}, {"id": "2208378956227849", "text": "Italia Castelli Gandolfo", "link": "facebook.com/groups/1373361046396315/permalink/2208378956227849/", "likes": 27, "comments": [{"username": "Donna Gulla Rosenberg", "comment_text": "Gorgeous photos! Bellissima!🇮🇹❤️🥂"}, {"username": "Helen Stokes", "comment_text": "Gorgeous ❤️❤️"}]}, {"id": "2208406649558413", "text": "The crowds at the Trevi 5:55am today (12 minutes ago)", "link": "facebook.com/groups/1373361046396315/permalink/2208406649558413/", "likes": 856, "comments": [{"username": "Angie Bacon-Gonzalez", "comment_text": "Kathy Bacon"}, {"username": "Yara Karime Vazquez", "comment_text": "Perlita Cabrera"}, {"username": "Michele Runge Tapp", "comment_text": "We were just there - what’s the big deal if there’s a crowd?🤷🏻‍♀️ everyone seemed so nice taking to turns to get up close ! And honestly, if u want a pic of it with no crowds, grab this one above !🤣🙌🏻"}, {"username": "Kerry Aldred", "comment_text": "Beasy an early morning for us then ❤️"}, {"username": "Krystal Apolinaro", "comment_text": "Yep! We were the there at about 6:30 am. It was nice!"}, {"username": "Mohanad Saddik", "comment_text": "Omar Kharboutli\nتعلم"}, {"username": "Mary Gerend Boll", "comment_text": "That is so beautiful 🤗"}, {"username": "Jennifer L. Mezzio", "comment_text": "Thanks for this - I am going to be an early bird!"}, {"username": "Dixie Kotylak", "comment_text": "Perfect time!"}, {"username": "Cheryle Bidmead-Malone", "comment_text": "Teresa Malone Julia Malone"}, {"username": "Bea Kuckens", "comment_text": "We look at the webcam and mid-day through late evening it is shoulder to shoulder. The people who want seriously good photos are there when the sun comes up."}, {"username": "Manny Patricia Botelho", "comment_text": "Manny Patricia Botelho"}, {"username": "Lynette Garland", "comment_text": "Best time of day by looks"}, {"username": "Phyllis Snyder", "comment_text": "Crack of dawn!"}, {"username": "Flora Johnson", "comment_text": "It was very crowded when we visited… hard to take pictures. So the secret is to be there very early in the morning!"}, {"username": "Sharon Grace", "comment_text": "Even at 4.30am when I went there were people around"}, {"username": "Shani Hart", "comment_text": "Alex Lang"}, {"username": "Kennedy Richard", "comment_text": "Tami Shadle-Pitts that’s Tami time right there!"}, {"username": "Jeanne Bissell", "comment_text": "Great time to experience Rome!"}, {"username": "Gail Matthews Maddox", "comment_text": "Lynn, I thought it meant 5:55 pm 😗"}, {"username": "Tiffany Boland", "comment_text": "Imijin Boland you’ll need to get up earlier 🤣"}, {"username": "Arlene Jadin Gambol", "comment_text": "Skylinewebcams.\ncom"}, {"username": "Rothschild Jacob", "comment_text": "I solemnly invite you to form part of the greatest conglomerate of the world and reach it on top of your career,\nand being part of an elite forum that will change your life and improve your financial situation.\nAre you ready to take advantage of this opportunity to form part of this large conglomerate?\nIf you are interested, send a text message to me via this telegram link\nTelegram https://t.me/\njacob_rothschild\n1\nWhatsApp ‪‪‪+1 (347) 470‑0188"}, {"username": "Tara Lee", "comment_text": "Kyla McBurney"}, {"username": "Hajar Rmt", "comment_text": "Tonight at 1 am, about 40 people around it"}, {"username": "Cecília Kitková", "comment_text": "Tak to sa oplatí si privstať😄👍"}, {"username": "Helen Lettieri-Haaland", "comment_text": "This was 3 weeks ago when I was there! So crowded! Very beautiful though!!❤️🇮🇹💚"}, {"username": "Linda Willis", "comment_text": "Went there in 2014 ,they were cleaning the Trevor and the Colliseum , amazing history . Loved being there ."}, {"username": "Kelly Redding", "comment_text": "Do people still 'toss a coin and make a wish\" ??"}, {"username": "Kris Swansson", "comment_text": "Yes they do"}, {"username": "Rhi Marie", "comment_text": "Matt Scott rise and shine ⏰"}, {"username": "Kim Grace", "comment_text": "Michelle Cummins early starts for us !!😬👍🏻"}, {"username": "Kaye Old", "comment_text": "Anita Hamilton this will be us 🤔"}, {"username": "Andreas Hegelund Jørgensen", "comment_text": "19:00"}, {"username": "Larissa Boisselle", "comment_text": "We went yesterday around 7:15. Maybe 50-75 people there as well as the Spanish steps. Took a tour at the Pantheon and came back to the square around 10:45 and it was PACKED!!!!!!"}, {"username": "Roxanne Franquelli", "comment_text": "I’m def going at this time."}, {"username": "Sania Junejo", "comment_text": "Sania Junejo"}, {"username": "Kim Randen", "comment_text": "Michael 📝"}, {"username": "Lisa Olszewski", "comment_text": "Zoe Molloy fyi... early bird gets the worm at tourist spots in Rome"}, {"username": "Susan Marie Bishop", "comment_text": "On a cold December morning"}, {"username": "Sandra Todd Coffey", "comment_text": "Kathy Morra Kuloy Kathleen Benjamin Susan Musacchio up early crack of dawn 😂"}, {"username": "Susan Marie Bishop", "comment_text": "On a cold December morning."}, {"username": "Susan Marie Bishop", "comment_text": "Susan Marie Bishop"}, {"username": "Susan Marie Bishop", "comment_text": "Susan Marie Bishop"}, {"username": "Susan Marie Bishop", "comment_text": "Susan Marie Bishop"}, {"username": "Cheryl Kavanagh", "comment_text": "Hi is the Trevi very fare from the Vatican, we have a 630 tour at the Vatican.Would we have time to see the Trevi on the way as we are staying near there 🙂"}, {"username": "Arlene Jadin Gambol", "comment_text": "Walked from the Spanish Steps (6:10am) to our 7:15am Vatican Tour Meetup. Heard the Barberini Station was closed during Holy Week. Walked through Piazza del Popolo, crossed the Ponte Regina Margherita, and along Via Cola Di Rienzo to meet with our tour group for the Vatican - The Roman Guy Privileged Entrance Tour at 7:30am. We nonchalantly walked 2.5 miles in 52 minutes."}, {"username": "Virginia Porato", "comment_text": "I was there at 6:30 am"}, {"username": "Eileen Dalton", "comment_text": "We'll be there later this week 🇮🇹\nWe'll definitely go to Trevi Fountain before 6 a.m.!!"}, {"username": "Bill Bowler", "comment_text": "I prefer seeing it at night. Was there last Wed. Helps to be tall 😉\n\nAlso witnessed a marriage proposal and the entire crowd clapped and cheered after she said yes. 💍"}, {"username": "Daisy Mae", "comment_text": "Shurajit Dutta they say wake up at 5:55? 😁"}, {"username": "Peggy Fisher", "comment_text": "Crowds, what crowds, it's beautiful, my favorite <3"}, {"username": "Leentje Van Regenmortel", "comment_text": "The crowd at 11.52am today 🫣"}, {"username": "Nicola Cattle", "comment_text": "Michelle Campbell Michaela Cattle Donna Burgess we will be going nice and early too."}, {"username": "Livia Ari", "comment_text": "Love this picture ❤️"}, {"username": "Yvonne Lopez", "comment_text": "Loco Lopez"}, {"username": "Nicola Campbell - Penrose", "comment_text": "What’s it like on a night? X"}, {"username": "Susan Brown", "comment_text": "Is there a time of year that not as many go to the fountain?"}, {"username": "Belchim Andrei-octavian", "comment_text": "never understood why people wake up so early just to take a photo alone at the fountain. The fountain is there the whole day and night. You're missing the point."}, {"username": "Denise Wallace", "comment_text": "Best time to go x"}, {"username": "Dawn Dae", "comment_text": "That’s fab as we were there on Thursday afternoon… and this was what it was like… beautiful but hot and packed! Xx"}, {"username": "Pietro Di Sorbo", "comment_text": "😏"}, {"username": "Sue Simmonds", "comment_text": "the EARLY bird.....catche\ns....the BEST spot! 👌 😍"}, {"username": "Jenny McGhie", "comment_text": "Eerin Jennifer Mc Craig McGhie😎"}, {"username": "Raymond Owens", "comment_text": "I LOVE getting up early to go to tourist spots and finding often times very few people compared to normal times. Nothing like having one of the most famous places on earth sort of “to yourself” for a little while."}, {"username": "Danielle Withrow", "comment_text": "I went at 6 am one morning in late April. 5 people there. It's worth getting up at the crack of dawn to see this beautiful fountain."}]}, {"id": "2208446866221058", "text": "Great first night ! Love Italy !", "link": "facebook.com/groups/1373361046396315/permalink/2208446866221058/", "likes": 136, "comments": [{"username": "Diane Hamilton", "comment_text": "Have a wonderful time!🇮🇹\nWe’re going for the first time mid - November"}, {"username": "Paula Bennett", "comment_text": "Where is that huge door?"}, {"username": "Lisa Wylin", "comment_text": "Enjoy! Love your photos 💗"}, {"username": "Patrizia D'Arcangelo", "comment_text": "have fun and thank you for choosing my Italy!"}, {"username": "Jeannie Morris Wierman", "comment_text": "Beautiful! Nighttime looks great"}]}, {"id": "2208465176219227", "text": "Italy Serbia unique iconic sculpture🤟", "link": "facebook.com/groups/1373361046396315/permalink/2208465176219227/", "likes": 64, "comments": [{"username": "Dima Salah Al Mustafa", "comment_text": "Rasha Barhoum\n😂🙂"}, {"username": "Carey Matthews", "comment_text": "Carey Matthews"}, {"username": "Paula Bennett", "comment_text": "Where is this?"}, {"username": "Jessica Thompson", "comment_text": "That is so beautiful!! I’m an equestrian …I would love to see this. Sorta reminds me of the kelpies!!"}, {"username": "Paige Duncan Presnell", "comment_text": "Gabe Presnell"}, {"username": "Helen Walton", "comment_text": "I saw the equivalent in London last year!"}, {"username": "Teresa Bliss", "comment_text": "Absolutely amazing"}, {"username": "Leiza Francis", "comment_text": "Jess Francis this is stunning"}]}, {"id": "2208466506219094", "text": "If looking for a restaurant in Milan try Da Regina 1985 in the piazza del Duomo\nHighly recommended", "link": "facebook.com/groups/1373361046396315/permalink/2208466506219094/", "likes": 4, "comments": []}, {"id": "2208231952909216", "text": "Anzio", "link": "facebook.com/groups/1373361046396315/permalink/2208231952909216/", "likes": 11, "comments": [{"username": "Patricia Ricci", "comment_text": "My uncle lives in Anzio"}]}, {"id": "2208237979575280", "text": "How many have had issues with train delays? We are leaving out of Rome on a cruise and plan on taking the train to Port.", "link": "facebook.com/groups/1373361046396315/permalink/2208237979575280/", "likes": 8, "comments": [{"username": "Tami Sue", "comment_text": "If you have to take a taxi, it's not far."}, {"username": "Gillian O'Callaghan", "comment_text": "I recently did 13 train trips in Italy and had no delays departing."}, {"username": "Colleen Dawson", "comment_text": "Give yourself plenty of time. The cruise line will not wait for you."}, {"username": "Pearl Lucero", "comment_text": "Not usually"}, {"username": "Robert Bill", "comment_text": "It is pretty much on time"}, {"username": "Annette Mayer", "comment_text": "If there are delays take a bus"}, {"username": "Patrick Easter", "comment_text": "LEAVE EARLIER IF THAT IS YOUR CONCERN!!"}, {"username": "John Wilson", "comment_text": "Unusual in Europe for trains to be notably late.\n\nExcept Greece."}, {"username": "Joann Lynn", "comment_text": "Trains where delayed all the time plan extra time of going by train"}, {"username": "Jeannie Morris Wierman", "comment_text": "Go the day before to avoid missing the ship"}, {"username": "Jonathan Goetzel", "comment_text": "We scheduled an uber pickup. This went well. Train would be a pain with all the bags."}, {"username": "David King", "comment_text": "For our first cruise out of Civitavecchia, we took the train from Rome to Civitavecchia to meet the ship.\n\nWe likely won’t ever do it again that way. We’d stay the night before in Civitavecchia instead.\n\nThe train was indeed a little delayed. We had taken an early enough train so we didn’t have to sweat it out too badly, but we still felt stressed. Train delays happen a lot in Italy.\n\nAlso, we didn’t correctly navigate the train to port connection, and it was a little chaotic for us that first time: so we walked from the train station to the port with our rolling luggage, when we should have taken a shuttle."}, {"username": "Larry Reinier", "comment_text": "We did from Pompeii to Sorrento"}, {"username": "Meghan Hoobler", "comment_text": "Never in the 4 times I’ve been to Italy."}, {"username": "Gayle Moores", "comment_text": "We took many trains on our last trip to Italy and most of them were on time.I would take an earlier train just to be on the safe side in case of a delay.You can check schedules on Rome2rio online."}, {"username": "Dawdaw Samaha", "comment_text": "No delays the train leaves from Rome every 30 minutes, there is shuttle will pick you up to the ship try to take an a early train, they checked us in around 11 AM to the ship"}, {"username": "Roxanne Franquelli", "comment_text": "No delays for me this trip so far."}, {"username": "Ellyn Jeck", "comment_text": "Never. I counted 16 trains I took in June and there was never a delay. On a previous trip, there were no delays."}, {"username": "Anna-Maria Lopopolo", "comment_text": "On a train now and it was 25 minutes later at 7am in the morning"}, {"username": "Marianne Liebenberg", "comment_text": "All of many trains I took were on time…"}, {"username": "Dawn Dae", "comment_text": "We’re in Italy now and haven’t had any delays in past 2 weeks 😊"}, {"username": "Mandy Pusateri", "comment_text": "We are taking a cruise as well next month. We are taking a train from Rome to Venice (a couple of days early) and then using the ship\"s shuttle service. The benefit of using the ship\"s shuttle service is that, if for some reason the shuttle is delayed, the ship will wait for you. If you use your own transportation and are late, the ship doesn't wait."}, {"username": "Sophie Kapetanellis Calabrese", "comment_text": "We did Naples to Florence and train was delayed 40 min"}, {"username": "Kimberly Coury", "comment_text": "We went from Milan to Rome and had a 40 min delay."}, {"username": "Jojo Hanna", "comment_text": "Me ! Did a day trip from Florence to Rome. 10 minutes delay going there and 60 minutes back. No explanations/\nupdates/\nexpected time of arrival. We just stood looking at the departure board, waiting for the platform number to appear."}, {"username": "Terry Massaro", "comment_text": "They pride themselves on being on schedule"}, {"username": "Dann Hrusch", "comment_text": "Maybe a 5 min delay at most."}, {"username": "Vero N Ferny", "comment_text": "Definitely a private shuttle or Uber to the port we stayed in Prati and shuttled to the port it was super easy and zero hassles. I recommend you schedule it the night before. If you are staying in an Airbnb the host might even set it up for you as ours did."}, {"username": "Shannon Sharrock", "comment_text": "Lots of delays today and some cancellations. My train was canceled and I got on another that was 45 mins delayed. Traveling from Florence to Rome. But I heard there was an accident that was causing so many at one time."}, {"username": "Gaby Devyll", "comment_text": "Some minor delays"}]}, {"id": "2208240366241708", "text": "Hi can you please let me know how much will be cost of taxi from Olbia to Badesi\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2208240366241708/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "Have you looked into taking the train? It’s a great distance so could be costly. Rome2rio app will give you some options and appropriate costs."}, {"username": "Helen Ladkin", "comment_text": "Try Rome2Rio, it should give an approximate price and alternatives."}]}, {"id": "2208210806244664", "text": "Hi all. 🤩\nWe are travelling down from Milan to Cinque Terra early September. Are there any “must see” places to visit on route there? Or a preferred route to drive perhaps?\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2208210806244664/", "likes": 21, "comments": [{"username": "Stephanie Stevens Burke", "comment_text": "We just went that way. We loved Genova. The port has beautiful\nships. The aquarium looked awesome (we didn’t go). The streets were fun to walk around an sit with aperol spritz and nibbles."}, {"username": "Ihsan Khrichfa", "comment_text": "Lereci"}, {"username": "Audrey Daenzer", "comment_text": "We spent many days in Genoa. Amazing!"}, {"username": "Pao Magnoler", "comment_text": "Genova, La Spezia, Portofino, Portovenere, and of course The Cinque Terre."}, {"username": "Pao Magnoler", "comment_text": "Why don't you take a train? Tolls are very expensive."}, {"username": "Antonio Aloè", "comment_text": "There are dozens of places along the Aurelia in Riviera di Ponente down to La Spezia from Genova.You better drive through Nervi and S.Ilario. Bogliasco,Camog\nli,Santa Margherita,Rapa\nllo,Framura,Zoa\ngli,Chiavari,Se\nstri Levante,Bonasso\nla,Deiva Marina,Levanto,\nMonterosso-the first of the 5 Terre-.Then you go to the othet 4 villages Vernazza,Riomag\ngiore,Manarola,\nCorniglia and in the Gulf of La Spezia Portovenere which is a pearl by itself and Lerici.There are some other magnificent places around La Spezia.That is what I would do..🤗"}, {"username": "Antonio Aloè", "comment_text": "Get out of Autostrada -The highway-in Genova ovest or Genova est and drive in the Aurelia,no tolls."}, {"username": "Nehal Ghosh", "comment_text": "Santa Margarita Ligure was stunning! We stayed there and took a train to Cinque Terre one day and Portofino the next day! Highlight of our trip!"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Seravalle designer outlet mall if looking for some goodies. Tortona, Voghera and Alessandria are true Italian towns with great food and wonderful people. No tourists. Near my family so I hang in these towns"}, {"username": "Melissa Reyes", "comment_text": "Genoa is beautiful"}, {"username": "Sam Mah", "comment_text": "Do spend a day or 2 in Genoa....it's stunning!"}, {"username": "Jeff McLellan", "comment_text": "You are driving to Cinque Terre? Very limited parking options and takes a long time between villages."}, {"username": "Jerry Kiger", "comment_text": "For CT, are there places to park rental car for day trip, if stay 1 of the towns? Considering driving to CT vs train but not sure parking situation … thx for any info"}, {"username": "Chelsey Mesenburg", "comment_text": "Chelsey Mesenburg"}, {"username": "Suellen Peters", "comment_text": "Torino is definitely worth visiting for a couple of days"}, {"username": "Jessica Visconti", "comment_text": "Genoa (at least 2 days), Camogli, Sestri Levante and after Cinque Terre, Lerici e Portovenere"}, {"username": "Sally Govic Burnazovski", "comment_text": "Camogli"}, {"username": "Isabelle Truong", "comment_text": "I love Genoa, it’s a Unesco city there are lots to see and little fishing villages nearby for a day trip. Also Levanto is much nicer and cheaper to stay than the other Cinque Terre villages."}, {"username": "निनावी सहभागी", "comment_text": "Thank you for all the wonderful ideas! So grateful for the input to assist with planning !! 🇮🇹"}, {"username": "Lean Ni Chleirigh", "comment_text": "I’m the only one who didn’t like Genoa! I’d do the Piacenza/Parma route. But I prefer smaller cities and I would be interested in Piacenza historically, so I might be an outlier."}, {"username": "Proper Angling", "comment_text": "Portofino near Genova 100%"}, {"username": "Wendy Jean", "comment_text": "Taking train to Recco from Milan in September! Excited to go to all of these places"}, {"username": "Saskia Kop", "comment_text": "You can visit Nervi, a neighborhood in Genova. Or take the other route, Piacenza is very nice and if you like shopping, Fidenza Village is a great outlet!"}, {"username": "Alaide Stuart", "comment_text": "We loved Santa Margarita and Rapallo"}, {"username": "Howard Abroms", "comment_text": "I like Mantua"}, {"username": "Michelle Bini", "comment_text": "Camogli is beautiful. Take boat from here to San Fruttuoso and Portofino . Baia di silenzio at Sestri Levante beautiful too"}, {"username": "Sarah Luisa Hughes", "comment_text": "Genoa, Santa Margherita, Portofino, Camogli, all on route"}, {"username": "Melanie Baffes", "comment_text": "I think it's worth a stop in Nervi, for a walk along the beautiful promenade there."}, {"username": "Natalie Reid", "comment_text": "Have a look at Grazzano Visconti, it's south of Piscenza. We will be stopping there for lunch on our way from Cinque terra to Verona"}, {"username": "Emma Renee Addison", "comment_text": "Portovenere and Sestri Levante❤️❤️❤️"}, {"username": "Andrei Andrei", "comment_text": "Portofino ❤️❤️❤️"}, {"username": "Andrei Andrei", "comment_text": "Grate pasta 🍝 in Portofino , affordable for everyone"}, {"username": "Andrei Andrei", "comment_text": "Portofino 💯💯 on your way down"}, {"username": "Ali Everson", "comment_text": "Drop into to Genoa. Piazza de Ferrari and explore."}, {"username": "Paola Coppi", "comment_text": "Genova: the singers' city: visit the narrow streets Carrugi and eat Fish Cuoppo in the Square by the Sea. Don't forget to see Saint Lawrence Cathedral."}]}, {"id": "2208127979586280", "text": "Looking for a good restaurant to have supper with the family staying in Navigli\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2208127979586280/", "likes": 2, "comments": [{"username": "Jose Velez", "comment_text": "You have hundreds of tourists traps, just select one"}, {"username": "Antonio Aloè", "comment_text": "Just google in google.it\nI migliori ristoranti ai Navigli a Milano or Mikano-Navigli.\n."}, {"username": "Brenno Bianchi", "comment_text": "Posto di Conversazione and Osteria del Binari are really good"}]}]