[{"id": "2204092803323131", "text": "Where is the best place to stay in Lake Como. We want to take a train to Milan city center. We want to see Bellagio and other areas but not sure how to get around and what else to see. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2204092803323131/", "likes": 0, "comments": [{"username": "Carmine Napolitano", "comment_text": "bellagio was a nice location for taking boats from theres many ferrys"}]}, {"id": "2204088923323519", "text": "Looking for best golf cart tour in Rome! 3-hour OR 10-5 (w/Sistine chapel)? Which tour company is best? TIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2204088923323519/", "likes": 1, "comments": []}, {"id": "2204088519990226", "text": "Hi All\nThis will be our First family trip to Italy. ( last minute)\nNeeding all the help I can get please 🙏🏻\n\nOctober 2023 🙈\n18 days including travel from Australia.\nLooking at flights into Milan and out of London.\nWill only get the top section of Italy in this trip. 😞\nSoooo many questions… sorry.\n\nIs it easy enough to catch a train from Milanआणखी Airport to Venice? Family of 4\n\nDriving in Italy … thinking we may need a rental from Venice to Siena. Is this easy enough to organise and drive?\nAny Recommendations for hotels/air bnb’s in\n-Lake Como\n-Venice\n-a cute town for down time in around the Provence of Siena or San Gimignano with cooking classes or wine tours?\n-tours for the Cinque Terres? Is it worth going there in October?\nAny other recommendations, Apps, things to see, or do is welcome 🤗 Teenagers will have their birthdays over there turning 14 and 16.\n\nThank you so much for any help 😊", "link": "facebook.com/groups/1373361046396315/permalink/2204088519990226/", "likes": 1, "comments": [{"username": "Jenny Payne", "comment_text": "I’m from Australia and go twice a year, I find it so easy to catch trains everywhere, myself would t drive unless u do lots of research where u can park, and never I’m mean never leave anything in your car, while u go to the shops , asking for trouble.blend in don’t stand out. Italians wear ,linen ,cotton ,silk. All carry backpacks with zips tags ( the ones that have codes on, just do the one that has in that is important to you. A cross body bag ( carry documents) I carry my passport everywhere,if i leave it in hotel I lock it in my case again with a zip tag. I take my phone & pay $5 per day or buy a sim card from a company called Tim ( Google and see the costS they will try and charge you more) have it in black & white to show them. Apps RometoRio & man in seat 61. Best sneakers in the world & a pair of sandals, Italians don’t wear thongs . Have a great trip 🌻"}, {"username": "Jenny Payne", "comment_text": "You can bus to Siena from Florence better as it drops you right in the city, cinque Terre great I stay inI in La Spezia"}, {"username": "Laura Cardinale", "comment_text": "Hi!\nHere are some advice\n- train from Milan to Venice: catch The Frecciarossa or Frecciabianca from Milano centrale. If you arrive in Linate there’s a metro Line and in 15 minutes you’re in The city center.\nI suggest 1 night in Milan as in October is full of life and Things to do.\n- driving: it depends. I don’t love driving AT ALL but I don’t think is difficult or dangerous in northern Italy.\nI would definitely try.\n- close to Siena there Are Certaldo, Volterra, monteriggioni, Asciano, San Quirico d’orcia.\nCheck also The small towns on Via Francigena.\n- cinque terre: it depends On The period. If is early october is ok, if is The end I would choose another target (lago di Garda, lago Maggiore, lago di Como) or a trip to Torino, or a beautiful Wine tour in Langhe or Franciacorta"}, {"username": "Bev Madill", "comment_text": "I’ve driven many times in Italy. As a fellow Aussie I’d highly suggest booking an automatic (sometimes hard to find). Just avoid driving in major towns but you get the hang of it. GPS is a must and have someone keep saying “keep right”. I love Varenna on Lake Como. I booked a great apartment last year in Venice from Truly Venice Apartments. They had a few 2 bedroom apartments to choose from not far from St Marks Square. I’m a big fan of Lucignano in Tuscany. It’s not that touristy but has enough cafes and restaurants to keep you happy. It’s within easy reach of Siena and beautiful Pienza. Can’t help you with tours of CT. I’ve visited twice (last trip June this year) and didn’t need a tour as the villages are easy to get around. Having said that I’m not sure what October would be like. Good luck. Italy is majestic."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204080619991016", "text": "Is there a legitimate website to book for admission tickets or tours in advance for the following attractions below, prefer just admission tickets if don't have to do tours. Many thanks in advance!\n1). Rome: Vatican museums, Colosseum, Roman Forum.\n2). Florence: Ponte Vecchio, Uffizi Palace, Academia Gallery.\n3). Milan: Duomo, the Last Supper painting.", "link": "facebook.com/groups/1373361046396315/permalink/2204080619991016/", "likes": 2, "comments": [{"username": "Deborah Schroeder", "comment_text": "Go to each individual website and book through them. Some will be third party but you have a better chance of not getting cancelled this way. Look at the FB or YouTube site Romewise and Florencewise for more information on those two cities."}, {"username": "Mindy Fey Kinser", "comment_text": "For the Vatican, go directly to the Vatican Museums official site. Very easy, lots of options to choose from. It’s the most affordable and reliable.\nThe Roman Forum is included in nearly all Colosseum tickets. Your best bet usually is Coopculture. But there are several reliable sites to purchase from. I’ve had good luck with Tiqets. DO reserve in advance at all of these sites.\n-The Ponte Vecchio is a beautiful bridge over the Arno River with shops (mostly jewelry) all the way across. No ticket needed."}, {"username": "Gary W Anderson", "comment_text": "Do tours or miss out on tons of info"}, {"username": "Steve Grossman", "comment_text": "VIATOR"}, {"username": "Glenn Todd Webb", "comment_text": "Yes except Roman forum is a walk thru. And ponte vecchio is a bridge. All others require advanced tickets."}, {"username": "JeriLynne Clifford", "comment_text": "We always buy our tickets through Get Your Guide. They have an option to not pay, but save your space, until the day before."}, {"username": "Gena Diaco Penland", "comment_text": "We used Viator for all of our tours(9 in total over 2 weeks) and they were all amazing! No issues with cancellations and the guides were all great!"}, {"username": "Miyuki Kanno Paul", "comment_text": "They all have official websites for booking"}]}, {"id": "2204080306657714", "text": "Ciao! 👋\n\nMy boyfriend and I are interested in traveling from Rome for a day trip in Gaeta. What is the best way to take a train. Open to all suggestions for an optimal Gaeta experience. Would like to visit the beach and walk around, etc.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204080306657714/", "likes": 0, "comments": []}, {"id": "2204077843324627", "text": "Has anyone had any issues with taking OTCs with you to Italy, like DayQuil, ibuprofen, Imodium, and OTC fat burners from GNC? Any input is appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2204077843324627/", "likes": 2, "comments": [{"username": "Bethany Rudy", "comment_text": "No, we talk several oTC medications"}, {"username": "Heather Weiss", "comment_text": "Nope, never ☺️"}]}, {"id": "2204077483324663", "text": "I love this group and love your feedback … that being said I have another question. I see a lot of people talk about the places you stay in Sorrento but I have never seen The Palazzo Tritone & Abagnale mentioned. Has anyone had any experiences with this hotel? We will be staying only two nights here in September and would love to know any experiences, good or bad. Thank-You!", "link": "facebook.com/groups/1373361046396315/permalink/2204077483324663/", "likes": 0, "comments": []}, {"id": "2204075096658235", "text": "There will be 7 of us traveling to Italy and my mom will stay with her aunt in Ostia near Rome. Does anyone have suggestions on places to stay for 6 adults between Ostia and Positano. We would like to be beachfront if at all possible yet able to travel either up to Rome and Florence or towards Positano on any given day. Any ideas or recommendations are welcome. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2204075096658235/", "likes": 1, "comments": [{"username": "Elena Eugeni", "comment_text": "Terracina, Sperlonga and Gaeta are right in the middle and are nice cities on the coastline. But it's a long trip anyway, more than 3 hours to reach Firenze or Positano. They are not close."}]}, {"id": "2204073723325039", "text": "Hello everyone,\nI’m traveling the end of September to Castello di Reschio (Umbria) I’d like to maybe spend a few days on the coast of Tuscany. Can you drop your favorite parts of the coast and why? Also any wineries or events you think are a must do please let me know!\nPictures would be great too!\nThank you in advance for all of your help! It is greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2204073723325039/", "likes": 1, "comments": [{"username": "Dr-Jon Warnecke", "comment_text": "Check vineyards in Orvieto, Val d'Orcia, or chianti. Torgiano, by Perugia has a wine museum"}]}, {"id": "2204073516658393", "text": "We are planning a trip in the fall and have 3 days between our cruise docking in Civitavecchia and an apartment reservation in Cortona. Looking for suggestions of where to spend that time. We have already been to Florence and Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2204073516658393/", "likes": 0, "comments": [{"username": "Leanne Batten", "comment_text": "Siena, Assisi, montepulciano! Aviognese winery 10 course lunch!"}, {"username": "Billie Begley", "comment_text": "Billie Begley"}, {"username": "Billie Begley", "comment_text": "Civita Di Bagnorgio is fantastic. Old Medieval town. We went there and Orvieto on a day trip. Great day"}]}, {"id": "2204070473325364", "text": "We are taking the train from Rome to Venice. All our luggage (3 pcs & 2 large back packs) will be traveling with us. What should I expect. Any issues?", "link": "facebook.com/groups/1373361046396315/permalink/2204070473325364/", "likes": 15, "comments": [{"username": "Emma Kay", "comment_text": "Sore arms"}, {"username": "Diana Smith", "comment_text": "You will be fine!"}, {"username": "Bonnie Brauner", "comment_text": "You’ll be fine"}, {"username": "Kathy Tully Sexton", "comment_text": "For two people? That’s a lot to manage. We had one medium spinner case and two backpacks between two of us. We stored the case at luggage storage in the station and just took our backpacks to the hotel. Unless you take a private taxi or your hotel has its own stop you will have to tote luggage through the busy narrow bumpy streets."}, {"username": "Lauren Dawson", "comment_text": "We are doing this on Thursday 2 adults small cabin case each plus a bag each I’ll let you know how we get on"}, {"username": "Gary W Anderson", "comment_text": "Just keep your eyes on them, either overhead or next to you. Make copies of ALL papers and don’t put anything in rear pockets just to be safe. Travel safe, eat well and enjoy gelato."}, {"username": "Renae Larcus", "comment_text": "Keep your eyes on them. There is storage above the seats and at the rear of each coach. Better yet, pare down the size and number of luggage you are taking. Much easier. We have noticed that people getting on and off trains with a lot of luggage don’t get much sympathy from other riders."}, {"username": "Stacey Esposito", "comment_text": "You ll be fine. There is storage above you and in between the trains. Download the app and it will show you each station as you approach it. If you are prone to motion sickness take dramamine which I wish I had known. The air conditioning was not great but I think that's hit or miss. How many of you are traveling? I screwed up our seats booking 8a 8b 8 c 8 d which I thought had us sitting together around a table. Instead we were sitting on the other side of the aisle which makes sense now. I should have booked 8a 8b 7a 7b so we would have been around the table in front of us. Another family did the same thing so we switched so each family of 4 could sit together and told the conductor / ticket checker and she was fine with it once she saw what we did"}, {"username": "Stacey Esposito", "comment_text": "And people are very helpful. My husband helped women that couldn't get their bags down and other passengers were very helpful if anyone was having a problem putting luggage up or down"}, {"username": "Rachael Richardson", "comment_text": "Just keep an eye on them or lock them up with a flexible bike lock"}, {"username": "Ryan Shearer", "comment_text": "Book business. Expect stairs."}, {"username": "Marc Rosenfeld", "comment_text": "Easy. Lots of space"}, {"username": "Shelley Frise", "comment_text": "We are still in Italy. We each brought a backpack and a carry on suitcase which worked fine even with dress clothes for our daughters wedding. I like to shop so when we where in Sorrento we bought a medium suitcase. Next trip I would back a small suitcase in a medium one for the extra leather coats table clothes gifts etc.. to get home."}, {"username": "Maria Urdi", "comment_text": "Oh I AM THE PERSON TO ASK RIGHT NOW!!! Hah! I’m on the Intercity Train to Sicily. 6 luggage. It was a shitshow.\n\nIf you have the option for Freccerossa with Executive Class do it!! Luggage stays with you no worries. I currently sat on 2 if my luggage for an hour or so. Then started putting them in empty seats as people got off. It sucked. Luckily people have been helpful helping me and 2 teenagers lug all our crap!!"}, {"username": "Beatriz Davalos Moreno", "comment_text": "no problems, we travelled with suitcases on the train, business class no problems at all, they are sooo nice and the seats are very wide and comfy, enough space for suitcases at the end of the train car!"}, {"username": "Robin Darmstadt Mancil", "comment_text": "Sweating, stairs."}, {"username": "Gillian O'Callaghan", "comment_text": "🙋‍♀️ 1 person....'chec\nked' luggage (17kgs), small backpack. Expect narrow, high, steep steps on and off trains. Overhead shelves plus some storage for large items. I did 13 trips ...always found a solution."}, {"username": "Brian Marcus", "comment_text": "Nah easy trip you'll be fine."}, {"username": "Amy Schmelzle Walsh", "comment_text": "My daughter and I took several trains and it worked out w each of us having an away carryon plus duffel backpack on our backs and Regular size backpack- we managed-but I was definitely shlepping I was very glad once I was up the few stairs getting on the trains- I run marathons and lift weights so I consider myself able bodied but to do it over w trains I would pack less!!😆"}, {"username": "Starla Dawn", "comment_text": "Book business class if you don’t want issues and pack lighter ;)"}, {"username": "Jayne Dawson Meyer", "comment_text": "Expect a great adventure & have a wonderful time! Don't over think & roll with the experience. 😊😊😊😊"}, {"username": "Pareesa Naveed", "comment_text": "I booked premium class, is it same as business class? Have 2 large suitcases. Will it be an issue in premium class?"}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Lyn Bee", "comment_text": "Please look out for fake ‘porters’ who offer to take your bags into the train then expect payment. We were willing to pay a euro for this but then we saw other passengers one of which had her handbag stolen by a team of thieves who distracted the group and by the time they realised the train had taken off."}]}, {"id": "2204069203325491", "text": "Looking for an answer please:-). If we are flying from Rome back to Minneapolis and connect in Paris, we don’t have to go through passport control or customs until Minneapolis, correct?? I just changed my flight home so I don’t have to connect in Boston anymore (Thank God)", "link": "facebook.com/groups/1373361046396315/permalink/2204069203325491/", "likes": 4, "comments": [{"username": "Allison Schenian", "comment_text": "Hi from MN, we just flew from Italy home to MSP with a layover in Paris. There is a passport control in Paris we had to go through in order to get to the terminal for US flights, but we didn’t have to do anything with our bags."}, {"username": "Stephanie Smith", "comment_text": "You’ll have passport control in Paris and clear customs in Minneapolis"}]}, {"id": "2204064963325915", "text": "Restaurant recommendations in Bellagio please!", "link": "facebook.com/groups/1373361046396315/permalink/2204064963325915/", "likes": 1, "comments": [{"username": "Jan Shelton Koprivnik", "comment_text": "Following"}]}, {"id": "2204064813325930", "text": "Does anyone have suggestions for Airbnb or Vrbo in Rome? Possibly near the Spanish steps?", "link": "facebook.com/groups/1373361046396315/permalink/2204064813325930/", "likes": 0, "comments": []}, {"id": "2204064669992611", "text": "Am planning to go to Italy in September 2024. What is the consensus on the Hotel Golden in Rome and it’s proximity to the historic center?", "link": "facebook.com/groups/1373361046396315/permalink/2204064669992611/", "likes": 0, "comments": []}, {"id": "2204064426659302", "text": "Hi , last time we were there we had a hard time finding cream in coffee shops / restaurants for an American style big hot creamy mug of coffee , is there something I should be asking ...to get coffee ( not espresso ) with actual cream ? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2204064426659302/", "likes": 22, "comments": [{"username": "Diana Sankara", "comment_text": "Cream is panna. You may ask for caffè americano con panna. If they ask caldo o freddo just answer caldo (hot)."}, {"username": "Bridget Gieseke", "comment_text": "Ask for American coffee with cold cream… otherwise they will bring it warm"}, {"username": "Kelli Lewis McElroy", "comment_text": "Pack some powdered coffee-mate and bring some with you when you venture out. You can actually carry it on the plane with you."}, {"username": "Luanne Carey", "comment_text": "When we're in Italy, we usually make our own coffee in the morning (we bring it from home, along with a cone and filters), which involves 2% milk we get at any Italian grocery store. Then while we're out and about we indulge in lots of wonderful cappuccinos, the kind we can only find in Italy. Can't wait to get back!"}, {"username": "Donna Winters Samford", "comment_text": "People, did your mama not teach you that if you don't have something nice [or helpful is my addition] to say then don't say anything at all. 80 - 90% of the feedback on this page is extremely helpful and I know will make my upcoming trip to Italy more informed and enjoyable; but, there is always that 10 - 20% that have to be snarky and rude and it just is not necessary - IMHO."}, {"username": "Joe Meiers", "comment_text": "OH MY GOD! What is WRONG with you people? She just wants cream in her coffee! Not milk. For Christ’s. Why is that so hard to understand?"}, {"username": "Pao Magnoler", "comment_text": "Panna! You should ask coffee with panna."}, {"username": "Annette Mayer", "comment_text": "Try to asl forCafe Americano con\nPanna. My husband doesn't like expresso and prefers American style. This is what he gets."}, {"username": "Anna Ciolino Di Bennardo", "comment_text": "Cappuccino.\nYou can also bring the mini little cups of flavored creamer from America. I brought a plug-in percolator American coffee and creamer from America."}, {"username": "Ainita Deks", "comment_text": "What a bunch of culture fascists we have here! It’s giving me “go back to where you came from “ vibes! It’s perfectly ok for people to have preferences for their food/drink without being crucified for it. Who made y’all the culture police? 🤦🏽‍♀️🤦🏽‍♀️"}, {"username": "Phyllis Waring", "comment_text": "Just ask for \"American \" when ordering coffee. Italians are used to the term!!"}, {"username": "Jean Marino", "comment_text": "Bunch of snobs in here. Geez"}, {"username": "Ville Lignell", "comment_text": "Some bars may serve a spoon of whipped cream with coffee, but it's rare. Cream isn't added to coffee generally speaking, just milk. By now StarSucks exists in Italy too, try there."}, {"username": "Athena Teligadas", "comment_text": "Maybe a cappuccino would work for you? Italians like to drink cappuccinos in the morning. And in the afternoons only espresso’s apparently."}, {"username": "Dan Baron", "comment_text": "“Cafe americano” is a shot of espresso with hot water added. Ask for it “con latte” and you’ll get some milk added. It may or may not be steamed milk, depending on the cafe."}, {"username": "Giu Di", "comment_text": "By memory I think there should be Starbucks only in Milan and Torino. Apart from coffee chains like those, no, you won’t find that. Italy is one of the few places where big food/drink franchising, like Starbucks or domino, do not have a market. And Italians are very proud of it"}, {"username": "Jenny Lee", "comment_text": "This might sound silly but something to maybe consider, if you purchase an expresso and a latte , you could carry a portable frother with you for the latte and then pour into your coffee.( you can order on Amazon, they are even usb chargeable)"}, {"username": "Janet Messanelli Bozzone", "comment_text": "If you are bringing a checked bag you can bring along some mini half and half. You could also bring some shelf stable cream if you will have access to a fridge. Again. Needs to go into checked luggage."}, {"username": "Debbie Potter", "comment_text": "Cappuccino"}, {"username": "Debbie Potter", "comment_text": "Debbie Potter"}, {"username": "Cynthia Marie", "comment_text": "I agree with you 100 %. When I’m in Europe I drink English tea or Espresso. Nothing compares to an American coffee with creamer. You have to be flexible when traveling and do what works best for you."}, {"username": "Rizzolo Josi", "comment_text": "Latte e caffe is more milk less coffee. Caffe e latte is more coffee less milk. Try that as an alternative perhaps, depending how you prefer your coffee, lighter or darker…."}, {"username": "Sheila Hagan Holst", "comment_text": "Hi Heidi — we would order caffè americano con panna."}, {"username": "Mark Spielman", "comment_text": "Americano caffe latte, should work"}, {"username": "Lisa Wylin", "comment_text": "CAPPUCCINO!!- yum!🥰"}, {"username": "Irene Oda", "comment_text": "No, you really can't buy this type of coffee. However, therefore now there are few Starbucks open in select cities. Could offer what you are looking for"}, {"username": "Lisa Hartert", "comment_text": "If you can get drip coffee or instant in your hotel or Airbnb then use Italian “panna” for creamer. I loved it. Ordering out: caffe latte. ☕️"}, {"username": "Non Robinson", "comment_text": "It is my understanding that flavored coffee creamers that we have in the US are not allowed to be sold in Europe because of some of the ingredients are banned. Might want to do some research on that????"}, {"username": "Carol Taylor Tisdale", "comment_text": "First time we visited Italy way back in early 90's - we hit up our first coffee bar on our first morning and i figured from the menu i should order \"caffe normale\" you know... normal coffee... SURPRISE!! 😛🤣"}, {"username": "Enas Mourad", "comment_text": "I take my mug with me as the largest cup of coffee in Italy is smaller than half of my mug 😂 i make my morning coffee in my residence so I can function and then drink coffee like Italians for the rest of the day"}, {"username": "Terry Pisano", "comment_text": "And someone remind me again... I drink black coffee every am... and yes will go through withdrawals if I don't have it. The closest to this is americano, correct? I'm not wise on various coffee drinks... just addicted to black coffee with caffeine. Thanks!!"}, {"username": "Jessica Asquith Hemphill", "comment_text": "My daughter loves cream and flavors in her coffee but enjoyed a cappuccino with a little sugar every day! Maybe try one and see what you think!"}, {"username": "Joan Adams Schilling", "comment_text": "Not sure why people have to criticize someone else’s preferences. Everyone is different. If I were the OP, I would be hurt by all the people who think it should be their way or stay home. How offensive is that?"}, {"username": "Carol Taylor Tisdale", "comment_text": "What is with the snarky comments. This person asked a simple question and did not deserve lectures. Good grief."}, {"username": "Paula Stansberry Brown", "comment_text": "I e been thinking about this a lot. I believe you could order a caffe con latte and if you want sugar also, con zucchero."}, {"username": "Toni Williams", "comment_text": "Do you not like cappuccino? That’s quite big and frothy? Or just ask for an Americano con latte"}, {"username": "Jazz Caldwell", "comment_text": "That's what I did amongst the espressos, macchiatos, and various other drinks some of which I hadn't tried before."}, {"username": "Michelle Murphy Margolati", "comment_text": "I order a latte when traveling. Otherwise the coffee is too strong for me. I drink coffee without cream or sugar at home."}, {"username": "Kathy Tully Sexton", "comment_text": "An americano is usually and espresso with water. A Lungo is a longer pull of an espresso so it is less intense but sometimes more bitter. My husband has tried them all and still pines for his American brewed coffee. He orders a lungo with a side of steamed milk. I doubt you will find a cream or half and half at most places."}, {"username": "Dana Talusani", "comment_text": "Having a coffee preference does not mean that OP is rejecting Italian culture. To suggest so is insulting. Sometimes we just NEED our coffee on our terms."}, {"username": "Brenda Mikels Bunch", "comment_text": "I found I loved the stronger cappuccino and espresso in Italy and my normal coffee at home tasted weak and watered down when I returned lol\nMy husband had a hard time because Italians do not have decaf anywhere around. Believe, you DO NOT want him on caffeinated coffee! 🤪"}, {"username": "Natalie Taska Rehak", "comment_text": "Jeez a question about ordering coffee the way she prefers should garner ZERO criticism. How about answering the question and maybe a “if you like this, you might want to try this…”"}, {"username": "Teresa Marina", "comment_text": "I feel you - so I ordered a Caffe Americano con latte"}, {"username": "Christine Aird Craig", "comment_text": "Cafe latte con pana"}, {"username": "Gianluca Rivizzigno", "comment_text": "Americano macchiato caldo (hot foamy milk), or macchiato freddo (cold milk).\nLatte intero means whole milk, closest thing to cream. If you want something scrumptious, you can ask for panna montata. In some parts of the country is made fresh on premises."}, {"username": "Dixie Kotylak", "comment_text": "It’s not America! Remember where you are, and enjoy their food and drink!"}, {"username": "Sanjeeta Ahmed", "comment_text": "Cafe con Crema is the answer"}, {"username": "Nancy Day", "comment_text": "I am a coffee drinker.I enjoy cappacino at any time aware not after 11am in Italy.Espresso sometimes just too strong but I will experiment. I am learning some Italian and hope I can get a Cafe con crema\nWhen needed,when I\nVisit next spring I'll learn"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Ask for an americano con panna NON montata (cream not whipped, usually if an Italian asks for cream he wants it whipped). If they don’t have cream or they only have it whipped (in any case when it goes in the hot coffe i becomes liquid) ask for a latte macchiato (=stained milk, what you call latte).\nIn Italy 50% cream doesn’t exists."}, {"username": "Delia Miscella Wroblewski", "comment_text": "You should stay where you are if you HAVE to have coffee in exactly that way!"}, {"username": "Diane Davis Lawyer", "comment_text": "https://\nlakesandlattes.c\nom/\nhow-to-order-cof\nfee-in-italy-a-\nguide-for-ameri\ncans/"}, {"username": "Diane Davis Lawyer", "comment_text": "All I can say is someone would make a small fortune opening American coffee bars during the high seasons! 🤣🤣"}, {"username": "Renee Rundle Stoneham", "comment_text": "Simply put your not going to find exactly what you want.\nCream, half and half etc…is not not a thing in Italy.\nPanna is close to half and half etc. you can get it and can probably get a small pitcher on the side.\n\nAmericano is closest to American brewed coffee because it has added water. It’s still stronger than what you’re used to.\n\nAlso try a Latte which is steamed milk and espresso then add some sugar.\n\nI LOVE cappuccinos in Europe sooo much better than here.\nHowever I do add both sugar packets!\nI miss my daily cappuccinos!!! I have a Nespresso at home but just not the same."}, {"username": "Linsey Sappington", "comment_text": "Cappuccino is very comparable in my opinion. That’s what we get."}, {"username": "Evelyn Brown", "comment_text": "I drink my coffee the way you do, and I live in Italy. When I'm out for breakfast, I order cappuccino. Otherwise, at home I basically make an Americano and add coconut milk (the kind used for for cooking). It's the closest I can get to the way I make coffee in the US. A cappuccino (or 2🤷) does the trick for me, though."}, {"username": "Ruth Hackert", "comment_text": "Order an Americano"}, {"username": "Karen Lavoie", "comment_text": "I asked for Caffè Americano con latte and received brewed coffee with milk multiple times Maybe try con crema instead of latte…."}, {"username": "Steph Craddock", "comment_text": "To be fair.. whenever I go somewhere else, I moan about the lack of a decent Italian espresso or cappuccino, and a lack of a good coffee in general.(I live in Italy) but no, you will never find cream in a bar. It just isn't done. You can't spoil the taste of the coffee!! Try a cappuccino, you can't go wrong."}, {"username": "Stefano Zordan", "comment_text": "Cream in a Italian bar/\ncaffetteria to put in your coffee?\nNo way, you won’t find it\nHope this help the author"}, {"username": "Heidi Littman Meiers", "comment_text": "OP here.... thank you to all who responded with actual helpful suggestions and to those who said they \"get it\" about how i just want a mug of coffee like I enjoy in the states as I find it an important way to start my day 🥰🥰🥰 and to those who were critical and snarky.... I assure you , i am as well travelled as you are and I promise I will rise above your nastiness and if you ever come to Philadelphia I will NOT insist that you eat your hoagies and cheesesteaks like a local if you don't want to 😝😝😝"}, {"username": "Lora de Vries", "comment_text": "Italians are not big on size and lean more towards quality I think. It is why Italian food is probably one of the best in the world in terms of taste, quality and the freshest of ingredients. If you want American sizes and taste, then depending on where you are headed, they do have Starbucks in some areas. We have had the best Cappuccinos and Espressos in Italy at local cafes and restaurants and their sizes were perfect for us."}, {"username": "Jessica Palladino", "comment_text": "Get a cafe freddo!"}, {"username": "Marisa Brombal D'Emilio", "comment_text": "To answer your question, ask for Caffè Americano! In Italian cream is called panna. Or ask for latte"}, {"username": "Tom O'Hara", "comment_text": "Esprrsso is coffee. What you want is american coffee, which is watered down real coffee."}, {"username": "Kayla Caras Prescott", "comment_text": "Maybe ask for a latte ? Not sure. We are just going with the flow. My 16 yr old son is even enjoying getting an espresso\n\nPS. I am very well aware latte is milk and have always known that 🙄."}, {"username": "Elisabetta Coppo", "comment_text": "Some ice cream shops (the ones with coffe bar service) put fresh panna montata on top of espresso (you can ask for a caffè lungo). It's not american cream coffee but it's delicious, try it! 😊"}, {"username": "Antonia Dosik", "comment_text": "Coffee Latto. That is coffee with milk and the closest you will get. Try a cafe Americano though which is a delicious espresso diluted with water so that it is not quite so strong. But it is served black as is almost all coffee in Europe."}, {"username": "Siobhan McAlinden", "comment_text": "Cream goes off quickly in heat so not often used just incase 🤔"}, {"username": "Alice Francesca", "comment_text": "You mean an Americano.Well ask for an Americano and some hot milk in a little jug (un caffè americano e un pò di latte caldo a parte) .\nThere are Starbucks in Rome, Turin, I think Florence too.\nBut while in Italy try espresso con panna.(espresso\ntopped with whipped cream)"}, {"username": "Pamela Karp Creamer", "comment_text": "Heidi, I guess ask them if they have Panna, which another poster said is Cream. I have the same issue as you with coffee when I travel. I am very used to the way I drink my coffee first thing in the morning and my day doesn't start \"right\" unless I like my coffee!"}, {"username": "Reina Pike", "comment_text": "Panna! Ask for panna 😊"}, {"username": "Sofi Cuadra", "comment_text": "Cream = Panna! If you would like a large cup of coffee, you should ask for “caffè americano” 😉"}, {"username": "Judy Carey", "comment_text": "Look for any Starbucks near you - you should be able to grab a cup there."}, {"username": "Ingrid Zancoli", "comment_text": "Please be aware that most times for panna Italians intend whipped cream, not liquid cream..."}, {"username": "Fetchin Gretchen", "comment_text": "Coffee is served in Italy with steamed milk not cream as Italians do not want to mask the taste of the coffee. You can order things like a latte machiato or cafe latte though that have a higher portion of steamed milk but you will rarely find actual cream anywhere."}, {"username": "Rebekah Lister", "comment_text": "Ask for a Caffè Latte - my brother and sister in law found a place that serves all kinds of American style coffees, but that was in Rome."}, {"username": "Teena Manship", "comment_text": "I found a couple places that served ginseng coffee, I tried it and really liked it. It was milky/ creamy and sweet. Almost a weak hot chocolate like drink. If it was too sweet/strong just add more hot water. Some places filled the cup, some served it half full. I liked it more diluted."}, {"username": "Barbara Kitlinski", "comment_text": "Cappuccino"}, {"username": "Annalisa Shulde", "comment_text": "You won’t find it. But maybe you can try adding a little sugar to “panna”(heavy whipping cream) (you can find in any grocery store) and use it as a creamer? Bring with you into cafes? I don’t suggest this but if you find you can’t do espresso?\nYou won’t find drip style American coffee. Espresso, though, is delicious. If you haven’t tried it, ask for Caffe del Nonno or crema caffè- iced Italian coffee-) or a granita al caffe…both of these are cold style coffee. Otherwise a cappuccino is a great choice, just not after 12pm"}, {"username": "Lauren-Jade Roberts", "comment_text": "I feel the pain here, as a Brit tea abroad is never the same, even if you take your own teabags. The water is different and the milk is sweet 😬"}, {"username": "Leopoldo Conti", "comment_text": "The closest you can get is an Americano in tazza grande ( big cup ) with cold milk on a side."}, {"username": "Grace Scinto", "comment_text": "Unfortunately I doubt you will find what you are after. The closest you will be able to get would be to ask for a caffe americano and add your own cream. You can buy small cartons of panna in a supermarket or alimentary. It will also probably be long life."}, {"username": "Andrea Ferretti- Kearney", "comment_text": "I don’t drink coffee and yet I’ve been drinking cappuccinos here. I feel like that is quite creamy."}]}, {"id": "2204061866659558", "text": "Anyone up to date on the visa requirements now for 2024 travel from US to Italy? Do we need to apply for a travel visa?", "link": "facebook.com/groups/1373361046396315/permalink/2204061866659558/", "likes": 1, "comments": [{"username": "Jason Naz", "comment_text": "No visa requirements for EU member nations..I went in march this year and hardly even needed to show my passport"}, {"username": "Stephen Dawson", "comment_text": "no visa but you will need pre clearance using\n\nhttps://\netias.com/"}, {"username": "Maninder Pabla", "comment_text": "https://\ntravel-europe.eu\nropa.eu/\netias_en"}]}, {"id": "2204060569993021", "text": "Hi We are looking for decent accomodation in Rome and Venice but reasonably priced due to the rand being 20. 1. Also can you do a day trip or tour to Amalfi coast from Rome? Can you swim ie are there nice beaches there . Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2204060569993021/", "likes": 1, "comments": [{"username": "Billie Begley", "comment_text": "For Rome we stay at Hotel Barocca. Nice boutique hotel. Venice our go to is Hotel Olimpia. Both excellent. Great Breakfasts. Nice lounge area for an evening drink."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Try the Lido island in Venice. It also has a beach."}]}, {"id": "2204060126659732", "text": "Looking to go to Italy in May 2024 . Is it still somewhat cool ? And not so crazy busy yet ?", "link": "facebook.com/groups/1373361046396315/permalink/2204060126659732/", "likes": 0, "comments": []}, {"id": "2204055509993527", "text": "We are going to Italy in November. I know I'm a bit early for tickets to the Vatican and Colosseum. I'm kinda stressed looking daily and seeing them sold out every day. So two questions. Would I be able to purchase at the Vatican and Colosseum on-site easily since crowds are fewer? Secondly there are several tours to choose from. I'd like to see the underground in the Colesseum. But which is the best tour? Booking directly through the site.", "link": "facebook.com/groups/1373361046396315/permalink/2204055509993527/", "likes": 7, "comments": [{"username": "Deborah Schroeder", "comment_text": "The crowds never go away. I would recommend purchasing when the tickets go on sale. The Colosseum is with Coopculture and they sell out fast. Use the Vatican website for the museum. St Peter's is free but you need to be there before 7 am to get in line for security and you beat the worst of the crowds."}, {"username": "Allison Taeger Wilson", "comment_text": "If you miss the 30 day mark for the Colosseum check 1 week before you go as they release more tickets then."}, {"username": "Mindy Jo", "comment_text": "I was able to purchase the Prime Experience for the Vatican last night. I have alarms set for the Colosseum. Thank you!"}, {"username": "Michela Zanni", "comment_text": "I think November is an almost dead month"}, {"username": "Jeff McLellan", "comment_text": "Easiest way to get Vatican is to pay from the Prime or Prime VIP depending on the size of your group and budget. We did the Prime VIP and felt it was totally worth it. This was somewhere we felt we were going to go once and only once so didn’t want to deal with others and had freedom to move at our own pace. Our guide Donatella had been doing tours at the Vatican for over 31 years and was great.\n\nFor Colosseum I suggest just practicing to get used to the website made all the different for me."}, {"username": "Amy Hanson Garrity", "comment_text": "I don’t think you can ever be too early when planning trips abroad. I suggest making note of the earliest day tickets go on sale and purchasing then. I did a tour for both sites and definitely recommend that. I am not normally a big tour person but the knowledge they impart in these locations is invaluable and really adds to the experience."}, {"username": "Karen Ries", "comment_text": "You have to be very diligent about refreshing the website and tickets pop up at the strangest times. I was able to snag two of the underground tour for the Colosseum￼."}, {"username": "Diane Janovas", "comment_text": "You should buy those tickets as soon as you can. Don't wait till you get to Rome"}, {"username": "Shawna Mcdonald Sapp", "comment_text": "We are going in November also. We booked our tickets through the Vatican directly fir that and the colosseum won’t go in sale until 30 days prior. I have heard not good things about booking through 3rd party is why we did it direct"}, {"username": "Daisy Yoo", "comment_text": "I got my vatican ticket for early dec 2 months ago. I got the prime 7:30 with breakfast"}, {"username": "Diane Plott Miller", "comment_text": "We are going in November and booked our tickets for the Vatican and Colosseum about 4 weeks ago with Viator."}, {"username": "Trish Donison", "comment_text": "I'm going the third week in October and I've purchased our tour tickets already!"}, {"username": "Kellie Stone Wells", "comment_text": "I’m going in December and none of the tickets I want are available yet. It’s stressful. 🫣😆"}, {"username": "Monica Saluja", "comment_text": "Hariti Saluja Sushreya Saluja"}, {"username": "Lisamarie Bianco", "comment_text": "Here in Rome, super crowded but manged to get tickets for Colosseum a day before on Tiquets.com. No luck with Coop Culture website. They told me everything was sold out."}, {"username": "Marilyce Arbelo", "comment_text": "Highly recommend an early entrance VIP ticket to Vatican/st Peter’s/\nSistine chapel. It was total 99euros pp and it started at 7:30a. We barely waited in any line and we finished by about 10a. It was a group of 12 and a tour guide. We bought it the day before online (tiqets)"}]}, {"id": "2204054776660267", "text": "How many Euros are people taking? We are a family of 3 - going for 2 weeks 😀", "link": "facebook.com/groups/1373361046396315/permalink/2204054776660267/", "likes": 18, "comments": [{"username": "Donette Earl Fox", "comment_text": "Just don’t think credit cards work well all over Europe! Germany wants cash only!"}, {"username": "Lizette Arellano", "comment_text": "Don’t take any. Just use Apple Pay. I didn’t need euros at all and we were there for two weeks in June."}, {"username": "Aubrey Roy", "comment_text": "Depends on where u r going"}, {"username": "Julia Haggerston", "comment_text": "Lots of places aren’t taking cash now it’s done by card (at least it was in France so assuming most of Europe will be like that now. Small things like toilets, drinks, ice creams will take cash but meals were by card & some places you found your own table, scanned the barcode on the table for the menu, ordered and payed without seeing anyone then your food was brought to your table. I’d keep your holiday money on a bank card to use and take a few hundred euros x"}, {"username": "David Ridpath", "comment_text": "I take a mixture of pre paid card,credit card and cash, some places won’t take a card for purchases under 10 euros"}, {"username": "Dom Boc", "comment_text": "Don’t use your credit card. Fees are applied. 2 weeks 3 people work on €300 per day with leftovers at the end"}, {"username": "Chad Kenney", "comment_text": "I would take 800 and 2 different credit cards. Make sure you use the euros before you come back, if not you will lose money when converting back to dollars. Also, contact your bank now because they may have to order them."}, {"username": "Nancy Caruso Watts", "comment_text": "We took 1600 euro for 5 weeks (family of 5) and came home with 150euro. Spent most of it in pompaii, calabria and Sicily. We had so local stores not have EFT up and running or internet shortages. Some don't have it because it cost them too much as a small business."}, {"username": "Al Filizetti", "comment_text": "I was there a month ago for 3 weeks. Started with 500 got 200 from atm and exchanged 80 at the airport on my return. Used most of my cash on taxis and purchased some leather goods and they discounted the price if I gave them cash."}, {"username": "Samina Jassani", "comment_text": "American Express excepted every where in Italy ???"}, {"username": "Cathie Smithward", "comment_text": "Is there an up charge for credit card use?"}, {"username": "Nichole Kempner", "comment_text": "We took about 500 and came back with 20. Most places take cards"}, {"username": "Edmond Nolan", "comment_text": "I don’t keep track j just spend what I want when I want"}, {"username": "Sharon Eilerman Post", "comment_text": "It depends where you are going and what you are doing. We hired several private drivers for day trips. They want cash. Check with your bank. Some will only let you withdraw 250e per day."}, {"username": "Maria Coladangelo Ducca", "comment_text": "Equivalent of 4/ 5 thousand dollars"}, {"username": "Katherine Seoane", "comment_text": "Is better to withdraw with your atm card there. However I will recommend withdrawing a small amount to have and use your credit card, make sure you your card does not charges you for international fees. Also American Express in Europe is a hassle so take a master card or visa."}, {"username": "Michelle Prince", "comment_text": "we took 200 euros and a revolute card for the 2 of us and mostly used the card"}, {"username": "Senad Sadic", "comment_text": "20 is plenty"}, {"username": "Hermineh Topalian", "comment_text": "With shopping ,beer, alkohol, food outside, transport,etc 1000 euro"}, {"username": "Christine Carbone", "comment_text": "I’m taking 3500 euros for three weeks- tours and Airbnb and transportation is paid for- going to try not to use mc"}, {"username": "Judith Laughlin Thomsen", "comment_text": "I live in Europe, pull Euros here from a Bank associated Automat. Not the random street ones. Yellow is not your fella and blue is not your Boo. Bring 100 in smalls for tips and such. IF for some reason you feel the need to use one of the ransoms, ALWAYS decline their conversion rate. Your personal banks rate will be better."}, {"username": "Crystal Waltz", "comment_text": "Two of us took 209 euro each. We also used our cards. For four days, I think that was a good amount."}, {"username": "Frank Dragna", "comment_text": "We took $2,000. And,\nHit the ATM three times. Loved the convenience of cash."}, {"username": "Sherry Held", "comment_text": "If you need Euros they have to be ordered from your bank. You need them for tipping, some transportation.\nMost restaurants take credit card. Just check with your credit cards to see if there are fees."}, {"username": "Stacie Iacopelli Bruce", "comment_text": "I went for 5 weeks, took 180€ with us, bit only because we had it left over from a previous trip. We used credit card nuat about everywhere. I don't think I even used it all."}, {"username": "Kim Douglas", "comment_text": "A lot"}, {"username": "Carmela Losavio Wiltshire", "comment_text": "Monzo or Revolut card ! also yes, cash is preferred in some places"}, {"username": "Guro Øsmundset", "comment_text": "We had 100 Euros in cash, family of five. The only time we needed cash was when we visited a market. Visa and MasterCard worked well all over the place, we visited many, different cities. 😊"}, {"username": "Ivon Alfaro", "comment_text": "Debit or Credit card. No need to take cash."}, {"username": "Michaela Andrew", "comment_text": "Troy Andrew"}, {"username": "Jenny Frank", "comment_text": "Lots"}, {"username": "Daniele Zarka", "comment_text": "Been here a month. Haven’t even used 100€ in cash. Apple Pay all the way for me."}, {"username": "John Wilson", "comment_text": "I get money from BNL bank machines in Italy in 400E increments as needed,as they’re common ATMs and I don’t pay extra fees when using their machine. I usually fly with 100 E in my pocket for beer and gum"}, {"username": "Antonio Rodrigues", "comment_text": "Antonio Rodrigues"}, {"username": "Paola De Tina", "comment_text": "We were a family of 4 and took 2 thousand Euros."}, {"username": "Maria Al", "comment_text": "We cashed out for 100 pounds and 400 euros for a family of four- 3 night in London and two weeks in Europe. We barely used any pounds but the euros was pretty perfect amount until my daughter got sick and we needed 250 euros cash for a Dr. We got that from an atm."}, {"username": "Christina Dunbar", "comment_text": "I only used credit card when there"}, {"username": "Kelly Johnson", "comment_text": "Always use an airline credit card for everything whether traveling or in the USA…collect miles."}, {"username": "Caroline Dombey", "comment_text": "Always wait until you arrive in any country to get best rate on local currency at ATM"}, {"username": "Theresa Sorrentino Pagan", "comment_text": "If you use your credit card fr￼om let’s say capital one( not debit card ) to take out cash, do you get charged a fee for a cash advance? isn’t that interest rate higher?"}, {"username": "Frank Hunt", "comment_text": "10,000"}, {"username": "Kathy Mansk-Billehus", "comment_text": "I used between my daughter and I about 300-400 in a week."}, {"username": "Juliet Lee", "comment_text": "Use the search 🔍 this has been asked lots of times - don’t take euros use a international travel card"}, {"username": "Alexandra A Welker", "comment_text": "It all depends on what you guys want to spend your money on. But you can start 100euro a day for small stuff but pay with CC for dining/shopping"}, {"username": "Shelagh Kosinski", "comment_text": "100 per day plus credit card"}, {"username": "Tony", "comment_text": "$1000 but better if you use cards"}, {"username": "Sonya Valentino", "comment_text": "Good question, what if your going for a month?? All accommodations and any tours we wanted are credit card paid. I’m assuming most food too."}, {"username": "Brenda Pittman Davis", "comment_text": "Cash"}, {"username": "Stacey Esposito", "comment_text": "Family of 4 for 11 days went through €1000. Just FYI cabs want cash. The little street vendors prefer cash but most of those will take credit cards. I know cabs are supposed to take credit but I didn't feel like arguing in a foreign country and just always made sure I had enough euros for cabs"}, {"username": "Anne Goodwin Benson", "comment_text": "Anyone use WISE?"}, {"username": "Jodi Discipio", "comment_text": "The cab drivers want cash so be prepared for that. I and my son ended up changing more money"}, {"username": "Rebecca Yeoh", "comment_text": "I went to Italy for 3 weeks in June and hardly used cash. The times I needed cash was for drivers/ transfers, purchasing souvenirs from market stalls and when I was in a remote village in Cinque Terre. Otherwise, everywhere takes card…even the toilets where you have to pay 1€."}, {"username": "Bob Short", "comment_text": "You can always get more at a bank ATM."}, {"username": "Fiona Ineson", "comment_text": "We got laughed at in some places for trying to pay with cash… cc is king now!"}, {"username": "David Sapienza", "comment_text": "ATM and credit cards. I don’t bring Euros."}, {"username": "Tara Dix", "comment_text": "People always go on about how much cash!?! Just take a little and then use your credit card!!"}, {"username": "Julia Bell", "comment_text": "We used 800 euros in 2 weeks for 4 people."}, {"username": "Charles Broussard", "comment_text": "You can also use an ATM therebut make sure it is at a reputable bank."}, {"username": "Deborah Coram", "comment_text": "I used 800 Euro for 5.5 weeks. I paid by credit card for most things and just cash for things that were cash only. Do the math on that it’s about $22 a day so 4-500 would absolutely cover you."}, {"username": "Dee Denise", "comment_text": "I brought $1,300 Euro and I feel like I’m going to have to exchange it back to usd for a 2 week stay"}, {"username": "Mark Spielman", "comment_text": "Take a few thousand, pickpockets will be enthralled"}, {"username": "Alison Wrobel", "comment_text": "Use credit card as much as possible. I’ve been here 2 weeks and only have used half of the 500 euros that we brought"}, {"username": "Ryan Shearer", "comment_text": "Family of 4 €250 a day so far."}, {"username": "Allie Waite", "comment_text": "Cindy Waite"}, {"username": "Anthony Bosco", "comment_text": "I’m with a family of four for two weeks now we brought about 800 euro… most places take credit but there are times you will want cash. One of the people with me just exchanged $200 for 128 euros at the train station. That’s a $60 service charge! That was today."}, {"username": "Lutfon Nahar", "comment_text": "We used cc and bought cash, which we used for tips. You need cash for tipping.. you can’t add it in the cc."}, {"username": "Anthony Sperduti", "comment_text": "Bring €1000 and get more there if you need it"}, {"username": "Andri McKenzie", "comment_text": "We took 200€ for a 9 day trip for a family of 4 and had to pay cash the last two days just to get rid of it, we could use out credit card in most places."}, {"username": "Ada Kr", "comment_text": "Lots of money it’s expensive everything"}, {"username": "Anita Reed Matchett", "comment_text": "I don’t think there is a one size fits all. Some people may spend more than others on items where it makes sense to pay with cash. Do whatever makes you feel comfortable."}, {"username": "Gary W Anderson", "comment_text": "Use credit cards mostly, they give the best conversion rates. DONT convert your money at the airport it’s a major rip off. Make copies of all important papers just in case of lose. Make reservations and get skip the line tickets NOW."}, {"username": "Nicoletta DiFranco Walsh", "comment_text": "Just got back. 1500 euros 6 people 10 days. 95% of places take a cc. We just used for tips. You get the best rate on your cc. It’s dangerous carrying all that cash"}, {"username": "Karen Schmidt", "comment_text": "I take about $500 to start, use me cc for restaurants, etc and get more cash from bank ATM’s as I go about my trip. Super easy. I also do the exchange at the airport just before I leave. It’s only a touch more, super convenient and they always have smaller bills available"}, {"username": "Chris Seymore", "comment_text": "We were in Greece last summer (family of 3) for 24 days. We brought 450 euros cash. Used credit cards for almost all transactions and withdrew cash from ATMs 2 times (withdrawing 200 per withdrawal).\n\nWe came home with 300 euros."}, {"username": "Renee Kremesec", "comment_text": "We took 2000 for 7 weeks\nUsed our CC all over europe"}, {"username": "Lisa Valdovinos", "comment_text": "There was two of us. We brought 500 and used our credit card as much as possible. We ended up getting more euros while we were there. If you get more while you’re there use an ATM connected to a bank."}, {"username": "Monica Roman-Fazio", "comment_text": "We took 2500 for 3 weeks my husband got more as we went at the post office ATM. We used the CC a lot."}, {"username": "Rodger Cravens", "comment_text": "You have all the euro you need at the ATM. Don't take any with you. Cards are acceptable most everywhere."}, {"username": "Jennifer Smith", "comment_text": "If you want some to not start off empty get enough for coffee and you taxi ride from the airport. After that I recommend your atm card. Make sure your bank doesn’t charge foreign transactions fees. If they do open an account where the fees are free. Also check your credit card. If it is issued by one of the big companies you will be ok. Regional and local banks often charge fees. You will need to notify your bank of the days that you will be out of the country so they don’t flag it as fraud. Also remember US is behind 7 hours so you will want to tell the bank the date of departure from the US not the date of arrival into Italy. There will be ATM at the airports. Choose to everything in euros and do not accept a conversion fee. If you get confused cancel and step through the process again."}, {"username": "Shardul-Neha Purohit", "comment_text": "100€ max…every single taxi, restaurant, shop takes CC…we took 1000 and it was way too much and you’ll be worried about theft"}, {"username": "Joannie Beiswenger", "comment_text": "My husband and I took 1200 for 2 weeks and came home with 300 that I cashed in. On our too all our breakfasts and dinners were included. Also all our tours too! Only had to pay for the excursion boat ride in Capri and Lake Como so you may want to take this into consideration ❤️It is the trip of a lifetime. Enjoy!"}, {"username": "Celeste Richardson-Foster", "comment_text": "Use credit cards or stop at an ATM if you need some euros."}, {"username": "Terry Pisano", "comment_text": "Bringing 500 for hubby and me for two weeks. Will use cc's for just about everything. I'm thinking 500 is more than enough and if we have leftover will just start using cash toward the end. I really don't want to come home with souvenir euros! Anyone think that's not enough?"}, {"username": "Melissa Hough", "comment_text": "We took $300 for a family of 5 and it was fine. Most Everywhere accepts cc. It’s also a better conversion rate using cc"}, {"username": "Emma Dowling", "comment_text": "We are a family of 4, we have spent 1250 cash and about 500 from debit card, in 10 days"}, {"username": "Sharon Krupp", "comment_text": "I would take $200 and then get it out as needed. Lots of cabs don’t take card and insist on cash only."}, {"username": "Lina Stump", "comment_text": "We take about a couple hundred euros with us on our person for a few days and then we just use our ATM card meaning our debit card and to get money daily or every few days"}, {"username": "Tam Wong", "comment_text": "Use American Express or travel card so they don’t charge a fee. Get cash there at atm it’s better then the banks in Us. Don’t exchange cash !!! Use atm !"}, {"username": "Loreen Hasenin", "comment_text": "Our driver in Venice to take us 2 people from airport to hotel and then back to airport 3 days later wants 300 euros or dollars cash . That includes boat also . Does this sound right ? Def has us bringing more cash !!!\nThanks"}, {"username": "Robin Barbera", "comment_text": "I was in Italy for 10 days and bought €200. Then go to the bank and get any more money. Just use my credit card for everything simple."}, {"username": "Bill Bowler", "comment_text": "Keep 300 on you each week. Likely more than enough."}, {"username": "Kelly Cannon", "comment_text": "ATM in Europe."}, {"username": "Stjepan Kujadin", "comment_text": "Depends where you go and what you like. Your questions is very individual"}, {"username": "Dan Pieri", "comment_text": "Cash is king!"}, {"username": "Michela Zanni", "comment_text": "I live in Italy and go around with 10/20 euros cash. I use only credit cards and bancomat to withdraw cash from ATM"}, {"username": "Kary LeBlanc", "comment_text": "Credit card for the past 2 years"}, {"username": "Tom O'Hara", "comment_text": "3k"}, {"username": "Kim Shea", "comment_text": "$800 cash and 2 credit cards kept in 2 different places."}, {"username": "Rick Pierangeli", "comment_text": "I was there for three weeks. Brought no Euros only used a no foreign transaction fee credit card for everything. Had no issues anywhere."}, {"username": "Jill Giura DeRamo", "comment_text": "We are a family of 4 and took 1000 in euros. We only used about $600 and We were there for 2 weeks. We used credit card most of the time."}, {"username": "Tony Indorato", "comment_text": "Take about 200. Use the ATMs to get money when needed. Credit cards work everywhere."}, {"username": "Liliana Shenton", "comment_text": "I used debit and credit cards the 2 month trip I was in Europe and only got cash out when I needed it to have as spare. Exchange rates are better on CC purchases and select no to conversion from euro as rates are better when converted by own banks. Daily amount depends on dining and spending preference. How many experiences are booked, transport, entertainment etc. I budgeted $100-150 euro for myself but I am not a saver 😂"}, {"username": "Erin Vizza", "comment_text": "We took about 200 euro then used ATMs as needed or credit cards"}, {"username": "Bijoy Krishnan", "comment_text": "Carry approx 3500 euro..that’s what you all need unless a lavish spender"}, {"username": "Paola Bobko", "comment_text": "Tourists get targeted in many places in Italy (especially big cities), therefore J would suggest not to bring too much cash. Credit cards are nowadays accepted everywhere. Revolut is a great option, I use it allow be the world, with the metal plan I can convert from/to every currency with no fees. Also when I travel, I just use Apple Pay and do not have credit cards on me."}, {"username": "Jose Velez", "comment_text": "ATH and credit card. Take out 100 euros from the atm for things not payable with card"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Just a credit card …. Even taxis many of them wanted cash, but when we said we didn’t have any, they took out the little credit card machine"}, {"username": "Richard Harris", "comment_text": "I'm taking 2000 euros for 2 weeks with my daughter. And $2000 for the ships casino lol. Use credit cards for big purchases"}, {"username": "Kim Geary Keidel", "comment_text": "We charged almost everything. Before the trip, I added up what euros i knew I would need. One private tour only accepted cash. Tips I would pay for the other tours we did. Tips for car service driver. Tips for lunch, dinner. Toilet use money. And I still didn’t take enough bc random things came up. I used a bank ATM as recommended here to get some more out. The key to me in knowing what to take was first to list out things I knew I would need cash for. (Some churches charge cash to come in. I hadn’t planned for that. Not many but some do.)"}, {"username": "D'Anna Sullivan", "comment_text": "Depends exactly where you are going and what you’re doing."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "FYI: There are bank affiliated ATMs (Bancomat) just past baggage claim at the airport."}, {"username": "Melissa McCormick", "comment_text": "We went with 7 and when we got to the airport took out 1000$ euros ( this ended up being 1080 in usd from our bank account) you have to decline the atm exchange rate and you will get your banks exchange rate. This is very important- if you do not decline it would be like 1300 usd or more from your bank account. When we would get close to running low on euros there were atm everywhere and we would take out in 500$ increments. If you use a credit card choose one with no foreign transaction fees."}, {"username": "Peter Doyle", "comment_text": "10k"}, {"username": "Katie White-Meade", "comment_text": "Are you going to, London? London is expensive."}, {"username": "Daisy Yoo", "comment_text": "we are going for 15 days and I am taking with me 360 euros and also have smaller changes, bc we tend to go to markets and eat street food or smaller places."}, {"username": "Erin Thomas", "comment_text": "My husband and I are budgeting €3500 for 2 weeks"}, {"username": "Meghan Kunza", "comment_text": "Depends on where you're going. My husband and I were in Italy for 9 days, u think we brought about €250 and had to force ourselves to spend it before we left. We only needed cash for a gondola ride, restaurant in Venice, and then a taxi in Rome, everywhere else took credit cards. If you do the cards, make sure you don't have any foreign transaction fees and pay in Euros."}, {"username": "Kimberly Ketterer Sedita", "comment_text": "We’re a family of 5 and brought 2300 euros for two weeks. So far so good."}, {"username": "Bjarne Stokseth", "comment_text": "None..paid everything with visa."}, {"username": "Rachael Richardson", "comment_text": "I took €750 and drew out more when needed towards the end - a lot of places love cash, used a travel money card as well"}]}, {"id": "2204053513327060", "text": "Hi! Can anyone please recommend a couple of the best priced hotels in Rome? I’m looking at 4 nights with my family of five, thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204053513327060/", "likes": 1, "comments": []}, {"id": "2204048739994204", "text": "Is anyone visiting Sicily right now? I’m having difficulty finding information that isn’t four or five days old regarding how things are going there now.￼. My incoming flight to Catania has been canceled every day since July 16 but of course they always show on time for tomorrow.￼ Official reports claim things should be back to normal by the end of this week, but I saw a report on television that really makes that seems highly unlikely. ￼\n\n￼ Any first-hand information would be greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2204048739994204/", "likes": 2, "comments": [{"username": "Rip Lonergan", "comment_text": "Here is part of what concerns me regarding the lack of transparency. All the information I can find shows cancellations through July 26 and then it just shows upcoming flights are on time. ￼"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204047866660958", "text": "I have booked a ticket from Sorrento to Rome through the Trenitalia website for mid-August. I have a short window to connect from the Napoli Piazza Garibaldi terminal to Napoli Centrale. I do realize that Centrale is in the same building and one floor higher. Can I hop on an earlier local train from Sorrento with my existing ticket or will that be an issue? or try to contact Trenitalia?", "link": "facebook.com/groups/1373361046396315/permalink/2204047866660958/", "likes": 1, "comments": []}, {"id": "2204018319997246", "text": "If you only had time to visit one: Pompeii or Herculaneum- which would you choose and why?\n\nDo I need a tour guide or is the Rick Steve’s audio enough? Are they easy to get to with public transportation or do I need a driver ?", "link": "facebook.com/groups/1373361046396315/permalink/2204018319997246/", "likes": 1, "comments": [{"username": "Aaron Peterson", "comment_text": "Herculaneum less tourists you sometimes almost have the place to yourself"}, {"username": "Gerson Mendez", "comment_text": "I went to both a couple of weeks ago. I’d recommend to try to do both. If you can’t then do Herculaneum and definitely pay for a guide. You would miss so many of the important details without a guide. I took the train and travelled by myself. It was very easy to get around"}, {"username": "Karen Schofield", "comment_text": "Herculaneum is better preserved. Pompeii is bigger.\n\nI’m glad I went to both as I was trying to convince husband to just ‘do’ Herculaneum, but he won in the end.\n\nI would recommend H first, then Pompeii. If no time, only Pompeii with a guide."}, {"username": "Dave Conroy", "comment_text": "Is it the same train to both sites or different lines? I have a train to Pompeii booked, but if my energy is low that day, I can hop off at Herculaneum instead."}, {"username": "Beth Casey Murphy", "comment_text": "I had a hard time following Rick Steves audio tour. There was construction going on at the time. I would hire a guide"}, {"username": "Bambi Harris", "comment_text": "We are staying in Pompeii so we can see both. It's not like we will be in the area a lot in our lives so we don't want to miss either <3"}, {"username": "Miyuki Kanno Paul", "comment_text": "How much time do you have?\nPompeii is HUGE. If you have more than a couple hours to explore, it’s your place.\nErcolano a.k.a. Herculaneum is much smaller but well preserved. A different type of pyroclastic surge buried and preserved once a wealthy seaside town.\n\nIt’s comparing an apple to an orange. I personally love Ercolano"}, {"username": "Sue Sherwood", "comment_text": "We loved Pompeii!!"}, {"username": "Bronwyn O", "comment_text": "At Pompeii you can also buy a guide book that talks about most of the sites. It also provides a few different tour paths to follow depending on how much time you want to spend. We spent nearly 6 hours at Pompeii and didn’t get to all of it; would have loved the Herculaneum also, but, there could still be a next time."}, {"username": "Ann Law", "comment_text": "I would visit Pompeii. The town is all spread out with great vistas around it. Vesuvius is in the distance. Pompeii is open and not surrounded by a modern town.\nBoth are a wonder to behold."}, {"username": "Henry Ratliff", "comment_text": "Pompeii"}, {"username": "Angela Voelker", "comment_text": "Pompei was massive and amazing to behold. Need a guide to get the best experience imho."}, {"username": "Kelly Siegmann", "comment_text": "Pompeii blew my mind!!"}]}, {"id": "2204043476661397", "text": "I’m looking for a apartment/house for June next year for a week. Preferably countryside/ pool kitchen and aircon.\nAny suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2204043476661397/", "likes": 1, "comments": [{"username": "Rosie Crouch", "comment_text": "Make sure there’s room for +2 🤣"}]}, {"id": "2204044999994578", "text": "What should I put on the list between Pescara and Rome for two day trip?", "link": "facebook.com/groups/1373361046396315/permalink/2204044999994578/", "likes": 1, "comments": [{"username": "Jojo Terencio", "comment_text": "Side trip to Firenze!"}]}, {"id": "2204042083328203", "text": "When your Dove chocolate wrapper sends you a clear message! 🤣 okay I added to it…", "link": "facebook.com/groups/1373361046396315/permalink/2204042083328203/", "likes": 57, "comments": [{"username": "Sharon Long", "comment_text": "Haha! Perfect! You have to listen to Dove! 😉"}, {"username": "Inbal Graham", "comment_text": "Listen to the wisdom!!!!"}, {"username": "Alessandro Iannelli", "comment_text": "chocolate never lies."}, {"username": "Kathie Duffy", "comment_text": "👍🏼👍🏼👍🏼"}, {"username": "Lucìa NJ Briar", "comment_text": "Lillian Hoilman-Briarr"}, {"username": "Lisa Abrams Argento", "comment_text": "Lisa Abrams Argento"}, {"username": "Keri Davis Frady", "comment_text": "I have this one on my desk at work ❤️"}, {"username": "Sharon Heberlein", "comment_text": "Go, go, go!!’"}, {"username": "Angela Perky Perkins", "comment_text": "Love it! ❤️"}, {"username": "Judy Carey", "comment_text": "That would make a great tattoo to get when you're there!"}, {"username": "Jen Alexitch Rachow", "comment_text": "I did book this one not too long ago 🥰"}, {"username": "Miriam Negrón", "comment_text": "💃"}]}, {"id": "2204041266661618", "text": "Hi! We are taking a cruise out of Rome and staying in Rome the night before. What’s the cheapest and easiest way to get to Rome to the port? Train? Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2204041266661618/", "likes": 0, "comments": []}, {"id": "2204037723328639", "text": "I am looking at taking a ferry from Sorrento to Positano. Is there a particular website that is the best to use? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2204037723328639/", "likes": 0, "comments": []}, {"id": "2204037413328670", "text": "Hello. How much can I expect to pay for a taxi from FCO to Vaticano Prati hotel? Any information and recommendations appreciated! Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2204037413328670/", "likes": 0, "comments": []}, {"id": "2204037246662020", "text": "Hi\nMy husband and I are planning to go to Alfami coast on April. We wanted to stay in a room with a spectacular view. Any suggestions?\nthank you", "link": "facebook.com/groups/1373361046396315/permalink/2204037246662020/", "likes": 8, "comments": [{"username": "Gail Holler", "comment_text": "LUNA convento."}, {"username": "Denise Curtis", "comment_text": "Marincanto Hotel"}, {"username": "Augusta Barna", "comment_text": "You mean Amalfi?"}, {"username": "Maria Theresa", "comment_text": "Hotel Poseidon in Positano"}, {"username": "Brooke Williams", "comment_text": "We had an amazing view from our balcony in Positano! Alcione residence."}, {"username": "Stacy Derouin", "comment_text": "We adored our hotel in Amalfi town, the Luna Convento. Beautiful views!"}, {"username": "Vivien Paulik", "comment_text": "Amalfi? Sorrento was so beauty"}, {"username": "Sherryl Spencer", "comment_text": "Hotel California in Positano. Great view"}, {"username": "Theresa Sorrentino Pagan", "comment_text": "Amalfi is just as beautiful and a lot less money. You can go to Positano for the day."}, {"username": "Jihan Adem", "comment_text": "💯 Grand Hotel S’Orsola in Agelero - Amalfi is like a sardine tin"}, {"username": "Elizabeth Kendall Nguyen", "comment_text": "Le Agavi in Positano. There is nothing like it!"}]}, {"id": "2204036133328798", "text": "Hi\nMy husband and I are planning to go to Alfami coast on April. We wanted to stay in a room with a spectacular view. Any suggestions?\nthank you", "link": "facebook.com/groups/1373361046396315/permalink/2204036133328798/", "likes": 0, "comments": []}, {"id": "2204035539995524", "text": "Our VRBO in amalfi has ghosted us. Looking for any hotel /\nvrbo recommendations that you've had experience with. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2204035539995524/", "likes": 1, "comments": []}, {"id": "2204033963329015", "text": "We are staying 2 nights on Rome before out cruise.... Will we need an adapter for the outlets in the hotel room in order to charge or phones?", "link": "facebook.com/groups/1373361046396315/permalink/2204033963329015/", "likes": 0, "comments": []}, {"id": "2204033856662359", "text": "Hello!\n\nI will be flying into Naples in September. Is it worth driving in Italy?\nWe are going to amalfi coast, hopefully Rome and Venice. Just wondering if anyone here has drove and how was the experience driving and parking.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204033856662359/", "likes": 1, "comments": []}, {"id": "2204032623329149", "text": "Hi everyone, I’m off to Rome in December and I was wondering if anyone knew of a good company for transfers to airport / accommodation?", "link": "facebook.com/groups/1373361046396315/permalink/2204032623329149/", "likes": 0, "comments": []}, {"id": "2204031446662600", "text": "I have had many hits and misses on dining this trip, and tomorrow I arrive in Assisi and am desparate for very good food and entertainment, no matter the price. Can someone recommend a good dinner spot?", "link": "facebook.com/groups/1373361046396315/permalink/2204031446662600/", "likes": 0, "comments": []}, {"id": "2204030619996016", "text": "I know Florence has some fabulous leather shops but what are the best ones in Rome? Looking for bags and gloves for gifts.\nWould also love to get some cashmere scarves but not sure how to get the real thing.", "link": "facebook.com/groups/1373361046396315/permalink/2204030619996016/", "likes": 1, "comments": [{"username": "Gysje Lyons", "comment_text": "Take a day trip to Florence by fast train. I found there was a lot more stores and variety of leather goods with cheaper pricing."}]}, {"id": "2204029673329444", "text": "Hi all. Looking for suggestions on places to stay when we first arrive. Flying into Milan and will be picking up a hire car. We'd like to drive about 1 hour-ish in the direction of Pisa. Any suggestions of towns or hotels? It's just really somewhere to sleep before getting back on the road in the morning to get to Pisa (and meet up with family). Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2204029673329444/", "likes": 2, "comments": []}, {"id": "2204029386662806", "text": "Should I visit the hot springs in Saturnia? Staying in Tuscany for a few days relaxing.", "link": "facebook.com/groups/1373361046396315/permalink/2204029386662806/", "likes": 1, "comments": []}, {"id": "2204026893329722", "text": "We are finishing our wedding in Orvieto 9/13 and don’t fly out of Rome until 9/19. Where would be a good spot or spots to checkout for a honeymoon?", "link": "facebook.com/groups/1373361046396315/permalink/2204026893329722/", "likes": 1, "comments": [{"username": "Aubrey Poindexter", "comment_text": "Following !!"}]}, {"id": "2204023779996700", "text": "Best places to buy leather bags, boots & jackets in Italy ??", "link": "facebook.com/groups/1373361046396315/permalink/2204023779996700/", "likes": 4, "comments": [{"username": "Scott Perry", "comment_text": "Florence"}, {"username": "Ada Kr", "comment_text": "Sorrento as I’m here it’s factory and I got some amazing staff"}, {"username": "Joy Atkinson", "comment_text": "Definitely in Florence, but shop around. Some shops can be cheaper than the Markets. Weirdly a bag I priced in Florence (made in Florence) was cheaper in Venice."}, {"username": "Craig Laing", "comment_text": "Love Italy 🇮🇹 ❤️"}, {"username": "Julie Dunleavy-Corcoran", "comment_text": "Can’t wait!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204018173330594", "text": "Best place for Louis Vuitton bags.", "link": "facebook.com/groups/1373361046396315/permalink/2204018173330594/", "likes": 111, "comments": [{"username": "Charles Broussard", "comment_text": "On the streets of NYC.\n1/2 price! Lol"}, {"username": "Lucy Wright", "comment_text": "On your shoulder! 🤷🏼‍♀️"}, {"username": "Blessy John", "comment_text": "QQ: hi any inputs for channel bags?"}, {"username": "Rose Cianci Gallucci", "comment_text": "The actual prices of designer bags are the same across the world. Depending on the dollar exchange - it may appear to be cheaper. Also you are not paying the taxes that we are mandated to pay in our states - so it would appear to be cheaper."}, {"username": "Craig D'Onofrio", "comment_text": "Kristin Carr D'Onofrio"}, {"username": "Yogita Jani", "comment_text": "Just got lv bag from Paris $300 less then USA 💃💃💃"}, {"username": "Susan Janssen Harshell Stokley", "comment_text": "Paris France"}, {"username": "Joanne DiPego Aiello", "comment_text": "Hawaii if you are from the U.S."}, {"username": "Mahmood Khalil Shaikh", "comment_text": "Best place is duty free Louis Vuitton at Heathrow airport . You don’t have to go thru the hassle of tax refund , commissions etc"}, {"username": "Andrew Hahn", "comment_text": "Temu? LV Shanghai? 🤣🤣"}, {"username": "Melisa Doyon", "comment_text": "There are beautiful and elegant bags created by so many in Italy that you may forget about LV.\nYou may notice that you won’t see LV as much across Europe.\nLook into Bottega."}, {"username": "Michael Spiekermann", "comment_text": "Chinatown."}, {"username": "Debra McCarthy Aberdale", "comment_text": "Italy"}, {"username": "Jaya Narwani-Choksi", "comment_text": "Florence"}, {"username": "Cindy Prosser", "comment_text": "On Que Style ! https://\nonquestyle.com/"}, {"username": "Graham C. Eccleson", "comment_text": "Bologna"}, {"username": "Rumon AndFriends", "comment_text": "It’s silly - those who buys Porsche or Lamborghini doesn’t really worry about gas prices.\n\nIf budget is an issue, One can choose much better quality leather & making with personalized logo / initials for 1/3 of the prices in Italy\n\nFrankly, what is the point of paying a premium prices for marketing for someone else’s logo"}, {"username": "Denise M. Gianuzzi", "comment_text": "Rome airport"}, {"username": "Iva Smiljan", "comment_text": "Iva Smiljan"}, {"username": "Israa Abodoma", "comment_text": "The have no outlets, I guess but there are shops in Milano, Rome, Padova and other cities. MacArthur Glenn Designer outlet has many brands but not LV."}, {"username": "Kristen Michele", "comment_text": "Anthony Nunez"}, {"username": "Gillian MacLean", "comment_text": "Capri"}, {"username": "Nancy Dunn Mercer", "comment_text": "France."}, {"username": "Lisa Solary Jacoby", "comment_text": "Charles Jacoby"}, {"username": "Jan Schiffner", "comment_text": "Hong Kong! Without a doubt"}, {"username": "Marcy Julvezan", "comment_text": "VAT tax refunds are a racket! Signs at CDG direct you to non-existent kiosks for your refund. I’ve been duped enough. If you end up finding a kiosk, there’s no one staffing it and or no forms. Complete and utter racket!"}, {"username": "Destined DivaDee Watson", "comment_text": "How about Venice?"}, {"username": "Lawrence J Morello", "comment_text": "Trash?"}, {"username": "Rita Cuoco-Ortiz", "comment_text": "Rome airport Duty Free"}, {"username": "Jessica Alexander", "comment_text": "Rome!"}, {"username": "Mark Wellard", "comment_text": "Fairfield Markets"}, {"username": "Marie Cole", "comment_text": "Paris. Lol"}, {"username": "Sam Mmy", "comment_text": "Istanbul"}, {"username": "Lisa Powers", "comment_text": "France"}, {"username": "Hilary Brinlee", "comment_text": "I bought one at the Lv store in Rome 🥰"}, {"username": "Debbie Costigan", "comment_text": "Louis Vuitton!"}, {"username": "Loredana Polichetti", "comment_text": "In Italy you must buy Gucci, Prada, Elisabetta franchi etc 😅"}, {"username": "Nissa Nolan Foster", "comment_text": "the best place is the boutique that will have what you want in the store. Check in advance, make a booking with an SA if you can."}, {"username": "Rose Wolschlager Hinman", "comment_text": "On my shoulder 🤣🤣"}, {"username": "Laura Walter Triola", "comment_text": "France"}, {"username": "Gigi Robinson", "comment_text": "🇫🇷 France"}, {"username": "Nicole Lawton", "comment_text": "If you buy a LV in Paris can you get the VAT back in the store? I’m taking the train to the UK and then flying out from there."}, {"username": "Kathryn Duncan Bianchi", "comment_text": "Paris"}, {"username": "Craig McGhie", "comment_text": "Over your shoulder"}, {"username": "Andrea Romano", "comment_text": "Be careful of counterfeits"}, {"username": "Vadim Gotovsky", "comment_text": "Canal street in NYC. You can get it under $100"}, {"username": "Diane Joy Sisemore", "comment_text": "Paris for LV.\nItaly- Valentino, Gucci, Ferragamo"}, {"username": "Rose Man", "comment_text": "I’m going to go out on a limb here and say the Louis Vuitton store"}, {"username": "Julienne Bourgeois", "comment_text": "Real or “real”?"}, {"username": "Clarence Giordano", "comment_text": "New York !!!"}, {"username": "Soumita Dhole", "comment_text": "Soujit Baug"}, {"username": "Jane Anne Herkins", "comment_text": "Yes, Venice and Florence have great LV stores with much cheaper prices!"}, {"username": "Tracy Callahan Pesavento", "comment_text": "Airport in Rome"}, {"username": "Alex M Hdez", "comment_text": "Milan then apply for the tourist credit on taxes wait 12hrs then at the airport or any Global blue office get your refund back to the CC you’ll save another 18%"}, {"username": "Axelle Catherine", "comment_text": "At any Louis Vuitton shop !"}, {"username": "Donna O'Malley", "comment_text": "Can you find them in Florence?"}, {"username": "Sarah Chapman", "comment_text": "Stacey Nicholas Sandy Jenaway Passmore Louise Hocknull"}, {"username": "Wendy Ross", "comment_text": "Paris, of course!"}, {"username": "Carrie Jendrasheske", "comment_text": "Renee Dawn💕👍"}, {"username": "Edmond Nolan", "comment_text": "Milano"}, {"username": "Marina Trainor", "comment_text": "Bella"}, {"username": "Joyce Warwick", "comment_text": "Make sure you leave plenty of time to do this at the airport. Like maybe an hour."}, {"username": "Andrea Shelton", "comment_text": "Louis Vuitton."}, {"username": "Graham Hyde", "comment_text": "Dustbin"}, {"username": "Isidro Delgado Sanchez", "comment_text": "La pulga"}, {"username": "Lisa Rizzo Ozmon", "comment_text": "So back to best place. Flagship in Milan?"}, {"username": "Beckie Yang", "comment_text": "Anyone going thru VAT to get the money back, you have to have the item to show, also paperwork done by the store.\nThe line at the airport for VAT was super long so you need to count the time before boarding."}, {"username": "Miklos Verdes Kovacs", "comment_text": "Luizvutton factory 🤔"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Yes it is great to buy a designer bag on holiday . But please remember the bag you buy at your local upscale store- the money stays in the community employs people in your community …"}, {"username": "Lisa Rogers", "comment_text": "Fb marketplace !!!"}, {"username": "Brenda Fuqua Rice", "comment_text": "F"}, {"username": "Shelly Stowell", "comment_text": "Every day. Every day we talk about this. Read some of the posts from yesterday. You’ll find all you need to know."}, {"username": "Marc Wenzel", "comment_text": "In Napoli at LV we bought a bag which was 100 Euros cheaper than on the LV webpage."}, {"username": "Kevin Alarid", "comment_text": "France"}, {"username": "Donna Parrish", "comment_text": "Paris! It’s a French brand!!"}, {"username": "Fei Dadulla Miranda", "comment_text": "I'd like to get me a Gucci 👜 when we go. Hopefully I find a style I like😉"}, {"username": "Carlijn Dijkstra", "comment_text": "LV store Verona"}, {"username": "Alfonso Camarena", "comment_text": "Lois Vuitton store , in Rome , Fierenze Venezia"}, {"username": "Stacy Christman Ticali", "comment_text": "At rome airport or in rome"}, {"username": "Marianne Bartolotta", "comment_text": "Flea market who cares if they’re ￼￼￼ knock off."}, {"username": "MyTrinh Tammy Nugen", "comment_text": "France not Italy"}, {"username": "Michele Rossman", "comment_text": "Went to LV in Rome yesterday (via condoti). The neverfull tote I was looking at was $600 less (but in euro) but still cheaper plus will get tax back."}, {"username": "Rosanna Hardeman", "comment_text": "Louis Vuitton Boutiques."}, {"username": "Dana Ioana Baias", "comment_text": "On the beach !"}, {"username": "Kelly Peagler Myers", "comment_text": "Shawnna Chance"}, {"username": "Kimberly Trutnau Zitek", "comment_text": "What is the best store in Rome to go to it looks like there is three?"}, {"username": "Gabby Gomez-Parra", "comment_text": "Milan near Galería and Duomo"}, {"username": "Christel Callebaut", "comment_text": "In Belgium 🤔"}, {"username": "Christel Callebaut", "comment_text": "In Belgium 🤔"}, {"username": "Debi Sicurella Krulisky", "comment_text": "France!"}, {"username": "Heidi Littman Meiers", "comment_text": "How do you know they're real ... like do places other than an LV store sell them ? I'm from US and you never know ... sadly sometimes LV store has been know to sell a fake ( likely a fake return but still ..)"}, {"username": "Fernanda Allen", "comment_text": "The EU market is about 25% cheaper than prices in the US, plus no US sales taxes added (depending on the US State). In Europe, if you have your NON-EU passport ( US, Brazil, Mexico, Canada ,etc) you can have the TAX ( VAT tax ) back. The tax in France is higher than tax in Italy.. so it will be cheaper buying your LV in Paris."}, {"username": "Neal Bainto", "comment_text": "Gallery Lafayette, Paris"}, {"username": "Eman Muneer Daoud", "comment_text": "Paris is way cheaper than the Middle East plus the tax free refund\nYes it’s cheaper than Italy as well\nThat’s why u see the long queue in front of Louis Vuitton store In champ Elysee in Paris\nI found my bag 400 Euros cheaper in Paris than Dubai"}, {"username": "Jill Rosenfeld", "comment_text": "I bought a bag that sells in us for 2300 and after the discount and bat it was 1500. The euro was very good though. Not sure about now"}, {"username": "Karina Stampe Kvorning", "comment_text": "The flagship store in Paris!\n\nhttps://\nmaps.app.goo.gl/\nLF2qdAA8c1ziAyFJ\nA?g_st=ic"}, {"username": "Lisa D Long", "comment_text": "France"}, {"username": "Lillian Baca", "comment_text": "I wasn't able to get my VAT refund at the airport, does this have an expiration date? Have to get the VAT stamp next time I travel to Europe."}, {"username": "Katherine Canapini", "comment_text": "Florence has a great Louis and Gucci store and yes they are a much better deal than here. They also will prepare all the VAT tax forms for you so you just need to go to kiosk at the airport and give them the forms."}, {"username": "Jackie Demara-Caro", "comment_text": "Airport"}, {"username": "Diane Talarico", "comment_text": "what is the name of the store on Florence that sells designer bags?"}, {"username": "Lynne Rizzuto Iati", "comment_text": "LV Rome airport. Only LV duty free store in the world.\nI bought a neverfull mm for about $800 less than US retail price. No tax paid so don’t need to worry about VAT refund."}, {"username": "Heena Chawla", "comment_text": "Are there any designer outlet centres near Rome or Florence"}, {"username": "Louise Gualtieri Wilkins", "comment_text": "What about Chanel?"}, {"username": "Katie White-Meade", "comment_text": "Love a Neverfull"}, {"username": "Tam Wong", "comment_text": "What part of Italy are you in?"}, {"username": "Ellie Hwong", "comment_text": "I’ve shop in Rome and Venice, all very nice esp the Venice one. They will make you wait for an SA so it’s about 30mins while you browse around. You’ll spend min 1 hr there. Bring your original passport to get the VAT refund. A copy will not do."}, {"username": "Steven Shannon", "comment_text": "Milan"}, {"username": "John Wilson", "comment_text": "London"}, {"username": "Raymond Capkin", "comment_text": "Waste of $$$$$"}, {"username": "Nikki Blosser", "comment_text": "The actual Louis Vuitton store"}, {"username": "Maria Angela Perrone", "comment_text": "In Roma? Al mercato di Trastevere"}, {"username": "Tom O'Hara", "comment_text": "France. Or Switzerland."}, {"username": "Tom O'Hara", "comment_text": "Switzerland is cheapest, and our VAT is only 7.7%!\n\nRule #1, in Switzerland, cheap stuff is expensive, and expensive stuff is cheap!"}, {"username": "John Borgia", "comment_text": "Paris"}, {"username": "Maryann Stacey", "comment_text": "Hi everybody,\nI keep hearing mixed responses about where to buy an LV bag. Some say Milan (where I’m heading now) and some say Paris, where I’ll be next week! Is there any concrete proof/\njustification one can explain about which is the better refund?\nThank you 🙏🏼"}, {"username": "Danelle Tené Naidoo", "comment_text": "Sandra Naidoo"}, {"username": "Lisa Martinson", "comment_text": "China town NYC…😉"}, {"username": "Marianna Gadayev", "comment_text": "Rome airport"}, {"username": "Virgz Van Møøre", "comment_text": "Paris 😂"}]}, {"id": "2204018083330603", "text": "Hello all! Just wondering if anyone has taken the train from Interlaken to Venice?\n\nHow was it? Was it possible to do an overnight train? Is it worth it?\n\nWe are okay with a long train ride as long as it’s pretty and worth it!", "link": "facebook.com/groups/1373361046396315/permalink/2204018083330603/", "likes": 15, "comments": [{"username": "Donna Dougherty", "comment_text": "Last week we took the train from Venice to interlaken. Was not long at all"}, {"username": "Donna Dougherty", "comment_text": "Interlaken is gorgeous!! Wish I skipped Venice and stayed longer in Interlaken"}, {"username": "Krissy DaRusso", "comment_text": "No, but I went from Lauterbrunnen to Venice. Since I was traveling alone I broke up the trip by staying in Milan, but I could have continued right onto Venice. I didn’t want to arrive in a place I had never been in the evening alone."}, {"username": "Gary W Anderson", "comment_text": "I’ve read that it is amazingly beautiful. We loved Interlaken and visited Venice but on different trips, no train ride between, do love the trains in Europe."}, {"username": "Bea Kuckens", "comment_text": "We took the train in the opposite direction: Venice to Spiez via Milan. From Spiez it's a very short, local train to Interlaken. The scenery was beautiful, although as always there are tunnels through the mountains. I wouldn't take a night train: 1) You miss the amazing scenery 2) For me, it's difficult if not impossible to sleep on a train due to the motion."}, {"username": "Gillian O'Callaghan", "comment_text": "I looked at this trip but changed my itinerary. Have a look on the Rome2Rio app as there's some different options for trains and an overnight bus."}, {"username": "Pirkko Storer", "comment_text": "Also on night trains you have to be careful not to get robbed. This has happened to me long time ago travelling from Switzerland to Rome."}, {"username": "Rosslyn Patience", "comment_text": "If you take an overnight train and have a bed make sure you lock the door with both locks."}, {"username": "Catherine Nichols", "comment_text": "We took the train/s from Interlaken to Monterosso. Was about 4 different trains changing at various platforms. Took from 7:30 til 3:15 but went quite smoothly even with short change times. I agree with not going overnight as you’ll miss the nice scenery."}, {"username": "Nicola Morgans", "comment_text": "I've taken two overnight trains very safe great experience"}, {"username": "Krystal Apolinaro", "comment_text": "My son did the train from Venice to Zurich. He said it was long but totally fine."}]}, {"id": "2204017906663954", "text": "We're thinking of adding Parma to our trip next year. Suggestions appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2204017906663954/", "likes": 1, "comments": [{"username": "Mario Giberti", "comment_text": "Would suggest pancetta also. LOL. Have a great trip!"}]}, {"id": "2204017773330634", "text": "Hi! My daughter, a friend and I will be in Italy March 2024 and have a few days & nights to fill between Venice and Rome. I’d love suggestions on a city to spend our time in those days. We’ll be traveling by train. Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2204017773330634/", "likes": 2, "comments": [{"username": "Scott Perry", "comment_text": "Bologna is terrific!"}, {"username": "Bev Madill", "comment_text": "Florence or Bologna."}]}, {"id": "2204016476664097", "text": "I need some advice. We are planning a trip to Italy for 25 days in October. We fly into Milan. I am trying to create a logical itinerary to visit the following places. Lake Como; Lake Garda/Dolomites/Verona; Venice; Bologna; Cinque Terra; Tuscany Wine Country; Puglia. I can't figure out a logical order. We prefer to travel by train or privateआणखी driver. We will probably need to end up in Rome or Milan to fly to Amsterdam. We have already spent a week each in Rome, Florence, and Sorrento on previous vacations. I appreciate any feedback and the best cities to make our home bases in each area.", "link": "facebook.com/groups/1373361046396315/permalink/2204016476664097/", "likes": 1, "comments": [{"username": "Darlene Woolson", "comment_text": "Awesome‼️"}, {"username": "Nancy Brubaker", "comment_text": "Enjoy!!"}, {"username": "Nancy Brubaker", "comment_text": "How exciting!!"}]}, {"id": "2204015319997546", "text": "Hi, I am looking for an idea on all inclusive resorts in Italy? if anyone been to any, would appreciate a suggestion please?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2204015319997546/", "likes": 1, "comments": []}, {"id": "2204005323331879", "text": "Hi\nGoing for a full experience colosseum tour tomorrow. I know backpacks are not allowed but are there any storage lockers to store your belongings ? If yes, is there a line up for it ?", "link": "facebook.com/groups/1373361046396315/permalink/2204005323331879/", "likes": 0, "comments": []}, {"id": "2204002649998813", "text": "Any good resturant apps or is yelp reliable for choices", "link": "facebook.com/groups/1373361046396315/permalink/2204002649998813/", "likes": 0, "comments": [{"username": "Laura DeCicco", "comment_text": "The fork"}]}, {"id": "2204001896665555", "text": "San Gimignano or Sienna for a day trip from Florence and why\nOr can both be done ?", "link": "facebook.com/groups/1373361046396315/permalink/2204001896665555/", "likes": 20, "comments": [{"username": "Laura McGaughy Mims", "comment_text": "We did both in one day."}, {"username": "Hilary Christo", "comment_text": "Yes- both in same day trip- Viator!"}, {"username": "Jonathan Wimmer", "comment_text": "This is a wonderful tour that covers both cities and a winery with lunch. It was Perfect!\n\nhttps://\nprestigerent.com\n/tour/\nsmall-group-tour\n-to-siena-san-g\nimignano-and-th\ne-tuscan-countr\nyside-from-flor\nence/"}, {"username": "Laura Uribe", "comment_text": "We stayed in San G for four days. Our room looked over the main square. Many things to do and see. Had to park outside the city wall in one of several lots. Good luck finding a spot. Had to wait for one car to leave before you could get in. Many restaurants and shops inside. Did a wine tasting just a ten minute ride away and we were the only ones there. Sienna was also great. No cars in the city center but allowed in the outskirts. A very large town with a lot to do. The main square is where to be. Soooooo many shops and things to do. You can do both if you get started early. Have fun."}, {"username": "Michael Imbelli", "comment_text": "Choose one and enjoy the experience. Don’t try to do too much by visiting both places in a day."}, {"username": "Nikki Blosser", "comment_text": "Both can be done"}, {"username": "Josie Moraca", "comment_text": "Love Sienna"}, {"username": "Francesco Ronchi", "comment_text": "Consider San Galgano too"}, {"username": "Dena Brookhart Whitener", "comment_text": "Donna Wood Robbins Lisa Zink Krebs Barbara Lipsky Nicki Cole Robin Gautney Claudia Pullen Cook"}, {"username": "Marina Rokhman", "comment_text": "Sienna but both if can do both on different days. Sienna is a beauty and you want time to explore."}, {"username": "Angela Abbate Karklin", "comment_text": "We did both in one day and a fantastic winery!!"}, {"username": "John Bruckman", "comment_text": "You can do both easily"}, {"username": "Jan McLachlan", "comment_text": "Both can be done in one day"}, {"username": "Carol Jones", "comment_text": "https://\noutsidethissmall\ntown.com/\ntuscan-winery-ex\nperience/\nThis is the best lunch experience we have had. Both of the above cities are wonderful hard to choose. But you should check this winery out."}, {"username": "Angela Emmitte Tripp", "comment_text": "You can do both in one day\nBut if you have to choose\nSan Gimignano"}, {"username": "Rick Weingart", "comment_text": "Siena has more to offer including the beautiful cathedral...But\nSan Gimignano has those magnificent towers...❤️ 🇮🇹"}, {"username": "Eva Ferrell", "comment_text": "San Gimignano was my fav far and away!"}, {"username": "David King", "comment_text": "Yes!\n\nWhen we did it, we did both, as well as two other towns in one day—met our driver at 7am to get the drive started, but nothing was open in San Gimignano before 10.\nLunch was in Siena at Cafe Fonte Gaia, at the center of town on Piazza del Campo… perfect day!!!"}, {"username": "Tony David Rossi", "comment_text": "Spend as much time as you can in Sienna! There’s so much to see and do."}, {"username": "Vivien C N Le", "comment_text": "I saw both in one day. It's doable and well worth it."}, {"username": "Rick Schneider", "comment_text": "Both great ! Sienna a little better and bigger."}, {"username": "Colleen Sommerin", "comment_text": "If you can only do one, definitely San Gimignano"}, {"username": "Rhonda Hope", "comment_text": "You can do both"}, {"username": "Suzanne Mills", "comment_text": "Lucca"}, {"username": "Sue Gelardi", "comment_text": "You can do both. Hire a private guide. Marco@toursinTu\nscany.com."}, {"username": "Andrea Paquette Haber", "comment_text": "We’re staying in San Gimignano. If we get to Florence, we get to Florence. 🤷🏻‍♀️"}, {"username": "Angelina Ciach", "comment_text": "Olivia Alessi"}, {"username": "Milana Bubis", "comment_text": "Both in 1 day is very doable"}, {"username": "Rebecca Yeoh", "comment_text": "In a day I went to both Siena and San Gig (plus lunch at a winery). Was one of my fav days on the whole trip. Loved it!!"}, {"username": "Lina Costantino Sirianni", "comment_text": "You can do both - they are close by"}, {"username": "Alicia Belculfine Lefkowitz", "comment_text": "We visited both & hands down wished that we had spent more time in San Gimignano. (Family of 4 with a 12 & 15yo for context)"}, {"username": "Barbara Bastianini", "comment_text": "I love both San Gimignano and Siena & have stayed in both. But my honest opinion is that if you go to both in one day you won’t see either one very well.\n\nBut, yes, logistically you can get to both on a one day trip. But everyone’s different so only you can know if a rushed, superficial overview of two wonderful places is worthwhile. For me anything worth traveling to see is worth seeing well so I’d feel cheated with so little time in each place. I prefer to “experience” a town rather than just “see” it. But this is your trip not mine so you should do what suits you best."}, {"username": "Teri Mayo", "comment_text": "You can do both. We were charmed by San Gimignano a bit more than Sienna. We did a tour so summertime else drove, wine tasting and Tuscan countryside. Tour was with The Tour Guy. We had Sara as a guide. She was wonderful."}, {"username": "Tammi Vajda", "comment_text": "We did both and added Pisa to the day. It was a long day but a great day."}, {"username": "Paris Buchanan", "comment_text": "Do both!"}, {"username": "Jennifer Gustafson", "comment_text": "San Gimignano and visit the https://\nwww.marronaia.co\nm/"}, {"username": "Shawna Soliday Taylor", "comment_text": "Both can be done but San Gimignano is amazing."}, {"username": "Lisa Zoccolillo-Bruno", "comment_text": "San Gimignano💕"}, {"username": "Andria Sullivan Barber", "comment_text": "I LOVE SIENA"}, {"username": "Mary Jackson", "comment_text": "We did both"}, {"username": "Christy Blanco-Frias", "comment_text": "San Gimignano if you have to choose one"}, {"username": "Megan Knight", "comment_text": "Consider Lucca!"}, {"username": "Alyson Dietrich Pawlik", "comment_text": "We did both in one day"}, {"username": "Diane M Fabiano", "comment_text": "On my last trip to Italy I spent a full day in each. I enjoyed my day in San Gimignano over Sienna."}, {"username": "Bobby Jo", "comment_text": "Sienna"}, {"username": "Heidi Maria Farrugia", "comment_text": "Definitely San Gimignano, the most beautiful medival city ever"}, {"username": "Frank Hunt", "comment_text": "Both with a car if the traffic is fine, parking is easy and you have a high speed camera. Not sure about train, but probably easier……I’m a recent train fan."}, {"username": "Tracy Middleton", "comment_text": "Eleanor Middleton 🤔"}, {"username": "Sa Ra", "comment_text": "f."}, {"username": "Pamela Bongas McIntyre", "comment_text": "Siena!"}, {"username": "Catherine Roebuck", "comment_text": "A great place to go for a day trip!"}, {"username": "Belinda Nielsen", "comment_text": "Sam Gimignano for sure.. my absolute favourite ❤️ ."}, {"username": "Joya Nicastro Cherry", "comment_text": "Susan Maschmann Lupu Thoughts for our day in Florence 🚶🏽‍♀️"}, {"username": "Claudia Caravedo Arroyo", "comment_text": "We did both! I recommend you book it from Get your Guide 🤩"}, {"username": "Daniela Ciobanu", "comment_text": "Both in one day.\nI liked Sienna more than Pisa."}, {"username": "Claudio Blizzard Indastria", "comment_text": "Siena"}, {"username": "La Cinzia", "comment_text": "Don't forget Volterra! More amazing and most ancient than Siena"}, {"username": "Janice Nugent", "comment_text": "San G for sure!"}, {"username": "Michèle Nardelli", "comment_text": "Both"}, {"username": "Jean Grimes", "comment_text": "I’d try to do both!\nThey are different but oh so wonderful! Start early and stay late!"}, {"username": "Jennifer Smith", "comment_text": "San G is just so charming! My favorite lunch is to get a slice of pizza and sit on church steps and people what. The shop all the great little shops and grab delicious gelato before I leave. You will enjoy which ever you choose."}, {"username": "Alice Engstrom", "comment_text": "You can easly do both!"}, {"username": "Kelly Imani", "comment_text": "Both if you can. So beautiful and unique!"}, {"username": "Dan Adams", "comment_text": "We did both plus Monteriggioni and a winery tour & lunch. Very cool!"}, {"username": "Lisa Mastronardo Kelley", "comment_text": "To do Siena right you need a day + a guide…. It is the most interesting wonderful city. San G can be split but I wouldn’t split it with Siena. Split it with a winery tour!"}, {"username": "Deb DiBenedetto", "comment_text": "Yes\nWalks of Italy has a tour includes a winery with lunch and tasting.\nTour was excellent"}, {"username": "Nicole Beaumont", "comment_text": "I did both plus Pisa and winery. I loved both."}, {"username": "Michele Baron Vold", "comment_text": "Sienna was really fun to walk around. I cannot remember San Gimignano."}, {"username": "Maria Harrington", "comment_text": "Definitely both!"}, {"username": "Karen Busch", "comment_text": "SG is not that big, but super cute town. Sienna there is more to see, so I would do that."}, {"username": "Lynn Francisco Casella", "comment_text": "Both can be ✔️ ndividually I believe. Did them when I visited Florence."}, {"username": "Cynthia Poremba Kelm", "comment_text": "Love them"}, {"username": "Dana McCracken", "comment_text": "Both. And awesome."}, {"username": "Renee Rundle Stoneham", "comment_text": "Of course you can do both.\nBut, I think both deserve a full day to explore. I’m not a fan of the Griswald stops just to take an Instagram pic then move on.\n\nHowever know that San Gimignano doesn’t have a train station, you have to catch a bus in Poggibonsi.\nSo if going by train getting to both will be a bit difficult.\nI know there are bus tours that will take you to both, if you don’t have a car.\n\nWe stayed in San Gimignano for 4 days and absolutely love it an the area. We did a day trip to Sienna and loved it as well!"}, {"username": "Carol Scott", "comment_text": "San Gimignano"}, {"username": "Silvia Par", "comment_text": "Siena"}, {"username": "Surabhi Bains", "comment_text": "Do both if possible and Siena is only one"}, {"username": "Marc Chomel", "comment_text": "You shouldn’t squeeze both in. Each requires several days."}, {"username": "Jono Roland", "comment_text": "Both!"}, {"username": "Rebecca A. Baer", "comment_text": "Both"}, {"username": "Sarah Schneider", "comment_text": "We did both in one day."}, {"username": "Marie Cole", "comment_text": "Must see"}, {"username": "Marie Cole", "comment_text": "Do 1 day each. We did both in one day. Wish we had more time"}, {"username": "Lisa Barnes", "comment_text": "We did both"}, {"username": "Lisa Holley", "comment_text": "You can do both."}, {"username": "Robert Baumann", "comment_text": "Siena for sure, lovely town, no you will be exhausted if you do both..."}, {"username": "Jodi Vosilla", "comment_text": "You can do\nBoth"}, {"username": "Stephanie Evans", "comment_text": "Both are amazing"}, {"username": "Colleen McMahon", "comment_text": "Both!"}, {"username": "Lynn Holland Benson", "comment_text": "We did both in one day"}, {"username": "Cathy Macka", "comment_text": "If you start early enough you may be able to do both. I loved San Gimignano the first time I spent an hour there so my next visit to Italy I stayed there 🥰"}, {"username": "Marla Wiese Compa", "comment_text": "I just came back from Italy, and if you can do both then do it! They were both my favorite hill towns to visit in Tuscany!"}, {"username": "Brice Blosser", "comment_text": "Yes. We did that trip. From what we learned, splitting them up is recommended in order to allow for travel time and enough time to wander around with being rushed, cutting it short, and/or being out super late. Both are amazing and need time to visit these places in the Tuscany country side. San Gimignano is a medieval Manhattan."}, {"username": "Lindsey Brancher", "comment_text": "Sienna"}, {"username": "Marlene Bertino Randolph", "comment_text": "They are both nice but Siena\nIs my favorite."}, {"username": "Yuko Y Smith", "comment_text": "If you have own transportation like hire private driver or rental car, you can visit both. Public transportation only one village."}, {"username": "Toni Marie", "comment_text": "Just came back and loved San getmanino"}, {"username": "Jessica Morse Hall", "comment_text": "Both can be done in a day. We did a tour from Florence that stopped in sienna first, then San gimignano. Both places are magical."}, {"username": "Jeff Gentner EA", "comment_text": "Separate days unless you just want to say you were \"there\". Both Wonderful."}, {"username": "Katie Kirk", "comment_text": "We did a 1-day trip with Viator that takes you to Siena, San Gimignano, a Tuscan vineyard, and Pisa! Loved each city!"}, {"username": "Pam Armenia O'Brien", "comment_text": "You can do both in one day. Many tours do that or you can drive on your own"}, {"username": "Julieanne Brown", "comment_text": "San Gimignano 😘"}, {"username": "Krissy DaRusso", "comment_text": "You can definitely do both! San G is my preference over Sienna but San G is pretty small."}, {"username": "Diana Boucher", "comment_text": "You should do both!!! A must see is the cathedral in Sienna"}, {"username": "Marissa McLean", "comment_text": "I did both in one day in May"}, {"username": "Bob Cinquini", "comment_text": "Jackie Sapio"}, {"username": "Cheryl Kahn", "comment_text": "San Gimignano! No questions. It’s so quaint and beautiful…like a storybook. Sienna is commercial and just eh…"}, {"username": "Pao Magnoler", "comment_text": "Both!!!! You can do it in 1 day. San Geminiano is pretty small."}, {"username": "Paola Bobko", "comment_text": "Less popular, but equally lovely is the Val d’orcia area. I would do Montepulciano and/or Montalcino, Pienza. You can also go to the gladiator spot and find a wine tasting + visit in the vineyard.\nDoing both Siena and San Gimignano sounds a bit much too me, I guess you also want to take it easy, enjoy the place, have a nice lunch, ideally have a wine tasting in a winery too, not jist be in a rush."}, {"username": "Silke Frankl", "comment_text": "Both in one day"}, {"username": "Theodore Meyer", "comment_text": "Siena. Much more to see there. San Gimignano is nice but very touristy."}, {"username": "Heather Sechrist", "comment_text": "I liked them both but, Siena was my absolute favorite Italian town."}, {"username": "David Hibbs", "comment_text": "Yes but it will be quick. Siena is bigger so u will want more time"}, {"username": "Alessandra Pasteris", "comment_text": "Both are beautiful but my heart is in Siena! Actually, a day trip to Siena will likely be too short."}, {"username": "Patrick Gilmore", "comment_text": "Teresa Swelbar Gilmore read these comments."}, {"username": "Tricia Teys", "comment_text": "Sienna"}, {"username": "Daisy Yoo", "comment_text": "I will do both"}]}, {"id": "2204001383332273", "text": "I want to buy tickets to a soccer game in October in Milan. Do they usually sell closer to the actual game date?", "link": "facebook.com/groups/1373361046396315/permalink/2204001383332273/", "likes": 0, "comments": []}, {"id": "2203999363332475", "text": "Easter - I know Rome itself is very busy Holy Thrs through the Monday following Easter. How are other northern cities like Venice, Tuscany, and even Zurich? Thinking about traveling over Easter but not hitting Rome until the week following Easter.", "link": "facebook.com/groups/1373361046396315/permalink/2203999363332475/", "likes": 0, "comments": []}, {"id": "2203996749999403", "text": "Hi! Leaving tomorrow and we have a day trip planned to Cinque Terre where we have some beach time and a boat tour to Capri. Wondering if I should pack some beach towels?", "link": "facebook.com/groups/1373361046396315/permalink/2203996749999403/", "likes": 1, "comments": [{"username": "Joey Clark", "comment_text": "They sell the really flat ones (like Sand Clouds) in both places, we bought one in Capri for my husband and it’s a great souvenir on top of being useful there!"}, {"username": "Sonia Gorton", "comment_text": "Our boat provided us with towels….we brought a few just in case."}, {"username": "Gary W Anderson", "comment_text": "Or buy them there, keep sakes."}, {"username": "Penny Bellofatto Westberry", "comment_text": "That's a long boat trip, no?!"}, {"username": "Karyn McCluskey", "comment_text": "I took 1 towel for 2 of us no worries"}, {"username": "Ken Lerch", "comment_text": "CT and Capri in one day?"}, {"username": "Paula DiCicco", "comment_text": "I brought some this time but next trip I would buy as keepsakes with area name embroidered on them. I bought 2 (in CT- all over stores) to take home and now leaving the ones I purchased to bring here for family as not enough room:)"}]}, {"id": "2203996363332775", "text": "Hey!\nIf i would spend 3 days in the Dolomites without a car, where would you recommend to stay?\nI’m coming from Venice and Cortina seems easy to get to but I wonder if I’d be able to go to hikes from there?\nAnother option is Urtijëi I just don’t know how to get there without a car.\nAny suggestions?\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203996363332775/", "likes": 94, "comments": [{"username": "Anthony Torre", "comment_text": "we have been here in Cortina for several days and departing tomorrow. Recommend the Villa Alpina, first class, newly appointed and reasonable. Public transportation available and a bike rental store next door to the hotel. Have fun, 2026 winter olypic coming to town."}, {"username": "Alice Engstrom", "comment_text": "Castelrotto, !"}, {"username": "Meghan Lee", "comment_text": "Could probably do Venice- Verona-Rovereto\n-Bolzano trains then bus to Urtijei. I went from lake Garda to Ortisei via public transport and it takes a long time but it’s doable"}, {"username": "Kassi Garan", "comment_text": "Went to Bolzano. I think there are tour guides and such that leave from there. We wanted to hike, but went just outside of season so guides told us no. But that’s the extent of my knowledge! Bolzano was a cute town and gorgeous gondola ride up the mountain. Jealous of you!!"}, {"username": "Ziv Ran", "comment_text": "I had a lovely time staying in Selva di Val Gardena and hiking up and down each day"}, {"username": "Lisa Scott", "comment_text": "Ortisei/\nUrtijei - definitely.\nTrain to Bolzano, bus to Ortisei"}, {"username": "Max Sorber", "comment_text": "We stayed at\n\nB&B Villa Angelino -\n\nPetlin 12 | 39046 Ortisei - Val Gardena | Dolomites - Italia\n\nGreat breakfast\n\nWalk around old town\n\n2 different gondolas to take up to different hiking areas"}, {"username": "Sarah Salisbury Vander Heide", "comment_text": "Ortisei, Seceda is right there and the area is gorgeous with restaurants and shops. A bus stops there but I don’t know where to get it. We did the car rental."}, {"username": "Megan Sergeant", "comment_text": "Following"}, {"username": "Andy Hunn", "comment_text": "Find your way to Dorf Tirol. It's amazing"}, {"username": "Katy Kennelly Olds", "comment_text": "Corvara! It’s easy to get to on public bus from Cortina or even directly from Venice on the Cortina Express bus line and it’s a great central location to do great day hikes in all directions. Feel free to contact me for more advice about hikes. I’ve been there 3 of the past 5 summers (all the way from California) I love it so much!"}, {"username": "Julia Haggerston", "comment_text": "Following, I’m looking to book somewhere for the 2026 Winter Olympics, I want to see bits of all sorts esp the opening ceremony , ski jumping, alpine, hockey so want to be quite central but with access to all x"}, {"username": "Sarah Bogdan Gjud", "comment_text": "We have been in Cortina and had a car which was parked there. We didn’t even need our car for our hiking, as you can use bus, gondolas or just walk."}, {"username": "David Perillo", "comment_text": "Following"}, {"username": "Kathleen Farrugia", "comment_text": "Following"}, {"username": "Marilyn Elphick", "comment_text": "A few years ago, we were staying in Colfosco. I injured myself and couldn’t ski, so we spent the week walking instead. You can use the ski lifts to get to any of the different villages in the Sellaronda - Corvara, Selva di Val ￼Gardena, Arabba."}, {"username": "Scott Vultaggio", "comment_text": "Anat\n\nWe stayed in Val Gardena and cortina. No car needed and close to amazing hiking. We rented a car at Venice airport because I like to drive in the alps. You could take a service to both towns and then hike from them without a car. The bus links all of the small towns."}, {"username": "Scott Vultaggio", "comment_text": "We stayed at this hotel in cortina. Fantastic. Small and great service. Center of town 5 minute walk"}, {"username": "Anat Kriger", "comment_text": "Hadar Kriger"}, {"username": "Katy Kennelly Olds", "comment_text": "One thing to know about Cortina is that there are very few hiking trails right from the town. For most of them, you have to take a bus to get to trailheads. Whereas if you base in Corvara (which is not far west from Cortina,) there’s hiking right there with multiple chairlifts to the top of mountains or within a few minutes’ bus ride.￼ I have lots of hiking suggestions so feel free to contact me!"}, {"username": "Katy Kennelly Olds", "comment_text": "Ortesei is a great location BUT it’s a long ways from Venice. If you are taking public transportation,\nyou would need to take a train from Venice to Bolzano (which involves a change of trains along the way, total time about3 hrs as I recall) then take a bus about 1-1.5 hrs from Bolzano to Ortesei which also, I believe, requires a transfer. Better to base yourself in Corvara if you’re reliant on public transportation because, as I mentioned in an earlier comment, you can take the Cortina Express bus directly from Venice all the way to Corvara.￼ To get to Selva from Corvara, you would then need to take a separate public bus from Corvara to Selva up and over a pass. That takes about 50 minutes.￼ I would recommend Selva LEAST if you are reliant on public transportation.\nEven if you have a car, Selva is the most remote town from Venice.￼"}, {"username": "Katy Kennelly Olds", "comment_text": "One more comment: be aware that most chair lifts and gondolas to the top of mountains halt service in late Sept or Oct 1 at the latest (for most). Check www.dolomitisup\nerski.com for exact schedules. .￼ To me, one of the great things about the dolomites is the ability to hop on the chairlift and get directly to the top of the mountain and then hike along and down to another village, rather than having to hike several hours steeply uphill to get to the views.￼ Also, I believe that many hotels and restaurants may close for the season in mid to late September. You would want to check on this.￼"}]}, {"id": "2203990823333329", "text": "Can anyone tell me anything about Saliceto? I know where it is located. My grandmother from there.", "link": "facebook.com/groups/1373361046396315/permalink/2203990823333329/", "likes": 1, "comments": [{"username": "Donna Mangone", "comment_text": "Where is it located? What Region and province?"}, {"username": "Paola Bersano", "comment_text": "I've been there, a cousin of my father lived in this small village. It is between Piedmont and Liguria, not far from the highway, but quite difficult ti reach, small and winding roads."}]}, {"id": "2203988846666860", "text": "🇮🇹 🇮🇹 Advice needed: 🇮🇹 on a hotel or air bnb near the Marco Polo train line… September visit all the way from Australia 🇦🇺\nI Need to be able to get to and from the Marco Polo airport easily and extra points if you know the cost / time and value of getting the train to and from the airport - Is there a better way? Last time I took a boat it was 89euros for just me. One way, one person. 🇮🇹🇮🇹🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2203988846666860/", "likes": 0, "comments": []}, {"id": "2203985580000520", "text": "Hello,\n\nWe want to go to Florence from Rome for a day, planing to take the train.\n\nAny suggestions or ideas?\nWhat do avoid?\n\nBest train apps?\nBest train lines?\n\nThanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2203985580000520/", "likes": 0, "comments": []}, {"id": "2203982886667456", "text": "Any public golf courses in Tuscany? We are staying in Sarteano…", "link": "facebook.com/groups/1373361046396315/permalink/2203982886667456/", "likes": 0, "comments": []}, {"id": "2203981740000904", "text": "Has anyone heard of the new entry requirement for US citizens to . Italy for 2024??\n\nhttps://travel-europe.europa.eu/etias_en", "link": "facebook.com/groups/1373361046396315/permalink/2203981740000904/", "likes": 0, "comments": [{"username": "Gianna Onesi", "comment_text": "Yes I posted it on another post"}, {"username": "Birgit Loveall", "comment_text": "Yes you do.\n\nhttps://\nabc7chicago.com/\nvisa-to-visit-eu\nrope-in-2024-us\n-citizens-new-r\nequirements-for\n-traveling-amer\nicans-will-need\n/13542133/\n?fbclid=IwAR2bOT\nz8PvoCFnYHZZhTw\n-uv-LyXdXaFgHF6\n1L3WxX3545tCyi3\nvd7IBWU8"}]}, {"id": "2203980813334330", "text": "I am looking for recommendations for a car service to pick up from Naples train station and take us to Sorrento. Any suggestions?\n\nI have so enjoyed reading the tips from this post. It has saved me time and stress!", "link": "facebook.com/groups/1373361046396315/permalink/2203980813334330/", "likes": 3, "comments": [{"username": "LeAnn Bonkiewicz", "comment_text": "Joe Bananas Limo"}, {"username": "Bev Madill", "comment_text": "Transferelax are great."}, {"username": "Barbara Brosnan", "comment_text": "Joe Banana. We used them several times earlier this month and won’t hesitate to use them again"}, {"username": "Michelle McNeil", "comment_text": "If you are open to it, there is a train that runs between naples and sorrento that is very Inexpensive. It was a great alternative"}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers are great.. Mena Forino"}, {"username": "Nadine Gauld", "comment_text": "Amalfi Coast Transfers we used them a week ago for the Naples to sorrento trip and return. Driver was waiting for us on arrival in Naples, professional team, great communication throughout and really knowledgeable about the local area."}, {"username": "Tatiana Frlic", "comment_text": "How much do a charge from Naples to Sorrento?"}, {"username": "Gena Kona-Mancini", "comment_text": "I commented previously on another post about the train Campania express that runs from Naples to Sorrento with a lot more comfort than the local train! You have to ask for these tickets as they aren't offered at the train station unless you ask. They're also pricier (€15 one way vs €4). But they looked much more comfortable and WAY less busy!"}, {"username": "Doris Callender", "comment_text": "Sorrento Scialone Travel is who we used our entire trip. They picked us up in Naples, brought us to our base in Sorrento, took us on day tours, and brought us back to the airport to catch our flights home. They were great & took us to places we would have never seen otherwise. I definitely recommend using them. 🍋"}]}, {"id": "2203980806667664", "text": "Stopping at Portofino on a cruise trip. Will be me and my 13 year old daughter and my parents who are almost 80. Are there any nice beaches near by? Anything recommended to do/see without tons of travel...\nDo any hotels offer day passes for any beaches?", "link": "facebook.com/groups/1373361046396315/permalink/2203980806667664/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203980723334339", "text": "Sorrento restaurants that are not expensive tourist traps! We found so many excellent osterias in Rome - wonderful ambience and amazing food. Hoping to continue this within our time in Sorrento.", "link": "facebook.com/groups/1373361046396315/permalink/2203980723334339/", "likes": 0, "comments": []}, {"id": "2203979676667777", "text": "I am hoping to Visit Rome, Florence and Venice. Would love to do a Winery tour. Which one is best known for their wineries?", "link": "facebook.com/groups/1373361046396315/permalink/2203979676667777/", "likes": 1, "comments": [{"username": "Leslee Wyatt", "comment_text": "Florence…Tuscan\ny is probably the best for that. I hope you have a wonderful trip!!!!!"}]}, {"id": "2203978950001183", "text": "Favorite souvenir from Rome, Tuscany region and Amalfi coast area?", "link": "facebook.com/groups/1373361046396315/permalink/2203978950001183/", "likes": 30, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Ceramics. They are all one of a kind pieces “dipinto di mano” by artisans"}, {"username": "Teresa Herrington-Dunham", "comment_text": "I cant wait (but have a year until9/30/24 on NCL Viva)! I want a LV handbag in Florence! I hear kess in Europe than USA and get some VAT taxes back. Excited to see all fun items!"}, {"username": "Colleen Dee", "comment_text": "Not sure what the item on the left is called. Got it at a little stand not far from the train station in Rome."}, {"username": "Karen Lyon Barnett", "comment_text": "Anything Murano glass!"}, {"username": "Belinda Bates Barragar Endicott", "comment_text": "Cameo ring. I’ve worn mine for 20 years and it’s looking worn. Time to replace it next month!!"}, {"username": "Tam Wong", "comment_text": "❤️❤️❤️🇮🇪🇮🇹❤️❤️"}, {"username": "Katherine Aube", "comment_text": "Something that can last forever…. An ornament, jewelry, a leather work bag… I’ve done all three over the times I’ve been there"}, {"username": "Becky Bianco", "comment_text": "I bought a carnival mask and lace tablecloth in Venice, a set of wine glasses from the murano glass factory, 3 bottles of wine in Tuscany, limoncello and jewelry in capri, a necklace and some prints from Florence, and a book from every area I visited. I regret not getting a mosaic from the little shop by the Vatican… next time😍"}, {"username": "Rosemary Sheldrick", "comment_text": "When I went to Florence, there was this little clock shop. I passed by it but had to go back for another look. I ended up purchasing this beautiful little clock. It still works after 12 years. And it reminds me of Italy every day. Puts a smile on my face. Best purchase on my trip😊"}, {"username": "Tracy Krause", "comment_text": "Brunello di Montalcino wine from Santa Guilia Vineyard. Free shipping to my local ABC store.\nCeramics from Praiano.\nOriginal art and lavender products from Assisi"}, {"username": "Jess Villa", "comment_text": "Limoncello from limonoro!"}, {"username": "Rosanna Hardeman", "comment_text": "Gucci 🤷‍♀️"}, {"username": "Pier-olivier Gagnon", "comment_text": "architecture"}, {"username": "Mimi Frederiksen", "comment_text": "If you go through the Rome airport, stock up on chocolates!! They are amazing and I wish I had bought a dozen bags!!!😭😭😭😀😀😀"}, {"username": "Connie Calhoun Colbert", "comment_text": "We haven’t gone to Italy yet but I’ve been buying a coffee mug when we travel. Every morning I pick a different cup to have my coffee in and think about our fun trip. And it has to be that perfect one. Love the ones I got last year on Scotland and Ireland."}, {"username": "Rebecca Karr", "comment_text": "Memories 💜"}, {"username": "Marian Calhoun", "comment_text": "Not my favorite but just cane back with 5 stitches from rome"}, {"username": "Manuela Coelho Mota", "comment_text": "Amalfi coast, our favourite"}, {"username": "Andrea M. Guidry", "comment_text": "Anything lemon on Amalfi"}, {"username": "Luan Banka", "comment_text": "The aroma of lemons on the Amalfi Coast. ☺️"}, {"username": "Pong Ac Ai", "comment_text": "Limoncello"}, {"username": "David Leineweber", "comment_text": "When we were in Capri my wife bought a pair of hand made sandals 10 years ago. Still wears them and look new."}, {"username": "Mark Held", "comment_text": "In-laid wood wine cart from Sorrento🤟🇮🇹"}, {"username": "Addie Fanticola Brownell", "comment_text": "My memories❤️"}, {"username": "Colleen Broderick Regan", "comment_text": "Popener"}, {"username": "Donna Parrish", "comment_text": "I collect magnets"}, {"username": "Debbie Milne Jenkins", "comment_text": "My photos 😊"}, {"username": "Linda Mascaro", "comment_text": "Wine and olive oil!"}, {"username": "Suzie Tumlin", "comment_text": "My husband and I collect Christmas ornaments from every city"}, {"username": "Lori D'Ascanio VanMeter", "comment_text": "Limoncello, olive oil, chocolates/\nlocal candy, olive wood items, regional wine, olives, linens, leather; gloves/coat, art, Italian gold/ jewelry. Shoes!!"}, {"username": "Leanne Dawn Sutton", "comment_text": "Little leather purse I bought in florence"}, {"username": "Shelley Fnts", "comment_text": "Leather purses/goods"}, {"username": "Angela Cistolo Tomko", "comment_text": "Pottery from Deruta (they shipped it to us); olive oil ( also shipped to us)"}, {"username": "Reba Hadcat", "comment_text": "Bucket hats, dish towels and lemon candy"}, {"username": "Rose Wolschlager Hinman", "comment_text": "My wooden spoons made from olive tree wood, and, of course the wine, the olive oil, I brought back the handmade gifts made in Italy."}, {"username": "Paula Appleton", "comment_text": "Sea glass I found on the beach in Capri."}, {"username": "Melinda Giuffre", "comment_text": "10 additional lbs on my hips"}, {"username": "Jackie Hall", "comment_text": "Leather gloves and pocketbooks!!"}, {"username": "Patti Hunter", "comment_text": "I buy a little nativity in every country we visit."}, {"username": "Kristin Johansen Mascia", "comment_text": "Lemon Perfume!!"}, {"username": "Judith Aquino", "comment_text": "Judith Aquino"}, {"username": "Charlotte Lowe", "comment_text": "Leather bag, Xmas ornaments"}, {"username": "Gina McFadden", "comment_text": "Perfume from Ana Capri\n(Capri Nights)"}, {"username": "Ann Law", "comment_text": "Limoncello"}, {"username": "Lisa Amellio-Chavez", "comment_text": "I haven’t been to Italy in such a long time but I remember we went somewhere that some beautiful cameos. Wish I could remember"}, {"username": "Debbie Schultz", "comment_text": "Art"}, {"username": "Cindy Vennare", "comment_text": "Italian Gin! 🍋"}, {"username": "Denise Wade Fulmer", "comment_text": "Amalfi coast- ceramics and limoncello. Tuscany area- Florence- leather products from the school."}, {"username": "Michele Sica Selesky", "comment_text": "Rosary beads from the Vatican"}, {"username": "Julie Raymond Shlepr", "comment_text": "My photos and memories!!"}, {"username": "Beth Spiehler Selvia", "comment_text": "Limoncello from Positano !"}, {"username": "Frank Knights", "comment_text": "Limoncello, EVOO decanter"}, {"username": "Donna Bowman", "comment_text": "Leather handbag and lemincello"}, {"username": "John Layman", "comment_text": "Cheese olives and limencello"}, {"username": "Denis Kee", "comment_text": "About 3 lbs.🤣🤣"}, {"username": "Annmarie Chenoweth Burmeister", "comment_text": "Capri-a good luck bell is a must!"}, {"username": "Martina Saverino", "comment_text": "My memories"}, {"username": "Dianne Parisi", "comment_text": "Ceramic Christmas tree ornaments, salt and pepper shakers, olive wood cutting boards, leather handbags."}, {"username": "Michelle Miller", "comment_text": "When I went to Florence outside of wine I couldn’t find anything I really needed (I had been before and at that time purchased a leather coat). I ended up finding a local shop with hand made postcards. I framed them and display them in my home and I love them! Inexpensive and im always reminded of my trip when I see them"}, {"username": "Rhonda Kurbis", "comment_text": "A bronze gladiator sitting on his horse & of course Venetian glass from Rome. Bought some bowls in Capri….not even going to mention the clothes🤦‍♀️😊"}, {"username": "Susan Shaffar-Redding", "comment_text": "Limoncello!"}, {"username": "Lisa Mastronardo Kelley", "comment_text": "Christmas ornaments"}, {"username": "Nikki Niks", "comment_text": "Amalfi 🍋"}, {"username": "Joëlle Manceau-Williams", "comment_text": "Wherever we go, regardless of the length of time we only take carryons so sometimes there can’t be much or any shopping done. There is however 1 things we buy every trip, and it’s an ornament. When we get home we put the date on it. Our tree each year gets fuller of memories. Hoping to pass the collection down to my daughter someday if she wants it"}, {"username": "Maria Villanueva", "comment_text": "I bought plates from different towns, they are easy to pack in suitcases. Also sweatshirts are always nice.👍"}, {"username": "Martinez Martin", "comment_text": "There is places in the amalfi coast where they made sandles for ladies custom right in front of you"}, {"username": "Shae Montandon", "comment_text": "I bought a beautiful leather wallet from “il Papiro” in Florence. I’m using it now.\nIt’s a beautiful store and they will show you how they make their designs."}, {"username": "Kim Grace", "comment_text": "Anything I can carry home"}, {"username": "Laura Heeren Tarman", "comment_text": "We found a beautiful handcrafted chess set with Roman-themed pieces for my son who loves the game."}, {"username": "Larry M Murray", "comment_text": "From Tuscany, wine, cheese and olive oil; from Amalfi, lemon everything, with us it was lemon soap and lemon candles also scarfs."}, {"username": "Rhonda Smith", "comment_text": "Anything lemon! Leather, linen.."}, {"username": "Rose Marie", "comment_text": "Limoncello and Meloncello."}, {"username": "Sharon Kmetz-Kunze", "comment_text": "My son found a very old family bookstore in Rome where we bought several prints. ( Some from the first medical books published). Easy to bring home. Here we matted and framed them and they are beautiful and unique."}, {"username": "Donna Cignatta", "comment_text": "Olive oil from Arezzo.💚"}, {"username": "David Kirkpatrick", "comment_text": "Memories"}, {"username": "Alice Engstrom", "comment_text": "Ceramica!"}, {"username": "Andrea Blasi Chimo", "comment_text": "My leather purse from Florence!"}, {"username": "Christine Aird Craig", "comment_text": "Rampini pottery from Tuscany. Hand made shoes in positano"}, {"username": "Karen Schmidt", "comment_text": "Family photos we did in Venice, and little balsamic balls (like caviar, but filled with balsamic). Soooo good!!"}, {"username": "Debbie Fekete Gene", "comment_text": "Lemon ceramic bowl. Really cheap in praiano. Too expensive in positano. Paid 69 euros vs 220."}, {"username": "Holly Frederick", "comment_text": "Linen and silk clothes!!!"}, {"username": "Jean Grimes", "comment_text": "From San Gimignano-\nOlive oil and balsamic vinegar\nset"}, {"username": "Chuck Morton", "comment_text": "Memories!"}, {"username": "Debbie Zaleski Cincurak", "comment_text": "Olive Oil 🫒"}, {"username": "Rodger Cravens", "comment_text": "Wine and olive oil."}, {"username": "Gina Manzotti Rasp", "comment_text": "The pictures I take, then I uploaded to Shutterfly and put them in a book. I wait until there is a coupon for unlimited pages so I can fill it with lots of photos."}, {"username": "Noel Flood", "comment_text": "Wonderful memories"}, {"username": "Mechelle Huff", "comment_text": "I bought a cross necklace made of black diamonds. Love it!"}, {"username": "Santo Finocchiaro", "comment_text": "Wine, wine, pistachio chello"}, {"username": "Meghan Kunza", "comment_text": "Small ceramics from Creart Rome!"}, {"username": "Scott Perry", "comment_text": "I bought a wallet from the Benheart store in Lucca — their main store is in Florence. It’s my favorite thing ever."}, {"username": "Jess Galasso", "comment_text": "A pretty rosary from the Vatican, a new found appreciation for artichokes, a boar ragu copycat recipe, a beautiful leather pocketbook, the habit of an afternoon aperitif with a little nosh."}, {"username": "Diana Occhipinti", "comment_text": "￼ Lemon ceramics from Amalfi coast area, gold cross and rosary from Vatican"}, {"username": "Russell Weidner", "comment_text": "Memories"}, {"username": "Maggie West Penix", "comment_text": "Wine, wine and oh yeah….wine!"}, {"username": "Jim Hooper", "comment_text": "I would say wine and olive oil. My wife may say purses 😀"}, {"username": "Lisa Valdovinos", "comment_text": "Ceramics from Sorrento, Capri and Leather purse from Florence."}, {"username": "Michelle McNeil", "comment_text": "We bought ceramic dishes for pasta and had them shipped back to massachusetts"}, {"username": "Michelle McDonald Mertens", "comment_text": "We bought a set of dishes in Positano! Still love them!"}, {"username": "Marti Byrum Young", "comment_text": "Ceramics - I had them shipped back to the US and I love ❤️ cooling and seeing them in my kitchen. It brings back such good memories"}, {"username": "Cilia De Vrieze", "comment_text": "The beautiful memories..."}, {"username": "Donna Hinton", "comment_text": "Pictures taken all over Italy and framed as a memory of all the lovely places we were. I also love the little painted bottles of lemoncello I got in Positano and Capri. I bought a very unique inexpensive bracelet in Capri with a hanging Capri charm and it makes me happy too. 😁"}, {"username": "Jessica Olivero", "comment_text": "my ceramic coffee mug!"}, {"username": "Lisa Martinson", "comment_text": "Balsamic vinegar"}, {"username": "Margaret Layden", "comment_text": "I haven’t bought them yet, but I am excited to buy Moscow Mule Mugs from Cafe Florian."}, {"username": "Rhonda Russell", "comment_text": "Photos, memories, weight loss from all the walking, book marks"}]}, {"id": "2203976753334736", "text": "Hi, I’m going to Milan this Friday and then to lake Como and have some questions.\n1. What is the best way to get from Bergamo Airport to Milan Center?\n2. What should I see in Milan that will still have available tickets of is free?\n3. What places to eat can you recommend in Milan?\n4. I will be staying near Como City at lake Como, what villas,आणखी attractions etc are worth visiting- I will be staying there 6 days\n5. Do you have any recommendations for restaurants/trattorias in Como or nearby? I’m also looking for breakfast places 😊\nThank you for your help", "link": "facebook.com/groups/1373361046396315/permalink/2203976753334736/", "likes": 0, "comments": []}, {"id": "2203974413334970", "text": "How many days do you recomend to spend just in Rome? Want to visit everything! But we only have 13 days to travel in Italy", "link": "facebook.com/groups/1373361046396315/permalink/2203974413334970/", "likes": 0, "comments": []}, {"id": "2203974356668309", "text": "hi guys! i am travelling to italy at the end of september. i have a layover in frankfurt (germany) and it’s only an hour and a half. i’m wondering if this will be enough time for me to make it through the airport to my plane? thank you in advance!! any advice would be appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2203974356668309/", "likes": 0, "comments": []}, {"id": "2203967623335649", "text": "In Venice now going to Florence tomorrow, I know I read here a good wine store and they ship it to US. Please give me the name of the store and location. Also doing a trip to San G, not sure if wi d there is cheaper. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203967623335649/", "likes": 0, "comments": []}, {"id": "2203966203335791", "text": "Do you use physical book guides like Lonely Planet or any other? Or do you recommend any travel book guide application?\n\n10 years ago I used to bring my own book guides to my trips and to buy some small ones in my destination. Now I see that there are some travel planning application that offer some kind of guides. But I am not sure whether the apps are worth to use. Any recommendation?\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2203966203335791/", "likes": 0, "comments": []}, {"id": "2203964600002618", "text": "I will be in Milan for 10 days, arriving into Linate airport. Is the MilanoCard worth it? Includes all bus, team, metro transportation, ticket to Duomo and the Linate shuttle", "link": "facebook.com/groups/1373361046396315/permalink/2203964600002618/", "likes": 1, "comments": [{"username": "Phyllis Snyder", "comment_text": "If you plan on going to all of the sites- and in town for a long time- is probable better to not purchase it."}]}, {"id": "2203963233336088", "text": "Hi! Asking for my mom (81 y/o) and her friends.\n\nIs there a transportation service to go from Venice to Milán (with suitcases)? They are looking for a private transfer and not train or bus.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203963233336088/", "likes": 0, "comments": []}, {"id": "2203956003336811", "text": "Amalfi Cathedral♥️", "link": "facebook.com/groups/1373361046396315/permalink/2203956003336811/", "likes": 1, "comments": []}, {"id": "2203915273340884", "text": "Update! Pompeii offers FREE bag storage at their site (any bag size!). AT the train station it is €5/bag (we got had 😓).\nHas anyone ever been to visit the ruins at Pomeii and left their luggage? It says they have a cloakroom for bags that they don't allow on the sites but I'm wondering if it could accommodate 2 carry on bags and 1 checked bag size bag. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203915273340884/", "likes": 2, "comments": [{"username": "Dafne Vassetti", "comment_text": "Nope, only backpack."}, {"username": "Sigrid Cormier", "comment_text": "Apparently across the street is a locker storage place."}, {"username": "Flora Hughes", "comment_text": "The Pompeii website says you can store bags, backpacks etc for free\n\nhttp://\npompeiisites.org\n/en/\nvisiting-info/\nvisitor-services\n/"}, {"username": "Cindy Gallen Barton", "comment_text": "There is luggage storage at Pompeii. Near the ticket booth and the restrooms. Very easy"}, {"username": "Kelsey Larabie", "comment_text": "I thought I saw full luggage storage at the entrance.\nOtherwise, check out the Radical Storage app."}, {"username": "Natalie Bentz", "comment_text": "Yes, we were there in May and checked 2 suitcases. There is an area for lockers that accommodate backpacks. There is also a luggage check room for larger luggage just inside beyond the lockers. It wasn’t a huge room, more like a large, walk in storage closet."}]}, {"id": "2203803036685441", "text": "Hi! First of all sorry for my english, I'm trying my best 😅\nI'm italian and i just want to say it' so nice to see foreigners so passionate and eager to get to know Italy, our food, our history and ourआणखी landscapes.\nI live in a small village, so I think I won't be able to give you advice about turist destination, but I really like being part of this group.\nEnjoy your stay in Italy! 🥰\n\nThank you all! For those who are wondering, I live in Costanzana, in Piemonte. There's almost nothingh here , 800 inhabitants in the middle of paddy fields but we have 2 beautiful churches, Santuario della Madonna delle Grazie and Confraternita di Santa Caterina. Definetly not a touristic place! 😅\nEDIT sorry, I can't answer anymore, FB disabled comments", "link": "facebook.com/groups/1373361046396315/permalink/2203803036685441/", "likes": 1160, "comments": [{"username": "Kimberly MacKinnon Cherry", "comment_text": "You live in a beautiful country! We are coming back in March 2024"}, {"username": "Susan Zimmerman", "comment_text": "💕 your post."}, {"username": "Kathleen Hardick", "comment_text": "Thank you Elisabetta for your interest and hospitality! We are coming to Italy for the very first time to your beautiful country in September and we are so excited.. going to Rome, Venice, Sorrento, Tuscany and Florence. Your English is much better then my Italian! LOL!!"}, {"username": "Susanne Couch-Wills", "comment_text": "Love this!❤️ Can’t wait for my first trip ever abroad next September and Italy is my first choice to visit 💖 cannot wait , going on an EF tour (educational) and excited to learn more and see the beautiful country. Oh , and Eat and Drink of course 🍷"}, {"username": "Randy Laub", "comment_text": "Grazie mille Elisabetta. Buona fortuna."}, {"username": "Maryjane Mucciolo Barbaris", "comment_text": "Maryjane Mucciolo Barbaris"}, {"username": "Jess Baloh Wuslich", "comment_text": "I just want to say thank you! We met so many kind locals who were so gracious and patient in dealing with our poor attempts at speaking Italian everywhere we went! I cannot wait to visit again with the hopes of learning more of your language 🙂"}, {"username": "Roxanne Franquelli", "comment_text": "Grazie Elisabetta!"}, {"username": "Stephen Anderson", "comment_text": "Thanks."}, {"username": "Susan Laspata Hoffman", "comment_text": "Susan Laspata Hoffman"}, {"username": "Maria Grillo-Abel", "comment_text": "Your English is perfect!! My mom and Dad come from a small town and I love that there are no tourists, only the locals that live there still or the ones that left and come visit."}, {"username": "Elisabetta Simoncini", "comment_text": "Ciao\nDi dove sei? Io sono di Roma ma vivo in Usa"}, {"username": "Jazz Caldwell", "comment_text": "It isn't just the sites and food in Italy - it is the people too - just like you Elisabetta!"}, {"username": "Kim Breeden Otto", "comment_text": "What village do you live in? My sister & I want to rent a small cottage & experience it like a local-that is on our bucket list."}, {"username": "Tracy Amin", "comment_text": "I’m Italian 100% my husband is Palestinian born in Venezuela we went in October rented a car it was the best 10 days ever we definitely will be returning we have been many places my husband says nothing compares to beautiful Italy the respect from the people the food the hospitality was amazing"}, {"username": "Susan Matthews Golden", "comment_text": "I was in Italy for the first time in June & loved your country! Only had 10 days so not nearly enough time!"}, {"username": "Mary Taylor", "comment_text": "Your English is perfect. Italy has always been in my heart since I first visited. My family was from Foggia and Compobasso regions."}, {"username": "Lisa Pirone Kaiser", "comment_text": "Loved Italy and can’t wait to go back 💕🇮🇹"}, {"username": "Cindy Neilson", "comment_text": "Thank you and I’m proud of my Italian heritage. (Late father from Friuli) 🇮🇹"}, {"username": "Sandy Kennedy Cohenour", "comment_text": "I love that you follow this page and love your country!❤️"}, {"username": "Geoff Plus Jann Mains", "comment_text": "We love Italy .\nCame16 years ago\nComing again next year in May\nJann New Zealand 🇳🇿 😍 ❤"}, {"username": "Elizabeth Erickson", "comment_text": "No apology needed! You write in English better than many Americans."}, {"username": "Elizabeth Erickson", "comment_text": "Tell us about your village!"}, {"username": "Christina Zotti", "comment_text": "This is so sweet. Warmed my heart. Thank you Elisabetta! I am visiting on my honeymoon in September. I have never been and I’m so excited. Visiting a small town that great grandfather was from. I wish I spoke more Italian. When my relatives moved here they wanted my parents to assimilate so unfortunately I heard very little Italian. But I’m trying to learn."}, {"username": "Hanne E Johnsson", "comment_text": "Så fint skrevet og er helt enig med dig, elsker landet"}, {"username": "Thalina DeMarco", "comment_text": "Thalina DeMarco"}, {"username": "Anne Smith", "comment_text": "Welcome to the group. I love Italy"}, {"username": "Manai Radhia", "comment_text": "Elisabetta Coppo.What s the name of your village? I love little Italian villages"}, {"username": "Elisabetta Coppo", "comment_text": "Thank you all! For those who are wondering, I live in Costanzana, in Piemonte. There's almost nothingh here , 800 inhabitants in the middle of paddy fields but we have 2 churches, Santuario della Madonna delle Grazie and Confraternita di Santa Caterina. Definetly not a touristic place! 😅\nEDIT sorry, I can't answer anymore, FB disabled comments"}, {"username": "Michelle Harris", "comment_text": "Both of my parents come from small villages in Italy and am more then happy to visit them and the surrounding areas. It probably helps that I speak Italian thanks to my nonna who lived with us and didn’t speak any English"}, {"username": "Amy Kaye", "comment_text": "We love Italy and the people! I love the small towns!"}, {"username": "Sandra Keyser", "comment_text": "We go to Lerici, Italy every year for a month! It’s small and not packed with tourists! I love it! I actually would like to live there! Your English is perfect! ♥️ Thank you for sharing!"}, {"username": "Helen Rosenberg", "comment_text": "Thank you we are looking forward to enjoying your beautiful country in September 🥰"}, {"username": "Lina Chaumont", "comment_text": "Elisabetta Coppo da dove sei tu ? Io sono nata in Scigliano pero adesso abito in Canada vengo in la Bella Italia con I miei figli .. andiamo un poco per tutto e anche 4 giorni in Scigliano.. ciao veniamo fra 3 settimane .."}, {"username": "Susan Hobrath", "comment_text": "Thank you for sharing..my family is from San Chirico Nuovo.. Visiting soon can’t wait ..would love some recipes from Italy … I was too young to appreciate my grandmothers cooking but now I would love to have some recipes from southern Italy"}, {"username": "Maria Sullivan", "comment_text": "After visiting all the major cities of Italy , go visit the Veneto region especially beautiful Marostica ….. a magical gem !! The Partita a Scacchi every 2 years is certainly a pageant like no other.\nNothing like wandering through the smaller towns of Italy …. I’m a tad biased."}, {"username": "Lisa Powers", "comment_text": "Grazie!"}, {"username": "Kathy Sylvestre", "comment_text": "My turn will be next September! I’ve been dreaming of visiting Italy for an eternity!"}, {"username": "Chris Neri", "comment_text": "What area ? Molisse?"}, {"username": "Heidi McPhillips", "comment_text": "Small villages are the best!! I prefer\nI think you could really give great suggestions ❤️"}, {"username": "Kathy Fryer", "comment_text": "Kathy Fryer"}, {"username": "Jill Brothers", "comment_text": "Yes, we are coming for the second time in September. We fell in love with the people, the countryside, the food and history. We look forward to learning more"}, {"username": "Chrissy Cobb Nunziato", "comment_text": "How sweet of you! Your English is really good too!!"}, {"username": "Marlene Bertino Randolph", "comment_text": "Italy is my favorite place to visit ❤️"}, {"username": "Susan Schulte", "comment_text": "Thank you! My favorite destination. Your English is quite good!😄"}, {"username": "Susan Gulrajani", "comment_text": "thank you! I can't wait to visit your beautiful country!"}, {"username": "Tony Mancini", "comment_text": "Qui e miele di noi? Nessuno!"}, {"username": "Pamela Carlson", "comment_text": "How kind. Best of the day and good health to all y’all."}, {"username": "Mary Gregory", "comment_text": "Thank you 💕"}, {"username": "Linda Chagnon", "comment_text": "Friends in & for Italy ! Linda in Arizona, USA 🌵💖"}, {"username": "Lea Wilson", "comment_text": "Lea Wilson"}, {"username": "Mindy Jo", "comment_text": "Your English is fab!! Never apologize!! You do better than most people from here!! Excited to visit in November!! I've been learning Italian (im terrible at it) and can't wait. Ciao!!"}, {"username": "Diane Maker Sandelowsky", "comment_text": "A beautiful message!❤️ My husband and are looking forward to visiting your beautiful country in Oct."}, {"username": "Diane Pieri Adiliano", "comment_text": "Grazie"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Best country …. We just attended our sons wedding in Poppi …… wonderful !!!"}, {"username": "Donna Holt", "comment_text": "We will! Wish I had some Italian blood or heritage I could tap into. Visiting first time late in September. Very excited. 💖\nI'm workingnon my Italian through Duolingo. Hopefully it will help."}, {"username": "Krystal Apolinaro", "comment_text": "Thank you for sharing your beautiful country with us!"}, {"username": "Carrie Lamm Bishop", "comment_text": "Thanks for your welcoming post! I live in the US and want to know enough Italian to be understood. What words, vocabulary, and grammar would you recommend as an Italian?"}, {"username": "Beverly Bovo", "comment_text": "My husband is also from a small town Roccopemonda a providence of Salerno"}, {"username": "Cynthia Cammuse Burkeen", "comment_text": "Thank you so much for the kind words!!"}, {"username": "Sheri Walters Densing", "comment_text": "Be as proud of your English as you are of your country! Thank you for your sentiments!"}, {"username": "Dixie Kotylak", "comment_text": "Love Italy, just returned from my first visit and can’t wait to come back! ❤️🇮🇹❤️"}, {"username": "Denise Chapman Toth", "comment_text": "Italy was a bucket-list wish for me. My family pulled together for my 50th birthday and got me 2 tickets and a hotel in Florence as my gift. I know, I have an awesome family 🙂 In planning my trip, I added a 3 day/2night stay in Venice. I fell in love with Italy. It’s so charming and beautiful. So rich in history and the pride, precision, and detail in the architecture is stunning. Each family owned shop and kiosk has a story and I loved getting to know the people, our nightly hotel bartender, and just people we sat near at dinner. The real thing matched the pictures I’d seen. Next year I am finally returning, God willing, and I’m bringing my kids back with me so they can see and feel what I did -because it’s special. Thank you for sharing your country with us, for your patience with us as we fumble through our remedial version of the Italian language, and for your graciousness as thousands of visitors swarm your homeland like locusts to just experience it’s uniqueness and historical importance.\n\nBTW Your English is as good as mine and I’m born and bred in America ."}, {"username": "Helena S. Stone", "comment_text": "Sono metà italiana (nata a Milano) e metà americana (a causa di mio padre) Questo gruppo mi incanta che così tante persone hanno interesse a studiare non solo la lingua, ma anche aspetti della vita italiana."}, {"username": "Lynne Meyer", "comment_text": "Grazie Millie"}, {"username": "Leila Jane", "comment_text": "Ciao, Elisabetta! Thanks for joining us! I once lived in Italy for a two year period as a US military wife in Vicenza. My husband worked at Caserma Ederle and we lived in Camisano Brigantina. I cried when we left as we were originally supposed to be there for 2 more years. It was an incredible highlight of my whole life. I'm now 78 and recall those years with great fondness and wonderful memories!"}, {"username": "Scott Perry", "comment_text": "Your English is perfect!!!"}, {"username": "Michelle Plutto", "comment_text": "So so sweet!!! I’m so excited to experience our trip!!"}, {"username": "Paula LaBellarti", "comment_text": "Welcome and thank you! My family is from Bari."}, {"username": "Susan Argall", "comment_text": "Find me a husband and I'll start packing !"}, {"username": "Carolyn Schwab", "comment_text": "I’ve been many times (from England) and I love it, I’ll be there again in September 😍"}, {"username": "Beta Madeira Bogaert", "comment_text": "That’s very sweet of you to say! Thank you for your hospitality!"}, {"username": "Karen Espinoza", "comment_text": "Your English and your country are fantastic.\nI am from Costa Rica 🇨🇷 my English is not very good ☺️\nItaly one of the best countries in the world."}, {"username": "Shelton McBride", "comment_text": "Thank you. We love visiting Italia because the country and the people are beautiful and friendly!"}, {"username": "Fetchin Gretchen", "comment_text": "Welcome to the group! I will be living in Italy from 2. September to 18. November this year. What town are you in?\nBenvenuto nel gruppo! Vivro in Italia dal 2 Settembre al 18 Novembre di quest'anno. In che citta sei?"}, {"username": "Patsy Luque Mejia", "comment_text": "Grazie mille 😁"}, {"username": "Beverley Ford", "comment_text": "I have absolutely fallen in love with Italy. Going to Florence in October and cannot wait! 🥰"}, {"username": "John Adams", "comment_text": "Grazie, Elisabetta 🇺🇸🇮🇹"}, {"username": "Paweł Kiepel", "comment_text": "Small willages, towns are more interesting then big, most knowns cities sometimes.\nMaybe there is not a big history but we can meet, talk with real people, see, touch their life. I prefer small towns, lost in somewhere contact with the nature, then big crowded cities."}, {"username": "Laurie Francis Menk", "comment_text": "So sweet!❤️"}, {"username": "Susan Streed McNaughton", "comment_text": "Totally agree!!!"}, {"username": "Larissa Bond", "comment_text": "Aww! That’s so sweet! ❤️"}, {"username": "Dianne Fowlie", "comment_text": "Thanks Elisabetta. I knew I’d be coming back to Italy “because I tossed the coin”. Visiting from New Zealand in 24 mor days 😎"}, {"username": "Rose Marie Reed Miller", "comment_text": "I lived in Italy and loved it , I would have stayed if I could have .,"}, {"username": "Vanessa Durkin", "comment_text": "Your english is very goid i am learning italian and flying there this week so excited"}, {"username": "Patricia Siemiontkowski", "comment_text": "What a lovely comment! Thank you! Your country is beautiful and your people are awesome!"}, {"username": "Diane Leesmith", "comment_text": "No need to apologise! Your English is great. If only I was that good with the other languages I speak.\nI think any contribution you make to this group would be valuable and helpful."}, {"username": "Susan A. Jasper", "comment_text": "We are excited to be visiting your country! And, BTW, your English is so much better than my Italian! :)"}, {"username": "Bobbie Lane Hausherr", "comment_text": "Bobbie Lane Hausherr"}, {"username": "Rachel Castleberry", "comment_text": "Ciao Elisabetta!\nGrazie! I’ve always wanted to go to Italy and other European destinations. My husband and I will finally be there late September early October 2023 and I am beyond excited! Love this!❤️ And can’t wait to see your beautiful country in person!"}, {"username": "Danielle Balch Blundy", "comment_text": "I would live in Italy if I could. We loved it."}, {"username": "Bambi Harris", "comment_text": "Grazie! <3"}, {"username": "Phyllis Waring", "comment_text": "Phyllis Waring"}, {"username": "Phyllis Waring", "comment_text": "Grazie!! Mi piacere di conocerla!!"}, {"username": "Renae Larcus", "comment_text": "We love your country. Thank you for having us as tourists."}, {"username": "Mary Balistreri Swan", "comment_text": "Your English is very good don't worry. 🥰"}, {"username": "Janie Collins Campbell", "comment_text": "Thank you! Can’t wait!"}, {"username": "Carol Taylor Tisdale", "comment_text": "Thank you for sharing your exquisite country with us!!! ♥️"}, {"username": "Jeanie Spates", "comment_text": "I’m going to Venice for a month"}, {"username": "Jeff Mayernik", "comment_text": "We're actually more interested in small villages than large towns. We are making our first visit next year - in June - and will stay in Tuscany region for a month or so to see what it's like but if we ever move there will probably be further south"}, {"username": "Carol Taylor Tisdale", "comment_text": "I live in Texas and Italians have always reminded me so much of Texans - passionate, expressive, outgoing and friendly, lovers of good food, great sense of humor. We always feel very at home when traveling through Italy - your hospitality is so welcoming 👏🏻♥️"}, {"username": "Mary Ellen Maatman", "comment_text": "We loved Italy, and part of the reason we loved our trip was the kindness of people we encountered everywhere we went."}, {"username": "Maree Bauckham", "comment_text": "Maree Bauckham"}, {"username": "Tatiana Goutman", "comment_text": "Your English is very good!!! Love Italy 🇮🇹❤️🥂"}, {"username": "Jonna Beck Lewis", "comment_text": "Elisabetta Coppo - Do you happen to know anything about visiting Quarazzana?"}, {"username": "Sherri Haff Benson", "comment_text": "Going for our first time with our adult children to experience the awesomeness of Italy together. Grazi"}, {"username": "Heather Van Olst", "comment_text": "That’s so very kind of you. We’ll be visiting Italy in Sept. We prefer to honour the countries we visit by getting to know the lovely people who call it home. Thank you for making us feel welcome."}, {"username": "Anna Gambino", "comment_text": "Tell us about your small village! 🇮🇹"}, {"username": "Gary Fossaceca", "comment_text": "Thank you! I’m working on my dual citizenship here! Very eager to be an Italian citizen."}, {"username": "Debbie Potter", "comment_text": "Awww... you did very well on your English. Great job!"}, {"username": "Loretta Wilks", "comment_text": "where is your beautiful village Elisabetta 😍\nthankyou We.will.over in may June next year so excited 😊"}, {"username": "Carrie Aageson", "comment_text": "From what region and what city do you come?"}, {"username": "K M Uí Fhionnaláin", "comment_text": "Elisabetta Coppo Grazie mille.Sto imparando l'italiano.Pens\no che L'italia è un paradiso sulla terra(Excuse my bad grammar 🙂)"}, {"username": "Alicia Cox", "comment_text": "You have a BEAUTIFUL country! 😃"}, {"username": "Carmen Martin", "comment_text": "Thank you Elisabetta 😍"}, {"username": "Gladys Lambertucci", "comment_text": "I'm planning a trip to Italy next summer with my grandkids, I would love to go to the small town where my nonno was born , any chance that you are near Tolentino, Macerata? I'm argentina living in Usa, my grandparents migrate to Argentina and my father was born in Mendoza, Argentina, looking for my roots in Italy, TIA"}, {"username": "Karen Martinez", "comment_text": "We’re back in US today from Italy as our last destination. We had a wonderful time. It was our 4th time in Italy. This time we went to Milan (shopping!) and Lake Como (Bellagio).\nThank you for all the tips and recommendations\n."}, {"username": "Kathryn Gibson Mirabito", "comment_text": "Your English is great! 🙂\nI love Italy!! The place, the people, the history and the food. My husbands family is from Stromboli, and we are going to be in Italy for a month, travelling from north to south. So looking forward to our trip."}, {"username": "Gina Albanese Verso", "comment_text": "Gina Albanese Verso"}, {"username": "Lucy Di Benedetto", "comment_text": "I can’t wait to travel again to Italy in the near future!\nbeing from Italian descent, I am excited to see where our parents were born!\nThis is part of who we are!"}]}, {"id": "2203603703372041", "text": "Hello\n\nLooking at travelling to Rome next year (April) with our 2 kids (8 & 5). Will be there for about 3 days.\n\nCan we please have recommendations of reasonably priced family accommodation in Rome.\n\nAlso recommendations best way to get tickets for the Colosseum.\n\nIf there’s any other recommendations you would do with the kids please let me know.\n\nOn another note do people just get taxis from the airport to their accommodation?\n\nThanks for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2203603703372041/", "likes": 1, "comments": [{"username": "Doots Okoniewski", "comment_text": "Every time I've been to Europe I've always gotten a cab to and from airport to hotel. No matter what country."}, {"username": "Daisy Yoo", "comment_text": "I think u may want to be more specific, like around what months u are going, and what is ur level of reasonable priced. best way to get the ticket is their official web site. airport taxi is fixed price, even if u have freenow installed the app, u will see the price is the same 50 euro but for up to 4 ppl so u will be ok. we will be there dec 2nd morning and I will just get a taxi outside. I know needs to be the white one and will also double make sure the price and let them know I know it is fixed price and I will also take a pic of their license # in case. for me 3 days in rome is not long, u can do hotel or apt. we will do apt close to spanish steps (nothing fancy as we are big on breakfast and get up early and want to cook ourselves) and we do not really eat dinner like most ppl do, but will eat out only for lunch."}, {"username": "Alessandro Iannelli", "comment_text": "i've been to rome some 5-6 times and never used a taxi. public transportation,\nespecially the metro, is good (not so much the buses, but they are another option). you can of course take a taxi, but you don't have to, you have options."}]}, {"id": "2203316016734143", "text": "I added more! 😅\n\nFor whatever it’s worth, my feedback as a solo female traveler returning just a week ago!\n\nRome-Reggio Emilia-Florence-Rome\n\n-TheFork was clutch! I perused restaurants and made reservations easily. Download it.\n\n-I never once had an issue with needing a toilet, so The Flush app was pointless for me.\n\n-GoogleTranslate - a perk, even after my year of learning Italian.\n\n-FreeNow - Lifesaver!!!! For taxis in Rome area.\n\n-GO to Emma Pizzeria and do not ask questions. And then go again. 😰 AMAZING. PS - I did lunch both times; might be ideal to make a reservation. Eat from the seasonal menu. Also Mazzè - make a rez.\n\n-Trenitalia App - Used to book all of my train tickets. FYI - I found the best luck on choices the morning of the day prior. I tried one day-of morning and was looking looking at later afternoon. A previous post had me navigating the train stations easily!\n\n-Visit the Farmacias for the BEST cosmetic goods! Happy to add more if interested. Here are two vids that did not steer me wrong! LOVE what I got! PS - also snagged some mini nail polish that lasted forevvvver.\n\nhttps://www.tiktok.com/t/ZT88TXBX9/\nhttps://www.tiktok.com/t/ZT88Ttrvj/\n\n-In Florence, visit Ugo Poggi Firenze for antiques. The oldest in the area. I got a silver ring and custom set of glasses. If you have something in mind (or don’t! in my case), they are so patient.\n\n-In Florence, there was a TON of shopping around - high-end, mainstream, etc. Dare I say almost a bit too commercialized in some areas?\n\n-Florence: pack your patience (and water!) and head to Piazzale Michelangelo. You will overlook the entire city. It was breathtaking (literally…aside from being 97 and sunny when I did it). You won’t regret it. Worst case, you can barrel roll down the hills/steps to return to civilization. (JK)\n\n-PLEASE go to Officina Profumo-Farmaceutica di Santa Maria Novella in Florence. It meets luxury cosmetics/candles, etc. and mini museum. And by luxury, I mean quality but you will not spend too much at all. I snagged a rose water and lip moisturizer because .. why not, and I spent $50 euro?\n\n-If you decide to impulsively get a tattoo in Florence, check out Florence Tattoo Studio and message them a day in advance. They were fun and my work is great!\n\n-Wherever you go, when lunch hits, grab a sandwich at a local shop and then grab a stool on the road and enjoy. One of my favorite parts of the trip.\n\n-If traveling soon, YES, it is HOT. I am used to hot, but not HUMID in Colorado where I live. My neck fan was amazing. While it could be my perimenopause 😅 it was spi￼iiicy, even in the FCO airport. My thicker thighs never suffered with some lightweight spanx. I sweat non-stop. My afternoons, I took a break and would relax or take a cold shower.\n\n-I saw another post recently about “begging” for water..I never once had this happen. I always had euros on me and there are stands alllll over the place. Bottles were typically 1 euro, 1.50 at most. Plus..the fountains?\n\n-Caution: This only happened in Reggio Emilia. Following a LARGE scale concert, the city was not equipped and gridlocked for hours. I understand. However when I finally got a cab (about 4:30a) to my lodging about 15mins outside of town, I had a touchy-feely driver who grabbed at my thighs and went in for more as I paid for my ride. I was able to fend off, but unsettling nonetheless. Given that, if traveling solo - an AirTag is great, as is a personal alarm device like Birdie. All that said, I did NOT feel uncomfortable even once in more populated areas.\n\nLodging - FYI: every hotel had AC and hair dryer if that’s your thing!\n\nRome: Unahotels Trestevere Roma - Great!! Rooftop bar is lovely, although the staff can be a bit lagging.\n\nReggio Emilia: Hotel La Vecchia Reggio - this place was so quaint. It was more remote than I’d choose, but hotels were entirely sold out because of the concert. I loved it here.\n\nFlorence: Hotel Perseo - I LOVED this spot. It’s quite compact but for 1-2, it is lovely (perhaps larger for more accommodation!) I felt like I was staying with a friend. Breakfast was especially special - you could just tell the extra care.\n\nRome (again): Hotel Ripa - Eh. Just avoid. They really want to be legit, but they are not. You enter to some fancy art installations and then enter your room and it looks like someone had a frat party and forgot to clean. Little basics were dirty - mirror, sink, around toilet, eh. The bar/restaurant was fine during happy hour, but when arriving back with a colleague at 10:45, they said no to a glass of wine (not table service) at closing time 11p.\n\nRandom Thoughts:\n\n-I packed a carry-on backpack (BEST choice) with just three outfits, plus a tote and cross-body purse. I also packed laundry detergent sheets to wash along the way and rewore (is that a word?) outfits/mixed and matched. It was great!\n\n-Ultimately I snagged a carry-on suitcase from a stand/vendor on the street. Worth the $35 to pack my stuff that was above 3.5oz to the US.\n\n-I bought Skechers sneakers and put some inserts in those babies and I was golden! Sure, my feet were tired from 7+ miles a day but never sore, blistered, etc. And I bought no-show socks with the little padding around the heel. Perfect.\n\n-Portable chargers! I brought two and they came in handy. I brought along my own converter but had a hell of a time. It would charge a few percentage and get too hot. I ended up at an Apple Store and just bought a local charger. Worth it!\n\nAll that said, if you can take the solo trip, do it!!", "link": "facebook.com/groups/1373361046396315/permalink/2203316016734143/", "likes": 85, "comments": [{"username": "Patrice Warren", "comment_text": "Thanks so much for the info! Regarding Free Now, does it work like Uber - just in and out, billed to your credit card, no fuss no muss?"}, {"username": "Jenn Messina Babore", "comment_text": "I was never able to get a taxi via FREENOW unless it was very early morning. Hailing a taxi was the best way for us. 😢"}, {"username": "Gianna Onesi", "comment_text": "Wow thanks for sharing. Sorry about that scuzball driver I hope you hit him in the groin 😆"}, {"username": "Patty Barnes", "comment_text": "Grazie!"}, {"username": "Diane Davis Lawyer", "comment_text": "I read if hailing, you need to ask the taxi driver if they take FreeNow. But, that seems counterintuitiv\ne as to how the app works. You should not be hailing if you're using FreeNow, right?"}, {"username": "Nydia Bryan", "comment_text": "I’d love more info on cosmetic goods 🙏🏽"}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson"}, {"username": "Sandy Todd", "comment_text": "Just what I needed to hear because I will be solo."}, {"username": "Barb Thompson Pedder", "comment_text": "Trenitalia is not available as an app in Canada. What do people recommend?"}, {"username": "Chrissa Matthews", "comment_text": "Thanks, sounds like an awesome trip!"}, {"username": "Amy DeRenzo Hulbert", "comment_text": "This was fantastic info!"}, {"username": "Karen Boldi", "comment_text": "The information you’re providing is amazing! Grazie!"}, {"username": "Keivan Fahim Nazari", "comment_text": "Very sorry for your incident in my hometown Reggio 🥹, if you happen to remember the taxi’s code please report him"}, {"username": "Anna Criscuolo Gebstadt", "comment_text": "Thank you. I did Rome 3 days in 21 and thinking of going to Puglia on my own."}, {"username": "Susan Zimmerman", "comment_text": "Thanks for your post!! Great info. Can you elaborate on Farmacias for cosmetics? Thank you"}, {"username": "Nancy Willson", "comment_text": "following"}, {"username": "Diana Spicer", "comment_text": "Great info. I would like to learn about the farmacia beauty products connect!!"}, {"username": "Jacqui Hodge", "comment_text": "Did you need reservations for Emma Pizzaria?"}, {"username": "Anna Treviño O'Campo", "comment_text": "You are a force!"}, {"username": "Sarah Felitti", "comment_text": "Following"}, {"username": "Rupal Pujara", "comment_text": "Thank you - and more on cosmetics please 🙏"}, {"username": "Katrina Gibson", "comment_text": "Jason Gibson Kianna T Jordan Mildenberger some good info!"}, {"username": "Irene Oda", "comment_text": "Can you share what type your neck fan is please?"}, {"username": "Kathy D. Mendenhall", "comment_text": "Great comments on your vacation!! Thanks for sharing as I’m planning on going fall of 2024!"}, {"username": "Lauren Wasson", "comment_text": "So helpful! Thanks"}, {"username": "Nina De Martino McDonough", "comment_text": "What backpack did you use? We are a family of 5 traveling and I don’t want to check bags 🤷🏻‍♀️"}, {"username": "Alicia Wendlandt", "comment_text": "Was it the Harry Styles concert in Reggio? 😍"}]}, {"id": "2203166933415718", "text": "After disembarking from a 21 day cruise in Civitavecchia, we are spending a few days in Rome. We have already booked transportation to get there. After Rome we are headed to Venice. Our problem is finding affordable transportation from Rome to Venice. Here is the kicker, we will have 2 big suitcases each and a carry-on each. We are thinking that taking a train will be to difficult considering the size and amount of luggage we have. Any suggestions? TyIA.", "link": "facebook.com/groups/1373361046396315/permalink/2203166933415718/", "likes": 58, "comments": [{"username": "Carolyn Hall Raffo", "comment_text": "Viator"}, {"username": "Michele Power", "comment_text": "How did you ship your stuff home?"}, {"username": "Sus N Mac RN", "comment_text": "If you happen to be flying back out of Rome, you could put some of your luggage in a storage facility while you travel to Venice. You definitely want to be light in luggage when you’re having to transport from a water taxi to your hotel in Venice. Otherwise, shipping things back home. Sounds like a great option too."}, {"username": "Gina Rabotino Pelle", "comment_text": "Have you looked into flights from Rome to Venice? Prob easier than train with all that luggage."}, {"username": "Wendy Harrison", "comment_text": "4 big suitcases for two people? Way too much, even for a cruise."}, {"username": "David Hastie", "comment_text": "Are you getting off the Carnival Pride??"}, {"username": "Lisa Hartert", "comment_text": "That amount of luggage will be impossible to manage on the train. My husband and I did four pieces of luggage between us and it was horrible! I agree with another commenter to store or ship the rest home and do two carry Ons to Venice. Mailboxes etc will send your big suitcases home. 😃"}, {"username": "Kari Cooper", "comment_text": "If you look now, you may be able to find some cheap flights on the budget airlines (Volotea, Wizz, Ryanair, EasyJet) that are either cheaper or on par with the train.\nYou will not want to lug that many suitcases around Venice. If you're flying home from Venice, I'd look in to luggage storage at the train station or airport."}, {"username": "Linda Snaring", "comment_text": "Many years ago, the first time we went to Europe we did a cruise first and then traveled by train for a few days. It was way too hard with all that luggage. There is a step up to get on the train very hard ￼ lifting the suitcase. And all the people getting on the train had to wait for you while you put all that luggage on the train. ￼ So now we travel with one small suitcase each and one small backpack each. Much easier!"}, {"username": "Monica Roman-Fazio", "comment_text": "We had 4 large suitcases and backpacks and the train buisness class was great"}, {"username": "Lisa Louis Hoffman", "comment_text": "One big one each plus carry on per person? If so, we did that no problem. Choose the frecciosa business or first class. There’s plenty of overhead for carry on and your big ones will either got behind your seat or one of the racks in your cabin"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "You have WAY too much luggage. We are leaving for three weeks in Italy, Greece, Croatia and Turkey and are only taking a carry on and a tote each. There are laundry facilities on the ship. The express train from Rome to Venice is your best bet for transportation,\nbut your suitcase situation now is untenable. Just getting those suitcases to roll across the massive cobblestones would be difficult. Cull your wardrobe for the trip. Traveling light this year will make your trip, easier, better and safer. There are WAY too many people traveling right now. It’s more stressful than ever."}, {"username": "Amy So", "comment_text": "We have traveled with 2 suitcases with a carryon before on train a few years back. Not easy at all since the carry on kept falling off the suitcases.\nVenice is not a place to have more than one big suitcase and a personal bag. Bridges everywhere. It is possible not take all of your 4 suitcases onto the train since you are boarding in Rome and getting off at Venice Santa Lucia. However, I’d be wary of theft. I would suggest finding a storage for at least half of your stuff when you arrive at the train station."}, {"username": "Susan Hagy", "comment_text": "Way too much luggage for any transportation.\nWe travel a mo th each trip and manage nicely with 1 carry on each, a very small rolling bag for meds and toiletries that passes for a personal item for my husband, and we also both have a small cpap machines that don't count. We never have to worry about loosing luggage on connecting flights or how to lug it all. I know it's not for everyone but it's easy to launder your clothes on a cruise. It took us a while to get to just a carry on plus personal bags or a back pack, but it is so much easier in every way. Best of luck\nMost importantly, enjoy your trip!!"}, {"username": "Donna Toma", "comment_text": "I heavily overpacked one year, so I found a shipping place in Florence to rid myself of one huge bag. The trains and water taxis would have been really hard to do with two big bags and a carry on. And I was in my 50s!!!"}, {"username": "Rachael Richardson", "comment_text": "How much luggage , quarter it ! The train is easiest option ,travel light !"}, {"username": "Mary Evans", "comment_text": "Train is essiestv"}, {"username": "Ian Beyer", "comment_text": "Train is gonna be a lot easier with your luggage than any other mode of transportation"}, {"username": "Janine Emma Lucas", "comment_text": "Thin out your luggage. 4 large is a lot. There’s laundry onboard or even book a apartment in Rome to do a load of must haves for your land portion. If you can get down to 1 bag each you’ll navigate much easier…and cheaper"}, {"username": "Cindy Berre", "comment_text": "https://\nwww.luggagefree.\ncom/\n?gbraid=0AAAAAD_\nQNZ7CTpX-lOLe16\nIM_Bz9nEp-B&gcl\nid=CjwKCAjwlJim\nBhAsEiwA1hrp5rj\nirwebImGiVtAdxo\nI4Wr2sfTdKfAsN3\nbwCYf5Cqsf50brT\n5xF9wxoC_-oQAvD\n_BwE"}, {"username": "Mary Passeri", "comment_text": "Get the train! If you're worried about luggage and theft etc. Treat yourself to a sleep cabin and travel over night.\nIt's honestly not that expensive and saved the cost of a night in a hotel."}, {"username": "Bree Hagan", "comment_text": "I did 6 weeks with varying climates in 11 countries from 30°F to 90°F all with a carryon backpack…"}, {"username": "Susan Lowry Lamb", "comment_text": "They offer laundry on the cruise ships. Either you doing it, or you having them do it. I'd recommend you try to scale down if you each have two big suitcases."}, {"username": "Lauren Vassallo Beattie", "comment_text": "Take the fast train buisness class the luggage compartments are always in sight."}, {"username": "Mary Anne", "comment_text": "This might be helpful.\n\nhttps://\nwww.italiarail.c\nom/baggage"}, {"username": "Cheryl Bonello", "comment_text": "Excessive luggage particularly if there are flights involved returning home.\nCan be very costly when it comes to luggage weight"}, {"username": "Maria O'Callaghan", "comment_text": "Book 1st Class/business class you will have more room. We have done the same before and yes we came off a cruise & had a big suit case each plus carry on.\nWe did have a private pick up from the port to take us to Rome, there were 4 of us and stayed in Rome for a few days before getting the train to Venice. We managed.\nSince then we have learnt to use smaller suitcases, but it is challenging when you come off a cruise with all the formal wear."}, {"username": "MaryLynn Capobianco", "comment_text": "Are you 4 people (one big suitcase per person) or 2 (two big suitcases per person)? Plus carryons. Depending on your answer, I think you probably need to cut out a lot of what you packed."}, {"username": "Charlene Messina-Fowler", "comment_text": "Ship the luggage home"}, {"username": "Miriam McNally", "comment_text": "As other contributors have said, cull your luggage big time. Look at each and every item in your 4 large suitcases and see do you really need it, then whittle it down to a case per person that the person is able to lift. Many train stations have stairs, some hotels do too. It's an impossible situation to trail so much baggage with you. Travelling light will make your whole trip so much better. Good luck!"}, {"username": "Maureen Rebello Hagerty", "comment_text": "When I last got off a cruise in rome and wanted to go to Venice. 9 of us. We flew. Quick and easy. But the train works too"}, {"username": "Kandra Giannini", "comment_text": "Use the train super affordable"}, {"username": "Terrie Glanzman Dopler Adams", "comment_text": "Train is the way to go"}, {"username": "Beatriz Davalos Moreno", "comment_text": "I was just there this week, buy a train ticket from Rome to Venice, not expensive and easy over internet. I used trenitalia, took one from Rome to Florence, then Florence to Venice. It was about2 and 2.5 or 3 hours I think each one, very comfortable. I bought business class. They even give you a snack and drink"}, {"username": "Beth Lammes Bruner", "comment_text": "Trains are fantastic between as well as flights (many options), we have also driven if you have the time\nAre you ultimately leaving from Venice? Or returning to Rome for international flight? Another option would be to check some of your luggage into the airport….some airports (you would have to check Rome airport) if they had this service. We used it in Northern Europe when we had 8-10 hour layover. Checked bags into hold while we explored city. They may do that for a few days as well."}, {"username": "Susan Monaghan", "comment_text": "If you take the train, keep an eye on your suitcases. If you store them near the door it is easy for them to be removed when the train arrives at a station. Best yet, try to keep them near you."}, {"username": "Beatriz Davalos Moreno", "comment_text": "From Civitavecchia, i was in a 9 night cruise, I bought bus tickets to Rome through get your guide, very easy and cheap, it stops right outside the port on the street"}, {"username": "Paulyn Hoffman", "comment_text": "Take the train. Easy Peasy! You’ll then walk a short distance to the Water Taxi’s."}, {"username": "Beatriz Davalos Moreno", "comment_text": "Very comfy too! Table and chairs"}, {"username": "Sarah Magnusson", "comment_text": "Hi! Flix buses are comfortable and affordable. You just add on the additional cost for more suitcases when you book. The journey is between 8 to 10 hours long, that’s the drawback.\nI would recommend thinking about packing less, using laundry facilities onboard, and taking the train. It’s more comfortable and a bit quicker. We use Omio to compare all transport options and prices. This article may help:\nhttps://\ncruisetrail.com/\nsearch-compare-a\nnd-book-train-t\nickets-in-italy\n/"}, {"username": "Diana Sankara", "comment_text": "Trains are equipped with overhead compartments and storage shelves; traveling with luggage is the norm."}, {"username": "Ken Lerch", "comment_text": "We recently did a 6 week trip: including 20 day cruise in 6 countries then did 2 more countries on our own. My wife and I had one medium sized piece plus one light carryon each. We are in our 70’s. Ignoring the fact that you travel way too heavily, repack down to one suitcase and a carry/on. Ship everything else home when you are in Rome. The trade off of ease and cost will be worth it. Then take the rapido train through Florence to Venice. We even shipped 15 kilos in Copenhagen before we returned home."}, {"username": "Beatriz Davalos Moreno", "comment_text": "It's not difficult, we were 4 had 4 big suitcases and 1 carry on each plus a personal bag or backpack! It goes with you inside train but there is space at end of each car and between the seats too"}, {"username": "Ron O'Brien", "comment_text": "I faced the same situation and decided to go via train, BUT I cut back to one carry on, a backpack and a medium suitcase. The time before, I got lucky and a young man helped me lift a large suitcase, but depending on the kindness of strangers is not a way to go."}, {"username": "Bennett Richards", "comment_text": "Take the bullet train from Rome to Venice… stops in Firenze."}, {"username": "Billie Begley", "comment_text": "We used the train. We had one big suitcase each and one carry on each. No problems."}, {"username": "Tam Wong", "comment_text": "Train and down size"}, {"username": "Carol Hoffman", "comment_text": "I found the big heavy suitcases hard to manage on the train but doable. Remember as you are packing how difficult that is, and the number of outfits dwindle to just the basics. Call an Uber or get a taxi to the train station, not the bus, too unwieldy and unpredictable with heavy luggage.Then the train is great. Flights from Rome can be even harder, crowded airports and more delays,"}, {"username": "Rose Anderson", "comment_text": "Your fastest easiest and most cost effective way will be the train but no matter what option you choose taking more than each can carry and keep up with independently will burden you and put you at risk for theft."}, {"username": "Steve Wolfrom", "comment_text": "Can anyone tell the original poster if there are porters or carts to assist with the transportation of the luggage. That’s the issue"}, {"username": "Dixie Kotylak", "comment_text": "Having just had to lug my suitcase and carry-on items, up and down countless flights of stairs, when using the train, if I had to do it again, and I was embarking from a cruise, I would hire a driver to take me from the cruise ship right to the train platform! If that’s an option for you, I would highly recommend it! ￼"}, {"username": "Jenny Kendrick", "comment_text": "We caught the train, it was ok as long as you can lift your suitcases in"}, {"username": "Sandra Ferrante-Kohn", "comment_text": "Whatever you do, don’t let some “sweet young thing” offer to “help” you with your luggage. There are gypsies everywhere and once they have access to your bags, they won’t relinquish them without a ransom."}, {"username": "Kristie Storie Winston", "comment_text": "The train will be fine. We just did it with a huge rolling suitcase and a backpack each."}, {"username": "Leah Naylor", "comment_text": "Try finding storage for luggage in Rome train station and absolutely take the train. I’ve done at the Florence train station. You could also get a first class car but luggage will still be a problem when you arrive in Venice. Even if you get a private water taxi, it’s the worst city to be dragging luggage."}]}, {"id": "2203666506699094", "text": "Hi everyone,\n\nI’m struggling to book a train from Naples to sorrento online for 14th October.\n\nRometoRio says it can be booked through EAV but none of the links are working nor are my google searches.\n\nWhat am I missing? Any ideas?\n\nWe’re coming from Florence and needing to get to positano so open to other options.\nTrain from Florence to Salerno get us in later than I would like as were traveling with kids.", "link": "facebook.com/groups/1373361046396315/permalink/2203666506699094/", "likes": 8, "comments": [{"username": "Rachael Richardson", "comment_text": "Don’t book just use the local train -"}, {"username": "Emine Karaca", "comment_text": "Şahane"}, {"username": "Cheryl Pacholek", "comment_text": "I had that issue a few years ago. Train to Sorrento from Naples cannot be booked- it's a small train, can get very crowded and it's just pot luck to get a seat. I sat on my luggage for the trip. I don't think it is a part of the main train systems."}, {"username": "Emma Bentley", "comment_text": "It's too far in advance. Right now you can only book til mid-September. Wait another month then try again."}, {"username": "Sara Joanne Bedford", "comment_text": "We did this journey a few years ago with young children but booked a taxi transfer from Naples train stn directly to Positano. Saved on time and not as expensive as you may think 👍"}, {"username": "Donna Watson", "comment_text": "I’ll try for you"}, {"username": "Donna Watson", "comment_text": "There’s lots of trains available"}, {"username": "Donna Watson", "comment_text": "Only took a pic of first page for you"}, {"username": "Ashley Martins", "comment_text": "That is just the commuter train, no need to purchase in advance as it is not assigned seats, just buy at station."}, {"username": "Sonita Sandhu", "comment_text": "Hi! Here is the link to the Campania express. And you can book in advance. https://\nwww.eavsrl.it/\nweb/\ncampania-express\n-en"}, {"username": "Sonita Sandhu", "comment_text": "I did the regular train and it took longer and no ac and not comfortable. It’s like a subway in NY. It was the only one that worked for the time I was leaving Naples station as I came from Rome. I would have preferred the express one! It’s 15€"}, {"username": "Jason Hobel", "comment_text": "If you are looking to book the commuter train then no need to do that in advance but be aware that train stops at every station (12 or 12 stops). If you are looking for the Campania Express then it is too early. It is quicker than the local train but still makes stops only to allow the for track sharing since most of the track is single use. And the Campania Express runs about every 3 hours or so, so keep that in mind when making plans."}, {"username": "Sue Sherwood", "comment_text": "Take the ferry!!"}, {"username": "Michele Levesque Semosky", "comment_text": "Try the Omio app. It allows you to look at trains, planes and buses"}, {"username": "Shelton McBride", "comment_text": "Suggest you take car and driver or ferry. I took fast train from Firenze to Roma to Napoli (about 2 hours I think), then took car and driver to Sorrento (60-90 minutes I think). Car will pick you up Napoli train station."}, {"username": "Shelton McBride", "comment_text": "I just got my trains booked to go all over Italy in October. I used Railbookers."}, {"username": "Frannie Kaplan", "comment_text": "Use trenitalia and Google maps for reference. Rometorio sucks"}, {"username": "Robin Darmstadt Mancil", "comment_text": "Have you checked out Campania express from Naples to Sorrento? It’s way better than the regional train. 4 trips daily, assigned seats, less stops. Worth the extra money. €15"}, {"username": "Jeff McLellan", "comment_text": "Just did the Campania Express from Naples to Sorrento. It was the worst part of our three week trip to Italy. We booked a van with driver for the return and strongly recommend you just go that route on your way down. Depending on how many of you there are you can also look at mydaytrip.com for shared vans."}, {"username": "Marie Payne", "comment_text": "local train..you dont book ahead like the others..."}, {"username": "Linda Tibbles", "comment_text": "It is a separate train line and name. Recommend looking for a shuttle bus using Viator or similar."}, {"username": "Genevieve Bastien", "comment_text": "Use the App « Trainline »\nOtherwise\nWhen we did Naples to Sorrento, we felt the ferry was easier but not sure if ferries operate regularly in October\n\nGood luck and have a great trip !"}, {"username": "Philip Curnow", "comment_text": "It's called the Circumsuviana. Naples to Sorrento, and even stops outside Pompeii. You can't book it. Just get on it. The temperature in October should be comfortable. I enjoyed it last time I went to Sorrento."}, {"username": "Maree Peel", "comment_text": "You can pre book the Campania Express train from Naples to Sorrento, it still has some stops but is 30 mins faster, has air con, luggage space and dedicated seating. There are limited departures, only 4 or 5 per day, cost 15eu pp."}, {"username": "Angela Klindworth", "comment_text": "Thanks everyone I think I’ll go with a private transfer from Naples to Positano ☺️"}, {"username": "Ibbu Mohd", "comment_text": "Use \"ferryhopper\" app to book ferry from naples to sorrento."}]}, {"id": "2203677776697967", "text": "Buongiorno,\nI'm going to travel from Milano to Veniza with Trenitalia with a change in Verona. Change time is 5 minutes. What if I miss it? Can I take the next Regionale train? Also can I make a longer pause (like 2 hours) to visit the city on one ticket?", "link": "facebook.com/groups/1373361046396315/permalink/2203677776697967/", "likes": 1, "comments": [{"username": "Emma Bentley", "comment_text": "I think it's 99% likely you will miss that train. Book the next one IMO."}, {"username": "Emma Bentley", "comment_text": "I had 35 mins to change in Rome Termini last week. Didn't make it because the first train was so late. No problems using the same ticket for a later train - I asked the ticket inspector before boarding - because it was clearly justified."}, {"username": "Brenno Bianchi", "comment_text": "Any regionale train ticket is valid for any regionale train on the same route for the next 4 hours since the departure time written on the ticket."}, {"username": "Bea Kuckens", "comment_text": "I agree with Emma - that's way too tight. You don't know where on the platform your car will be or which platform the next train will be on. Aside from dealing with the mass of passengers getting off and on, there's likely a lot of walking to do as well. Give yourself a MINIMUM of 30 minutes."}, {"username": "Shelton McBride", "comment_text": "There are plenty trains without long wait in that area. No big worry."}, {"username": "Brenno Bianchi", "comment_text": "Also I would bet 10€ the regionale train from Milano will arrive with at least 10 minutes of delay in Verona because in first place the railway around Peschiera del Garda has been messed up after a reworking and now there are some problems of right of way with the frecciarossas on the line; in second place the Lombardy region don't like to pay for regional trains benefitting the Veneto region (some years ago the train from Milan was direct to Venice, not anymore) and Trenitalia prefer a lot if you buy a ticket for a more expensive train."}, {"username": "Lyn Pappas Dahm", "comment_text": "The regional train is time stamped. If you get a paper ticket you can take another time but you must validate your ticket before you board your train."}]}, {"id": "2203728243359587", "text": "Looking for good private transportation from Naples Airport (NAP) to Sorrento. Does anyone have a favorite?", "link": "facebook.com/groups/1373361046396315/permalink/2203728243359587/", "likes": 1, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Easy car Naples"}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers"}, {"username": "Liz Marikian-Falvey", "comment_text": "Taxi Mister Cab Driver-Naples & Amalfi coast-"}, {"username": "Carole Tarlap", "comment_text": "I used The Sorrento Shuttle 💥❤️👍\nShuttle@dtservi\nce.it\n+39 8018087092"}, {"username": "Lisa Walkow Bonchonsky", "comment_text": "We used Transferelax. It was $280 Round trip from Naples to Positano for 4 of us. Very reliable and great communication."}, {"username": "Barbara Brosnan", "comment_text": "Joe Banana. We used them several times throughout our trip this summer and they were fabulous"}, {"username": "Christine Golia Brigida", "comment_text": "Amalfidrive4you"}, {"username": "Nancy Fricke Corsi", "comment_text": "Sorrento Transfers"}, {"username": "Maria Delaney", "comment_text": "Ciro la Motta is the best. Taxi Mister Cab Driver-Naples & Amalfi coast-"}, {"username": "Brad Nelsen", "comment_text": "mydaytrip.com"}, {"username": "Claudia Anastasion Briggs", "comment_text": "We also had a great day with Ciro la Motta."}]}, {"id": "2203757870023291", "text": "Recommendations to go to the centre from MXP and from the centre to Linate?\n(Milan)", "link": "facebook.com/groups/1373361046396315/permalink/2203757870023291/", "likes": 0, "comments": [{"username": "Veronica Parravicini", "comment_text": "From Malpensa you can take the train called “Malpensa express”\nFrom the city center (San Babila) you can take the metro (m4) to Linate"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203840173348394", "text": "Do you think outdoor cafes be open in October ( in Rome, Florence, Venice, Sorrento )??", "link": "facebook.com/groups/1373361046396315/permalink/2203840173348394/", "likes": 7, "comments": [{"username": "Andrea Corey Andrews", "comment_text": "Yes"}, {"username": "Teresa Kallish", "comment_text": "Megan Sowle"}, {"username": "Nadia Filice", "comment_text": "Absolutely even in December"}, {"username": "Shelton McBride", "comment_text": "Of course, it is the best time!"}, {"username": "Linda Chase", "comment_text": "Yes!"}, {"username": "Robin Darmstadt Mancil", "comment_text": "Absolutely, the weather is nice in October."}, {"username": "Sal Facciponti", "comment_text": "Most definitely."}, {"username": "Denise Lynn Frick", "comment_text": "They are even open in December"}, {"username": "Miyuki Kanno Paul", "comment_text": "Yes. Expect you will be inhaling someone’s cigarette smoke😢"}, {"username": "Alice Francesca", "comment_text": "Of course! We Italians have our espresso every day of the year !"}, {"username": "Sharon Milligan Martin", "comment_text": "Yes"}, {"username": "Philip Curnow", "comment_text": "of course and with outdoor heating in the winter"}, {"username": "Catherine Campbell", "comment_text": "Absolutely"}, {"username": "Brittany Armstrong", "comment_text": "Yes they are"}, {"username": "Berndt Weihs", "comment_text": "YEAH!!"}]}, {"id": "2203851193347292", "text": "After finishing our trip, I would like to post a couple reviews of restaurants and tours we really enjoyed and thought were great value, fun, and organized. I’d also like to post a review of one of our hotels, but I have noticed that many hotel hosts reply to reviews and are heavily defensive and argumentative. Of course my reviews will be fair and honest, I would just like to give a review to help out other tourists, but I am hesitant because of this! Has anyone else noticed this? Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2203851193347292/", "likes": 10, "comments": [{"username": "Rhona OConnor", "comment_text": "I review regularly on Google. I always look for the positives......\nBut keep it accurate. Reviews help businesses and customers."}, {"username": "Shelton McBride", "comment_text": "Don’t worry. Just give your honest viewpoint. Don’t be overly critical or ugly, just be truthful and don’t worry what others say. It is your opinion. Just say I loved it or I don’t recommend it. Don’t say it is a rathole!"}, {"username": "Laura Uribe", "comment_text": "I usually start with what I liked and then address any potential negatives. If it was absolutely awful, then that’s the way it is. People need to be aware of problems. The owner can be as defensive as they want. As long as your review isn’t abusive, the owner doesn’t have a lot to say about it."}, {"username": "Maria Delaney", "comment_text": "No I have not experienced that. I always write food reviews stating the positive and if there is a negative try to do it in a constructive manner. If you found some great restaurant please do tell"}, {"username": "Tracy Foss", "comment_text": "Love feedback and suggestions. Maybe only post positive comments!"}, {"username": "Jamie Cardinal Mueller", "comment_text": "Please post your experiences here. I would like to see them here, all in one place."}, {"username": "Joe-Linda Po Agustin", "comment_text": "Please post both negative and positive, past experiences could help future travellers."}, {"username": "Georgina Mcauliffe", "comment_text": "It’s really the point of reviewing. Praise what’s good and point out areas to improve. What do you think the problem is criticising? Who cares if they are defensive - all the more reason to call them out."}]}, {"id": "2203876270011451", "text": "Could someone please suggest where i might get information on local travel. I need to know how to get fromour accommodation in Ostuni to the train station there. Are there ubers or taxis? Is there an app to book? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2203876270011451/", "likes": 1, "comments": [{"username": "Dafne Vassetti", "comment_text": "No Uber. Yes, you can get a taxi for sure and can ask the hotel to reserve it for you."}, {"username": "Jenn Messina Babore", "comment_text": "Check Rome2Rio for options. It should tell you if there is a bus or taxi, etc. available."}, {"username": "Maria Delaney", "comment_text": "Rome2rio is great"}]}, {"id": "2203881786677566", "text": "My boyfriend is going to Italy August 31st til the 11th of September. He has rented a car from the airport in Venice, traveling to Croatia, to Brento then back yo Venice. What insurance should he make sure to get for the car? Should he get it through the car rental place when he picks up the car, or go ahead and book it through Expedia?", "link": "facebook.com/groups/1373361046396315/permalink/2203881786677566/", "likes": 1, "comments": [{"username": "Robert Lawshe", "comment_text": "First thing I will say, he should book the car directly, and not through a third-party like Expedia."}, {"username": "Joe O'Hara", "comment_text": "That's a good tips. Much appreciated"}]}, {"id": "2203948876670857", "text": "My husband and I will be on a cruise ship that stops in LaSpezia, we booked a tour of The David in Florence. Does anyone have recommendations for best train since We have heard the trains often go on strike.We are in port from 6:30 am-8:00 pm and I booked a walking tour for 10am.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2203948876670857/", "likes": 2, "comments": [{"username": "Emma Bentley", "comment_text": "You're aware it takes 2 hours (at the least) on the train from La Spezia to Florence, right? Look at the Trenitalia website."}, {"username": "Jenn Messina Babore", "comment_text": "Trains typically strike on Fridays. If you are going another day you should be ok."}, {"username": "Dafne Vassetti", "comment_text": "Is the walking tour in Florence or La Spezia?\n\nI don't think you will make it to be in Florence and meet with the guide by 10:00am. If you arrive in La Spezia at 6:30am(if the ship doesn't have delays), consider let's say 30 min to disembark, then it will take you another 30 min at least to get to the train station if you walk or take the bus (you have to buy a ticket, wait for the bus, etc) and quickest way would be taking a taxi. Still to be in Florence by 10 you should try to get one of these three trains (I'am adding the schedule from the Trenitalia website). None of these trains work with your schedule. Also, in all three cases you will have to switch train and if one train is late you will miss the coincidence and will have to wait for the next one in Pisa Centrale. At what time you have the Accademia? You also have to consider the return train.\n\nIf you really really want to do this my suggestion would be to get a private driver that picks you up at the port and brings you to Florence and back.\n\nPs: La spezia Is a nice town and Cinque Terre would be much easier to visit for a one day excursion."}, {"username": "Michela Zanni", "comment_text": "From La Spezia you can take tours to Lerici, Porto Venere and Cinque Terre or Golfo del Tigullio towards Genova (Rapallo, Santa Margherita, Portofino) and Camogli. It's really short time for Florence"}, {"username": "Colleen Dawson", "comment_text": "Docking at 6:30 does not mean you will get off at 6:30. They have to get clearance, so the earliest would be 7:30. Then you get to the train station at least 30 mins away and get to Florence is another 1 1/2 hrs, don’t think you will make it by 10."}, {"username": "Robin Darmstadt Mancil", "comment_text": "You should ck out Rome2rio app. It will give you ALL possibilities of travel from La Spezia. It will show you the bus and all the different options rail lines, not just trenatilia."}, {"username": "Karen Schmidt", "comment_text": "That will be very tight, if not impossible. Maybe with a private driver…but even then."}, {"username": "Karen Ries", "comment_text": "Nope, don’t do it. Do the cinque terre instead. Or go to Lucca."}]}, {"id": "2203919100007168", "text": "If you plan to visit Venice, I want to mention one of the best souvenirs we left with, and a beautiful experience we had when we visited recently! If you are planning a trip to Venice, you can't go wrong by scheduling a Tour/Photo Shoot/Gondola Ride with Devin Sartori (the photo here is from this experience). To start, Devin met us at the Rialto Bridge, then took us on a wonderful tour of the back streets and canals, sharing his passion for his amazing city. He pointed out details, gave us insight to Venetians, and willingly answered any and all questions we asked. As we went around this \"hidden\" Venice, he would point out things we might have missed, and he would have us stop so he could take awesome photos of us together, as well as, some of me individually. We eventually got to a spot where he had a gondola waiting for us, with a gondolier and a bottle of Prosecco. We were treated to a fantastic private ride, including going on The Grand Canal, and some quiet canals, while Devin continued taking photos. When we returned from our lovely trip, Devin suggested a restaurant nearby for dinner, and we had a fabulous meal, where we were well taken care of by the owner. If you are looking for a wonderful souvenir or gift from your time in Venice, I highly recommend Devin! He is on Instagram @devin.sartori or you can email him to get more information sartoridevin@gmail.com (feel free to tell him I sent you 🙂 ). It truly is one of my favorite things from our trip to Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2203919100007168/", "likes": 53, "comments": [{"username": "Elaine Bradley", "comment_text": "Michaela Friel"}, {"username": "Cindi Lachney", "comment_text": "I just booked Devin for my trip to Venice in February based on your recommendation.\nThank you for the post !! Great picture"}, {"username": "Kathleen Hardick", "comment_text": "Sara would you mind if I PM you for more details. I have been in touch with Devin for a booking in October and I would love to know more things from you."}]}, {"id": "2203949273337484", "text": "We are traveling to Italy in mid-September (Cassino, Rome, Florence, Venice) and going for 18 days. With all the horror stories about lost luggage, would really like to do carry-on only. Per TSA, do you just take mini sunscreen, hair and bath products or buy them once there? Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2203949273337484/", "likes": 2, "comments": [{"username": "Molly Roberts Siegenthaler", "comment_text": "Buy them there. They have SUCH great products in Europe, especially skin care. Also try Marvis toothpaste. I always stock up when I go."}, {"username": "Jenn Messina Babore", "comment_text": "We brought with us and then got any additional items we needed once there (or replaced as necessary)."}, {"username": "Heather Sechrist", "comment_text": "It sunscreen and bath products there and just pack a tote for them. Have a great time!"}, {"username": "Sue Sherwood", "comment_text": "Brought minis and stocked up while we were there."}, {"username": "Tiffiney Q. Irons", "comment_text": "I just left a 10 day tour there, almost every plane we caught it was full and the luggage if it had wheels had to be checked ( for free) so I suggest something without wheels if you’re trying to stay clear or checked luggage. And we took all toiletries with us from US and was just fine as well as straightener, every hotel we stayed at had a hair dryer"}, {"username": "Starla Dawn", "comment_text": "My 14 year old daughter and I did carry on only and it was the best thing ever! So glad we didn’t go on a trip with so much baggage."}, {"username": "Matt Ros", "comment_text": "What brings you to Cassino, if you don’t mind me asking?"}]}, {"id": "2203927103339701", "text": "I am applying for global entry for a trip with my husband to Italy and Greece in Fall of 2025. My husband had a DUI over ten years ago but I’ve been reading that this could hinder his application process. Has anyone else been in this position? I know we don’t have to have global entry but I’m always wanting smooth entry in and out of the country. We live in the United States. He is a Canadian Citizen.", "link": "facebook.com/groups/1373361046396315/permalink/2203927103339701/", "likes": 2, "comments": [{"username": "Joshua Pickles", "comment_text": "He needs to be truthful in his application. Disclose everything. Perhaps apply to the court to have the record expunged. He will still need to disclose along with the records of it being expunged. Usually records over 5 years are allowed. Good luck"}, {"username": "Colleen Dawson", "comment_text": "If you are denied Global Entry you can use Mobile Passport Control which is an app you can download."}, {"username": "Sue Sherwood", "comment_text": "Honestly, i have global entry for 8 years. I have only found it useful 1x. I just used it on my entry at the Atlanta Airport and i think it actually slowed us down... i would just get TSA Precheck."}, {"username": "Joanne Smith", "comment_text": "I travel internationally\na lot and I find it very useful"}, {"username": "Victoria Moorhead Murrow", "comment_text": "Definitely get it.. it INCLUDES TSA precheck. It has saved me many hours that I would have otherwise stood in huge lines. It has helped me out every single time coming back into the US & Canada."}, {"username": "Lorie Russell Atkins", "comment_text": "I don’t know Canada laws re: dui but my husband (dui in USA 2008)and our son applied for Global Entry on the same day. Our son’s application was processed right away (conditional something) however, my husband’s application took several weeks to move to the next step. All 3 of us flew back to US and went to the Global Entry line at JFK after we landed. My husband got lucky. While we were waiting in line, he received his confirmation email so all of us got interviewed and processed at the same time. I hope the process works out for you and your husband."}, {"username": "Judy Jamieson Pisano", "comment_text": "We have had Global Entry for about 8 years and after we had it for about 3 years my husband got a DUI in NYC. The next time he tried to use Global Entry he was denied. The DUI was expunged but he had to go for another interview with all the dui paperwork to get it reinstated. Otherwise we found that it makes coming back to the US very easy. The process is even faster than when we first used it."}, {"username": "John Liddi", "comment_text": "How do you schedule an appointment for the interview? The online system offers only places across the country or far away."}, {"username": "Lyn Pappas Dahm", "comment_text": "Just download mobile pass app…works like a charm."}, {"username": "Nancy Willson", "comment_text": "I have found the Global Entry to be worth it. I don't travel internationally\na lot but I was applying for TSA precheck and the global was only $15 more."}, {"username": "Dawn Marie", "comment_text": "Amex offers a credit for getting global entry"}]}, {"id": "2203897630009315", "text": "Hi! I have my train ticket here and just want to make sure this is right. I assume the 3 is the carriage number and I know the seat number but is 01 business class also marked somewhere on the car? I’m a little nervous about the trains and trying to find the right platform quick enough. Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2203897630009315/", "likes": 38, "comments": [{"username": "Fetchin Gretchen", "comment_text": "Yes, first class and 2nd class cars are marked. You will have a car or carriage number and a row and seat number."}, {"username": "Brenno Bianchi", "comment_text": "Outside is writtend in bold letter Executive, Business, Premium or Standard Class. But you need to know only the coach and seat numbers. The classes are not mixed, each coach is entirely one of them."}, {"username": "Colleen Dawson", "comment_text": "The carriage numbers are on the outside, so will see it when the train arrives to the station."}, {"username": "Brenno Bianchi", "comment_text": "You can see written \"business\" on the doors"}, {"username": "Jeff McLellan", "comment_text": "Do not rely on the information being displayed on the platform to be right. Three times for us it wasn’t."}, {"username": "Ashley Martins", "comment_text": "Cars 1-3 are business, first class, etc. Cars are clearly marked."}, {"username": "Rachael Richardson", "comment_text": "It’s easy to follow when you get there if you have a problem just ask someone"}, {"username": "Roxana Truica", "comment_text": "Your seat is 7D\n01 business means business class 1\ncar number is 3\nOn each car the number will be written and also on car 3 you will see business written."}, {"username": "Lesley Nesbitt-Blanchard", "comment_text": "Thank you for the information everyone!"}, {"username": "Nancy Lewis", "comment_text": "Ask someone if you need help."}, {"username": "Gillian O'Callaghan", "comment_text": "When you get to the station find the time then trip # on the departure board. Your destination may not be listed. The platform # will be posted about 10-15 minutes before departure. At the platform there are LED signs to show you where on the platform your coach will be. Don't panic....if you get on the train in a different coach just walk through the coaches. Be prepared for someone or a bag to be on your seat. Just have your ticket on your phone to show them. Enjoy."}, {"username": "Sue Sherwood", "comment_text": "The thing that always trips me up is the location of the car. For example car 3 could be at the very far end of the platform not the closest point. I traveled with my family and kids and made sure we were on the platform when the train came in. It was obvious that car 3 was not in the closest position on the platform and we had to walk a ways to find the car at the end of the platform."}, {"username": "Todd N Nicole Clarke", "comment_text": "There are lots of people to help but you will see everyone gathered near the screens, just know your actual train no (eg like your flight number), as it will have final destination which may not be where you are getting off, the Trainline app actually shows all stops"}, {"username": "Wendy Jean", "comment_text": "I have a question! Do they announce each stop like a subway? I’m doing regional train from Milan with 2 transfers to Recco !"}, {"username": "Tracy Piko Lawniczak", "comment_text": "Just remember to look for the train number when looking for the platform don’t always look at the destination bc chances are it won’t match your destination.\n\nIt’s actually so easy at the train stations."}, {"username": "Claudio Bidart", "comment_text": "Teresa Tobar Bidart"}, {"username": "Yvette Pavone", "comment_text": "There are plenty of people to help you! Don’t worry. 01 is business and you are in car 3 seat 7D"}, {"username": "Rose Stolarek", "comment_text": "The carriage is 3 and your seat is the other . Don’t worry about the business class as the carriage number 3 is Business class ."}, {"username": "Noelene Cameron", "comment_text": "Be sure, when looking at the board, to always look for the train number, not YOUR destination, because the final destination for the train may be different. The platform number will be displayed about 20 to 10 minutes prior to departure time.\nThe 01 is the carriage number. But beware, because this could be the first carriage, or the last. I struck this several times on my recent trip.\nThe position of the carriage is not always displayed at the smaller stations, but will be at the larger ones. The carriage display board is on the platform.\nI loved train travel in Italy"}, {"username": "Ian Beyer", "comment_text": "Yes, the car will be a business class car."}, {"username": "Stacey Esposito", "comment_text": "Yes number 3 is the carriage number. They are listed on the outside of the train. You ll see it as it pulls into the station"}, {"username": "Farheen Rahman", "comment_text": "We’ll be travelling with my elderly parents and 3 kids, the younger being a year and half….I’m just getting nervous thinking about the carriage numbers. How do we know where our carriage will be? What if we’re standing at the opposite end of the train? Can we walk through any carriage and then find the one that is ours?"}, {"username": "Natalie Perrett", "comment_text": "Sue Jennion"}, {"username": "Virgz Van Møøre", "comment_text": "Nath Marmotte"}, {"username": "Christine Musso", "comment_text": "Don't forget to validate your ticket before getting on the train"}, {"username": "Renee Rundle Stoneham", "comment_text": "Yes the car will have a 1 painted on it.\n2 is painted on for other classes.\n\nThe coach #3 won’t be painted on the car, rather it’s where it lines up at the station.\n\nIt’s very easy"}, {"username": "DeDonno Luca", "comment_text": "train frecciarossa! cars number 3, seat 7d!! buisness class."}, {"username": "Sue Jarvis", "comment_text": "Good Luck When I caught a train from Lavento to Milan I was in the wrong carriage as were lots of other people but it didn't matter as we sorted ourselves out when we were on the train ."}]}, {"id": "2203888083343603", "text": "I am doing a day tour of the Amalfi coast from Rome. The tour pickup is at the Naples central station- my choices are take the 5am train and get there at 7:12am, or, take a train and arrive at 8:12am (tour at 8:30am)\n\nHow often do the trains run behind? Which time would you take?\n\nThank you! :)", "link": "facebook.com/groups/1373361046396315/permalink/2203888083343603/", "likes": 2, "comments": [{"username": "Emma Bentley", "comment_text": "The trains are nearly always late. Does your tour leave directly from Napoli Centrale? 15 minutes might be enough if you only need to step onto the platform."}, {"username": "Jenn Messina Babore", "comment_text": "Early is always better. You don’t want to miss your tour."}, {"username": "Dafne Vassetti", "comment_text": "Arrive at 7:12, then have a Graffa for breakfast at Ciro inside the train station. The best two euros you will ever spend. ❤️"}, {"username": "Gayle Moores", "comment_text": "I would take the 5.am train and get there earlier to be on the safe side.You can always go to a cafe’ in the station or outside of it close to where you have to meet. If you take the later one there is not much time to spare if the train is even a few minutes late. We were in a situation like yours on our last trip where I had to meet the tour group an hour away to the next train station and opted to get up and leave early. Glad we did as we had time to spare and had trouble finding our tour bus. Was so glad I had the extra time!"}, {"username": "Andrea Ferretti- Kearney", "comment_text": "Definitely take the early train. If you get there 8.12 you will most likely miss your tour. We missed our bullet train from Milan to Rome because our regional train was delayed. Trains run late more often than not and you won’t know until you’re at the station"}, {"username": "Chiara Normanno", "comment_text": "Arrive early then step outside the station to have the best breakfast ever at Attanasio (link following). Just a heads up: be aware of your surrounding when walking around there as it's bit of a sketchy area. https://\nmaps.app.goo.gl/\nK3XSmv8cqrPTASKo\n7"}]}, {"id": "2203885830010495", "text": "Me and my wife are looking to travel 7 days in March of 2024. Is our day 1 doable? We are wanting to make a circle starting and ending in Rome. After Venice we’d like to go to Milan and Lake Como, just need to find stuff to do. All advice welcome!", "link": "facebook.com/groups/1373361046396315/permalink/2203885830010495/", "likes": 16, "comments": [{"username": "Paul Davis", "comment_text": "7 days; don’t spend it traveling. Rome, a couple stops in Tuscany plus Florence. (Stay reasonably close to Rome to minimize travel.) Leave Venice, Como, and Milan for another trip."}, {"username": "Mary Youssef", "comment_text": "Also doing 7 days\nDay 1 things I don’t need tickets for in Rome\nDay 2 Vatican Sistine chapel\nTaking last train to Florence\nDay 3 pisa and rest of day in Florence\nDay 4 cinque terre and back to Florence\nDay 5 Florence to Venice\nDay 6 Venice and head back to Rome\nDay 7 Rome colosseum\nDay 8 fly home\nTraveling with 2 kids\nAlso not sure how realistic my plan but will give it a try\nDidn’t book trains except for Rome to Florence and will keep flexible"}, {"username": "Andrea Ferretti- Kearney", "comment_text": "No your days and too packed. You won’t have time to see forum/\ncolosseum pantheons and Sistine chapel all in one day. Not to mention you will be very tired from all the walking."}, {"username": "Haley Rose Conley", "comment_text": "Also, think about what all you'd be missing out on if there's any delay with your flights. Ease into it, you'll likely be tired day one!"}, {"username": "Claire Dowson", "comment_text": "Are you going to see Florence with all the travelling from it to elsewhere? I’d do much less travelling."}, {"username": "Amy Kaye", "comment_text": "I wouldn't plan anything on 1st day, you're nit guaranteed to get there. Currently in Amsterdam for 2 days trying to get to Detroit bc if canceled flights🙄"}, {"username": "Aileen Hickey", "comment_text": "Do less but do them without rushing. You'll get more out of it and have a reason to come back again."}, {"username": "Karen Albertyn Wood", "comment_text": "I definitely recommend 3 nights in rome\nIn actual fact 3 nights in most places. You spend a lot of time travelling on trains getting to acc ect"}, {"username": "Karen Ries", "comment_text": "Why r u going back to Rome. Fly into Rome out of Venice."}, {"username": "Ryan Monahan", "comment_text": "You could totally do it. We did two very similar days in Rome back in June. You likely won’t be able to do full tours of those sites but you can easily go and see them."}, {"username": "Beth Ann", "comment_text": "No, day 1 is definitely too packed. Sistine Chapel and the Vatican generally require their own day and you will inevitably be jet lagged and tired"}, {"username": "Danielle Gervais", "comment_text": "Day one can’t do Sistine chapel , put it with the Vatican"}, {"username": "Fernando Leon", "comment_text": "Rome ay least 3 Days ."}, {"username": "Amy Hanson Garrity", "comment_text": "If you are energetic and not worried about jet lag you should be able to do day one but you need to remove the Sistine Chapel. Best of luck!"}, {"username": "Elaine C. Macalolooy", "comment_text": "We just came back a week ago and went early for a walk at 5:30am to see the Trevi fountain , Piazza de Spagna , Pantheon and walked all the way to the Vatican . Not a lot of crowd and great way to see the city before the heat wave and crowds. Vatican museum & Sistine Chapel takes almost 3 hrs , you can get a skip the line ticket but would highly recommend the bfast tour early in the morning ."}, {"username": "Alyson Alai", "comment_text": "All good ideas but some will de difficult to fit in. Too tight an itinerary is often not so enjoyable no matter where you are traveling. Years ago I used to help British tourists plan their itineraries while in Orlando. Inevitably they had it jam packed with no understanding of the size of the attractions and the time it takes. My advice was always to do a lighter day every other day and to make the first day a lighter day to get the lay of the land and recover from the trip over. That would be my suggestion here."}, {"username": "Ana Ka", "comment_text": "In Milan i love chiesa di san maurizio! Gorgeous frescoes! In my view this church is a lot prettier than the duomo! Explore brera area - very cute restaurants snd shops… as well as galleries. Finally, for food go to la gioia, langosteria or papermoon giardino. 🥰 enjoy!"}, {"username": "Nicole Harrow", "comment_text": "We are in Rome now. Did Vatican, Sistene Chapel and St Peters one morning (early because is it super hot here right now)… took about 4 hours all up (we also climbed the dome at St Peters - great view!)\n\nThat evening we went for a walk to visit / walk past Piazza Novana, Pantheon, Trevi Fountain.\n\nNext day Colosseum, Palestine, Forum… another long tour but worth it.. 3 hours long.\n\nThat night we visited the Spanish steps and had dinner nearby then walked back past Trevi again.\n\nWe didn’t buy tickets to Enter Pantheon as we didn’t have enough time. We also walked very briefly through Villa Borgese.. beautiful view of Rome from the park. Would have liked more time to explore this area but again ran out of time."}, {"username": "Jenna Phillips Clabeaux", "comment_text": "I would definitely make less on day one… that jet lag is a beast"}, {"username": "Lucrezia Folger", "comment_text": "Skip Milan and narrow down your search for things you’d like to do in Venice."}, {"username": "Vanessa Mulquiney", "comment_text": "I won't add too much to this as you'll be inundated with responses but as a Rome local there are things you need to consider that others haven't mentioned (and please consider this is as your first trip, so you don't need to do everything now unless you're not planning on returning). You're cramming too much in Rome, consider 3 days. St Peter's activities on the same day and reconsider the pope on sunday or factor in all the queuing/\nsecurity checks, lots of people...it will eat into most of your day. There are also a couple of Vatican public holidays in March - look these up in advance as nothing will be open. Drop Milan and go straight to Como. Venice in March can be tricky - you need to keep an eye on acqua alta during this time; the flooding usually occurs from Oct-March."}, {"username": "Fabio Guglielmi", "comment_text": "7 days in Italy, landing in Rome early morning?\nSpend good 2/3 days in Rome, take a train to Florence and stop by in Tuscany hills..\nGo see San Gimignano, Siena or Lucca..\n\nLeave Milano / Como lake and Venice for another trip..\n\nVatican Musems include Sistine chapel and book your entrance beforehand to skip a 3 hrs queue.\nColosseum / Pantheon and whatever you want to see in Rome, be prepared for a 12/15 miles (20 kms) walk to see plenty of things at least from exterior.\n\nYou won’t be regretting this shorter trip.."}, {"username": "Jordyn Spresser", "comment_text": "I think it’s doable but you will be BUSY just because we did 5 days and it was way too much time for us! Stuff is a bit further away than you expect so day 1 you will be walking a ton or having to use transportation also depending where your airbnb is! Venice was beautiful! Just walking around was our favorite and the food was awesome!"}, {"username": "Nessa Arias", "comment_text": "I would do an extra day in Rome. Also, move Sistine Chapel to the same day as the Vatican as you’ll see it then."}, {"username": "Bridget Gieseke", "comment_text": "I call this the been there, done that tour. Yes, you may have seen all the things… but did you have to appreciate and enjoy?? You simply have no understanding that Italian time, is kind of like island time… there is no hurry, hurry and there’s nothing you can do to make Italians hurry. They live there so have zero appreciation for those who are in a hurry.\nEither spend another week or cut your itinerary in half. What’s the point of going to any of these amazing places if you’re simply in a rush to get to the next item on your check off list??? You likely think I’m being negative, but am actually being quite sincere. Dinner in Italy takes min of 2-3 hours… that should give you an idea of what it’s like. Restaurants close down between 2 or 3 until 7 pm. You will be exhausted from your overnight, 11 hour flight. You may be able to deal, but your kids???"}, {"username": "Tammi Van Niekerk", "comment_text": "I would suggest looking at the Rome Pass as it includes all public transport (including from airport) and you can get fast track entry into some of the attractions that have long queues. That is a lot to cram into 1.5 days. Would definitely recommend another night in Rome!"}, {"username": "Isotta Tab Guarino", "comment_text": "Jonathan Knight Italian here, I would suggest staying one more day in Rome, and skipping Milan. Lake Como is very beautiful, but be mindful that 7th of March you could have snow, as it’s in the north, I would book (if you like wine) some winery around, just in case there’s extremely bad weather. Same goes for Venice, it could be really rainy, and when it rains too much they close the city. The centre and south of Italy are a better bet when it comes to early March weather."}, {"username": "Deborah Schroeder", "comment_text": "Depending on where your Airbnb is, I would walk around the forum and Colosseum then head to the Pantheon and on to the Spanish Steps for dinner. Swing back by Trevi Fountain for gelato and call it a day. The Vatican Museum houses the Sistine Chapel so do that with St Peter's. It is 4 hours by train to Venice so that day will be pretty full."}, {"username": "Maria Carriedo-Ceniceros", "comment_text": "We recently were in Europe and met up with some family members who only had 3 days for Rome. We did early morning Vatican and Sistine Chapel, had a 2 hr break for lunch and then did Colosseum and Forum in the same day. For us, the time wasn’t the issue, but the heat made it hard. It was 98 degrees that day. It’s obviously better if you have more time, but my family members had never been so they wanted to see as much as they could in the 3 days they were there. I had been before so I was there for them. On day 2 we did Rome to Pisa, then Pisa to Florence, and then back to Rome. Travelled by train and it wasn’t bad. We bought timed tickets for climbing Pisa and for the museum in Florence. Definitely would want more time in Florence, but again, they only had 3 days for Rome. We also went to Amalfi Coast and Pompeii on Day 3. It was a very packed 3 days, but they were so happy to see so much. Definitely better if you can space things out, but they really enjoyed themselves."}, {"username": "Cherie Adams Viator", "comment_text": "We did your 1st day last August and it all worked out!"}, {"username": "Kiran Kashyap Khullar", "comment_text": "No, colosseum and sistine chapel are very time consuming....co\nlosseum is huge and has palantine hill and roman forum around it, which is worth exploring....Si\nstine chapel can be done with vatican city and is also time consuming..."}, {"username": "Narinder Gore", "comment_text": "Sistine Chapel is in Vatican city so would maybe swap that with trevi fountain"}, {"username": "Rachael Richardson", "comment_text": "Sistine chapel is part of the Vatican tour so that needs doing at same time as St Peter’s basilica, they are next to each other - pointless doing them separately"}, {"username": "Jeff Gentner EA", "comment_text": "Check out Walks of Italy. Great tours. The Colosseum and Sistine Chapel on the first day is a little ambitious. Both are worth it but you might want to combine the chapel with Vatican City. Trevi Fountain is quick, go there after dinner at night."}, {"username": "Tara McCloud Odebrecht", "comment_text": "Not to start out with a negative view, but that would be really tough. The Sistine chapel is tough to do quickly most days and is very crowded. Next time we are doing the breakfast tour. So maybe look into that on your day 2?\n\nI would maybe do Trevi Fountain Day 1 at night. It’s kind of amazing at night. We sat by the fountain and chatted with people the first time we went - it was magical. The second time we did during the day - it was crowded and no magic! 🙂\n\nColosseum - requires a reservation- I think so consider that. The forum is walkable without too much planning. We didn a Rick Steves audio tour.\n\nPantheon is pretty quick and easy - but now requires a reservation on the weekend I think.\n\nI think you may have too much on the agenda for two 1/2 days. Also, we just got back from Spain. It’s tough to hit the ground running at that pace when you hop off a plane. Just my opinion. We have started trying to plan a light day."}, {"username": "Rachael Richardson", "comment_text": "You will get Round Spanish steps, Trevi fountain , pantheon (book this) and coliseum, Roman fort palatine hill in one day\nVatican - sant angelo castle the next day"}, {"username": "Renae Larcus", "comment_text": "I’m a big fan of hitting the ground running once you get there. It that seems ambitious. Sistine Chapel will be included in Vatican tour. Save that for another day. Maybe do the hop on hop off bus. It gives you a good lay of the land."}, {"username": "Heather McFee", "comment_text": "Skip Milan and go straight to Lake Como! It’s so idyllic, you won’t regret it!"}, {"username": "Brian McGraw", "comment_text": "Sorry but no.\n\nColosseum and forum is 3 hours or more.\n\nAnd it will take you all day to walk through the Vatican museum and the very last thing you’ll see is the Sistine Chapel.\n\nSwap for Trevi and Santo Spirito on Day 1. And put the Sistine at the end of your Vatican Tour.\n\nI would recommend arriving at the Vatican VERY early. It’s a big place, and will take most of an entire day. Truth be told, you could spend a week in that place and never see it all.\nIf you’re planning to get out of Rome that day, you’ll need to get started early."}, {"username": "Chris Aman Florian", "comment_text": "Colosseum is a cluster F, as they take forever to get you and the thousands thru 4 metal detectors! I noticed it wasn’t as crowded around 3 pm, not sure if you can go that late."}, {"username": "Isabella Banfi", "comment_text": "Hei Jonathan, sorry but I think you’re doing too much! Travel between these places take time, in 7 days it’s insane! You wouldn’t be able to see anything 😅 I would recommend to either di Roma and surrounding or Milan and surrounding (Como lake) or maaaybe combine Milan and Venice 🥲"}, {"username": "Alexandra A Welker", "comment_text": "Your day one is too tight unless you only want to stay outside of the Colosseum and not explore and not go to The Forum. I recommend swapping your activity from Day 2 like Trevi Fountain with Sistine Chapel & Vatican since you have St Peter's Square listed. They are all in one area. I suggest arriving early to the Vatican to avoid crowds and you'll have lots of time to cover the whole place."}, {"username": "Tess Galinato Perez", "comment_text": "Omg...your itinerary is literally making my head spin! If I'm you,, the most I will do is Rome (3 days), Florence (2 days) and Venice (2 days), just enough to get an overview. But I'm the type of traveler who would rather go back than cram everything in one trip."}, {"username": "Tracy Piko Lawniczak", "comment_text": "That’s a lot for day one. You probably won’t be able to do all of that."}, {"username": "Jeff McLellan", "comment_text": "Agree it is too much for one day."}, {"username": "Marie Payne", "comment_text": "SLOW DOWN!!! you won't see a thing...forget Milan and Lake Como...2 nights Venice the rest in Rome...fly into Venice and out of Rome if you can..."}, {"username": "Chrystal Stevens Bisonet", "comment_text": "If you want to do all that, spend 2 nights in Rome."}, {"username": "Kerri Bevilacqua", "comment_text": "No, I do not recommend what you have listed for several reasons:\n-If you have trouble with your flights, get delayed, etc you will lose money in whatever you have booked.\n-Jet lag is real, and that’s a lot to cram into the first day\n-The Sistine Chapel is inside the Vatican museums so you need to do it in the same day as the rest of the Vatican and St. Peter’s, otherwise you’d have to pay to get in twice.\n-Every time you change cities, you’re losing a lot of time in transportation and checking into and out of hotels so you’re not going to be able to see as much as you think you will."}, {"username": "Mark Boyce", "comment_text": "Unless you have something coordinated with your VRBO, you are also going to have your bags to deal with until they allow check in. I’ve seen that a lot of places probably check in before 3 PM."}, {"username": "Jazmin Avila", "comment_text": "Idk where you’re coming from but I was sooo tired after flying in (11h). We didn’t do anything on day 1 except go eat after our long nap. We arrived in the morning too. Maybe you sleep better on planes than I do and maybe you have a shorter commute…?\nAlso, does your air bnb allow you to check in early? Every air bnb I’ve stayed in, check in is like no earlier than 3pm… so not sure how you will get all the rest of the stuff done on your itinerary on day 1. Forum and coliseum will take several hours. Sistine chapel should be done with the Vatican since that’s where it is…"}, {"username": "Charleen Siegler Schuss", "comment_text": "Most Airbnb's aren't equipped for early checking or leaving luggage. It's not worth it to stay less than 2 nights anywhere. Watch a travelog to see all those things. Experiencing Italy is much more the taking a quick pic of a site. If you only have 7 days and arrive and leave from Rome think about 4 days in Rome with a day trip to Pompeii and 3 days in Florence returning to Rome\narea staying on Ostia (near FCO) and seeing the ruins"}, {"username": "Gina Albanese Verso", "comment_text": "My only suggestion is to go first thing to St.Peters, Vatican City and Sistine Chapel. We went at 7am and it was so lovely to be there without crowds."}, {"username": "Victoria Marchetti", "comment_text": "Don't forget jet lag will take you out in the first couple of days"}, {"username": "Dominique Tarplin", "comment_text": "I agree with everyone else on this thread. You’ll wear yourself down trying to do all this in 1/2 days. We stayed in Rome for 4 days and still didn’t see everything. I would do the Trevi fountain and Spanish steps at night. My husband and I did that by mistake and it turned out to be one of the most magical nights in Rome.\n\nDay 1: Colosseum, Forum, Pantheon.\n\nDay 1 night: Trevi fountain and Spanish steps\n\nDay 2: Vatican City/Sistine Chapel\n\nYou could possibly catch the high speed train after your Vatican City tour but you’ll certainly be extremely tired. Have fun and enjoy!"}, {"username": "Diane Janovas", "comment_text": "You actually only have one day and a half. I would spend at least 2 nights in Rome. That will allow you to do an evening tour and not have to check out of hotel. Venice is lovely but less to see ."}, {"username": "Shane McClain", "comment_text": "You have to book a tour for that"}]}, {"id": "2203815990017479", "text": "I’m here talking about the Trenitalia promo since not many has talked about it. It’s called “Italia in Tour”. So, there’s a promo from Trenitalia regional trains that you could get on UNLIMITED rides within 3आणखी days to any destination in Italy with just ONE ticket (or 5 days).\n\n3 days costs €29 (under 12 costs €15)\n5 days costs €49 (under 12 €25)\n\n‼️only for regional trains of Trenitalia (remember Trenord is NOT Trenitalia)\n‼️can’t use within Cinque terre because they have their own ‘promo ticket’\n‼️You can also purchase the ticket at the ticket office just simply saying “3-day promo”, the staff would understand.", "link": "facebook.com/groups/1373361046396315/permalink/2203815990017479/", "likes": 0, "comments": []}]