[{"id": "2205195953212816", "text": "We are traveling to Rome this month. What is the best way to get from airport (FCO) to hotel and will they accept credit card?", "link": "facebook.com/groups/1373361046396315/permalink/2205195953212816/", "likes": 1, "comments": [{"username": "Annie Gerke", "comment_text": "Taxi\nThey will be waiting outside and they do accept credit card but ask first to make sure before you go in one"}, {"username": "Miyuki Kanno Paul", "comment_text": "We usually take the train into the city, then get a taxi to our hotel in Roma. No crazy traffic to deal with. We learned in a hard way"}, {"username": "Vivien Paulik", "comment_text": "Train or taxi"}, {"username": "Danielle McMann-Griffin", "comment_text": "https://\nwww.romecabs.com\n/"}, {"username": "Frank Hunt", "comment_text": "Rail, yes, Trainline app"}]}, {"id": "2205198479879230", "text": "Any suggestions for must dos in Lake Como? Favorite town? We will be staying in Nesso, one day we will head to Bellagio and have a boat rental then we will have a free day after that.", "link": "facebook.com/groups/1373361046396315/permalink/2205198479879230/", "likes": 1, "comments": [{"username": "Isabella Banfi", "comment_text": "You can go to Orrido di Bellano or visit one of the beautiful villas along the lake, like Villa Carlotta or Villa del Balbaniello. Restaurant Materia in Cernobbio is the best one in the area!"}, {"username": "Gayle Moores", "comment_text": "Visit the medieval town of Lake Como! There are some beautiful monuments to see and the Renaissance Como cathedral is beautiful inside. Lots of restaurants and shops.We walked around the lake when we were there and visited the Villa Olmo and gardens.It is free to visit. There is a funicular you can take near the town that leads to another town Brunate.Beautif\nul views of Lake Como at the top.\nBellagio is worth seeing. There is the Villa Melzi and gardens with beautiful views of the lake and Italian Alps.Across from Bellagio by ferry is Tremezzo and Villa Carlotta and gardens."}, {"username": "Leanne Bower", "comment_text": "We just stayed in Nesso for 4 nights. Wander down to the lake side for a dip but beware of walk back up, it’s non stop steps 🥵!!! Get the ferry to Varenna & Como. Bellagio is great for boat hire. Enjoy!"}, {"username": "Γιάννης Κοντοστέφανος", "comment_text": "I suggest you drive towards Alagna Valsesia and see the villages.\nLiteral fairy tail place"}, {"username": "Leanne Bower", "comment_text": "Anonymous participant ferry goes from Nesso. Or buses are also very frequent. Both are cheap! We actually got the bus to Como & bought tickets at terminal there for ferry back to Nesso. Far nicer than driving. And how the bus drivers navigate those narrow roads is amazing!! Have fun. It’s beautiful."}, {"username": "David Silverstone", "comment_text": "Loads of beautiful historic Villa's and towns all around the lake to explore. Book a tour of a Villa or 2 and take a ferry to see many more from the lake. 1 day won't be enough!"}]}, {"id": "2205246823207729", "text": "If you’re in Milan and you like a spa I highly recommend qc termemilano! I’ve not really seen many people mention it but we absolutely loved it and for the price thought it was amazing ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2205246823207729/", "likes": 5, "comments": [{"username": "Rita Levi Montalbano", "comment_text": "Qc terme is all over italy and its always worth a visit. Here is qc terme dolomiti"}]}, {"id": "2205213856544359", "text": "Currently in sorrento and just want to clarify I have never been asked for ID is there a reason people are carrying their passport around ?", "link": "facebook.com/groups/1373361046396315/permalink/2205213856544359/", "likes": 47, "comments": [{"username": "Aiden Sone", "comment_text": "You are expected to have passport ID on you if asked. I wasn’t asked but I didn’t need the hassle if I was and didn’t have it. Wasn’t an issue for me to carry it with me."}, {"username": "Kristen Vorbeck Cochrane", "comment_text": "For when you are asked. Often by the police."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "I kept it in my purse…. Just in case …"}, {"username": "Etschi Bruckner", "comment_text": "you might never been asked, but it´s the law to have an ID on you"}, {"username": "April McDill Steele", "comment_text": "It’s the law"}, {"username": "Lyn Pappas Dahm", "comment_text": "Because if you are stopped and asked for it and you don’t have it, you will be fined"}, {"username": "Neville Spargo", "comment_text": "Just a couple of weeks ago on the La Spezia train station got asked by the police for our passports! that day we did decided to take them with us too!"}, {"username": "Monica Roman-Fazio", "comment_text": "I never carried mine unless we where traveling somewhere else."}, {"username": "Megan O'Brien Kinsella", "comment_text": "I carried paper copies of it everywhere but mainly for shopping and the VAT tax paper work. Everyone excepted paper copies"}, {"username": "Rose Wolschlager Hinman", "comment_text": "I always carried mine with me. I was asked for mine in the train station in Florence and I was just doing a day trip. And it’s the law"}, {"username": "Frannie Kaplan", "comment_text": "When you book for museums tours etc in advance they ask for your ID, but a license would be fine for that. Id never risk bringing my passport"}, {"username": "Maria Centritto-Conway", "comment_text": "I kept it with me and ended up needing it for reimbursement of train ticket."}, {"username": "Ivette Lugo", "comment_text": "Hi, send us pictures please of the best spots please, going there next month 🙏"}, {"username": "Kit Nader", "comment_text": "Just to keep it safe. Yiu don't need it"}, {"username": "Megan Knight", "comment_text": "We weren’t asked for ID or train tickets on our entire 2.5 week trip lol I don’t know why everyone was so concerned with that. I suppose I would be if it had happened… but before I went I felt like I was going to be stopped in the street and asked to show my passport - nope !"}, {"username": "Bronwyn O", "comment_text": "I carry mine because I’m not okay with knowingly breaking the law of the country I’m visiting."}, {"username": "Joanne Fish", "comment_text": "Who asked?"}, {"username": "Anthony McClure", "comment_text": "No need."}, {"username": "Liz Cottrell", "comment_text": "We had a guy with us who put his passport in the hotel safe twice and couldn’t get it out had to call the desk each time. I wear mine under my shirt just in case I got separated from group or needed it for some unexpected reason"}, {"username": "Sandra Maldonado", "comment_text": "No. They just feel afraid. I have never carried mine. I have never been asked for it. I just carry copies of it, so that I have something to show if needed."}, {"username": "Shelly Stowell", "comment_text": "We were never asked either. My daughter was there for 4 months and never asked."}, {"username": "Dani Stewart", "comment_text": "Never once in 35 years of travelling to Italy have I been asked for a passport and my husband and I have been stopped by the police- twice they asked for drivers license and international drivers license- lucky I speak Italian had a great laugh with him and he waved us off but then again we don’t really go to popular places"}, {"username": "Paul Kratt", "comment_text": "I don’t carry it on the street. Leave it locked up in my room."}, {"username": "Robin Barbera", "comment_text": "Because the one time you may need it you better have it."}, {"username": "Moonshine Bill", "comment_text": "We needed ours at the colosseum and imperial forum as well as a couple other sites."}, {"username": "Kirsten Abrams", "comment_text": "I was asked for mine to purchase something that had a high tax."}, {"username": "Larry Reinier", "comment_text": "Technically you have to. Most don’t but we were asked in Rome"}, {"username": "Roxanne Franquelli", "comment_text": "I leave it locked up. I’ve never had to show it for anything ever!"}, {"username": "Sue Allanby", "comment_text": "Apparently it’s actually the law but I’ve been to Italy many times including Sorrento & never been asked but I have it on my iPhone just in case,never carry the actual documents for security reasons"}, {"username": "Farrell Baker", "comment_text": "I just carried mine around cause thats what was gonna get me home. I wasnt gonna leave that bastard anywhere but on my body. But i took a tour."}, {"username": "Melissa Reyes", "comment_text": "No I brought my passport card with me a few times but it wasn’t needed"}, {"username": "Rachael Richardson", "comment_text": "It’s the law if they ask you for it you need ID , a copy or picture will do , we got asked"}, {"username": "Lesley Richardson", "comment_text": "Yep always carry with me 🤔"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205225393209872", "text": "Hey all. Still in our planning phase for next year. It would be a little easier on family watching our kids if we waited until summer, but I keep seeing these posts on how excessively crowded and more expensive it is to go then. Is it worth it to figure it out and go in May? Where I live May has a huge rainy season. If I do work it out to go am I going to regret the weather?\nI can’t seem to make a decision!", "link": "facebook.com/groups/1373361046396315/permalink/2205225393209872/", "likes": 1, "comments": [{"username": "Meredith Williams", "comment_text": "we went early april over june, zero regrets! we had some rain but nothing that we couldnt roll with!"}, {"username": "Sue Sherwood", "comment_text": "We were there in May this year and the weather was perfect!"}, {"username": "Jeanne Eliason", "comment_text": "We were there May 15-30. Only a bit of rain and one hailstorm in Orvieto. The rain was brief. The poppies in full bloom. We were in Tuscany so I don't know about elsewhere. Temperatures cool in evening and I wore a sweater. Days were mainly sunny and 75."}, {"username": "Sandra Yee", "comment_text": "My vote would be for May."}, {"username": "Jiahui Song", "comment_text": "We are in Italy now. I don’t feel it is excessively expensive around this time but it’s definitely EXCESSIVELY crowded. Sometimes you just got to bite the bullet. With kids at school age we don’t really have a choice. But it’s fine once you accept it."}]}, {"id": "2205234163208995", "text": "Forum Super Pass: Palatine hill/ Roman Forum\nFor those who have bought this ticket separately. It did not give me an option to choose a date it says open ticket. Does this mean I have a certain timeframe to use this?", "link": "facebook.com/groups/1373361046396315/permalink/2205234163208995/", "likes": 0, "comments": []}, {"id": "2205231609875917", "text": "Our airbnb host is booking us an 3 hour boat tour on the Amalfi coast from Positano- would you recommend morning or afternoon? I was thinking morning for weather and then having rest of the day, but wondering if anyone has thoughts? we have nothing else booked for the day…?", "link": "facebook.com/groups/1373361046396315/permalink/2205231609875917/", "likes": 0, "comments": [{"username": "Jennifer Avrett", "comment_text": "We did a 4 hour morning boat. I'm so glad we did morning because, like you mentioned, we had the rest of our day free. Also, it was really starting to get quite hot by the time we were finished. Even though we got in the water several times I still would have preferred to not be in the unobstructed sun all afternoon. It's one of my favorite travel experiences so I hope you have a great time, too!"}]}, {"id": "2205238103208601", "text": "My husband and I fly into Rome November 21 for 12 days. We want to stay in places off the beaten path. Any suggestions? We will have a car to explore.", "link": "facebook.com/groups/1373361046396315/permalink/2205238103208601/", "likes": 1, "comments": [{"username": "Alexandra Kassianos Matthews", "comment_text": "following!"}, {"username": "Roland Trego", "comment_text": "DAY TRIPS NORTH OF ROME WITH CAR RENTAL:\n+Calcata Vecchia (Lazio). Yet another tufo village, this one quite small.\nLake Bracciano towns (Lazio): Bracciano, Anguillara Sabazia, Trevignano Romano*\n+Palazzo Farnese (Viterbo), about halfway between Lake Bracciano and Civita di Bagnoregio, has interesting architecture. Good for an hour’s visit and lunch.\n+Civita di Bagnoregio***(V\niterbo) (must-see) 1h35m north of Rome, or 30m south of Orvieto\nSoriano nel Cimino (Viterbo)\nCaprarola: Villa Farnese* (Viterbo)\nBagnaia: Villa Lante* (Viterbo)\n+Pitigliano (Tuscany)***(. Also magnificent. Built on tufo. (must-see)"}, {"username": "Roland Trego", "comment_text": "TUSCAN COUNTRYSIDE:\nIf you stay in Florence, there will be an abundance of day-trip tours you can take to various destinations (esp. recommended: Siena, Lucca, and San Gimignano, Pienza and the Crete Senesi, in that order). A minimum of two days in Florence and two days in the countryside would be ideal. How to get to these places is detailed below.\nArticle: Best Day Trips from Florence (Take out spaces to access site.)\nhttps: // italybest . com /\n15-best-day-trips\n-from-florence/\n...\nMost villages in the Tuscan countryside are not well served by public transit (exceptions noted below). If you choose to stay in the countryside, but won’t be renting a car, ask the management of the place where you are staying if they can arrange tours or private drivers.\nIf you have a car and are staying in the countryside, both San Donato in Poggio and Barberino Val d’Elsa (pretty villages) are centrally located and have quick access to the main north-south highway.\nMy favorites places are asterisked. A few destinations are served by train; otherwise, renting a car is strongly advised.\n+Siena*** Must-see: La Libreria Piccolomini in the Siena duomo. (train)\n+Lucca *** (train)\n+San Gimignano** (train + bus)\n+Panzano* (train)\n+Pienza** (car)\n+Barberino Val d'Elsa (car)\n+San Donato in Poggio+ (car)\n+Certaldo (car)\n+Radda in Chianti* (car)\n+Montepulciano (car)\n+San Quirico d'Orcia (car)\n+Montalcino (car)\n+Pitigliano*** (car, very long drive)\n+Pisa. Only if you are in the immediate area. Aside from the three famous buildings, it is a tourist trap without any charm. If you must go, spend two hours and the rest of your time in Lucca! (Don’t miss climbing the Torre Guinigi.)\nSuperb restaurant with wonderful views: Il Ristoro di Lamole, in the village of Lamole, high above the Chianti hills. Reservations necessary. Lunch. Near the village, the road gets very narrow.\nPHOTOS OF THE TUSCAN COUNTRYSIDE\nhttps: // photos . app . goo . gl /\njLW8HqJrAmPQBe1P6\nDRIVING IN THE TUSCAN COUNTRYSIDE\nDriving in central and northern Italy is not stressful or difficult. It's very much like driving in the U.S. or Canada. (The Amalfi Coast and Sicily are a completely different story!) Make sure you know what a ZTL is. If you enter one, you will end up getting a very expensive ticket in the mail several months later. Also, speed limits are not well marked in Italy. I use Waze for that. You can set it to alert you (with a noise) that you are exceeding the speed limit. Neither Google Maps nor Waze will tell you when you are actually entering a ZTL. Someone told me that the app ZTLradar will do that, but I haven't used it and cannot vouch for it. Do an online check for European traffic signs.\nhttps: // www . autoeurope . co . uk/travel-blog/\ndriving-in-italy\n-what-are-ztls-\nand-how-to-avoi\nd-them/\nIf you rent a car in Florence, ask the rental agency how to exit the city without encountering a ZTL. Also, before leaving the rental agency, 𝗮𝘀𝗸 𝘁𝗵𝗲 𝗿𝗲𝗻𝘁𝗮𝗹 𝗮𝗴𝗲𝗻𝘁 𝘁𝗼 𝗰𝗵𝗮𝗻𝗴𝗲 𝘁𝗵𝗲 𝗚𝗣𝗦 𝗮𝗻𝗱 𝗼𝘁𝗵𝗲𝗿 𝗻𝗲𝗰𝗲𝘀𝘀𝗮𝗿𝘆 𝗲𝗾𝘂𝗶𝗽𝗺𝗲𝗻𝘁 𝘁𝗼 𝗘𝗻𝗴𝗹𝗶𝘀𝗵 𝗹𝗮𝗻𝗴𝘂𝗮𝗴𝗲. The manual will only be in the country’s language. (To go to link, take out the spaces.)\nhttps: // www . autoeurope . com/\ntravel-guides/\nitaly/\nitaly-road-signs\n/\n#:~:text=Parking\n%20spots%20in%2\n0Italy%20are,or\n%20mothers%20tr\naveling%20with%\n20infants/"}]}, {"id": "2205239563208455", "text": "Hi All. Looking for suggestions on restaurants in Venice that you loved and were memorable! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2205239563208455/", "likes": 6, "comments": [{"username": "Kristine Walker", "comment_text": "Following"}, {"username": "Billie Begley", "comment_text": "You need to go to Burano for this one. Viva Rosa. Fantastic"}, {"username": "Jill Wolder", "comment_text": "Hotel cipriani"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Osteria Mocenigo"}, {"username": "Holly Frederick", "comment_text": "Get the risotto! It’s a cute mom and pop place. Not touristy"}, {"username": "Dave Colleen", "comment_text": "Dolfin"}, {"username": "Jiahui Song", "comment_text": "Following this thread since my daughter’s birthday is coming in two days and we will be in Venice"}, {"username": "Tricia Brittingham Neff", "comment_text": "We had a really hard time finding restaurants that weren’t tourist traps. It seemed like every restaurant had same menu."}, {"username": "Suzanne Sullivan", "comment_text": "Following/ I’m leaving Florence in a few days and will also be there so I’m always looking for good places to dine as well!"}, {"username": "Lynne Begnaud", "comment_text": "Following!"}]}, {"id": "2205243549874723", "text": "Is there any hope of finding presents even slightly connected to da vinci??", "link": "facebook.com/groups/1373361046396315/permalink/2205243549874723/", "likes": 0, "comments": []}, {"id": "2205245299874548", "text": "If we arrive as scheduled to Fiumicino Airport at 6:30am, how long should it take to get through customs and to the train station? I'd like to purchase our tickets to Naples, but I'm unsure of what time to book. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2205245299874548/", "likes": 4, "comments": [{"username": "Lyn Pappas Dahm", "comment_text": "Depends on how many other planes land, where you are seated on the plane, and if you have checked luggage."}, {"username": "Miyuki Kanno Paul", "comment_text": "Just wait until you get to the train station. You never know how many flights are arriving at the same time in which may cause a long lines to go through Passport Control and picking up your luggage. High speed train service to Napoli Centrale is almost every hour, so I usually wait until I get to the train station at FCO"}, {"username": "Sandy Radican Shikaly", "comment_text": "Passport control and baggage pick up are hard to predict.. then customs is a walk through if nothing to declare"}, {"username": "Rita Scotto Epifanio", "comment_text": "Multiple fast trains from Rome to Naples leave every hour. Just get the tickets once you get there."}, {"username": "Virginia Lane", "comment_text": "I booked 3 hours out!"}, {"username": "Jenn Messina Babore", "comment_text": "It would be easier to buy the tickets once you get there."}, {"username": "Shawn Shaddix Reed", "comment_text": "Thank you everyone! I've booked 3 hours out. Hoping that's enough!"}, {"username": "Vero N Ferny", "comment_text": "It took us about an hour and a half to 2 hours super quick and easy"}, {"username": "Monica Roman-Fazio", "comment_text": "I would also consider flight delays. My flight was delays almost 3 hours. I would book train at least 3 hours after I rather wait then to miss the train."}, {"username": "Sharon Bowns", "comment_text": "I wouldn’t buy my ticket until I’m through customs."}, {"username": "Maria Urdi", "comment_text": "Our flight was scheduled to land at 7am. We landed at 545am 😳"}, {"username": "Angela Dempsey", "comment_text": "Dianne Gerrell read the comments here. Saying not to buy tickets til you get through customs and get your luggage. Big sigh. What to do…."}, {"username": "Graham Sherlock", "comment_text": "Allow 2 hours to get to termini station from landing."}, {"username": "Candace Linda Solomon Cross", "comment_text": "Do you have internet? If you do, book on line as your are waiting to clear customs. I did it , several times , no issues at all , also saved me time as well."}, {"username": "Mike Guluk", "comment_text": "Allow at least 1hr 30 minutes you should be safe"}, {"username": "Brian Osman", "comment_text": "Well I hope your flight isn't delayed, I would of waited till I got to the train station"}, {"username": "Theresa Sorrentino Pagan", "comment_text": "If you want business class buy now and three hours out. If you want the basic seats then you can wait till that day. I wanted business seats so I bought ahead"}]}, {"id": "2205245999874478", "text": "Hi! Looking for advice. Travelling to Europe mid March through mid April with three children ages 4 through 8. We would like to add one more destination to the end of our trip. Requirements: walkable or public transit, safe to navigate with kids, reliable internet available (spouse will be working remotely for this portion of our trip). What wouldआणखी you suggest?\n\nTrip so far:\n5 days- Paris\n4 days- Rome\n8 days- Florence\n7 days final stop (April 5-12)- suggestions please\n\nI am concerned with the weather in early spring, for places like Venice.\n\nAlso if you have any suggestions for must dos in Rome or Florence with children, please share 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2205245999874478/", "likes": 2, "comments": [{"username": "Susi Menazza", "comment_text": "I suggest Verona. It’s charming, fits all the criteria and is a short train ride from other beautiful places like Lake Garda and Venice. I do no recommend Venice (my favorite place) for an extensive stay because although very safe for kids, it has a lot of bridges and can be tiring if you use a stroller."}, {"username": "Scott Perry", "comment_text": "Lucca is nice too!"}, {"username": "JeriLynne Clifford", "comment_text": "Modena. Very family oriented city.\nWalkable. Safe and the food. Oh my lord, the food."}, {"username": "Suat Choo Coco Moreno", "comment_text": "Switzerland is perfect for kids especially if you like outdoor activities"}, {"username": "Laureen Garrido Jimenez", "comment_text": "Dolomites is amazing for kids and beautiful"}, {"username": "Laureen Garrido Jimenez", "comment_text": "Also, interactive davinci museum in Florence.."}, {"username": "Em Hillary", "comment_text": "If you’re looking to stay in Italy, i would recommend verona/lake Garda. But if you’re looking to leave Italy and see a new country try Germany, they have so many cute towns, look into Breman and Rothenburg ob der Tauber"}, {"username": "Jenny Kendrick", "comment_text": "London"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I would switch the time in Florence and Rome, as 4 days in Rome with kids it’s quite rushed and 8 days in Florence is a lot (unless you use it to visit the countryside around).\nFor 7 days I would go to Venice or Lecce. Both amazing.\nIf you aren’t already seeing when in Florence another option is Siena."}]}, {"id": "2205257636539981", "text": "Would like some feedback on the Hotel Golden in Rome. Is it within walking distance of the historic center?", "link": "facebook.com/groups/1373361046396315/permalink/2205257636539981/", "likes": 0, "comments": []}, {"id": "2205276569871421", "text": "Timing question….we had a 7;00 night tour of the colosseum planned and my husband bought tickets to the imagine dragon concert that same night. I just got an email the tour has been moved to 8. The concert time is listed as 7, 7:30 and 9 depending on if I look at the tickets or the circus Maximus site. I can’t tell if these are times for opening gates, opening act, main act? I tried calling but don’t speak Italian. Does anyone have any insight as to when imagine dragons actually come on?", "link": "facebook.com/groups/1373361046396315/permalink/2205276569871421/", "likes": 0, "comments": [{"username": "Kate Laidlaw", "comment_text": "A quick google shows they’d be on at 9/9:15pm and a couple of warm up acts prior. I’d still move/cancel the colosseum tour, why not enjoy the full concert and you’d be in a big rush. Our tour during the day was over 3 hrs"}, {"username": "Karen Schmidt", "comment_text": "A colosseum tour is about 2-3 hours if you really stop to enjoy, and take it all in. I’d move it to earlier in the day, or to another day all together"}]}, {"id": "2205284066537338", "text": "Do I need to reserve train tickets in advance or can I do it day of departure?", "link": "facebook.com/groups/1373361046396315/permalink/2205284066537338/", "likes": 3, "comments": [{"username": "Brian Osman", "comment_text": "Day of, but day before is probably best"}, {"username": "Jenn Messina Babore", "comment_text": "Either or but cheaper to buy in advance typically."}, {"username": "Sandy Radican Shikaly", "comment_text": "Less expensive in advance"}, {"username": "Eric Parks", "comment_text": "If you wan a premium class or a lower rate, do in advance. If you don't mind class or fare, then day of should be fine...unless a national holiday then I'd definitely plan ahead."}, {"username": "Gillian O'Callaghan", "comment_text": "I used Trainline for 13 trips in Italy. Most I booked a few days ahead but some on the day."}, {"username": "Enrico Lecce", "comment_text": "Both"}, {"username": "Wahab Sidharta", "comment_text": "Cheaper to buy in advance, get the first class ticket if you travel with big suitcase. Trainline app might come in handy."}, {"username": "Roland Trego", "comment_text": "If you need to, you can buy them at the station, but arrive 35-45 minutes beforehand because there are not infrequently lines. It's easiest to do it with an app. If you are riding a high-speed train and want to reserve your seats, it's best to do it a few days ahead. Local trains don't have reserved seating."}, {"username": "Sherry Lynn Sullivan Fink", "comment_text": "So when you are talking about in advance are you talking months in advance to get a great rate.?"}, {"username": "Michael Barnes", "comment_text": "Yes"}, {"username": "Silvia Arndt", "comment_text": "We are traveling to Italy last 2 weeks of September…spent\nmost of the afternoon today booking frecce train to various cities. Paid a little more for Business class and was able to pick our seats. Some selections had these super saver fares that were inexpensive"}, {"username": "Frank Hunt", "comment_text": "Either but if the train is full then it’s a self imposed uppercut."}, {"username": "Noreen Kelly Turnbull", "comment_text": "Going in October do you still think book in advance"}, {"username": "Krissy DaRusso", "comment_text": "For my day trips I do the evening before.\n\nFor my longer trips, when I’m moving locations, I try to get those in advance for my own piece of mind. This may be a month before or a week before. The problem with getting them really far out in advance is that so often my trip changes, I cut short on one place to spend more time in another, and then have to buy new train tickets."}]}, {"id": "2205283076537437", "text": "Hi all, has anyone bought the Venice museum pass? Do you still need to reserve a timeslot for the Doge's Palace if you have the card? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2205283076537437/", "likes": 0, "comments": []}, {"id": "2205284559870622", "text": "Recomend a bus tour in Rome", "link": "facebook.com/groups/1373361046396315/permalink/2205284559870622/", "likes": 1, "comments": [{"username": "Mary White", "comment_text": "Hop on, Hop off"}, {"username": "Albert Campagna", "comment_text": "Hop on hop off -"}, {"username": "Albert Campagna", "comment_text": "They have many routes you can choose from you can stay at each stop as long as you want and every 45 minutes a bus comes by so if you want to hop on and go to the next stop and the tickets are good for 24 hours from the time of purchase"}]}, {"id": "2205286399870438", "text": "Has anyone rented a boat on their own in Positano? Any recommendations or tips for doing this?", "link": "facebook.com/groups/1373361046396315/permalink/2205286399870438/", "likes": 1, "comments": [{"username": "Jeff McLellan", "comment_text": "Like boat for you to operate?"}]}, {"id": "2205286836537061", "text": "Would you recommend doing a 3 hour boat tour along Amalfi coast from Positano in the morning or afternoon?", "link": "facebook.com/groups/1373361046396315/permalink/2205286836537061/", "likes": 1, "comments": [{"username": "Brad Nelsen", "comment_text": "Before midday."}, {"username": "Karen Cumbo", "comment_text": "Warmer to swim/snorkel in afternoon"}, {"username": "Rae Gasparini", "comment_text": "Where do you book?"}, {"username": "Rita Scotto Epifanio", "comment_text": "Morning. The water is usually calmer in the morning. Sometimes by midafternoon the currents change which causes wavier water."}, {"username": "Laurie Frainetti", "comment_text": "Thanks all! I’m not actually sure which company we booked with, we had looked at Gianni’s boats? But in the end just asked our airbnb host, she took care of everything for us, booked beach day, dinner and a boat tour 🤞🤞🤞"}]}, {"id": "2205299486535796", "text": "Planning to go back next year already! We absolutely fell in love with Tuscany last year. we need 4 bedrooms- countryside preferred. Planning for April or May.\n\n1) What town would you reccomend for a family of 8 to stay for two weeks? (All adults and one baby)\n\n2)do you have any favorite homes or villas that you reccomend?", "link": "facebook.com/groups/1373361046396315/permalink/2205299486535796/", "likes": 2, "comments": []}, {"id": "2205301159868962", "text": "Traveling by public transportation between Rome and Florence, which hill town would you visit for 1-2 days and why? If a vineyard is close and able to access by public transportation, or another moderate ($$) form, a bonus! TIA😊", "link": "facebook.com/groups/1373361046396315/permalink/2205301159868962/", "likes": 0, "comments": [{"username": "Rachel Gray", "comment_text": "We went to a little town called Bracciano. Very quaint and reminded me of Ravello (Amalfi coast). 1 hour train ride from Rome. Highly recommend"}, {"username": "Miyuki Kanno Paul", "comment_text": "Civita di Bagnoregio. It’s one of a kind, very unique place to visit"}, {"username": "Gayle Moores", "comment_text": "We stayed in Siena Tuscany an hour from Florence by train.A medieval town with lots to see like the gothic cathedral and Palazzo Publico(town hall).It is not far from the wineries of the Chianti region. We took a wine tour with Get your guide tours. It was an afternoon tour that took us into the Chianti region to 2 wineries and a stop in two other towns Monteriggioni and Castellina in Chianti.Very good tour.They picked us up from the hotel we stayed at and returned us to Siena."}]}, {"id": "2205304029868675", "text": "Hi, I would like to tour Southern Italy and the Amalfi coast and then go on to Sicily. Spend a few days there then fly back to the US. Any travel tips? Ferry? How to return, etc. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2205304029868675/", "likes": 0, "comments": []}, {"id": "2205301519868926", "text": "𝗖𝗵𝗶𝗲𝘀𝗮 𝗱𝗶 𝗦𝗮𝗻 𝗠𝗮𝗿𝘁𝗶𝗻𝗼, 𝗣𝗼𝗿𝘁𝗼𝗳𝗶𝗻𝗼, 𝗜𝘁𝗮𝗹𝘆.\nPhoto ©Roland Trego #Churches #ChiesaSanMartino #SanMartinoChurch #Portofino #Italy #Ligura #RolandTrego", "link": "facebook.com/groups/1373361046396315/permalink/2205301519868926/", "likes": 8, "comments": []}, {"id": "2205305539868524", "text": "Hello everyone! 🇮🇹\nI just wanted to say thank you to all who gives advices and helps with information.\nI would like to think this group has helped so many of us, and also I myself have found so many useful tips and tricks, new locations and much more.\n\nSo this is a big thank you for those helpful people who spends time helping us discover Italy!\n\nCiao! ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2205305539868524/", "likes": 2, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205310499868028", "text": "Moderately priced hotels in Florence for myself and teen son for a few nights? Under $225 night. Main stay in Rome but this is a side trip.", "link": "facebook.com/groups/1373361046396315/permalink/2205310499868028/", "likes": 4, "comments": [{"username": "Rachel Gray", "comment_text": "Look into Airbnb. We just stayed in a nice one close to the tan station called pancakes apartment. Highly recommend!"}, {"username": "Dave Colleen", "comment_text": "Hotel Kraft, we liked it there."}, {"username": "Wendy Harrison", "comment_text": "What time of year?"}, {"username": "Elizabeth May La Duca", "comment_text": "Www.monasteryst\nays.com"}, {"username": "Elizabeth May La Duca", "comment_text": "Www.hostels.com"}, {"username": "Jodi Homes", "comment_text": "We’ve stayed at this Airbnb in Florence several times, we are going back in September. Not fancy but unbeatable location, clean & functional. Even has washing machine. If you can’t do stairs though, this is not a good choice. Have a wonderful trip!"}, {"username": "Carol McIntyre", "comment_text": "Hotel Il Bargellino was lovely. Carmel & Pino were fabulous hosts (she's from Boston so lots of wonderful conversations since that's our area).\n\nEnjoy it all - Florence is wonderful!"}, {"username": "Pao Magnoler", "comment_text": "Why don't you book an airbnb? You can find really nice ones."}, {"username": "Jessica Shin Cho", "comment_text": "Will Pmd u w our Airbnb in Florence. We absolutely loved it last year and staying there again when we go back next week."}, {"username": "Gayla Regitz Jones", "comment_text": "Il Guelfo Bianco"}, {"username": "Ann Wise", "comment_text": "Residenza Castiglione is reasonably priced, and I had a very positive experience there a few years ago. Good location, really nice room, quiet at night."}, {"username": "Laura Jetton", "comment_text": "Monistaries or convents."}, {"username": "Nuno João Teixeira", "comment_text": "Hotel Bonifácio"}, {"username": "Sande Ricci", "comment_text": "Try a VRBO or Airbnb. That’s all we use no matter where we travel."}]}, {"id": "2205320229867055", "text": "Lake Como, Italy 💙🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2205320229867055/", "likes": 9, "comments": [{"username": "JisHan Ahmmed", "comment_text": "JisHan Ahmmed"}, {"username": "Alison Freeburn", "comment_text": "Riley Freeburn ❤️ but in winter 😁"}, {"username": "Snigdhø Parveź", "comment_text": "Absolutely amazing place ❤️"}]}, {"id": "2205322963200115", "text": "Hello, going to Lake Garda and staying in Garda for 5 nights. We haven’t booked any excursions yet? Are there plenty to book locally or should I book through the travel agents? Also, are the plug sockets European two pin? Thankyou in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2205322963200115/", "likes": 1, "comments": [{"username": "Sandra Dyer Williams", "comment_text": "Depending where you are staying in Lake Garda there are Ferry Boats to take you to different places on the lake ⛴️ there are buses that you can get to Verona for the day. Tours you can arrange to Venice for the day. Although having done the Venice trip in May ourselves one day is definitely not enough. We are planning a return trip to Venice.\nJust love Italy 🇮🇹 ♥️"}, {"username": "Ryan Monahan", "comment_text": "Yes two pin. Do a day on the Lake taking the ferry to different towns. They’re beautiful. Valpolicella is close and it’s an amazing wine area. Verona only 40 min away."}]}, {"id": "2205323743200037", "text": "Been seeing how crowded the Vatican is and some people booking the VIP Premiere tours to get in one hour before opening. I'm assuming this is especially recommended during high season. What about going in late October? Is it still necessary? Will it still be that crowded?", "link": "facebook.com/groups/1373361046396315/permalink/2205323743200037/", "likes": 1, "comments": [{"username": "Gianna Onesi", "comment_text": "Imo I would book early rather than later. I am going too in October and lots of things are booking up!"}, {"username": "Isabella Banfi", "comment_text": "Hei Nathalie, I’m Italian and I’ve been to the Vatican museums several times. Last February I went with my boyfriend with the Prime Experience at 7:30 am and that was one of the best experiences I had in my life! See the Vatican museums, the Cappella Sistina and San Pietro without the crowd it’s just amazing. There are always lot of people in the Vatican, at every time of the year. For just 60€ it’s so much worth it!"}, {"username": "Cindy Gallen Barton", "comment_text": "We were there last October. Still very crowded. We booked an early entrance tour though The Tour Guy. Line for St Peters was long when we left (tour went in a back way, no line)"}]}, {"id": "2205324766533268", "text": "What city is suit for celebrating and countdown 2024 between Milan or Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2205324766533268/", "likes": 0, "comments": [{"username": "Muhammad Arslan", "comment_text": "milano"}, {"username": "Rita Levi Montalbano", "comment_text": "Milan"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Milan,\nbut Florence is smaller so maybe easier to navigate and probably warmer, so it really depends in what you like."}, {"username": "Julie Tran", "comment_text": "Depends on what occasion"}, {"username": "Alessandro Iannelli", "comment_text": "Beware of the streets on the 31th of December, people in Italy love to celebrate with firecrackers. It's more of a tradition in the south but still, I would avoid being right below an apartment building around midnight."}]}, {"id": "2205331463199265", "text": "Planning a trip to Rome and Amalfi Coast and surrounding areas in mid October. Plan to spend 4 days in Rome and 4 days in the south. I was told to check if ferries and restaurants will be open in the south in mid October. Is it a bad time to visit south Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2205331463199265/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "I am Italian, visited the Amalfi Coast in October and it was beautiful. Still a few tourists, but not many, weather was perfect, everything will be open do not worry."}]}, {"id": "2205324896533255", "text": "Hello everyone! My boyfriend and I are visiting Italy for two weeks end of August. He has never been to Italy or Europe and I really want to take him to see great things but also not tourist traps.\nWe're going to Rome for two days, Florence for 3, Cinque Terre for two days, Milan for two days, and Lake Como for a wedding for 4 nights. Drop authentic restaurants you love and off-the-beaten-path things to do!🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2205324896533255/", "likes": 1, "comments": [{"username": "Frannie Kaplan", "comment_text": "I would skip Milan and 2 days is not much for Rome, it depends what you want to do"}, {"username": "Wendy Wallin", "comment_text": "All the places you’ve listed are tourist places"}, {"username": "Brie Nicole", "comment_text": "“Authentic” you’re in ITALY"}, {"username": "JeriLynne Clifford", "comment_text": "There are a lot of touristy things and places in the cities listed. What type of experience do you want?"}, {"username": "Lucrezia Folger", "comment_text": "\"Tourist traps\", all the famous ancient sites are where you'll find tourists, they aren't tourist traps. All the cities you're going to are the most famous places which = tourists. If you want \"authentic restaurants\" best to ask people that actually live in these cities, or stroll the back neighborhoods, and you'll come across many local places to dine. Google \"off the beaten paths\" for each city for things to do."}, {"username": "Tam Wong", "comment_text": "Rome you need at least 4 days . After all - all roads lead to Rome"}]}, {"id": "2205345363197875", "text": "this question is for people that have visited naples and know a lot about that area.\nI tried to join a naples italy private group but my req has not been approved for well over 3 months.\nI want to know if someone… आणखी has visited, underground inside Galleria Borbonica and/or Underground naples\nI know they are different, bc period of time plus one was made by roman/greek and another spanish.\nfor the people that have visited both, do you love them both or one is better than the other. and should I do standard tour or private tour guided\n\n\nthanks. also if you know of a private group for naples and surrounding area, please let me know. I think sometimes we get more feedback if our questions are more locally specified\n\n\nthanks again for your time.\n\n\npic for attention", "link": "facebook.com/groups/1373361046396315/permalink/2205345363197875/", "likes": 4, "comments": [{"username": "Stella Kevin", "comment_text": "I did the underground tour. Very informative and we enjoyed it. They do offer a claustrophobic free option which we did and didn’t feel like we missed out on anything. Hope it helps"}, {"username": "Miyuki Kanno Paul", "comment_text": "We did. They are similar to one another. There are other underground tours available that you may take consideration. Napoli Sotterranea on Piazza San Gaetano is note worthy because it covers a part of 2000 years old Nerone’s theater. Galleria Borbonica covers deep understand cistern and areas used for bomb shelters during WW II. If you must choose one, go for Napoli Sotterranea because you will see how mundane people still live within the 2000 year-old ruines"}, {"username": "Nicola Algerino", "comment_text": "Informazioni utili : Napoli Sotterranea\n\nhttps://\nwww.napolisotter\nranea.org/"}, {"username": "Adela Primiano", "comment_text": "Yes we did the tour.it was absolutely amazing.one of the most interesting tours that we have been on.definitely recommend it"}, {"username": "Luca Lookone Ferrentino", "comment_text": "You might also consider visiting Fontanelle cemetery, it gives a good perspective of the superstition and devotion of the dead by Neapolitans https://\nen.m.wikipedia.o\nrg/wiki/\nFontanelle_cemet\nery"}]}, {"id": "2205381106527634", "text": "Looking to go to Italy mid to end of April with 2 kids (11 and 7). Would appreciate any help with planning/itinerary. Something that will be fun for kids and will allow them to rest. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2205381106527634/", "likes": 0, "comments": []}, {"id": "2205381469860931", "text": "I see lots of posts about private drivers. I have never hired one. Are you referring to an Uber type or a private tour guide.", "link": "facebook.com/groups/1373361046396315/permalink/2205381469860931/", "likes": 6, "comments": [{"username": "Meredith Williams", "comment_text": "i think it depends on where and what. for example, we chose to hire a private driver from naples to positano!"}, {"username": "Sandy Radican Shikaly", "comment_text": "Uber is only in Rome and Milan.if I remember... Private driver companies transport people with or without tours"}, {"username": "JeriLynne Clifford", "comment_text": "Private drivers for tours or transfers. My husband and I made a deal if we were going to travel in Europe that we would never, ever rent a car. We take the money that we would’ve used to rent a car and pay for gas etc. and use private tour companies to take us to wineries etc. I’m not worried about drinking and driving they make all of the arrangements. A lot of the great wineries they only speak Italian so a lot of the tour guides can help you. Also I work with hotels that we’re staying at with the concierge and have a private transfer that is usually $20 more than a taxi. After getting off a long flight knowing a car is waiting for me is worth it to not have to wait in a taxi que.\nIf you divide all of that time up by the number of days you’re there, it ends up being cheaper. We use trains for traveling between cities."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Not a guide, a private car that takes you wherever you want to go and is usually pretty knowledgeable about his/her country."}, {"username": "Frank Dragna", "comment_text": "We used a driver quite a bit. Our travel agent scheduled everything."}, {"username": "Tutti Burkett", "comment_text": "What private driver did y’all use?"}, {"username": "Frannie Kaplan", "comment_text": "You can book them.directly on booking.com. uber is not as good as it used to be, you can download the app MyTaxi.\nSarmacanda as well"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Private company with trained drivers who also give tours"}, {"username": "Cheryl Swiatko", "comment_text": "We did a private driver for three days of our trip and it was fantastic. His name was Salvatore Maurano of Touring Italy. Will do it again when we return!!"}, {"username": "Ralph Squire Martuscello", "comment_text": "This guy out of Pompeii took my family from Capri to Salerno and back to Sorrento, in a Mercedes. The best money that I spent on vacation. Giuseppe is the best!!! Ask him about “pizza wallets”"}, {"username": "Annette Tamminga", "comment_text": "I hired a private driver and a guide for two weeks. It wasn’t cheap but I had two new friends at the end of two weeks. Florence, Rome and Sorrento."}, {"username": "Wendy Spano Bracco", "comment_text": "We have a few private drivers organized for touring, or for transferring us from point a to b. We booked through our hotels or through a private tour company. My TA handled this based on what I wanted to do."}, {"username": "Greg Saba", "comment_text": "We have used private drivers in a few specific instances over the years. But it depends completely on where you want to go and what you want to see and, of course, your budget. For example, we spent a month traveling to all the wonderful small towns in Umbria and another month traveling to 76 places in Sicily, all on our schedule. It would have cost us a small fortune to do that with a private driver, and I'm not sure any driver would have been available to keep up with us. Again depends on what you are doing and how much you want to pay."}]}, {"id": "2205389966526748", "text": "Brescia 🤎🤎🤎", "link": "facebook.com/groups/1373361046396315/permalink/2205389966526748/", "likes": 16, "comments": []}, {"id": "2205390446526700", "text": "We arrive at Florence train station at 10:45a on 8/4 and need a transfer to Castelfalfi for two adults and two kids. Any car service recommendations? Will need the return trip on 8/6 as well.", "link": "facebook.com/groups/1373361046396315/permalink/2205390446526700/", "likes": 0, "comments": [{"username": "Regina-Rich Krett", "comment_text": "Welcome Pickups"}]}, {"id": "2205396923192719", "text": "Lac d'iseo 🤎🤎🤎", "link": "facebook.com/groups/1373361046396315/permalink/2205396923192719/", "likes": 1, "comments": []}, {"id": "2205405686525176", "text": "Finalizing our first trip to Italy! In Rome we will need taxis from Rome Train station to Airport. What is the best way? How long does it take between the two? If taxis are they way to go, do they accept credit cards?", "link": "facebook.com/groups/1373361046396315/permalink/2205405686525176/", "likes": 4, "comments": [{"username": "Scott Perry", "comment_text": "You might look into the Leonardo Express. It runs every 15 minutes between Roma Termini and FCO."}, {"username": "Lisa Schalig-Winter", "comment_text": "Our taxi driver only wanted cash. There is also Uber Black."}, {"username": "Rachel Gray", "comment_text": "Uber or free now app"}, {"username": "Roxanne Franquelli", "comment_text": "I just did the Leonardo express. Do it! Safe, easy, fast and saves money."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "No need for a taxi. The Leonardo Express will take you directly from Termini station in Rome to the airport. Very simple."}, {"username": "Rachael Richardson", "comment_text": "There is a direct train to airport no stops takes 30 mins"}, {"username": "Miyuki Kanno Paul", "comment_text": "Our departure from FCO is always early, so we always take either taxi or private service. If your lodging is within the city wall, it’s a fixed rate of €50 for taxi. Have your cash ready the night before"}, {"username": "Lori Sammons", "comment_text": "I was in Rome 2 days ago and had my hotel arranged the airport pick up, don’t do it, taxis are everywhere and it’s only £50 while 100€ private pick up"}, {"username": "Dixie Kotylak", "comment_text": "Thank you for this info about the Leonardo express! I will file that away for my next visit to Italy! ❤️🇮🇹❤️"}, {"username": "Vanessa J Bossi", "comment_text": "Honestly we just got back fro3ish days in Rome and the easiest and best way to get around was the bus and metro. A 3 day pass for both was 18€ and you can use them as many times a day as you need and want.\n\nWe had a car service to get to our Airbnb from the train station that was arranged by our host but to go back we took the metro"}, {"username": "Greg Saba", "comment_text": "We pay less than $100euros for a private drive,r who is always there for us. In essence our own limo driver in Rome, a city we visit several times a year. Nice guy and super reliable."}]}, {"id": "2205411663191245", "text": "Gubbio\nLuglio 2023", "link": "facebook.com/groups/1373361046396315/permalink/2205411663191245/", "likes": 36, "comments": [{"username": "Heath Conn", "comment_text": "Debbie Conn"}, {"username": "Dr-Jon Warnecke", "comment_text": "My favorite city in Umbria! The city of crazy people, lol."}]}, {"id": "2205412403191171", "text": "Spoleto\n19 Luglio 2023", "link": "facebook.com/groups/1373361046396315/permalink/2205412403191171/", "likes": 15, "comments": [{"username": "Dr-Jon Warnecke", "comment_text": "Another beautiful Umbrian city!"}]}, {"id": "2205421769856901", "text": "Hi, I’m planning to spend Christmas in Italy. I’ve been before but not during this time of year. Any suggestions on the best areas to stay or places to visit? I’ve heard of Christmas markets and I’ve also heard lots of things close down during this time as well?", "link": "facebook.com/groups/1373361046396315/permalink/2205421769856901/", "likes": 2, "comments": [{"username": "Alexandra Kassianos Matthews", "comment_text": "following!"}]}, {"id": "2205422706523474", "text": "From my 28 day stay in Rome back in March (remote work). Even after that much time, there's still so much I have yet to see!", "link": "facebook.com/groups/1373361046396315/permalink/2205422706523474/", "likes": 73, "comments": [{"username": "Nicole Gouzoules Sheehan", "comment_text": "Amazing photos!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "It’s the problem with Rome: the more you see the more you discover there is something stunning you haven’t seen."}, {"username": "Marcus Hiesler", "comment_text": "Currently here and what an amazing place"}, {"username": "Lushan Yao", "comment_text": "Nice photos! May I ask where you stayed for 28 days in Rome? An apartment?"}, {"username": "Vitya Volkov", "comment_text": "Just got back from a trip to Italy last month, it really is a beautiful country,🥰"}, {"username": "Julie Norris", "comment_text": "I stayed a month in Prati, Rome and I agree, there's so much more to see. Back again this October I love it so much"}]}, {"id": "2205425146523230", "text": "Hi all\n\nI am just looking into restaurants in Venice. Is there anyone that can recommend any? I have found one osteria del lovo but would need another three.\n\nThank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2205425146523230/", "likes": 1, "comments": []}, {"id": "2205425576523187", "text": "Just booked a private driver from Venice airport to hotel through Jayride and Luxor. Has anyone had an experience with these companies?", "link": "facebook.com/groups/1373361046396315/permalink/2205425576523187/", "likes": 1, "comments": [{"username": "Cassie Ryan", "comment_text": "Your hotel has access by vehicle?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205348626530882", "text": "Stay in Positano, Sorrento or Amalfi and why?", "link": "facebook.com/groups/1373361046396315/permalink/2205348626530882/", "likes": 125, "comments": [{"username": "Skye Birch", "comment_text": "sorrento... can get to all them places easy...\n\nalso have options to get on train to pompeii or naples for the day too"}, {"username": "Debra Trolman Alvo", "comment_text": "Ravello - easy to the others"}, {"username": "Megan O'Brien Kinsella", "comment_text": "Sorentto!!We just left today and my family and I never wanted to leave!!100 % Sorrento!!!!! We stayed at the Grand Hotel Riveria! amazing boutique hotel that was once a mansion. And outstanding location with privacy ￼ but a very short walk into town. Very nice pool very and amazing beach/pier area. The restaurants were fantastic. The service was phenomenal. The town itself is charming and beautiful and delightful to be in!!! We got ourselves via train to Naples and had the hotel make our car service ￼arrangements. We will definitely come back to Sorrento one day!"}, {"username": "Alicia Cox", "comment_text": "Sorrento"}, {"username": "Mary Marzacco Krzykowski", "comment_text": "We stayed in Sorrento it was perfect."}, {"username": "Carol Abriola Ortiz", "comment_text": "Amalfi"}, {"username": "Jena Marie", "comment_text": "Positano"}, {"username": "Stephen Kestler", "comment_text": "The million people there that you can't avoid bumping into. I recommend October"}, {"username": "Tino Antonacci", "comment_text": "It’s beautiful, great food ,and memories for a life time"}, {"username": "Lauren Anne Heckenberg", "comment_text": "I love to stay in Praiano and Positano"}, {"username": "Raul Cantella", "comment_text": "Maiori, walking distance to the lungomare, boat and bus distance to everywhere"}, {"username": "Dubravka Škurla", "comment_text": "SALERNO!\nAnd then rent a scooter and enjoy. No waiting in a car line.\nWe did it last end of june .\nSuch Adventure 🥳🥳🥳"}, {"username": "Enery Castellanos", "comment_text": "I stayed in Sorrento 7/24-27 and would have had a Coronary if I would have stayed in Positano. The steps up and down 🤪 were nuts."}, {"username": "Bob Schock", "comment_text": "Sorrento because it’s easier to get around and it’s much cheaper with all the same character. Positano is easy to get to by ferry from Sorrento"}, {"username": "Lani Skyles", "comment_text": "Sorrento, easier to navigate. Definitely cheaper than Positano and it’s absolutely beautiful just as beautiful as the other two."}, {"username": "Marco Feola", "comment_text": "Stay in the little quiet towns and travel to the others."}, {"username": "Carol McDonald", "comment_text": "Sorrento."}, {"username": "Mahmood Khalil Shaikh", "comment_text": "Sorrento for sure and take the ferry to Positano and elsewhere on the coast"}, {"username": "Christine Matthews", "comment_text": "yes all three. gorgeous. stay in sorrento as its less pricey i think."}, {"username": "Mimi Tirambulo Trautz", "comment_text": "Sorrento!"}, {"username": "Michael EIkady", "comment_text": "Sorrento hands down"}, {"username": "Tamriko Chanishvili", "comment_text": "Only Sorrento"}, {"username": "Lucrezia Folger", "comment_text": "Positano, beautiful, stayed there 4 times."}, {"username": "Punam Patel", "comment_text": "If you have money to spend, positano."}, {"username": "Lynn Spalding", "comment_text": "We are going in September and booked in Atrani which is a10 minute walk to Amalfi."}, {"username": "Irene Young", "comment_text": "Positano for sure, it’s divine"}, {"username": "Helen Tucker", "comment_text": "NOT Positano!!!! Unless you like the Italian version of Disney. Amalfi is fine, but Sorrento is close to Capri, Pompeii and you get the sunsets. Just rent a boat for the day to visit the other towns on the Amalfi coast and you will be happy but I would avoid going in July or August because it is super crowded."}, {"username": "Barbara Kamensky", "comment_text": "All 3!!"}, {"username": "Paul Wilson Ibrahim", "comment_text": "Sorrento, transportation to every where of Amalfi Coast is easier."}, {"username": "Caterina Liquori-Culhane", "comment_text": "Sorrento cheaper but you don't get t he views. Positano very crowed and expensive . Nice for a day trip. If you want to spend more with the views I guess Amalfi."}, {"username": "Diane Davis Lawyer", "comment_text": "Sorrento seems to be a better jumping off point to go pretty much anywhere you want to go on the coast. Amalfi seems to be less of a favorite of many here. Positano is a definite favorite here but it is expensive, nicer rooms book out further. If price is no object, then it's a favorite place of many here."}, {"username": "K Shannah Serio Dutka", "comment_text": "Just fantastic climate, terrain, people and food"}, {"username": "Tripp Page", "comment_text": "Amalfi, cheaper, less crowded and less snobby than Positano. Less crowded than Sorrento."}, {"username": "Wernich Stipp", "comment_text": "You have to do all 3"}, {"username": "Lisa Citrowske", "comment_text": "St Agnelo"}, {"username": "Addie Fanticola Brownell", "comment_text": "Sorrento so naturally beautiful, not as crowded🥰"}, {"username": "Paolo Mittiga", "comment_text": "Right now .. none of those are good places to go. They are very very crowded .. Sorrento over Positano and Amalfi as they are the most crowded … they are small and the crowd is overwhelming …"}, {"username": "Gill Salter", "comment_text": "I visited all and would say positano personally."}, {"username": "Robin Barbera", "comment_text": "Sorrento.. You can visit the other places but Sorrento has more to offer and not as many people."}, {"username": "Cat Harris", "comment_text": "Cetera, top end of the amalfi, quiet and unspoilt, travel into the others for the day"}, {"username": "Johni Divine", "comment_text": "Amalfi or atrani !"}, {"username": "Ted East", "comment_text": "Manarola. Not as crowded, centrally located."}, {"username": "Annette Brin", "comment_text": "Go off season and avoid the madness"}, {"username": "Gary Oroian", "comment_text": "Positano!"}]}, {"id": "2205355126530232", "text": "Has anyone flown Turkish airlines recently from east coast USA to anywhere in Italy , specifically rome or milan with the normal 2 hour lay over in Istanbul ? I have not had a lay over in Istanbul since 2018 and wondering if 2 hours is enough time, thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2205355126530232/", "likes": 0, "comments": [{"username": "Vicky Hall-Newman", "comment_text": "Are you flying in and out of Istanbul airport? Istanbul has 2 airports."}, {"username": "G.Y. Harvey", "comment_text": "in IST there are a \"short connection\" and a normal one. Do not take the normal one - it will be like walking a mile or two. Make sure you take the short one, you'll see one upon arrival to your terminal. 2 hrs is tight but do-able, the only delay there will be is security check up."}]}, {"id": "2205359599863118", "text": "We are planning a trip in October of 2024. We plan on flying to Naples around Oct 16th. We are planning on getting a hotel in Naples for about 7 days. We would like to see Naples, Pompei, the Amalfie Coast, Positano and Sorrento, if time permits for all of these. As we plan on flying to Barcelona for 2 or 3 days before we catch our transatlanticआणखी from Barcelona.\nDoes anyone have suggestions as to places to stay in Naples.\nAnd is it feasable to do day trips from Naples to these places.\nOr should we stay somwhere like Positano and do day trips from there for 1/2 of the time and then Stay in Naples and do day trips from there for Pompei and touring Naples.\nAnd any suggestions for places to stay in Positano quiet and reasonable.\nAny suggestions would be helpful.", "link": "facebook.com/groups/1373361046396315/permalink/2205359599863118/", "likes": 5, "comments": [{"username": "Rachael Richardson", "comment_text": "I’d stay in sorrento much nicer and more central for everything. We had an apartment for 2/3 people right in the centre"}, {"username": "Jason Hobel", "comment_text": "Sorrento would be the better choice to use as a base. It is a beautiful town and much closer to those other destinations you mentioned. Plus it is not as hectic as Naples."}, {"username": "Lisa Adams Robertson", "comment_text": "Don't do day trips to the Amalfi Coast. Stay in one of the towns for a few nights so you can enjoy them at night when the crowds lessen. Try to see the coast from a boat, if weather permits. As for Naples, we stayed in the historical center, at Piazza Bellini hotel/\napartments and really enjoyed it."}, {"username": "Diane Davis Lawyer", "comment_text": "Naples is often referred to as 'gritty.' It's busy and bustling most of the time. I would look up some addresses of hotels in Naples and then google map them and do 'street view' so you can see the entire surrounding area. We are staying three nights total in Naples next month and have opted for ABnB instead of a hotel. Take a look in the Vomero area, it's a nice, quiet residential area away from some of that hustle and bustle, but if a more lively area does not bother you then city center it is! Good luck!"}, {"username": "Valerie Collanton", "comment_text": "I stayed at hotel Matilde in Naples. It is in a perfect location next to the Galleria and very close to the San Carlo Theatre. Modern with large rooms and bathrooms. and on a quiet street. People always discourage stays in Naples. But it has a lot to offer. I would stay there at least a couple of nights.\n\nhttps://\nwww.matildehotel\n.com/"}, {"username": "Scott Perry", "comment_text": "The Chiaia neighborhood of Naples is terrific, if you would rather stay in the city."}, {"username": "Roland Trego", "comment_text": "Yes, you can do day trips from Naples to those destinations. However, Sorrento might be a better choice as it is more centrally located between Pompeii, Naples, and the Amalfi Coast. For example, the ferry from Naples to Positano typically takes around 1h25m to 2 hours. From Sorrento, it takes 45-60 minutes. (Take out the spaces for the link below.) Also keep in mind that the weather in the first half of October may be better. The rainy season often kicks in around the end of October. https: // www . rome2rio . com/map/Naples/\nPositano#r/\nFerry/s/0"}, {"username": "Miyuki Kanno Paul", "comment_text": "Staying Napoli to do all the excursions are total feasible as Amalfi coast shuts down in mid to late October. Do take a ferry to Positano soon after you arrive in Napoli. Take a ferry from Molobeverello straight to Positano in the morning, have lunch, walk around, then take a ferry back to Napoli. It applies to the same for Isola di Capri. Seasonal service ends by October 31st, so visit there as the top of priority. I don’t know what you think is “reasonable” price for any accommodations in Positano. I know it’s not cheap at all unless you go during the off season(majority\nof places shut down for the year until Spring). Plus you will be isolated, and the method transportations\nwill be limited by SITA bus, ferry(during peak season), private chauffeur service, or drive your rental car. A good alternative is to stay in Sorrento, by the way, because you have an access to Circumvesuviana\nSorrento train ride on top of everything"}, {"username": "Jill Tingley", "comment_text": "Sorrento best . Closer to all"}, {"username": "Suzy Coler", "comment_text": "I have always loved Sorrento, but this year in May, it was crazy busy with tourists; honestly, I can never recall it being this way during all my other visits. Revenge travel has turned Italy in to a destination of the mobs…if you have never been before, you have nothing to compare…lucky you, as first visit is so exciting…❤️"}, {"username": "Suzie LG", "comment_text": "I also stayed in Sorrento for a week and traveled to Pompeii, Capri and the Amalfi Coast. It’s a charming town with lots of beauty, nice hotels and shopping. It has great ferry service to Capri and the Amalfi Coast. Sorrento is lovely!"}, {"username": "Jasper C. Acton", "comment_text": "We enjoyed the Royal Continental Hotel in Naples, then ferry onetime, taxi next time to Sorrento…then day tours to Pompei, Capri, Amalfi. Sorrento nice location, easy walkable, lots of restaurants…eas\ny bus or ferry rides to visit other sites, towns."}, {"username": "Bill Gillespie", "comment_text": "Where I've stayed before and will stay next year, Hotel Foro Carolina at Piazza Dante."}, {"username": "Daisy Yoo", "comment_text": "I would split it with Naples base 1 and amalfi base 2"}, {"username": "Suzanne Mills", "comment_text": "Sorrento"}, {"username": "Laura Uribe", "comment_text": "I would stay two days in Naples, which we love for its history and big city vibe, and then head to Sorrento for your day trips. Have fun!!"}]}, {"id": "2205360209863057", "text": "Hi all, any recommendation on a tried and tested dayvtripntour to Tuscany and another for Orvieto from Rome - thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2205360209863057/", "likes": 0, "comments": []}, {"id": "2205362376529507", "text": "Question about sun beds in positano or amalfi. If you’re a family of four and only need 2 sun beds will they allow that or they charge per person? What’s a beach club that we can go to without prior reservation for sun beds? Going this Saturday.", "link": "facebook.com/groups/1373361046396315/permalink/2205362376529507/", "likes": 0, "comments": [{"username": "Jennifer Avrett", "comment_text": "In Positano they charge per person at both beaches. Unless you're a chair only person, I really recommend just bringing a blanket or sheet and claiming a section outside the chair area."}, {"username": "Scott Haggarty", "comment_text": "You can hire 1 or 100 it doesn’t matter you can only use what you pay for"}]}, {"id": "2205362973196114", "text": "Looking for hotel recommendations in Venice on grand canal that offer transportation to airport.", "link": "facebook.com/groups/1373361046396315/permalink/2205362973196114/", "likes": 0, "comments": [{"username": "Jay Parekh", "comment_text": "I’m staying at the Antiche Figure Hotel right across from the train station. The hotel has a offer for €80 to airport. If there is a train option, you should do that. The bridge across the canal is few feet away. Breakfast also included! So easy."}, {"username": "Kay Matthews", "comment_text": "We stayed in Hotel Rialto next to Rialto Bridge and got the water bus from airport €27 return, it drops off outside the hotel. Very efficient\nIt’s the orange line from the airport at the water bus stop in the airport. We bought our tickets from ticket office there when we landed. Very well signposted from arrivals"}]}, {"id": "2205364293195982", "text": "🇮🇹⚜️💜 Florence, Italy 💜⚜️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2205364293195982/", "likes": 1, "comments": [{"username": "Jacqueline Boner", "comment_text": "Stunning shots ! ❤️"}, {"username": "Chelli Bawcom Montgomery", "comment_text": "Spectacular pictures! Thank you for sharing!"}, {"username": "Issa Hattar", "comment_text": "Very nice 👍"}, {"username": "Karim Ouladi", "comment_text": "Florence is one of my favorites in Italy"}, {"username": "Melisha Folk", "comment_text": "Angela Bermudez ❤️❤️"}, {"username": "Claire Amélie", "comment_text": "Gaël Dumas 🥰"}, {"username": "Kate O'Connor", "comment_text": "Your photos are stunning."}, {"username": "Deborah Jones", "comment_text": "Beautiful pictures! ❤️"}, {"username": "Holly Blythe", "comment_text": "Gill Duke"}, {"username": "Kris A Jarman", "comment_text": "Absolutely gorgeous!"}, {"username": "Genevieve Hodge-Cardini", "comment_text": "Io adoro 😍😍😍"}, {"username": "Justine Di Terlizzi", "comment_text": "Loïc Nikky"}, {"username": "Ann Sauter", "comment_text": "Beautiful photos. Was there last fall for just a day. Didn’t get to see it like this."}, {"username": "Ewa Szczukowska", "comment_text": "Byłam. Polecam...."}, {"username": "Beverley Ford", "comment_text": "Libby Elizabeth Axiaq Hague x"}, {"username": "Denise Castelvetrano", "comment_text": "Wowwwww!!!! Breathtaking"}, {"username": "Rebekah Krieger", "comment_text": "I cannot wait! This month cannot go fast enough"}, {"username": "Giovanna Margo", "comment_text": "I LOVE Florence..one of my favorite places in Italy."}, {"username": "Andrew Grayson", "comment_text": "65 days to go! I can't wait!"}, {"username": "Linda Kolebaba Leusink", "comment_text": "Beautiful photos. Will be travelling there in September. Never been, where were these taken?"}, {"username": "Matty Van", "comment_text": "Louise Ronan"}, {"username": "Sarah Castellano Fisk", "comment_text": "Amazing pictures. How do you upload them to Facebook without losing the quality? Claudio Ciardi"}, {"username": "Xiomara Servellon", "comment_text": "I'm fall in love"}, {"username": "Suzanne Martin Crisci", "comment_text": "Your pictures are incredible ❤️"}, {"username": "Simone Nicole", "comment_text": "Ric Semreh"}, {"username": "Virginia Haughan", "comment_text": "Can’t wait"}, {"username": "Jean Mason", "comment_text": "Jean Mason"}, {"username": "Tangela Smith", "comment_text": "Spectacular!"}, {"username": "Tom McKeev", "comment_text": "Phone camera or other?"}, {"username": "Christine Hesham", "comment_text": "Carol Hesham"}, {"username": "Bela Soni", "comment_text": "Bela Soni"}, {"username": "Sherry Coleman Taylor", "comment_text": "Sherry Coleman Taylor"}, {"username": "Denise Incandela Boccio", "comment_text": "Denise Incandela Boccio"}]}, {"id": "2205365686529176", "text": "On the beach, how do you keep your valuables safe when you want to swim in the water? Only my husband and I travelling so please don't say one of us should stay on the beach lol. Obviously most concerned about our phones/copies of our passports. I know there are waterproof bags for your phones but can you immerse them?? It must be hard to swim carrying them around. We leave our stuff on the beach in NJ but is it safe in Italy as well?", "link": "facebook.com/groups/1373361046396315/permalink/2205365686529176/", "likes": 19, "comments": [{"username": "Sam Hawkesford", "comment_text": "The chairs we rented came with lock boxes attached to the umbrella, when you pay they give you the code"}, {"username": "Annette Mayer", "comment_text": "There are beach safes on amazon"}, {"username": "Kristin Lynn", "comment_text": "If you will have a beach chair and can keep an eye on it https://\ntheaquavault.com\n/"}, {"username": "Cammie Porter", "comment_text": "I’ve always just buried it in the sand, in a plastic bag. I also leave a tote bag out, with replaceable items, that way if someone is going to steal something they think everything is in there."}, {"username": "Melanie Fuger-Dolan", "comment_text": "Just bring a bag with a clip and attach it under the umbrella canopy. If you you keep an eye out while swimming you would have plenty of time noticing someone approach your belongings."}, {"username": "Chelsea Marcordes", "comment_text": "We got two small locks from Amazon. Locked the book bag zipper and then locked the book bag to the chair we rented 🙂"}, {"username": "Cynthia Marie", "comment_text": "I wouldn’t leave anything valuable on any beach. Leave it in your hotel safe and enjoy the ocean"}, {"username": "Anna EClar", "comment_text": "We bought these. Super sturdy. Have used them twice. Cutting it off would be an eventual possibility but not without being very obvious and attracting attention!\n\nhttps://\ntheaquavault.com\n/"}, {"username": "Graham Sherlock", "comment_text": "Wrap them in a cloth, zip them in a zip lock bag and then discretely bury them in the sand below your towel. Don't leave them in your bag, as your whole bag might get pinched. Leave your passport at your hotel, a picture of it on your phone is fine. Bury your keys, phone."}, {"username": "Carrie Swanson", "comment_text": "Get a waterproof pouch"}, {"username": "Darcy Parker", "comment_text": "For swimming there are swim pull buoys that are inflatable ( or packable) and waterproof ( you can fit keys, phone, credit cards. They have a belt that attaches to your waist. My husband and I are distance open water swimmers and we use these. They are comfortable and provide safety. swimmers"}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "What a palaver! So glad I don’t go near beaches full of people"}, {"username": "Lauren Vassallo Beattie", "comment_text": "We just took it in turns swimming"}, {"username": "Colleen Titus", "comment_text": "These bags are great. Used them at beach/ pool everything stays dry."}, {"username": "Amanda Murray", "comment_text": "I got a waterproof Fanny pack on amazon"}, {"username": "Terri Bazinet", "comment_text": "We have a beach lock bag. We lock it to our chairs."}, {"username": "Anne-Marie Hallas", "comment_text": "I once read to wrap it all up in a nappy as they won’t touch that! Not done it yet!"}, {"username": "Jennifer Larese Taylor", "comment_text": "Don’t take your valuables to the beach. We’ve never had a problem leaving phones, etc in our bag while we swim"}, {"username": "Gry Jungberg Møller Madsen", "comment_text": "I have been wondering why so many in this group are carrying their passports everywhere. I am from Northern Europe and have been vacationing in Italy the last 30 years including this summer. I have never taken my passport with me going out in Italy and have never been asked. I have only once experienced gypsies in Rome approaching me and trying to steal my handbag but they didn’t succeed so I am just a little curious to your approach? I also must say that I dont feel safer when I go on holiday in the States compared to Italy - to me it is very much the same safety wise - but I might be wrong. Love following this group and even though I have been to Italy a lot I still get new ideas for places to visit 🇮🇹🍕🍝"}, {"username": "Lisa McCusker Sherer", "comment_text": "Hotel safe"}, {"username": "Lisa Childs-Brown", "comment_text": "I take a lock and padlock bag to chair or table.\nIf the thieves were determined they'd find a way around it. But it would give you time/ visual."}, {"username": "Lisa Wylin", "comment_text": "This is my opinion, since I probably won’t buy all these cases and stuff, I would simply have the person I am with watch my stuff while I swim or like everyone says just have some nice people near you watch it. And yes, obviously keep it minimal with your valuables if at all possible.😎"}, {"username": "Jessica Sheffield", "comment_text": "Drybag"}, {"username": "Gregg Pires", "comment_text": "Bring a child's diaper...wrap your valuables in the diaper as if it was a dirty diaper...who's gonna steal a dirty diaper....."}, {"username": "Doug Burke", "comment_text": "Do you really need a phone with you 100% of the time?"}, {"username": "Sally Sharkey", "comment_text": "Purchase lockers."}, {"username": "Beth Allen", "comment_text": "You can buy portable “safe” bags with a lock that you can attach to a beach chair or table."}, {"username": "Cris Wimer", "comment_text": "We lock our passports, iPads etc in our suitcases with travel combo locks in hotel room if there is no safe."}, {"username": "Julie Michele Allen", "comment_text": "Passports leave in your room safe. You can always carry a photocopy. I put money and phone in a ziploc bag and bury just under my towel"}, {"username": "Claire Dowson", "comment_text": "I took a dry bag as just me and my daughter. Keys, phones and money all dry and with us when swimming."}, {"username": "Kade Johnston", "comment_text": "Never had a problem/don't take valuables...."}, {"username": "Plane Shummer", "comment_text": "Just ask people beside you to look about for you stuff. That’s what we did and others asked us to do same. No issues."}, {"username": "Andrew Walston", "comment_text": "No, we had our camera stolen from the blanket on the beach. Check with local bank if you can rent a safety box for the duration of your trip (for passports and valuables)"}, {"username": "Nicole Schipplock", "comment_text": "When we were in Hawaii we used a waterproof phone carrier like the one pictured above, we put key cards, money , phone etc in it and wore it around our necks while we swam foe hours, we did out our phones in a zip lock freezer bag inside for extra protection though"}, {"username": "Anne Hoenig Steib", "comment_text": "We were in Amalfi Coast and just put things in our towels. Maybe not the smartest but it was all fine. I also didn’t bring anything worth stealing except my phone. Good luck!"}, {"username": "Delphinia Salamin", "comment_text": "Do not leave your valuables exposed on any beach in Europe. Buy a waterproof bag and keep cell phone and credit card/cash in it. This is only option"}, {"username": "Andrea Kroposki", "comment_text": "I used these in the Bahamas. You can still use your phone, take pics ect.. I through my credit card and room key in it."}, {"username": "Mary Passeri", "comment_text": "Honestly Italy is no more dangerous than America! If you're very worried don't carry/leave more than you can afford to lose.\nLeave valuables in your hotel safe. Maybe use only a 'disposal 'phone for beach days."}, {"username": "Lisa Roth", "comment_text": "Honestly just don’t bring the phones to the beach for the afternoon. Also, many (not all) beaches are “beach clubs” of sorts with an entry fee, so see if one has lockers."}, {"username": "Lynn Crane", "comment_text": "We use a chair safe. Works great. FlexSafe by AquaVault (on Shark Tank): Anti-Theft Portable Beach Chair Vault and Travel Safe. Packable, Lightweight & Slash Resistant. Use at the Beach, Pool, Waterpark, Cruise Ship, More - Black https://a.co/d/\n7VxOH6J"}, {"username": "Lisa Graves Donald", "comment_text": "I heard to put in a bag and bury in the sand"}, {"username": "Don Bussolari", "comment_text": "Lots of good answers but EU or US leaving anything you deem valuable unattended is testing fate IMO."}, {"username": "Denise Maglio", "comment_text": "Dig a hole and bury them and put your towel over top."}, {"username": "Pamela Jones", "comment_text": "At Manarola (is that the beach village?) they have lockers in the changing rooms you can hire. A man stands on guard at them."}, {"username": "Elizabeth Florio Campanella", "comment_text": "portable safe that locks around chair"}, {"username": "Gina Legere DeJohn", "comment_text": "When I was at a beach club on the Ligurian coast and on the train an Italian woman asked me to watch her bag while she went to get something to eat. It appears to be customary. Each time, they casually asked me politely to watch their bag. Would I do it? Probably not. But they did."}, {"username": "Gigi Igle Gonzales Dong", "comment_text": "I bought one of these at Aldi’s except mine was clear not blue"}, {"username": "Meredith Holloway Helbon", "comment_text": "Bury it under the sand in a ziplock or something waterproof, and then put your beach towel or beach chair or bag or whatever else, less valuable, on top of it. Then always stay within visible distance. If you glance over periodically, you’d be able to tell if something is happening to it, with hopefully, enough time to react."}, {"username": "Etschi Bruckner", "comment_text": "just don´t bring the phones - and nobody would be interested in a copy of your passport!"}, {"username": "Kim Sousa Andrews", "comment_text": "We paid extra for front row chairs and we just kept an eye on it when we were in the water. It never felt unsafe."}, {"username": "Debbi Mayfield", "comment_text": "Diaper wrapped like it’s used"}, {"username": "Rose Stolarek", "comment_text": "Italy is safe overall but there’s no way I would leave my valuables on the beach while we swam, so either buy something you wear while you swim Or ask someone nearby to keep an eye on your valuables or one person swims while the other waits on the sand . We had a couple tell us they had everything stolen while they swam and were actually watching their valuables from the water"}, {"username": "Koen Loeven", "comment_text": "water proof pouches and waste band"}, {"username": "Susan Lynn Sullivan", "comment_text": "https://\nwww.kyssbag.com/\n\nI use a Kyss bag. It has a built in chain and lock."}, {"username": "Beth Shetz", "comment_text": "Hide things in plain site. Before you go get a can of peanuts or some other snack that is large enough to fit your phone, the either eat or dump the snack and keep your phone in there inside your beach bag. Do the same for money, but with an empty sunblock bottle. Cut the bottom put in the cash then keep the bottle in a pocket in your bag. Try not to keep all valuables together. Also if you can hook your bag to your chair leg or the umbrella. That way if someone does find one of your hiding spots they don’t get everything and hopefully they won’t take the time to take the whole bag."}, {"username": "Anne Sarno-mcilwrath", "comment_text": "This is what I used in italy. and used it tubing as well.\n\nhttps://\nwww.amazon.com/\nVenterior-Waterp\nroof-Pouch-Adju\nstable-Waist/\ndp/B088DDYQDJ/\nref=asc_df_B088D\nDYQDJ/\n?tag=hyprod-20&l\ninkCode=df0&hva\ndid=64211783009\n2&hvpos&hvnetw=\ng&hvrand=114438\n93395192256660&\nhvpone&hvptwo&h\nvqmt&hvdev=m&hv\ndvcmdl&hvlocint\n&hvlocphy=90018\n83&hvtargid=pla\n-1951086202023&\npsc=1&gclid=Cjw\nKCAjw_aemBhBLEi\nwAT98FMvICXpKVB\no3IFqW3uryLt99B\nsBX347zPB9ICvj3\n2cC58e3OE3kfzgR\noCya4QAvD_BwE"}, {"username": "Andrew Mazan", "comment_text": "Have some young guy watch your stuff!🤑"}, {"username": "Kelly Pruchnicki", "comment_text": "I bought one of these but haven’t used it yet\nhttps://\nwww.amazon.com/\nBKNOOU-Anti-Thef\nt-Waterproof-Co\nmbination-Remov\nable/dp/\nB09ZKKZ3L9/\nref=mp_s_a_1_2_s\nspa?crid=GXXI55\n9BZUM3&keywords\n=beach+lock+box\n+for+chair&qid=\n1691017741&spre\nfix=beach+lock+\n%2Caps%2C123&sr\n=8-2-spons&sp_c\nsd=d2lkZ2V0TmFt\nZT1zcF9waG9uZV9\nzZWFyY2hfYXRm&p\nsc=1"}, {"username": "Stacey Esposito", "comment_text": "The waterproof cases I use however if it isn't sealed it will leak and I've lost a phone this way\nSo now I put my phone credit cards in a zip lock and then into the waterproof bag. If I hadn't done that I would have destroyed a 2nd phone as when I pulled it out the water had gotten in but now into the zip lock. Il"}, {"username": "Kim Godfrey Hardy", "comment_text": "following"}, {"username": "Lesley Vullo Pino", "comment_text": "Don’t laugh but I’m super cautious and I took a small lock and locked the zippers and my bag to the beach chair I rented 🤣 😂🤣🤷🏻‍♀️😅"}, {"username": "Bronwyn O", "comment_text": "The waterproof phone cases are waterproof (buy one that says so, test it in the sink or bath first). I swim with one with my phone, passport, and money inside. I have one that fits my camera also - that one is a little more awkward to swim with but great for snorkeling pictures!"}, {"username": "Dianne Smith Durham", "comment_text": "We were in Cinque Terre at a beach club but it was very full & crowded. We left our things in a bag under the chair while swimming & everything was fine, nothing touched. My daughter has been here for the summer & said they had done the same. I’m sure just like in the US, things can happen, but we were fine."}, {"username": "Linda Boardman", "comment_text": "Do you need to take your phone and a copy of your passport to the beach? We have been in Italy and France for 3 months. We leave everything except a small amount of money in the apartments we rent. If you have to take them, the only way is a waterproof pouch. A small one will fit under your hat or cap whilst you swim."}, {"username": "Lisa Nelson Viall", "comment_text": "The dirty diaper trick is humorous, but I don’t know anyone who has tried it.\n(Wrap your small valuables in a baby diaper, so it looks used, and nobody will touch it, is the theory)"}, {"username": "Paula Bennett", "comment_text": "Good question. Let’s see how those that know it all respond."}, {"username": "Chrissy White Mazur", "comment_text": "They sell fake sunscreen containers that you can put stuff in."}, {"username": "Angie Martin", "comment_text": "The waterproof phone cases, if you buy the appropriate ones, can be submerged in water. I use them when I go kayaking and snorkeling and put them around my neck or if the lanyard is long enough I wear it crossbody. You can also buy dry bags of various sizes to put all of your valuables in and then wear the dry bag crossbody in the water."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "I used the waterproof phone cases. I just wear it around my neck and swim. That way you can take pictures in the water too. I fit cash, credit card, ID, and room key inside. Just make sure it’s sealed. They’re great."}, {"username": "Aaron Peterson", "comment_text": "pacsafe steel mesh bag cinch it up and padlock it to the chairs and umbrellas"}, {"username": "Paula Brink", "comment_text": "Always leave our passports etc locked in room safe. Take phone and minimal money to beach club, all the ones I’ve been to have lockers for your stuff.\nOr we have stayed at hotels with beach access and pools."}, {"username": "Charlie Charnigo", "comment_text": "How much valuables? When I went to Mexico I used my water proof camera pouch and kept cash and cards in there. I also wear a rash guard and kept the pouch under there. Also the other option is the diaper trick. Keep them in a balled up diaper with your towel. Most folks are not gonna touch a dirty diaper."}, {"username": "Maria Brozou", "comment_text": "We dive in turns. When the beach is not overcrowded we hide wallet and phone below clothes in the bag and make sure to have eye contact with it at all times when we dive together."}, {"username": "Natalie Philpott", "comment_text": "I bought my husband and I each a waterproof fanny pack. So we will put our stuff in there and swim with it :)"}, {"username": "Meredith Woolley Jackson", "comment_text": "I’ve always left my stuff with the chair we rented while swimming. You’ll get a feel for how safe it is once you’re there … and will probably feel fine leaving it at your chair. We also had other people ask us to watch their stuff while they went swimming or went to the snack bar. People are friendly, just like in NJ and FL. 😊"}, {"username": "JoLynn Waters", "comment_text": "We brought a portable safe you can wrap around the bottom of the umbrella at the lido. But we nevermind used it. Buried our stuff when we both went in the sea."}, {"username": "Cheryl Turner", "comment_text": "Waterproof phone cases are brilliant! I’ve been canyoning with one (jumped off 20ft waterfall) & was bone dry inside! I’ve used it in the sea too. The good thing is you can still take pics & use your phone (a bit) with them too. The one I have is YOSH brand. It also has a strap that you can put around your neck."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Dig a hole under your blanket or towel and bury it !!!"}, {"username": "Dani Stewart", "comment_text": "We always go to a paid beach and have never had any troubles"}, {"username": "Dann Hrusch", "comment_text": "Personally, I'd never leave my passport/ID unsecure in any situation in any country, including the US."}, {"username": "Caren Murray Kleinman", "comment_text": "This is what I use on beach or by the pool"}, {"username": "Sally Rush", "comment_text": "Waterproof dry bag."}, {"username": "Andrea Shelton", "comment_text": "So you don’t go to Seaside Heights or Sandy Hook…"}, {"username": "Tomas Krivanek", "comment_text": "My friends plastic bag was stolen on the beach of Nica.🇫🇷 underwear and a watch inside. He was watching a bit and catched the thief😉he got his stuff back😉"}, {"username": "Denis Taylor", "comment_text": "Place your phone and passport into a ziplock bag and then into the waterproof neck bags . No problem swimming."}, {"username": "Tomas Krivanek", "comment_text": "You really dont want to loose your phones😉 you can always ask reliable people (family with kids) to watch for your stuff😉😉😉...i travel alone and can you imagine what happens when my car key would be stolen???😉😉😉"}]}, {"id": "2205375313194880", "text": "I booked tickets from Trenitalia app didn't ask for the insurance fee and ended up with a $7 charge is that normal?", "link": "facebook.com/groups/1373361046396315/permalink/2205375313194880/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "I noticed that when I booked tickets through Trainline, a \"service\" charge was always added. Maybe it's the same with Trenitalia?"}, {"username": "Maria F. Ruiz", "comment_text": "It has never happened to me. The order says it's some type of insurance?"}, {"username": "Zucchero Candito Kandinsky", "comment_text": "Before checking out, Trenitalia asks if you want to add additional services (choose seats, change class, have access to the lounge, etc), perhaps did you inadvertently add a service?"}]}, {"id": "2205368643195547", "text": "Does anyone know which taxi companies in Naples/Sorrento are reputable? I heard there's a lot of scammers.\n\nAlso, what one can expect to pay from Naples airport to Sorrento?\n\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2205368643195547/", "likes": 1, "comments": [{"username": "Michele Levesque Semosky", "comment_text": "Visit taxi-calculator\n.com/\ntaxi-fare-napoli\n/199"}, {"username": "Ibbu Mohd", "comment_text": "Take bus from naples airport to naples port, then take ferry to sorrento\nUse \"ferryhopper\" app"}, {"username": "Christine Andaya-Wallace", "comment_text": "Thanks!"}]}, {"id": "2205371616528583", "text": "2 nights in Como or 2 nights in Cinque Terre if you had to choose?", "link": "facebook.com/groups/1373361046396315/permalink/2205371616528583/", "likes": 76, "comments": [{"username": "Sherry Welch", "comment_text": "Como- bellagio"}, {"username": "Milt Lawhorn", "comment_text": "I’ve been to the CT and it’s great so I’d have to pick Como, simply because I haven’t been there yet."}, {"username": "Dana Kittle", "comment_text": "Como"}, {"username": "Amalia Cristina", "comment_text": "Cinque Terre"}, {"username": "Millie Rodriguez", "comment_text": "Como"}, {"username": "Monica Marzari-Hailey", "comment_text": "Cinque Terre"}, {"username": "Phyllis Frier", "comment_text": "Como!!!!"}, {"username": "Susan Ray Taylor", "comment_text": "I deeply regret not being able to spend more time in Como being able to hop on and off the ferry to visit all the different villages that were so beautiful and filled with interesting shops, restaurants and history!"}, {"username": "Rosi Wendt", "comment_text": "Did both loved them both 🙌"}, {"username": "Jo Ann Perrotta Solimando", "comment_text": "4 nights in Cuomo."}, {"username": "Valerie Grist", "comment_text": "Como!"}, {"username": "Maggie Glover Daniels", "comment_text": "Como"}, {"username": "Anna Rosella", "comment_text": "Como"}, {"username": "Laurie Finnell Smith", "comment_text": "Como!"}, {"username": "Kristi Newhouse", "comment_text": "Has anyone done 10 day trip that included Amalfi coast and made it to lake como? Not sure how to plan such a thing that makes sense…."}, {"username": "Karen Deegan", "comment_text": "You need more time in Cinque Terre, you need to walk the towns.. they are wonderful. 2 nights in Como is enough"}, {"username": "Karin Waldock", "comment_text": "Ashlan Waldock"}, {"username": "Ramona JJ", "comment_text": "Probably Como. I don't get the fascination with 5 Terre"}, {"username": "Majd Mubaidin", "comment_text": "I haven’t been to cinque terre but two nights in bellagio and one in Varenna were worth everything 😍"}, {"username": "Rhonda Tarchini", "comment_text": "Both"}, {"username": "Diane Spicer", "comment_text": "Both but Como"}, {"username": "Cheryl Bastow", "comment_text": "Tough choice. CinQue"}, {"username": "Renée Niquette", "comment_text": "I could not choose !!!"}, {"username": "Marisol Estremera", "comment_text": "Cinque Terre ❣️"}, {"username": "Karyn Huisman", "comment_text": "Cinque terre"}, {"username": "Kim Laverick", "comment_text": "Como"}, {"username": "Diane Subert Murphy", "comment_text": "Love both but Como has a lot of beauty."}, {"username": "Helene Wright", "comment_text": "I would pick Menaggio. Really laid back and so beautiful."}, {"username": "Petra Hess", "comment_text": "Cinque Terre without a doubt. 💕"}, {"username": "Liane Shatrov", "comment_text": "Como!"}, {"username": "Shari Osborn Klarich", "comment_text": "Two nights means only one full day. If you could stay three nights, you would get two full days. Much better. They are both beautiful, but different, places."}, {"username": "Beth Bolyard", "comment_text": "Como"}, {"username": "Barbara Musso Brotschul", "comment_text": "Cinque Terre"}, {"username": "Dianne Chalfant", "comment_text": "Como"}, {"username": "Iliana Zlatareva", "comment_text": "Como"}, {"username": "Mich Ele", "comment_text": "Como"}, {"username": "Jill Perretti Martay", "comment_text": "Como hands down! Specifically Bellagio"}, {"username": "Lily Mehr", "comment_text": "Cinque terre"}, {"username": "Sara Bee", "comment_text": "Cinque terre hands down. No comparison.\nUnless it’s August, then definitely avoid Cinque Terre."}, {"username": "Bettine Aba Eli", "comment_text": "Cinque terre"}, {"username": "Maria Graziella Rincon", "comment_text": "Cinque Terre"}, {"username": "Mirka Zembjak", "comment_text": "Definitely Cinque Terre, si much to see and so beautiful"}, {"username": "Sue Jackson", "comment_text": "Cinque Terre"}, {"username": "Chris Seymore", "comment_text": "I love both. They’re both amazing. But if I had to choose it would absolutely be Cinque Terre."}, {"username": "Ann Moorhead", "comment_text": "2 nights in Como"}, {"username": "Marcy Gallardo", "comment_text": "Cinque Terre for sure!"}, {"username": "David Garfinkel", "comment_text": "Como. No contest"}, {"username": "Kristin Merrill- Walker", "comment_text": "Como"}, {"username": "Kate Gold", "comment_text": "Como for sure"}, {"username": "Marlyn Abramson", "comment_text": "Como"}, {"username": "Cynthia Vitale", "comment_text": "Just went to both… Lake como!!!"}, {"username": "Dorothy Press", "comment_text": "We stayed in Lake Como for 4 days and only did a day trip to Cinque Terre. We stayed in Santa Margarita for 2 nights before heading to Florence for a few days. Lake Como was amazing, we stayed in Varenna 💕"}, {"username": "Damjana Puklavec", "comment_text": "Como🥰"}, {"username": "Lynette Garland", "comment_text": "Oh god that’s a hard one we did 4 nights in cinque Terre must say one if the highlights of our 8 week trip also had 3 nights in Milan with day trips to lake Como and lake Garda . Eating in cinque Terre way cheaper and really would have to pick that in the end, stay in Monterosso it’s just fabulous"}, {"username": "Franco Abbaglivo", "comment_text": "Cinque terre"}, {"username": "Penny Cato", "comment_text": "4nights in CT. 🇦🇺🇮🇹🥂"}, {"username": "Bellafab Fabrizio", "comment_text": "Omg Cinque terre any day of the week! Been to both!"}, {"username": "Anna Cappeluti", "comment_text": "Loved Lake Como, we’ve been to Cinque Terre a few times and it’s beautiful as well but we loved the relaxing feel about Lake Como, we stayed at Mennagio and it was stunning. To be honest both places are gorgeous so you can’t go wrong.\n😊😊"}, {"username": "Mary Melissa Manuel", "comment_text": "Como!!!!"}, {"username": "Michelle Crahan Panciocco", "comment_text": "Cinque Terre it’s amazing!!"}, {"username": "Kerry Abell- Landon-Speziale", "comment_text": "Cinque Terre without hesitation!!"}, {"username": "Alex Gaidouk", "comment_text": "Como"}, {"username": "Kasia Kotlarska-Stec", "comment_text": "We did one day in Lake Como and one in Cinque Terre - totally doable if you have a car 😃 just pick 1-2 towns in CT - they all look/feel similar so not necessary to see all towns if you don’t have time 😉 we loved Riomaggiore and Vernazza 😃 and took a boat to Bellagio, Varenna and Menaggio on LC 🙂"}, {"username": "Tracy Meyer", "comment_text": "Kim Hughes"}, {"username": "Figen Dayan", "comment_text": "CT"}, {"username": "Jan Watson", "comment_text": "COMO!"}, {"username": "Heikki Valtonen", "comment_text": "Both❤️"}, {"username": "Karyn Brown", "comment_text": "como"}, {"username": "Alain Gielen", "comment_text": "Como and Como Lake are nice but amongst the 3 lakes ( Maggiore & Garda ), the less attractive.\nAlso I prefer Amalfi coast over Cinque Terre"}, {"username": "Bronwyn Walsh Jenkins", "comment_text": "Como"}, {"username": "Adeline Alex Tanfara", "comment_text": "Hard to choose. They’re both beautiful.￼"}, {"username": "Lyn Duty", "comment_text": "Cinque Terre have more to offer."}, {"username": "Vicki Dyer", "comment_text": "Loved Cinque Terre"}, {"username": "Jayne Bradshaw", "comment_text": "Jayne Bradshaw"}, {"username": "Di Walker", "comment_text": "Kristen Stephens both baby 🩷😂"}, {"username": "Kenneth Montoya", "comment_text": "Cinque Terre but that’s me personally"}, {"username": "Paul Thompson", "comment_text": "Como"}, {"username": "Rick Washco", "comment_text": "Cinque Terre definitely! But - there are 5 villages in the CT. Don’t try to do them in a few hours. We spent 4 days there in April and loved every minute!"}, {"username": "Debbie Milne Jenkins", "comment_text": "Cinque Terre hands down!"}, {"username": "Kristyn Kessler Lau", "comment_text": "Como"}, {"username": "Ninoska Malik", "comment_text": "I am in Como at this moment and this place is magical\nI’m obsessed"}, {"username": "Renee Lastort Pennebacker", "comment_text": "Como"}, {"username": "Sarah Louise Jeffers", "comment_text": "CT for sure!"}, {"username": "Alison Bryson", "comment_text": "Lake Como, Varenna"}, {"username": "Krish Rescigno", "comment_text": "Cinque Terre most definitely!"}, {"username": "Patrick Eidinger", "comment_text": "Como"}, {"username": "Toni Stent", "comment_text": "Varenna on Como"}, {"username": "Rose Coccaro", "comment_text": "both you only live once"}, {"username": "Karima Berrada", "comment_text": "Depends on what you like. I just did both and it was great."}, {"username": "Hilarie Morton Jones", "comment_text": "Como!"}, {"username": "Gintarė Gi", "comment_text": "Como 😊"}, {"username": "Angela Gonza'lez-Troxel", "comment_text": "Both"}, {"username": "Sue Campbell", "comment_text": "No choice Cinque terra"}, {"username": "Marg Sebo", "comment_text": "Cinque Terre"}, {"username": "Joanie Mitvalsky", "comment_text": "Como .. Cinque terra is so touristy! ( shame)"}, {"username": "Louloudidou Louloudidou", "comment_text": "Impossible de choisir. Je fais les deux ♥️"}, {"username": "Annabella Pojer", "comment_text": "Do both"}, {"username": "Natasha Bisordi", "comment_text": "Como, cinque Terre is overrun with tourists!"}, {"username": "Tricia O'Donovan", "comment_text": "Cinque Terre"}, {"username": "Luciane H Azevedo", "comment_text": "After spending 2 weeks in Italy and coming back last Sunday… I’m just so grateful to be back home.\nItaly left me with a bad taste and I have no desire of ever coming back. I know people think differently and we don’t hear much about it but I personally like people over places and for that reason I realized that all the other places I’ve seen are on top of the list 💔"}, {"username": "Juliet Cavanaugh", "comment_text": "Como for sure. Elegant, relaxed, beautiful. We’ve been, so this time my husband and I are staying on the other gorgeous lake, Maggiore, in late September."}, {"username": "Liz Marquez", "comment_text": "Como!"}, {"username": "Dorothy Holder Zmigrodski", "comment_text": "CT"}, {"username": "Beth Tate Branz", "comment_text": "I haven’t been to Como, but I have been to Cinque Terre twice. It is beautiful but over run with tourist. Getting on and off the train can be a nightmare if you are slightly claustrophobic."}, {"username": "John Ross", "comment_text": "Cinque Terre"}, {"username": "Britta Mobley", "comment_text": "I have brent I both and both places are beautiful! Hands down Lake Como! Stay at Hilton in Como. Most gorgeous rooftop pool with views of lake. Rent a boat and see the area from the water. It’s one of the few places we want to return to."}, {"username": "Tracy Cunning", "comment_text": "Cinque Terre"}, {"username": "Ari Sun", "comment_text": "Cinque terre"}, {"username": "Mark Hardman", "comment_text": "Como"}, {"username": "Carla Bertozzi", "comment_text": "Cinque Terre, absolutely!"}, {"username": "Kathy Conaty", "comment_text": "CT for sure but don’t miss Como’s surrounding beaches, all amazing ❤️"}, {"username": "Dianne D'Alimonte", "comment_text": "Cinque Terre"}, {"username": "Cryst Cheung", "comment_text": "Como is nice but 2 night maybe not enough"}, {"username": "Jeanne Zorich", "comment_text": "Cinque Terre"}, {"username": "Natalie Demie", "comment_text": "@ lake Como"}, {"username": "Danielle Marie", "comment_text": "Depends on when you are going, we went on our honeymoon to both in mid May, Cinque Terre was only busy during the day and Lake Como was really quiet, if I had to choose one I would pick Cinque Terre because it isn’t as spread out as lake Como so getting around is much easier and cheaper"}, {"username": "Cynthia Chow", "comment_text": "I feel like you can take the train and see all the towns of Cinque Terre in one day."}, {"username": "Sandy Gorr Ghilarducci", "comment_text": "Never been to Como but I though CT was super touristy. Happy I was there once, but do not feel the need to go back."}, {"username": "Candy Mattiello", "comment_text": "Cinque Terre❗️💕"}, {"username": "Kelly Petillo", "comment_text": "I would stay in Tremezzo or Bellagio over Como!"}]}, {"id": "2205378246527920", "text": "Never a dull moment when travelling with my son who is a big Lego fan. First stop on our first day in Italy - the Lego store to get his passport stamped and check out their local creations. Next step to go on a walk about to find the real thing!", "link": "facebook.com/groups/1373361046396315/permalink/2205378246527920/", "likes": 165, "comments": [{"username": "Matt-Kathy Stavely", "comment_text": "Jeannette Teall who knew??"}, {"username": "Katrina Nancy Robin", "comment_text": "Very cool 😎"}, {"username": "Gigi Igle Gonzales Dong", "comment_text": "Nice! My 23 year old engineer also loves Legos. She put her new one of a Vespa in her new office."}, {"username": "Sara Sinclair LeLievre", "comment_text": "Where did you get a lego passport?"}, {"username": "Theresa Caruthers Ansbaugh", "comment_text": "So awesome"}, {"username": "Liza Vega Santos", "comment_text": "Liza Vega Santos"}, {"username": "Maria Musumeci", "comment_text": "In 2022 we travelled with friends. Their son (19 at the time) is a huge Lego fan, so my kids HAD to show him the Rome store. He purchased The Colesseum (mind you we were in the middle of a 4 week trip, but he managed to carry it safely everywhere). He built it & has it proudly displayed at his family home in Australia & it's truly magnificent!!!"}, {"username": "Judy Carey", "comment_text": "So cool!!!"}, {"username": "Paula Bennett", "comment_text": "How fun!"}, {"username": "DeAnna Pulliam Like", "comment_text": "So cool!!!"}, {"username": "Vanessa Jimenez", "comment_text": "Adam Jimenez"}, {"username": "Christy Powers", "comment_text": "Which Lego store did you go to!? This is the highlight of my sons trip except for the coliseum 🤣"}, {"username": "Stephanie Osborn Rushing", "comment_text": "Neat! My daughter would like to do the same!"}, {"username": "Niki Sewell", "comment_text": "That’s awesome!"}, {"username": "Marla Mazalan", "comment_text": "Love this!! Thanks for posting!"}, {"username": "Nancy Lewis", "comment_text": "Great store in Cologne, Germany too."}, {"username": "Audrey Daenzer", "comment_text": "Tell me more about this “Lego passport”."}, {"username": "Jaimi Bakker", "comment_text": "Go at 6am 🤣"}]}, {"id": "2205372499861828", "text": "“Born from a thought of love and a dream of beauty”, as Giovanni Pascoli wrote, Pienza is known as the incarnation of the ideal city!\n\nJoin our NEW virtual experience: आणखीhttps://nextstop-italy.com/virtual-tours/pienza/\n\n#italytravel #artlovers #hiddengems #italygram #vacationmood #virtualworld #history #italytrip #medievalarchitecture #medievalart #medievalhistory #medievalcastle #italytrip #hiddengems #artlovers #tuscany #tuscanygram #tuscanyitaly #tuscanytravel #tuscanypeople #tuscanyexperience #pienza #pienzaitaly #pienzatuscany #renaissance #renaissanceart #orciavalley #valdorcia", "link": "facebook.com/groups/1373361046396315/permalink/2205372499861828/", "likes": 5, "comments": []}, {"id": "2205308463201565", "text": "Discover the splendours of the Roman Baroque with our immersive virtual experience of the Borghese Gallery.\nDuring the virtual tour, you will be led by an art and history passionate guide through thisआणखी outstanding Museum, it will be an incredible opportunity to discover one of the world’s greatest art galleries…all from the comfort of your own home.\n\nJoin us: https://nextstop-italy.com/virtual-tours/borghese-gallery/\n\n#history #art #italytrip #virtualworld #vacationmood #italytravel #VirtualTour #renaissanceart #italygram #italyiloveyou #borghesegallery #villaborghese #Bernini #bernini #canova #caravaggio #baroque #baroqueart #art #artlovers #artgallery #artoftheday #museum #museumlove #museumlover #museums #MuseumsForAll #arthistory #arthistorynerd", "link": "facebook.com/groups/1373361046396315/permalink/2205308463201565/", "likes": 7, "comments": []}, {"id": "2205099583222453", "text": "DAY 12- VIESTE BY NIGHT\nThe historic centre of Vieste is truly charming with a maze of alleys characterized by white-washed houses, churches and its famous Swabian Castle. An evening stroll through the centre is… आणखी an experience that shouldn’t be missed. You can enjoy the many shops; enjoy a pizza and even watch an evening show.\nWhere to stay: Hotel Falcone - Discover More: https://www.tkqlhce.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g194948-d572017-Reviews-or10-Hotel_Falcone-Vieste_Province_of_Foggia_Puglia.html%23REVIEWS\nLovely hotel with awesome location - walking distance to beaches, restaurants and attractions.\n#vieste #gargano #garganoexperience #garganocoast #puglia #apulianlife #apuliatravels #nextstopItaly #italygram #italy_vacations", "link": "facebook.com/groups/1373361046396315/permalink/2205099583222453/", "likes": 12, "comments": [{"username": "Carmela Losavio Wiltshire", "comment_text": "Puglia... home🫶🥰🙋"}]}, {"id": "2205141756551569", "text": "Just curious, has anyone used booking.com for accommodations, and how reliable were they?", "link": "facebook.com/groups/1373361046396315/permalink/2205141756551569/", "likes": 82, "comments": [{"username": "Maria Brozou", "comment_text": "I have been using booking for years all over Europe. Never had any problems. I usually book hotels and once in a while a private host. Always read the reviews because booking only allows reviews to people who have actually stayed in the accommodation."}, {"username": "Susan Levings", "comment_text": "Use it all the time.. .they never disappoint"}, {"username": "Kylie Eagleton", "comment_text": "Love booking.com and with the free cancellation when you book a year ahead it’s worth it. I also just messaged hotels direct after I booked so long ago and the prices have sky rocketed so much it’s cheaper now with booking.com"}, {"username": "Karen Keppel", "comment_text": "Never had an issue, great site!"}, {"username": "Sage Marie", "comment_text": "I use all the time for bookings in AUS & overseas. Never had a problem!"}, {"username": "Stella Cammarano", "comment_text": "We used Air BnB"}, {"username": "Siobhan Aherne", "comment_text": "Booking.com let us down badly in Sorrento last year. The accommodation was not up to scratch and after several phonecalls and efforts to fix the problem had failedr, they refused to let us speak to someone'in charge and basically said they would charge us for a full weekend if we didn't leave that day. This was 11pm at night and no where to go.. Luckily we found a place outside of Sorrento so at least we had somewhere to stay. We had to pay €50 for a taxi to get there. The apartment that we left had a strong smell of sewage and the shower didn't Work . It was a nightmare dealing with them . Never again. It's all fine untill you gave a problem and then they don't want to know"}, {"username": "Mike Guluk", "comment_text": "Yes numerous times I get great extra discounts as a genius member"}, {"username": "Tracey Fairbrother", "comment_text": "Lots and always been great"}, {"username": "Ronel Gouws", "comment_text": "Yes most of our travel stays"}, {"username": "Sheyla Enrich", "comment_text": "Yes. I always do."}, {"username": "Tiffany Lopez", "comment_text": "I like it because you can reserve/hold a room without paying for it until closer to the date …"}, {"username": "Frannie Kaplan", "comment_text": "All the time, 90% great experiences. I think I cab give you a discount code as well, but I have to check, lmk"}, {"username": "Sandra Kingsley", "comment_text": "Use them all the time all over the world , brilliant!\n\nWe are overseas at present using them again for all our accommodation needs, never had any issues at all."}, {"username": "Bellafab Fabrizio", "comment_text": "100% then use a cashrewards or a shop back site and get another percentage off"}, {"username": "Anna Maria Gatt", "comment_text": "Very reliable"}, {"username": "Karin Garfin", "comment_text": "OMG, we’re in a battle with them right now. They’re a mess… ￼ and customer service is a disaster."}, {"username": "Robin Polito", "comment_text": "I've used booking, Expedia and the Agriturismo app. Had no problems with any of them."}, {"username": "Allan Miller", "comment_text": "Yes, use them all the time"}, {"username": "Val Furlong", "comment_text": "Always use them never any issues"}, {"username": "Natalie Wohling", "comment_text": "I always use it. Even used it for flights ✈️"}, {"username": "Cynthia Tarantino", "comment_text": "Book straight with hotel...not dependable!!"}, {"username": "Mimi Gill", "comment_text": "Yes, all through Italy! No problems at all"}, {"username": "Aiko BSamadan", "comment_text": "Yes"}, {"username": "Melissa White", "comment_text": "100s of times. Am now getting 15% off every booking as I review each one"}, {"username": "Lindsay Stewart", "comment_text": "Very reliable and often cheaper than other sites"}, {"username": "Vanessa Durkin", "comment_text": "I find thembexcellent easy to use can often pay at property and all accomodation as described use them both home and abroad currently in italy and my florence booking is great moving on next week to rome amalfi and capri"}, {"username": "Penny Cato", "comment_text": "I lost money with them at the beginning of COVID B.Com told me the hotel and the hotel told me B.C had it and there was no resolution!!! No credit!!! I won’t use them again!!"}, {"username": "Valentina Zoccheddu", "comment_text": "Sempre e solo booking"}, {"username": "Judy Miller", "comment_text": "I use it often and have never had a problem. Great app that tracks all your reservations. I always choose hotels with good cancellation policies to give the best flexibility I want."}, {"username": "Lori Greco", "comment_text": "Very reliable, use them all the time."}, {"username": "Janis Laidler", "comment_text": "I’ve always used them previously. However we recently stayed at a hotel they said was 4 star when it was only actually 2! I emailed them and they said get in touch with the hotel but as the staff didn’t speak English that wasn’t an option. I w sent them photos of how awful the place was but haven’t had any positive feedback yet as I demanded a refund. They said the hotels put their own posts and star ratings and they aren’t responsible so just a word of warning . I doubt all of the reviews are 100% truthful also. After all they’re a business out to make money regardless."}, {"username": "Anne Maree Wallett", "comment_text": "Yes use them regularly- reliable"}, {"username": "Mary Grech", "comment_text": "I always use it"}, {"username": "Marianne Russo Arrigone", "comment_text": "Don’t do it!\nSomething goes wrong you can’t get a hold of them. The call goes to a foreign country."}, {"username": "Lorr Aine", "comment_text": "No problems...I use as its easier for free cancellation which is not always available when booking directly with hotel"}, {"username": "Tilla Olivier", "comment_text": "Very good."}, {"username": "Ruma Dak", "comment_text": "Yes, many times, in various countries. Never had a problem"}, {"username": "Avril Jackson", "comment_text": "No problem for me"}, {"username": "Allison Campbell", "comment_text": "Yes booked almost our whole 5 week trip\nUsing them. Spot on ."}, {"username": "Enid Monica Robinson", "comment_text": "Yes,I find booking more reliable and easier to deal with than other sites and if you use them a lot you can get some special offers"}, {"username": "Erin Barnard McCann", "comment_text": "Used booking.com exclusively for an Italy trip two weeks ago when we visited four cities over 8 days. One location was overhyped but the other four hotels were great! Would definitely use this strategy again."}, {"username": "Lorraine Ewers", "comment_text": "Not great, used them a lot, then the night before our London stay they cancelled our booking as they couldn’t take payment. Nothing wrong with any of my payment cards. I called them and they refused to take payment over the phone. Haven’t used them since. Use Expedia now, no problem"}, {"username": "Lauren Chastain Presson", "comment_text": "I used them and had no problems!"}, {"username": "John Walter Brown", "comment_text": "Used them for all accommodation in Italy this year and no probs at all."}, {"username": "Anne-Marie Twigge", "comment_text": "Do most of my bookings through them."}, {"username": "Gabriela Szymaniak", "comment_text": "I always use them everywhere I go 👌"}, {"username": "Alain Gielen", "comment_text": "i never had an issue with booking , tomme absolutely reliable. But I also always check if I can book directly with the hotel, and if possible I do that."}, {"username": "Fiona Mac", "comment_text": "Just watch where u book ensure taxes are included also local tourist taxes are payable"}, {"username": "Sharon Costa Malaspina", "comment_text": "Well ee used booking.com. hotel was horrible, tried to cancel. You cannot get a refund fyi"}, {"username": "Kari Spain", "comment_text": "Booking are liars! You can pay to get a dump listed"}, {"username": "Sharon McCarthy", "comment_text": "Use them regularly and I love the easily accessible booking info when traveling. I do then check the accommodations website to see if they're able to get better in some way. I'm at a level with Booking.com that gets me upgrades and bonuses so often they are the better option"}, {"username": "Giulia Cardamone", "comment_text": "No problems ever"}, {"username": "Linda Seckler-Rufkahr", "comment_text": "I’ve used them many times. Never had a problem so far. My last booking with them was a lovely hotel in Venice."}, {"username": "Tina Bellitto", "comment_text": "I liked them"}, {"username": "Katia Taam", "comment_text": "I always use booking. com and never had any problem."}, {"username": "Sharron Joy", "comment_text": "I have used it regularly, never had an issue but once I choose a hotel, I check on their website direct also as they often offer extras: breakfast etc"}, {"username": "Tracy Krause", "comment_text": "I used them for all of my accommodations for 23 days in Italy 2 months ago. No issues"}, {"username": "Carol Vickers", "comment_text": "I only ever use booking . com . Have done so for over 10 years and never had a problem. I will say, however, that I don't ever book anything with a rating/review score under 8. I read the reviews too and go from there."}, {"username": "Pamela Jones", "comment_text": "We have used them all over the world, presently in UK & Europe using them. Absolutely brilliant! Very reliable. If the place you want shows as having no rooms left however , that just means no rooms left set aside for Booking.com....go try the hotels website often there are still rooms to be had."}, {"username": "Rita Mitchell Vieira", "comment_text": "I used booking.com for hotels in Italy, Spain, London, and California without any issues at all. I like that you can book many months ahead and pay closer to the date of the stay, or sometimes during the actual stay. That way if plans change, I don't have to badger the hotel for a refund. I also use booking.com for transport to/from airports and train stations and get great service every time."}, {"username": "Marie Payne", "comment_text": "I use booking to check everything out and then sometimes book direct after deciding...I have used booking also with no issues...usuall\ny cheaper to book direct but you have to pay in advance so 5 of one half a dozen of the other...good luck...everywhe\nre in Italy is wonderful!!"}, {"username": "Lisa Scott", "comment_text": "The big advantage is the ability to cancel easily if necessary and pay later. I book a looong way in advance and booking directly with the hotel means they have my money for almost a year."}, {"username": "Donna Stevens", "comment_text": "Always use it. No issues"}, {"username": "Natalie Cook", "comment_text": "I book all our trips through there and never had a problem until we went to Bali a month ago. The site was hacked and was nearly scammed out of 1000's of dollars. Saying that though, I still use them as this can happen anywhere"}, {"username": "Shirley Lewis", "comment_text": "we use Booking a lot, very reliable but compare w/other sites"}, {"username": "Pui Quing", "comment_text": "seriously reliable and sometime better price than airbnb or others. review are correct and photo are accurate. If you book through mobile sometime will get additional discount which is much cheaper than you book through website"}, {"username": "Jacinta McGarry", "comment_text": "Have used Bookings, prefer Hotels as you get free nights after 10 bookings . Have used it frequently on the go o/s, in advance and here at home. Off to the city next week o/n, free bottle of wine as I’m a Silver member."}, {"username": "Hope Brown", "comment_text": "I used Booking exclusively for our 3 week trip to Ireland and Italy. All accommodations worked out beautifully. I did a ton of research and read a lot of reviews."}, {"username": "Karen Bryant", "comment_text": "Yes I used it last year for Rome. It was perfect"}, {"username": "Maria Musumeci", "comment_text": "We used them for all our accommodation throughout our 4 week trip in 2022. Whether it was hotels or apartments, they were all great with no issues, and excellent communication. Best part was, it was all accessed through the one site."}, {"username": "Meg Bowen Beauchamp", "comment_text": "Used a lot. Never have had any issues."}, {"username": "Amy Sandler Riemer", "comment_text": "I booked an apartment in Manarola through booking. I like they don’t charge till right before the stay. I have noticed it’s almost all apartments."}, {"username": "Kelly Lutrick Sanford", "comment_text": "Yes and all of our accommodations were wonderful! Make sure you read all of the reviews before you book a hotel."}, {"username": "Tracey O'shea", "comment_text": "Found them great!"}, {"username": "Brenda L A Berry", "comment_text": "We do, haven't had any problems."}, {"username": "Sigrid Picken", "comment_text": "The advantage is not having to pay upfront, only on arrival, unless you are a no show then you pay full price anyway."}, {"username": "Patricia Betty Graham", "comment_text": "Don't like booking.com"}, {"username": "Bonnie Brauner", "comment_text": "The advantage that I find is that booking.com has a better cancellation policy￼ than a small hotel might."}, {"username": "Nathan Earl Stellenberg", "comment_text": "I've used them, so far so good"}, {"username": "Rebecca Vesić", "comment_text": "Only use them for actual hotels and even then I compare on booking.com then also confirm prices on individual site and book with whoever cheaper. You can also get genius discounts if you book multiple hotels. For Italy we booked through there and the hotel was offering a free airport pickup so we were picked up in a nice Mercedes from the airport and dropped right at the hotel."}, {"username": "Shelley Howard", "comment_text": "I have for years .. never had an issue\n. had one hotel cancel on us and they sorted a replacement out so fast.."}, {"username": "Natasia Joy", "comment_text": "Read reviews and be extra careful, some advertising tell you they won't refund, definitely don't book there, in my experience (and that's a lot!!) Those are the scammers ,and booking will not help you ....that being said...there are ofcourse also excellent Hosts on that site , but again ...be very Careful, read well , look at the pictures and be very critical, booking.com has bad reviews overall, Airbnb is much more trustworthy"}, {"username": "Sonya Valentino", "comment_text": "I’ll let ya know after my trip. Used it for most of our accommodations for a month mid September thru October. Nice to have it all in one spot. Communication to each place thru the site as well. Just easy"}, {"username": "Sam Mah", "comment_text": "We have used them quite a bit. We check reviews and prices with them, then go to the actual hotel site if we can find them and check the price for booking direct. We book the cheapest way. We found booking better for apartments as those are harder to find with just a search. We have only had one problem with an apartment and that was in part because we ten to book within 1-5 days of needing the accommodation. Bookings helped us fix the issue."}, {"username": "Fiona Cameron", "comment_text": "Yes I’ve booked through them many times. Just need to read ALL the conditions for each property. I like it because many have no deposit and free cancellation up to a certain date so if your itinerary changes (as mine just has) you can cancel and book somewhere else."}, {"username": "Patsy Luque Mejia", "comment_text": "Yes, and have never had issues. Works well for me."}, {"username": "Alexandra A Welker", "comment_text": "Very reliable, I use it almost all the time."}, {"username": "Denise Adams", "comment_text": "No probs at all. The more you use them, the more discounts you earn."}, {"username": "Michelle Smith", "comment_text": "Great no problems however if you can contact the accommodation direct try them first"}, {"username": "Michelle Forbes", "comment_text": "Never had a problem with booking.com,i have been using them for years with local and international travel. You may pay a couple of hundred dollars more for the option of free cancellation and pay at the property,but always compare prices with the website of the hotel,as sometimes cheaper to book with them direct,but not always. Having used booking.com for over 10years ,i now get a 10-15% discount when booking amd certain perks,like free upgrade or breakfast incl if available at the property,but always check different sites for best price. Good for reviews"}, {"username": "Lisa Olszewski", "comment_text": "I always use them - it's nice to have all bookings in one spot (in the app) and the more you book with them the better deals you get"}, {"username": "Lynair Bergman", "comment_text": "Yes I have used them and they have been 100% reliable just got back from a 5 week trip around europe and used them for all our bookings"}, {"username": "Patti Farrell", "comment_text": "Very good for booking easy cancellations.i\ndon't use anything else"}, {"username": "Crystal Hope", "comment_text": "Just make sure you untick the little box saying save your card details for next time, on the official booking.com website.\nI didn't realised it was ticked, and got scammed over $4,000 from fraudulent bookings that were done overnight while I slept."}, {"username": "Lisa Childs-Brown", "comment_text": "Yes, have used it for a.trip to Venice and Malcesine on 2 different occassions."}, {"username": "Ann Tritscheller", "comment_text": "I have used them with no problems."}, {"username": "Lauren Vassallo Beattie", "comment_text": "All the time. I prefer to book places directly as they are more accommodating if anything needs to be changed etc."}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "Nearly always use them. I have reached Genius level 3 and it’s worth itBUT read the descriptions carefully and read the reviews. So far no problems"}, {"username": "Terri Young", "comment_text": "Are use Booking.com all the time"}, {"username": "Louisa Smith", "comment_text": "I used booking.com for majority of my trip in May! All was good!"}, {"username": "Debbie Alves", "comment_text": "Great no problems at all"}, {"username": "Kathy Mansk-Billehus", "comment_text": "I used it and had no issues. But I always check if it’s a hotel on their site too in case they have a soecial"}, {"username": "Miyuki Kanno Paul", "comment_text": "Some accommodations only use the site for their bookings. My hotel in Matera is one of them. I usually use the site for information regarding descriptions of the rooms and amenities not informed by the accommodation’s\nofficial website. I prefer booking my accommodations directly from their respective official websites.\nThere are some occasions I used the site to book apartment rentals. I had to compromise and lowered my criteria for it because inventories were very limited at the time."}, {"username": "Laura Uribe", "comment_text": "We have used them almost exclusively because their listings are often in the city center. We have never had any problems."}, {"username": "Jennifer Wojack", "comment_text": "Used them for all my stays in Ireland and Scotland last fall it was amazing to have to option to cancel up to a few days before each booking . No issues at all"}, {"username": "Jane Wilson", "comment_text": "Have done all Italy accommodation bookings with booking.com.\nWill let you know how it goes in November when we return.🤣🤣\nIt’s handy having all accommodation (all info, address etc) on their app."}, {"username": "Viv Gleeson", "comment_text": "Use Booking.com all the time\nI have never had a problem"}, {"username": "Pam Kimak", "comment_text": "I booked both of my hotel stays, one in Rome the other in Maiori directly with the hotel. I couldn't have been more pleased meeting the actual person at the front desk when my family and I arrived."}, {"username": "Mat Marturano", "comment_text": "yes, no problems"}, {"username": "Heather Baumann", "comment_text": "I was a hotel.com until recently and just started using booking.com. No idea yet but reviews looked positive and they were cheaper then direct website which is why I decided to try. I did email the host to ask a question through the site and they responded so guessing it’s good to go."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Just used it for all of our accommodations for 7 cities. All of the places were wonderful and hosts so kind. Look at reviews prior to booking."}, {"username": "Pam Bouman", "comment_text": "Use all the time"}, {"username": "Angie Formica", "comment_text": "Used them for many trips in Europe. Never had an issue."}, {"username": "Meghan Lee", "comment_text": "It’s always best to book direct but sometimes they have much better pricing. I’ve used them a lot. I think it’s important to email the hotels directly around 1-2 weeks before reservation and make sure everything is in order and that they have your booking. I’ve had no issues"}, {"username": "Karen Casey", "comment_text": "I have never had a problem"}, {"username": "Annette Mayer", "comment_text": "Use it often"}, {"username": "Marie Tmarie", "comment_text": "love it"}, {"username": "Jenny Kendrick", "comment_text": "Yes we did and no issues. Just do your reading of the motels suggested and i would check to see if they have an overnite staff member onsite"}, {"username": "Tracy Wetherill-white", "comment_text": "Yes used them for 6 of my accommodations in Italy 🇮🇹 in June reviews are pretty spot on never let me down once always use them"}]}, {"id": "2205162723216139", "text": "Wrapping up our trip in September in Positano, and would like to have a special meal on our final evening.\n\nWho has an amazing restaurant experience recommendation in Positano?\n\nLa Tagliata is one I was thinking about.\n\nGotta have unforgettable view and food. Budget is no issue.", "link": "facebook.com/groups/1373361046396315/permalink/2205162723216139/", "likes": 33, "comments": [{"username": "Brooke Williams", "comment_text": "The best dinner we had was at Roc Pizza and Steak. We went back twice during our trip, because it was that amazing! Not an unforgettable view, but definitely unforgettable meal."}, {"username": "Jill Wolder", "comment_text": "Hotel San pietro"}, {"username": "Carlotta Crespi", "comment_text": "best restaurant in the area: https://\nwww.ristoranteda\nciccio.com/en/"}, {"username": "Denise Curtis", "comment_text": "Look up Il Pirata"}, {"username": "Michelle Solak", "comment_text": "We loved La Tagliata!! We went there on our last night and agreed it was the perfect dinner for our last night of our vacation"}, {"username": "Gina Romano Peralta", "comment_text": "La sirenus"}, {"username": "Alice Francesca", "comment_text": "Eating the best seafood pasta on the beach in Positano:Le tre sorelle!\nFamily owned for decades!"}, {"username": "Peter Doyle", "comment_text": "Le Sirenuse"}, {"username": "Jan Buess", "comment_text": "Is this the restaurant that's at the top and sometimes offer a crazy ride up there and does not have a menu and you have to eat what they put in front of you? If so, I have heard mixed reviews from too much food and not enough time to enjoy to having a cooking class at the same time that are always so loud? And the food is just ok and just one price???"}, {"username": "Stuart Vogt", "comment_text": "Da Vincenzo has been Michelin rated. Not a view unless you consider the wait at the side of the road with a prosecco."}, {"username": "Joanah Kemirembe", "comment_text": "Life is an opportunity but it comes for those who extremely have the zeal to achieve it don't sit back and watch others earning greatly just give it a try\nStephen Hanson"}, {"username": "Elie Loummer", "comment_text": "Luna at Villa Magia for sure!!!!!!! Worth the money!!! Best dining experience of our lives!"}]}, {"id": "2205157389883339", "text": "Hi all, I’m planning my 2-week trip to Italy in the end of November. My itinerary will be Turin, Cinque Terre, Florence & Tuscany, Rome, Venice, Milan and maybe Dolomites. I heard November is slow and possibly the rainiest month there so I want to have a plan B. I prefer to stay in the North of the country. What would you recommend? Thank you all 😃", "link": "facebook.com/groups/1373361046396315/permalink/2205157389883339/", "likes": 10, "comments": [{"username": "Libertie Oknames", "comment_text": "Oct"}, {"username": "Stephanie Dean", "comment_text": "Forget Cinque Terre in November. Add Verona to your itinerary. Skip Turino. And still that's a lot of places in 2 weeks. Remember it takes most of a day to travel from one place to the next (check out, transport to train, travel time, transit to hotel, check in and eat somewhere along the way). Also leave yourself time to just sit in a cafe and drink a coffee, or wander around Venice with no itinerary."}, {"username": "Mike Ball", "comment_text": "If you are planning to visit at the end of November anywhere in the North of Italy will be cooler and wetter,\n\nI’ve visited Rome and Milan in late November and we had rain during both trips , there is still plenty to see and do though so don’t let the weather put you off ."}, {"username": "Glenn Todd Webb", "comment_text": "Way too much for 2 weeks. Venice(3),Milan\n(3), Florence(4), and Rome(4) are barely doable in 2 weeks."}, {"username": "Ken Lerch", "comment_text": "Your Plan A is too ambitious for my style of travel so good luck, grab your selfie and scamper off to the next stop. But as to a Plan B, reduce your travel (hopping lots of trains and hotels in the cold and rain can be miserable) and pick picturesque venues. Start in Florence (4 days) get car and map out roaming around Tuscany (3–4 days, hilltowns, villages.) Drive or train to either Siena/Orvieto/\nAssisi on your way to Rome. 4 days there, then go home. Simplify."}, {"username": "Mell Prz", "comment_text": "Bologna. Its an amazing city. Very gotic structures. Subrealist. I went last october and was not to crowded, not price. Confort to walk."}, {"username": "Elizabeth May La Duca", "comment_text": "Way too much for 30 days, imho…l like flying with Emirates Airlines [JFK NYC-MXP Milan] because convenient departure/\narrival times and economy fare includes 50 lbs check in bag and can stay 2 months"}, {"username": "Maria LoSurdo", "comment_text": "A lot of gorgeous places are in the south too but if you only have limited time…"}, {"username": "Marcia Grant", "comment_text": "In my opinion the Dolomites would not be a good choice.\nI spent a week there at the end of May. It was beautiful and I loved it for hiking in low season.\nThe downside was very few establishments were open and I encountered ice and snow in the higher elevations.\nI’m accustomed to driving in those conditions but it was very challenging on the switchback mountain roads."}, {"username": "Shannon Darcy", "comment_text": "Cinque Terre has all ferries closed and many restaurants Oct 31"}, {"username": "Donna Parrish", "comment_text": "Might be too many destinations for a two week itinerary! Can you stay 3 weeks?"}, {"username": "Lisa Good", "comment_text": "Verona!!!"}, {"username": "Gayle Moores", "comment_text": "We travelled in early November on our first trip to Italy. It is the off season but it does have its advantages depending on where you plan to visit. Less crowds being one of them.We stayed on the Amalfi Coast in the South and the weather was beautiful .I would go towards the South not the North. November is usually the rainiest month in the North!\nPlaces like the Amalfi Coast Rome,Southern Tuscany tend to be drier.I would include Florence as it was warm and dry when I was there in November.I would pack a small travel umbrella just in case it rains and a warm lightweight jacket for cooler nights."}, {"username": "Daisy Yoo", "comment_text": "I am not sure if it is idea for Dolomites in nov"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "November is the rainy season in the north of Italy."}]}, {"id": "2205159843216427", "text": "Question about laundry in Rome, Venice, and Florence. We are staying in Hotels and not Airbnbs. What laundry options are there?", "link": "facebook.com/groups/1373361046396315/permalink/2205159843216427/", "likes": 10, "comments": [{"username": "Crystal King", "comment_text": "Washing and drying at the hotel sucks, doesn’t dry in the humidity and your clothes aren’t as clean. We did laundry in Venice. There’s a little place by the Rialto bridge. We just looked on Google Maps. Soap is included in the price. Took about 1 1/2 hours to wash and dry. We had a drink at a nearby cafe while clothes were washing. Really easy. Those same laundromats are all over Italy. We didn’t need one in Florence but did the same in Milan and Pisa."}, {"username": "Jeff Overman", "comment_text": "You can search for a term like self service laundry and see what’s nearby"}, {"username": "Carol Taylor Tisdale", "comment_text": "First off, ask the front desk about options near you. Some are normal launderettes, some you can drop off and some will pick up from hotel and return to you."}, {"username": "Michela Zanni", "comment_text": "There are self service laundry in every town"}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "We stayed in a great apartment in Florence close to everything with laundry facilities. It was fabulous! Palazzo Belfiore"}, {"username": "Vivien Paulik", "comment_text": "Not in the hotel, but there are self services laundry in the cities"}, {"username": "Wendy Spano Bracco", "comment_text": "Washing and drying many items in a room with no balcony is very hard. Little things like bras and underwear for women are fine. Also some very very light fabrics. I’m checking with my hotel for my second and third stops (Florence and Rome), to find about about their laundry options for those heavier items like men’s underwear, socks etc…we don’t have time for a laundry mat."}, {"username": "Madeline Caporale", "comment_text": "Possibly your hotel may offer laundry service. Otherwise there are services that will wash, dry, fold and deliver your items to your hotel, or you can search google for nearby laundromats."}, {"username": "Kris Beacham", "comment_text": "You have to send it out. Unless you find a laundromat."}, {"username": "Robin Burrell", "comment_text": "You should easily find a launderette."}, {"username": "Jenny Payne", "comment_text": "Airb&b have washing machines , I take sheets of washing powder, a lot easier these days & hotels that I stay I send out , costs me €5 per item 🌻"}, {"username": "Bridget Gieseke", "comment_text": "Laundromats…."}, {"username": "Paula Stewart", "comment_text": "We used a launderette in Rome. We left the washing and collected it later. Didn’t want to use hotel laundry as all dry cleaning. It was much cheaper and we had a lot of washing."}, {"username": "Carole Tarlap", "comment_text": "In both Rome and Florence I used a Laundromat. Easy....clean..\n.not expensive! You can also drop off and they do it ...you come back and pick.it up."}, {"username": "Edmond Nolan", "comment_text": "Hotel laundry"}, {"username": "Lucrezia Folger", "comment_text": "There are places you can drop your clothes off and pick them up later in the day."}, {"username": "Dana McCracken", "comment_text": "I checked at one in Sorrento. $7 per pair of socks was as far down the price list as I made it. Lol"}, {"username": "Sharon Bowns", "comment_text": "Call the hotels"}, {"username": "Brian Osman", "comment_text": "I went to a laundromat"}, {"username": "Liz Anne", "comment_text": "We just returned from Rome, Florence and Venice. When we arrived in Florence we had the hotel do some of our laundry. Expensive, but it was done in a few hours and didn't interfere with our touring. With the heat right now, we were going through 2 or 3 outfits a day!"}, {"username": "Kathy Whiting", "comment_text": "Plenty of laundromats all over Florence"}, {"username": "Michelle Bergman Davis", "comment_text": "We found a laundromat in Rome that was very convenient to our Airbnb. Just use google search. You can also find full service laundry service if you are willing to pay for it."}, {"username": "Dann Hrusch", "comment_text": "Check with your hotels first. Like anywhere in world, some don't offer, some charge by the item and some have a flat rate by bag. Turnaround time can vary too."}, {"username": "Tari Lawson", "comment_text": "I Saw a couple Laundromats when we were walking around Rome."}, {"username": "Miyuki Kanno Paul", "comment_text": "Some towns have laundromat or laundry service. We use hotel’s laundry service for heavy items(hard to dry/special care) or “urgent” items. Some light things can be washed in sink. Your hotel shampoo is perfect for it!"}, {"username": "Claudia Caravedo Arroyo", "comment_text": "We googles laundromat and found many around our hotel 🙌😜"}, {"username": "Carla Onofrio", "comment_text": "Having the hotel do your laundry is super expensive. Find a laundromat instead. We did ours in Florence and there was a nice cafe across the street where we drank cappuccinos and ate pastries while we waited. ☺️"}, {"username": "Amber Caracol Noguchi", "comment_text": "We used a laundromat in Sorrento. Asked how much at drop off and they said 20 euros per load. Which was great compared to laundry service at the hotel that was per item. The next day we went to pick up and paid 20 euros. When unpacking the clothes, the receipt said 5 euros. While the clothes were clean and folded, I didn’t feel good about being scammed by the laundromat. I guess the takeaway is to ask for them to write out a receipt before paying??"}, {"username": "Ann Hall Dagostino", "comment_text": "There is one on Cavour they will do exactly the way you ask cold water, no dryer for 20 euros for several different pieces. We have used them the last 2 times we have been there"}, {"username": "Wahab Sidharta", "comment_text": "Laundromat in Florence, close to Ponte Vecchio bridge."}, {"username": "Amelia Bowers", "comment_text": "Many hotels have a laundry service, but the better option would be to wash your small items and hang them to dry in the bathroom. Some bathrooms have a drying line over the bath."}, {"username": "Amelia Bowers", "comment_text": "Otherwise, here are some laundromats."}, {"username": "Yvonne Ormson", "comment_text": "Laundry services available everywhere. Wash/dry/fold. No need to wash underwear in the sink 😂"}, {"username": "Deborah Schroeder", "comment_text": "These are major cities and have laundry facilities. Look at Rick Steves book on Italy and he shows laundromats on a map in each location."}]}, {"id": "2205165216549223", "text": "Hello everyone!\n\nDoes anyone know of a firm which I could contact in advance to book this kind of tour in open bus in Rome?\n\nDid anyone have good experience with this kind of tour?\n\nWill appreciate the information so much!!!🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2205165216549223/", "likes": 1, "comments": [{"username": "Lynn Kennon Staggs", "comment_text": "Do you have the app Get Your Guide?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205168356548909", "text": "We bought lunch in the museum and Sistine Chapel tickets for September. Do we need ‘skip the line’ tickets too? Or anything else?", "link": "facebook.com/groups/1373361046396315/permalink/2205168356548909/", "likes": 0, "comments": [{"username": "Liz Del Signore", "comment_text": "Your ticket purchase should stipulate where you are meeting your guide or you just walk up to the entrance with your tickets. The worst of the line up is for purchasing the tickets."}, {"username": "Jay Parekh", "comment_text": "Skip the line is for tickets but doesn’t skip the security lines which can be long."}]}, {"id": "2205088493223562", "text": "Verona 🤎🤎🤎", "link": "facebook.com/groups/1373361046396315/permalink/2205088493223562/", "likes": 48, "comments": [{"username": "Jennifer Erdman", "comment_text": "So looking forward to visiting Verona!"}]}, {"id": "2205097109889367", "text": "Please, any recommendations for any resorts in Puglia or the surrounding areas that are close to the sea and have activities or areas for children?", "link": "facebook.com/groups/1373361046396315/permalink/2205097109889367/", "likes": 1, "comments": [{"username": "Rossella Montanaro", "comment_text": "Dipende da dove ti trovi, se vai dalle parti di Torre canne (Fasano) c'è lo \"zoosafari\" a Fasano e oltre gli animali è un parco divertimenti. Torrecanne è vicino a Monopoli, Polignano a mare..Sempre da quelle parti c'è \"Acquapark Egnazia\" con scivoli, piscine.. Poi a Castellana grotte c'è il\" Parco dei dinosauri \".Anche ad Alberobello c'è un Acquapark."}]}, {"id": "2205123703220041", "text": "Hi! We are traveling to Italy at the end of August. Would like to take a day trip to Cinque Terre. Any recommendations of tour companies or self guided tour ideas? Do we need to book a tour or is it easy to explore on your own?", "link": "facebook.com/groups/1373361046396315/permalink/2205123703220041/", "likes": 0, "comments": [{"username": "Deborah Dacher", "comment_text": "So easy to explore on your own. Just get the train pass and you’re good to go"}, {"username": "Lynn Kennon Staggs", "comment_text": "We will be in Florence for three days, looked at a tour through the app GetYourGuide to Cinque Terre. They pick up in Florence and transport you to Cinque Terre. It’s 13 hours and hope I can hold out for that long."}, {"username": "Kim Anne", "comment_text": "https://\nwww.ourescapecla\nuse.com/\none-day-in-cinqu\ne-terre-itinera\nry/\nWe took the first train from Florence and the last train back. This was in March so not as busy or as hot as August will be."}]}, {"id": "2205171616548583", "text": "Hello everyone,\n\nWe have bought train tickets in advanced and received pdf copies of the tickets via email. How do we validate these print-outs at the train station? Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2205171616548583/", "likes": 16, "comments": [{"username": "Lynn Kennon Staggs", "comment_text": "I read a article about validating bus tickets at the bus station with a yellow colored terminal. It said if you got on the bus without being validated you would be removed. That sounds awful. Maybe the train tickets are similar.."}, {"username": "Liz Anne", "comment_text": "Online tickets do not need valdation."}, {"username": "Carlotta Crespi", "comment_text": "If your tickets have day and time of departure stamped on then you do not need to validate them."}, {"username": "K M Uí Fhionnaláin", "comment_text": "Online tickets do not need to be validated"}, {"username": "Krystal Sullivan", "comment_text": "When you board the train, someone will come around and scan the QR code/bar code that is on the ticket."}, {"username": "Elisa Bernstein Wolfe", "comment_text": "We had two train rides prebooked. One printout clearly said this is your ticket and the other clearly said that we needed to get the actual ticket at the train station the day of travel. Yours doesn’t say either?"}, {"username": "Amanda Bellamy", "comment_text": "No need to validate it. I used mine today with no problems. It was checked on the train"}, {"username": "Victoria Moorhead Murrow", "comment_text": "Take a screenshot of each passengers barcode from the confirmation email. You may not have internet service on the train when you need it."}, {"username": "Miyuki Kanno Paul", "comment_text": "A conductor will scan yours onboard"}, {"username": "Gillian O'Callaghan", "comment_text": "No need. You only need to validate tickets bought at the station on the day. You don't need printed tickets either. Just use the QR code on your phone. PS just did 13 trips and tickets only checked twice."}, {"username": "Claudia Caravedo Arroyo", "comment_text": "We just used ours just showing the QR pdf. They have their iPads to check."}, {"username": "Ibbu Mohd", "comment_text": "Show your pdf copies to train conductor, they will scan qr code"}, {"username": "Lori Sammons", "comment_text": "Is there a place where you can put your luggage?"}, {"username": "Gerson Mendez", "comment_text": "No need to validate these tickets. Only the ones bought at the station"}, {"username": "Iris Garza", "comment_text": "Just make sure to have your QR codes (print or on phone) ready when the train leaves the station. Train employees will walk through every train carriage at the beginning of every train stop scanning your ticket/\nbarcode. You only have to do it once."}, {"username": "Rebecca Yeoh", "comment_text": "Print them out, you scan the QR code to get onto the platform where there are gates (not all stations have gates) and then inspectors will check it again once seated on the train."}, {"username": "Sandy Michelle Duggan", "comment_text": "online don't need validating. just show the conductor a screen shot of barcodes."}, {"username": "Diane Langlois", "comment_text": "Since your name is on it, no validation necessary. You have to keep it with you while traveling in case of inspection."}, {"username": "Mohor Chakraborty", "comment_text": "No validation needed"}, {"username": "Ryan Shearer", "comment_text": "Just print them out or save on your phone. Conductor will scan the QR code once you are on. No need to validate."}, {"username": "Heather Stokes", "comment_text": "Don't need to validate online tickets."}]}, {"id": "2205172316548513", "text": "Hello all, I have a question regarding storing luggage. We have a scheduled tour of St Peter's Basilica at 7:30 am to 9:00 am and after the tour we are headed to the train station to go to Pompeii. To maximize our time and walking, we do not plan to go back to our hotel after the tour. My question is about luggage. We will have one carry on perआणखी person (6 people). I downloaded the bounce app for luggage storage and none of the locations near the basilica open before 9. We would need to store our bags at 7 am. The train station is too far to travel to store them. Does anyone have any thoughts on this? Can we store them somewhere within the basilica or elsewhere nearby?", "link": "facebook.com/groups/1373361046396315/permalink/2205172316548513/", "likes": 2, "comments": [{"username": "Lynn Kennon Staggs", "comment_text": "You have probably already thought of this, but if your hotel is close by, could you store them there?"}, {"username": "Phil Murphy", "comment_text": "https://\nwww.stowyourbags\n.com/en/shop/\nrome/\nluggage-storage-\nvatican-st-pete\nr/ 7am-11pm"}]}, {"id": "2205174529881625", "text": "Best Travel Sceduling App? Wanderlog or a better one?", "link": "facebook.com/groups/1373361046396315/permalink/2205174529881625/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Notebook and pencil"}, {"username": "Penny Bellofatto Westberry", "comment_text": "I use Tripit"}, {"username": "Jennifer Walp Rydholm", "comment_text": "I use visit a city, free and may or be as comprehensive as others but it helps me plan where I am going and when. Tickets etc I print to have a hard copy and I keep electronic in a folder on my phone."}, {"username": "Aaron Peterson", "comment_text": "Tripit"}, {"username": "Michelle Coffey Crawford", "comment_text": "Love Wanderlog. I also paid for a small upgrade to attach all documents like hotels, excursions, restaurants and directions, train tickets etc. Also added a bit of history to each place we are visiting and shared with all family members electronically so everyone can view it."}]}, {"id": "2205175113214900", "text": "Our 5 nights on the Amalfi coast did not disappoint it was above and beyond expectations but was so happy we chose the quiter Praiano as our base .Was so lucky to find an air b and b with the most fabulous views and most beautiful host. We were greeted with fresh fruit and tomatoes from her garden and prosecco ❤ and during our stay found eggs from her hens left at our front door.\n...In hindsight should have got a transfer from naples and then hired car later as we left car in garage for our stay as there is no way to describe the traffic..My partner did a fabulous job driving there (he has driven all over Europe) but once we arrived said that's it no more driving here 🤣\n...weather was fabulous low 30s\n...visited Amalfi and Positano and Minori via bus and ferries ...Praiano doesn't have ferry access but we found easy enough to jump on bus and then get ferries from other towns\n...Amalfi and Positani great to visit but so busy so was nice to go back to quieter and much cheaper Praiano\n...Did a fabulous trip through Viator 8 person boat trip to blu grotto . Capri and then swimming on way back ..was via sorrento (we got a private transfer as had to be there by 7.45) we were so lucky as blu grotto had been closed 3 days prior due to tides /weather conditions . Capri was nice to visit but so expensive as expected .\n...Found hospitality fabulous ...we went back twice to restaurant near our acvomodation (recommended by our host ) as loved it so much ( Kasai)and a bar with best cocktails ( Mirante bar ) ..both places service was so good and on our return they both said welcome back\n...Views in Prairiano were so amazing and our accommodation was so much cheaper then the main tourist towns .We were surrounded by locals with beautuful vegie gardens and roosters that woke us each morning 🤣\n...Sorrento we only saw briefly when took boat trip from there but one place I want to see more of . It looked gorgeous\n...as said nothing can prepare you for the traffic we were on a bus that a car hit there was much swearing and hand waving by bus driver and traffic attendant...I asked our private transfer driver now often are there accidents ...every day was his response\n...it was lovely to have 5 nights in one spot we had some busy days but then some relaxing ones too ..I find you really lose a day moving from place to place and can be quite exhausting but we are lucky enough to have the time to do this with length of our stay..we have three 5 night stays just to break up all the moving around .\nNow on to something completely different Matera 😊", "link": "facebook.com/groups/1373361046396315/permalink/2205175113214900/", "likes": 89, "comments": [{"username": "Renee Bruno-Arias", "comment_text": "Beautiful pictures, thank you for sharing 😊"}, {"username": "Sinem YS", "comment_text": "Magnifique"}, {"username": "Katie White-Meade", "comment_text": "Thank you.\nI have been trying to explain to my son that you can’t enjoy yourself if you’re moving around every single day. Need to stay in one spot for several days. It is hot in, Summer. This is exactly how I will be seeing, Italy."}, {"username": "Pirkko Storer", "comment_text": "Thank you for sharing!!"}, {"username": "Evie Gee", "comment_text": "Looks magical!"}, {"username": "Janice Nugent", "comment_text": "Beautiful!!!"}, {"username": "Concetta Geraci", "comment_text": "Great pictures!!\nThank you for sharing!!"}, {"username": "Jayne Geaney", "comment_text": "Looks amazing"}, {"username": "Nancy Day", "comment_text": "Great pics ,how big was your airbnb and name of host,if they have another place .We (3 senior ladies) going in Spring 3-4wks"}, {"username": "Gay Polt", "comment_text": "Thank you for sharing. We have an Airbnb booked in Praiano next May and I was hoping this was a good idea. But the house, view and hostess had the best reviews. We are staying 10 nights. Time to see the area, and soak it up. I don’t want to try to see all of Italy. Hopefully we’ll go back and spend 2 weeks in Tuscany some day.\nWe want to get transfers to and from the airport. Do you feel like a driver one day is a good idea? Or a boat tour? Or are the publisher ferries just fine?"}, {"username": "Nicole Buchanan", "comment_text": "Wow looks so amazing and beautiful"}, {"username": "Maria Rizzuto Campanella", "comment_text": "What airbnb did you stay at? Looks so beautiful"}, {"username": "Maria Rizzuto Campanella", "comment_text": "Lucas Campanella"}, {"username": "Phuong Nguyen", "comment_text": "Thank you for sharing such wonderful photos and tracking tip . It look so awesome and seems you both had a wonderful time . Love Italy"}, {"username": "Kelley Koboldt", "comment_text": "Thank you for sharing your lovely photos. I’ll be in Amalfi in October for 3 days- staying in Sorrento. You’ve given me some nice ideas of things to do"}, {"username": "Virginia Sudol", "comment_text": "Loved your trip! We’ve also stayed in Praiano and couldn’t agree more! We loved it! 👍😊💞"}, {"username": "Vikki Hudson", "comment_text": "I’ll be there in two weeks I booked a bus tour of Positano, Amalfi, ravello. I’m thinking the bus is going to be annoying with traffic. I don’t want to waste our whole tour on a bus in traffic and less time in the towns. How were the ferries or local buses big lines?"}, {"username": "Michelle Cotoni", "comment_text": "Can you share the link to the air bnb?"}, {"username": "Jenny Meffert", "comment_text": "Looks fabulous. Can you advise name/link for bnb. Thankyou."}, {"username": "Patty Barnes", "comment_text": "Thank you for sharing!!!\nAbsolutely beautiful!"}, {"username": "Xiomara Servellon", "comment_text": "Thanks for sharing 👏😀💕"}, {"username": "Adam Wilmot", "comment_text": "Jocelyn Wilmot ☀️"}, {"username": "Lorraine Page", "comment_text": "Absolutely gorgeous!!! Thank you for sharing your tips & suggestions 💕💕"}, {"username": "Tracey Watt", "comment_text": "Wonderful photos, we stayed in Praiano last year on honeymoon and it was amazing. We stayed at the hotel Tramonto D’Oro which was pretty much next door to the church with the bell 🔔😂. We braved it and hired a moped (hubby is a biker) and had the best day riding the coast !! Not for the faint hearted 🫣."}, {"username": "Paola Quevedo", "comment_text": "Can you please share airbnb info! You can private message me."}, {"username": "Kathleen Wells Erickson", "comment_text": "Kathleen Wells Erickson"}, {"username": "Anne Maree Wallett", "comment_text": "Great photos"}, {"username": "Coreen McGuire", "comment_text": "Thank you for sharing ❤️"}, {"username": "Dick Moss", "comment_text": "Wow wow wow 👌"}]}, {"id": "2204717563260655", "text": "Hello! So.. we are beginning to plan a week trip to Venice, with a day trip to Rome. Just two adults..In possibly 2 years or so. We've never been out of the US, basically not far at all lol\nWe need all the tips and ideas please! Thank you!!\n\nEta... ok so totally understand a day trip to Rome isn't possible lol", "link": "facebook.com/groups/1373361046396315/permalink/2204717563260655/", "likes": 6, "comments": [{"username": "Tari Lawson", "comment_text": "A day trip to Rome is not enough. Consider dividing your time and doing 3 days in Venice and 4 days in Rome."}, {"username": "Vanessa Durkin", "comment_text": "Nred extea day in rome book hotels through booking.com some of these you can pay when you arrive rather than before trains in italy are brilliant as is the bus system very cheap to get around have a great trip"}, {"username": "Clelia Minucci", "comment_text": "Rome is 6 hours away from venice."}, {"username": "Toni Marie", "comment_text": "Yes just got back and there’s alot to see in rome"}, {"username": "Alice Francesca", "comment_text": "Split in half.Half Venice, half Rome.\nAnd remember there is so much more to see in Italy than Churches! Theaters, palaces, centuries old gardens, contemporary art museums!"}, {"username": "JeriLynne Clifford", "comment_text": "I haven’t been to either city but the big travel tip I will give you is to fly into Milan or Rome. Try to make it so you don’t fly through another European city. We fly Delta through JFK or Atlanta to Milan.\nAlso, if you can afford it get the better seats. Not first class but the plus, premium, whatever they call them.\nThe extra room overnight is worth it.\nAlso, when you arrive keep moving! Drop your luggage and do some walking around to get acclimated. Eat an early dinner then go to bed. Helps with the jet lag.\nFinally, try to do carry on only. Luggage being lost stinks. Bring a duffel bag in your carry-on so when you make purchases you can put them in either your carry-on or your duffel. I end up checking both bags on the way back since I’m going home. This is one reason I suggest Delta is for the space. A lot of European brand airlines have smaller bag requirements.\nOther than that, I suggest you build in time to relax and explore. When people go to Italy, for the first time, they try to go due to many things. Have fun planning!"}, {"username": "Tracy Piko Lawniczak", "comment_text": "We just did the trail from Venice to Rome and it was 4 hours. You won’t be able to see everything in a day or just 2 days in Rome.\n\nHighly suggest your must sees for Italy. What is it you want to see in Rome ? What is it you want to see in Venice ?"}, {"username": "Gina Rovello Keenan", "comment_text": "One day in Rome is not nearly enough time. If you have one week, I would suggest 3 nights in Venice and 4 nights in Rome. The train system is amazing. Make sure you have a current passport. Be sure to get travel insurance. Wear the most comfortable shoes you own. You will do a lot of walking. When looking into flights I prefer direct only. Follow this group for lots of ideas!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "You cannot do Rome as a day trip from Venice. It’s almost four hours each way on the high-speed train."}, {"username": "Heather Ann Maddalone", "comment_text": "OK so I was looking at what flights would be. Could we do round trip flights flying in to say Venice and flying out of Rome?"}, {"username": "Rachael Richardson", "comment_text": "Too far for a day trip ! Could not do a week in Venice - split it"}, {"username": "Carol Taylor Tisdale", "comment_text": "One day in Rome would result in complete frustration. If that's all you can give it - I'd skip it until you can devote no less than 3 full days there. Trust me. 🙂"}, {"username": "Heather Ann Maddalone", "comment_text": "OK so looks like we'll try to split it. So an Italy trip has always been on my bucket list. Grew up with my mama's Italian family in Chicago. Hubby wants to see Rome and I want Venice lol"}, {"username": "Deborah Schroeder", "comment_text": "You have plenty of time to research what it is you want to see. Everyone has different points of views. Get Rick Steves book on Italy and look at his videos, look at Rome2Rio for travel info and use ProWalks tours on YouTube for ideas. Add in travel times and look at arriving in one city and leaving from another. Get a passport and work out a budget. Basically, do your homework and decide what is perfect for you. I just saw where you added more information and I now see about Rome and Venice. If you are coming from the US, get a direct flight either from where you live or connect in another city for a direct flight to Italy. I would land in Rome and leave from Venice. Why you ask. Rome is amazing chaos and Venice is calm and relaxing. Good place to wind down."}, {"username": "Charleen Siegler Schuss", "comment_text": "Why bother going to Rome at all? What attracts you to Italy? Architecture, history, food, people, shopping, practicing a new language, observing how other folks solve daily living issues, checking of things on a bucket list or something else? A tour let's you cover the most ground in a limited time. Your job is to be packed and ready at eight and everything is taken of. You miss out on finding a little family restaurant, getting lost and a Nona giving you directions and maybe even walking you to your destination. Venice is spectacular but very small and 2 days is enough for your first time. Rome has so many more things to see and experience."}, {"username": "Rose Anderson", "comment_text": "All good thoughts here- I encourage you to avoid summer because the heat can be oppressive and can limit your ability or at least enjoyment in walking around etc."}, {"username": "Rose Anderson", "comment_text": "I also suggest exercise before you go- travel is more rigorous than you might expect\nAnd be sure you have international calling on your phone- just being able to use gps and look up schedules and other info is a lifesaver"}, {"username": "Mary Gregory", "comment_text": "Use a travel agent 👍🏻😉"}, {"username": "Heather Ann Maddalone", "comment_text": "OK ya'll. I'm going to split the trip. I get that a day trip isn't possible and see everything lol That's the point of making this post. I'm clueless but I have plenty of time to figure it out. 🤩🤩"}, {"username": "Kit Nader", "comment_text": "I would have a night in Rome maybe 2. But Venice is a wonderful idea for the rest of your time. You'll love love it. I know it quite well now...im going back in octoner for the 4th time this year from england. Fly in to marco polo airport...from there you can go to the airport dock and jump in a water taxi ...its expensive but you will arrive like movie stars and be at your hotel in half an hour. So easy. It's about 150 euros...if you pick a hotel with its own dock the taxi can drop you right at the door. I'll recommend hotel columbina...I stayed there last November...its a nice pretty boutique hotel with a lift a/c ...its own dock ..24/7 desk ...good staff and if you pick a room facing the canal you'll be able to see the bridge of Sighs from your window. It's also 2 minutes from San marco Square... the best part of venice. From the airport you can also get a water bus that will take you to a main bus stop nearish your hotel. Or out the front of the airport you can catch a road bus to take you into venice for 10 euro......so something to suit all pockets.\nVenice is a place to absorb ...not to be rushed. Its unique. No cars ... and its small ... you can walk all of it. And you can get lost ( everyone does) ...and its fine to get lost. At night st marco Square is fabulous ... the lights... the orchestras playing. Its heaven. Just absorb all that history. The beauty of the grand canal ...the buildings!! And it's so safe ....you can wander late into the night and you won't feel uncomfortable at all. Obviously in crowded areas always make sure you keep your valuables safe ...but that's the same in any city. The station is easy to get to ...everything in venice is central ...from there you could travel to Rome...which I think is about 4 hours? Florence is closer and very pretty 2ish hours away. What ever you do you will adore it! If you want to ask more please feel free to message me. X"}, {"username": "Lucrezia Folger", "comment_text": "A 1-day trip to Rome is a total waste. How about 4-5 in Rome and 2-3 in Venice. Seriously, there's no point in going."}, {"username": "Renee Rundle Stoneham", "comment_text": "Split your time between the 2.\nFly into Venice and out of Rome.\n3 nights in Venice\n4 nights in Rome."}, {"username": "Miyuki Kanno Paul", "comment_text": "Fly into Venezia and fly out of Roma(or vise versa) if you want to hit both"}, {"username": "Eileen Muro", "comment_text": "We booked our trip in December of 2022 for July 2023. We just came back. For 6 months we did tons of research. I highly recommend YouTube blogs. Just start searching trips to Italy, tips for traveling to Italy, search tips to the specific areas you want to visit. We also searched \"how to use trains in Italy\". There is alot of useful blogs on Youtube!!"}, {"username": "Kat Morse", "comment_text": "We did a day trip to Rome. Booked colosseum tour am and then Vatican tour pm private through Viator."}, {"username": "Doug Burke", "comment_text": "I realize time is precious and we all have other obligations but I'd seriously consider adding some days to the trip. With all the effort getting there and back, there's not a whole lot of difference between 7 days and say, 10 days. It's basically 3 hotel nights. And it would add so much more to the trip. There's a HUGE cost/benefit plus there."}, {"username": "Suzanne Mills", "comment_text": "Rome is not a day trip, way to early to plan."}]}, {"id": "2205178486547896", "text": "Looking for a half day sailing experience for 6 adults on Lake Como. We are staying in Varenna and was hoping to sail from there instead of having to go to Lecco to board the sailboat. Your recommendations are greatly appreciated! TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2205178486547896/", "likes": 0, "comments": []}, {"id": "2205178899881188", "text": "Today we took the Circumvesuviana from Sorrento to Pompeii and it was so easy. I was expecting a nightmare involving pickpockets and hoodlums. In fact, I think I even read someone’s post stating that they had chickens at their feet! If you’re from the Northeast US this train is a typical “metro” ride in DC or the ￼T in Boston. In fact I probablyआणखी felt safer in Italy as I haven’t worried about a shooting during my trip in Italy. It was 90% tourists and I enjoyed chatting with people from around the globe, sharing restaurant recommendations etc. The worse part was having to stand on the way back to Sorrento midday when it was busy. Don’t waste all of your money on private transfers!", "link": "facebook.com/groups/1373361046396315/permalink/2205178899881188/", "likes": 52, "comments": [{"username": "Jeff McLellan", "comment_text": "Some people prefer the comfort of a private transfer with AC it isn’t always just about saving money especially after three hours walking around Pompeii in the sun."}, {"username": "Dana Talusani", "comment_text": "I think it's lovely that you had such a good experience and got to talk to fellow travelers!"}, {"username": "Donna Kate", "comment_text": "We will be doing this in a couple of weeks. Kids will love traveling on train in another country"}, {"username": "Donna Kate", "comment_text": "Quick question Does the same train go to Herculaneum too?"}, {"username": "Pat Cray", "comment_text": "Agree"}, {"username": "Michelle Knoll", "comment_text": "We did that too and loved it!"}, {"username": "Joanne Diaz", "comment_text": "We did the same thing it was fine 😁"}, {"username": "Sara Joanne Bedford", "comment_text": "Agreed we did the same trip a few years ago with 2 young children Sorrento - Herculaneum- Pompeii - Sorrento. Absolutely fine and a great way to see a bit more of the area and do as the locals do 👍"}, {"username": "Renee Rundle Stoneham", "comment_text": "👏🏻👏🏻\nWe used the circumvesuviana\nseveral times with 0 issues!\nFrom Napoli station to Sorrento & back.\nPompeii etc…\n\nEasy and cheap… like 5€\n\nWe did have to stand on our first trip from Naploi as it was late afternoon and most people were going home from work. We just stood at the back of the car with our suitcases out of the way.\n\nVery much like NYC subway or other major city transit. Piccadilly line in London etc…"}, {"username": "Gabriella Villasenor", "comment_text": "same! on the way back no A/C but other than that it was fine"}, {"username": "Daisy Yoo", "comment_text": "this is the method we will be using ty for confirming that"}, {"username": "Shirley Lewis", "comment_text": "this train is great and certainly an adventure but do NOT underestimate the pick pockets on this train, they are rife! I've ridden it many times and even being aware my husband lost his wallet on one trip"}, {"username": "Alisa Leeds Rotundo Baker", "comment_text": "Thanks so much for sharing! Is there any luggage space? We expect to have a couple of carry-on size suitcases. ￼ ￼"}, {"username": "Carmen Zervigon Everett", "comment_text": "Very true. I would take on pickpockets in Italy any day over the endless gun attacks here."}, {"username": "Fiona Mac", "comment_text": "Totally agree great service we were the same on our visit there in June"}]}, {"id": "2205094266556318", "text": "Goodmorning! How would I get to Tuscany Airbnb or hotel from Venice by train ? Would love to make that our vacation for a few days before going to Rome but I’m confused how I’d do it without a car. I’d like to spend Tuscany enjoying the property and visiting wineries.", "link": "facebook.com/groups/1373361046396315/permalink/2205094266556318/", "likes": 3, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Depends on where in Tuscany your AirBnB is. You could take a train and then you might need a taxi."}, {"username": "Alice Francesca", "comment_text": "In Tuscany you will need a car to get around abd reach agriturismo or wine tasting place"}, {"username": "Steve Grossman", "comment_text": "Tuscany is one of the few places in italy, where you absolutely need a car if you want to see lots of towns. And there are many many interesting towns in tuscany."}, {"username": "Glenn Todd Webb", "comment_text": "Tuscany isn’t a specific destination like Venice or Florence. Depends on the city. Consult rail schedule. If you are traveling around within Tuscany, rent a car, make a base in Florence."}, {"username": "Carlotta Crespi", "comment_text": "Tuscany is a region, not a town, like Venice or Florence... depending on the area you want to visit you should make a base in Florence or Arezzo or Grosseto and rent a car from there to move around.."}, {"username": "Ryan Monahan", "comment_text": "Rent a car. Otherwise you’ll need to do a tour of some sort."}, {"username": "Danielle Withrow", "comment_text": "If you truly don't want to rent a car, you can visit several Tuscan towns by train or by small van tours. Next year, I'm taking the train from Venice to Florence, then on to the Tuscan town of Lucca by train for an art workshop. Sometimes if the train station in a small Tuscan town is several kilometers from the town center - taking a bus is better (I'm traveling by bus to visit Siena). Also if you station yourself in Florence for a couple of days, there are small van tours to the Tuscan countryside for wineries or cooking classes. This past May I took a day-long cooking class at a hilltop village outside of Florence. The host met us at the Florence train station for the 20 minute train ride then picked us up by van to the villa. Fabulous day with hosts Luca and Lorenzo! (lovexfood. com). I'm just not into renting cars."}, {"username": "Jeanne Eliason", "comment_text": "We go to Tuscany 2 times a year. Never rent a car. Land in Firenze. Take regional train to Sinalunga where we stay. Then walk a short distance to station. We go to Siena, Orvieto, Chuisi, Arezzo and Poppi. Our host takes us to Montepulciano. It's lovely. We have also traveled from Firenze to Lucca. From Lucca there are many places the regional trains go. Want more info. Message me."}, {"username": "Paul Davis", "comment_text": "You can see the train line in this photo of mostly southern Tuscany. Not all stations are shown."}, {"username": "Pao Magnoler", "comment_text": "You can get by train to Florence and then book a car or go to the bus station and ask for the one that would take you there. Is really easy."}, {"username": "Barbara Bastianini", "comment_text": "It depends where in Tuscany your hotel is located. Tuscany is a whole area with lots of different cities, towns and villages. Some places are well connected by train others are not. So it’s impossible to give accurate info without knowing the destination. Generally speaking, I’d say a big city like Florence could be eadily reached by train but small villages might not be, so a car could be necessary for those and driving in Tuscany is fairly easy."}]}, {"id": "2205104923221919", "text": "Good morning!\nI have been planning on going to Italy for a girls trip for my 40th birthday since I was about 20, that is now only 3 years away! I joined this group because this year I planned on as my gathering information year, next year creating an itinerary and having those that have said they are coming truly commit.\nI planned on actuallyआणखी booking things around spring/summer 2025, the trip taking place spring/summer 2026. I am planning on 3-4 destinations, a total of about 3 weeks .\nReading some of these posts is making me think maybe booking a year in advance is too far. Thoughts?\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2205104923221919/", "likes": 4, "comments": [{"username": "Starla Dawn", "comment_text": "I went for my 40th birthday June this year.\nI decided to go and planned an intricate epic trip in May this year.\n\nIt was awesome!\nAnd everything worked out perfectly."}, {"username": "Lucrezia Folger", "comment_text": "Your idea to book is too far in advance. Anything can happen in the next 3 years!! Wait until your a year out. You could start learning basic Italian now."}, {"username": "Bethany Antone Pitcher", "comment_text": "I had read somewhere once to book up to two years in advance! Good to know that is not necessary."}, {"username": "Tracy Piko Lawniczak", "comment_text": "I booked 2 months prior.\n\nBut nothing wrong with securing places to stay etc a year out. Especially if you find something you really like and like the price. I possible would wait to book things like train tickets until closer.\n\nTour tickets few months out to secure date time you want.\n\nJust check the cancel policy on everything. That will be key as far as booking stuff"}, {"username": "Glenn Todd Webb", "comment_text": "In May tickets for last supper we’re sold out until September. In January I couldn’t get any of the hotels I wanted for end of May."}, {"username": "Elizabeth May La Duca", "comment_text": "I like to stay in hostels [www.hostels.com] and monasteries/\nconvents [monasterystays.\ncom or .it]…better to book/reserve at least one year in advance"}, {"username": "Elizabeth May La Duca", "comment_text": "Currently takes a few months to renew passport [used to take a few weeks]"}, {"username": "Elizabeth May La Duca", "comment_text": "Many international travelers are not aware of the 6months minimum requirement for passport expiration date …this applies for most countries, not just USA"}, {"username": "JeriLynne Clifford", "comment_text": "I always start planning my trips a year out. Putting together information for a few years before is great! I have a note on my phone where I put what I want to do/see.\n\nIf I can highly suggest a few things, take them for what they are, but thought it might be helpful to keep in mind. Try and fly into one of the major airports being Milan or Rome spend a day or two in that city, then take the train to other cities. Also consider flights that do not have stops in Europe. That can be added stress, trying to make connections while going through immigration. We fly Delta from Austin through JFK or Atlanta directly to Milan.\n\nOutside of the first stop, we have a rule of a minimum of three days in each location. Bouncing all over the place and wasting all that time traveling between places is something we don’t care for. Don’t try to see the whole country in one trip maybe the second part for your 45th!\n\nIf you can do, carry-on, only do it. Lost luggage is no joke. We always pack an extra duffel bag to put our clothes in and purchases go into our carry-on and then we checked both for the way home.\n\nHave fun planning!"}, {"username": "Alice Francesca", "comment_text": "Whatever you decide, DO NOT COME IN AUGUST.it s peak tourist season and it can get pretty frustrating and hot."}, {"username": "Amy Stevens", "comment_text": "My mother said this........ I started ours a year out. It meant accommodation was cheapest. You can't of course book trains but you can see the timetable to get an idea for your travel arrangements."}, {"username": "Bea Kuckens", "comment_text": "We book flights about 10 months out, then determine an itinerary. Once that is set, we book lodging about 8 months out (some AirBnB's offer an \"early bird\" discount). Trains can't be booked as far out, but we watch the schedules and book when available (the farther out you book the more you will save). Excursions, theatre tickets, whatever extras are last, but still ASAP. If you go before Easter it will be a lot less crowed (and less expensive)."}, {"username": "Tara Roed", "comment_text": "Booked flights in October for end of June. Hotels and Airbnb I think around December. We spent some time In amalfi coast and since the towns are small hotels book. I booked those hotels early with the throughly that I could change them later if I wanted. I same with Airbnb. It worked out that I didn’t change anything. As long as rooms can be changed why not. Helps to begin the itinerary since you will know where you will be when. I even booked a cooking class in February For beginning of July in Positano….it’s popular and books up"}]}, {"id": "2205104053222006", "text": "Anyone recommend a good bike tour around Rome ?", "link": "facebook.com/groups/1373361046396315/permalink/2205104053222006/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Rome/\nAncient-Appian-W\nay-Tour/\nd511-85309P3?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Ingrid van Til-Akster", "comment_text": "Recommend the via Appia tour\n\nhttps://\nwww.bajabikes.eu\n/en/\nrome-sightseeing\n/"}]}, {"id": "2205087193223692", "text": "I need help going to milan during our 3 weeks in italy. I have googled best place to eat on YouTube and there isn't much. So please I would like to know where to find all the best places to eat. Where the locals eat I don't want touristy restaurants. Please please HELP.", "link": "facebook.com/groups/1373361046396315/permalink/2205087193223692/", "likes": 0, "comments": [{"username": "Merilice Finateri", "comment_text": "A great experience is the Lz Renaissance near Duomo. Go for an aperitivo of supper. 7 floors up. Look for the red door. It's a rooftop bar. There's also a great shop inside."}, {"username": "Veronica Parravicini", "comment_text": "It depends on what you wanna eat!\nMilano has a lot of restaurants, cafe etc to the point its overwhelming and unfortunately the quality it’s not always there😅"}, {"username": "Neaţă Maria", "comment_text": "Look in Brera district. There are some of the best restaurants around."}, {"username": "Lainie Bennett", "comment_text": "Best restaurant in Milan where locals go: Nerino Dieci Trattoria. Delicious homemade food at both lunch and dinner with great service! Be sure to email Ms Oksana in advance to make a booking!\nNerino Dieci Trattoria\n+39 02 3983 1019\n\nhttps://g.co/\nkgs/FoJFeU"}, {"username": "Lucrezia Folger", "comment_text": "Ask someone that lives there where they go when they take their family out. Or walk and discover places along the way on the back streets."}, {"username": "Donna Mangone", "comment_text": "There are places next to the Cathedral."}, {"username": "Donna Mangone", "comment_text": "I had delicious eggplant at a restaurant in Milan."}, {"username": "Ken Lerch", "comment_text": "My suggestion for these sorts of requests, not to criticize, but stop asking for “best” of anything. Be more specific: where to find regional cooking, what are favored wines, looking for wood fired “al forno” dishes, regional/local shellfish, late night drop-in where locals hang out. Like to read, ask for bookstores. Like music, ask about local artists and clubs. Don’t like museums, stop asking which to visit. Know what you seek."}, {"username": "Dana Talusani", "comment_text": "I have found TripAdvisor to be a good reference. You can customize your searches to types of food you are looking for and price point. Good luck and have a great time!"}, {"username": "Ishbel Raffle", "comment_text": "The Navigli area has lots of restaurants by the canal"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Why do you want to go to Milan? Are you into high end fashion?"}, {"username": "Fetchin Gretchen", "comment_text": "Try Google Bard AI and be specific about what you like and one city at a time."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "If you buy Lonely planet city guide has en excellent selection of restaurants, from Michelin’s top ones to really great hidden gems."}, {"username": "Alice Francesca", "comment_text": "Please first of all do your own research about what dishes are considered local in Milan.\nFor instance, NOT PIZZA.\nWe Italians take pride in knowing where to ask for what and if you know that lasagna is from Bologna and you don't ask for it on the Amalfi Coast you will look clever;)"}, {"username": "Rod Fick", "comment_text": "Get Rick Steve’s travel book on Italy.\nProbably answer most your questions."}, {"username": "Rhona OConnor", "comment_text": "Search on Google for restaurants in the area you will be in. Read the reviews. Much better than YouTube."}, {"username": "Irene Oda", "comment_text": "Milan is huge city. You can walk in any direction and will come across restaurants. Are you staying at a hotel? I'm sure the concierge will help with suggestions."}, {"username": "Tess Galinato Perez", "comment_text": "https://\nwww.ristorantere\nplay.it/\nThis is our favorite restaurant near the Duomo. If you go, say 'hi' to Vincenzo. 🙂"}, {"username": "David Silverstone", "comment_text": "Milan is full of great restaurants! Start with the 'Galleria' area near the Duomo. You might regard them at touristy but the food and the experience of eating in such a beautiful place is a must do. We found many more less touristy restaurants as we walked to various museums outside of the city centre."}, {"username": "Richelle Trezise", "comment_text": "Thank you everyone for all your help"}]}, {"id": "2205094493222962", "text": "I have 9/10 days in Italy next month. My partner has never been but doesn't like to move around too much on holiday. I was thinking fly into Naples, spend a couple of days in Sorrento and a couple of days in Positano. Do you recommend anything else while here? I also considered Milan - Lake Como. Does anyone think this would be better?", "link": "facebook.com/groups/1373361046396315/permalink/2205094493222962/", "likes": 0, "comments": [{"username": "Zhallie Obina", "comment_text": "Visit Palermo or Florence.. you will love this 2 cities"}, {"username": "Anita Clayton", "comment_text": "If you don't want to move around, Sorrento is brilliant. You can visit Naples, Pompeii,Hercula\nneum and the Amalfi coast if you want to or just chill in Sorrento. Lake Garda is lovely and Verona is an easy trip."}]}, {"id": "2205101426555602", "text": "Has anyone ever been to Monte Argentario if you have what are your thoughts.", "link": "facebook.com/groups/1373361046396315/permalink/2205101426555602/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Bigger than you think. Accessible from the nature reserve which is the lagoon of Orbetello. Sort of place where low key European royalty holiday unnoticed. Sophisticated and no 'cafoni' welcome."}]}, {"id": "2204442169954861", "text": "Edit: Sorry for posting anonymously, but since I am sharing specific dates, I prefer not so share my identity for safety reasons. Thank you for understanding!\n\nSame day. Too much? Hoping for an easy casual morning after our previous Friday night driving tour (should be a van, I think-which will be good if it’s cold) with Pizza and Gelato. At that time of year, it will be getting dark by 5pm & was hoping the timing of ￼exiting the Vatican tour on Saturday will leave time to view the nativity at St Peters Basicila & head to Piazza Cavour. (I assume we will need a taxi-but I am not seeing this option when I plug in directions in Google Maps) Last Saturday of December… Will this area be swarmed with people making it hard to maneuver and view? We do not want to rush, but we also don’t want to be stuck moving at a snail pace due to inability to actually get around. Rome is our departure city on our way to return home. We are actually planning on staying in Spoleto all of Christmas week & are hoping to visit other parts of Umbria by car or train. (Though I am worried about places being closed the 24-26th) We plan to arrive in Rome on the 29th to catch out flight the 31st. My thoughts were an evening tour for highlights, casual morning, iconic Vatican in the afternoon, something fun and non-strenuous for dinner. Just looking to dip our toe in￼ so we can figure out what interests us most on a potential return trip.", "link": "facebook.com/groups/1373361046396315/permalink/2204442169954861/", "likes": 0, "comments": [{"username": "Alix de Dreuille", "comment_text": "I think you can make it if the cooking class is not too far from the Vatican. The Vatican Museum and the Sixtin Chapel close at 6pm. The church of St Peter is free. You can go there before your visit at the Museum."}, {"username": "Mary Brown", "comment_text": "If this is a class through “Eat and Walk Italy” we just did it and it was fun.\nI booked directly with them on their website. Have fun!"}, {"username": "Cristopher Quinto", "comment_text": "Hello, where did you buy the tickets? There are no more on the official site 😔"}, {"username": "निनावी सहभागी", "comment_text": "Also would love any insight about Spoleto. Grazie!"}, {"username": "निनावी सहभागी", "comment_text": "I suppose this plan looks 👍 I’ve noticed people love to jump all over a post if it is too ambitious or foolish. Getting excited to see Italy decorated for Christmas 👼✝️❄️🎄"}]}, {"id": "2205110416554703", "text": "We have 6 adults and 3 kids unders 2years. Should I use Public transportation in and out vacation places in Italy (Pisa, amalfi coast, Venice) or rent a big car. If big car which one should I take and do we need car seats for kids. Planning to do 5 days trip in Itlay. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2205110416554703/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Pisa and Venice is reachable by train and would potentially be cheaper than a car especially if you book early enough and can take advantage of the family rate for trains where kids are free or 50% off. Amalfi coast is more tricky. You could also hire a van or taxi depending on where you are looking to stay and go otherwise a rental may be easier but driving the Amalfi coast is interesting. 🤗"}, {"username": "Rita Scotto Epifanio", "comment_text": "The issue with a big car is finding parking for the car. Amalfi doesn’t have much parking, and navigating small streets might be hard with a big car. If you do go that route though, you. An ship your car seats with your suitcases for free."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "You would most likely need 2 cars. We are 4 and need large car due to suitcases and 4 adults. Never had problem parking."}, {"username": "Carlotta Crespi", "comment_text": "car seats for kids are compulsory in Italy. Pisa, Amalfi coast and Venice in 5 days, with 3 kids sounds Mission Impossible to me, unless you want to spend 75% of your time driving or sitting on a train. With only 5 days you should consider focussing on one area only."}, {"username": "Michela Zanni", "comment_text": "I think that a van is less expensive and you can stop wherever you need with kids"}, {"username": "Vivien Paulik", "comment_text": "For 9 person you need two car.\nPisa and Venice is with train and walk of course. Amalfi Coast is okay buy car, but the streets are not as big as you used to it if you are form the USA.\nAnd 5 days for that much?"}, {"username": "Joe-Linda Po Agustin", "comment_text": "Train seems to be better option- aside from cost savings, there’s no need for car seats, washroom right there, there’s space for kids to walk around, adults can enjoy ride instead of being on the wheel."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Five days?! No need for cars or car seats. Just stay put in one location. You can not possibly visit even two of these locations in five days."}, {"username": "Megan Leigh", "comment_text": "This is quite a feat. Anything is doable but that sounds like the least enjoyable vacation I could imagine. Lots of travel & lots of chaos and every time you get settled you'll be moving again. 5 days, 9 people including young kids- I would focus on one area. And likely a less crowded area. Maybe Sardinia or the Riveara or Tuscany. But that's just me. Some people would love an itinerary like the one you've mapped out & maybe it will be perfect for you. I'm just not that adventurous, lol. ;)"}, {"username": "Marie Payne", "comment_text": "NO WAY!!!"}, {"username": "Megan Leigh", "comment_text": "OP- have you considered the Puglia region? Much easier to drive in than Amalfi, still gives you plenty of options to move around and have different experiences with lots of water time but also keeps you in one region to maximize your time. Less crowded/\nchaotic as well, as it's only just beginning to get recognition as a hot spot. Several beautiful white-washed towns & lots of history. I desperately want to visit Puglia. Such an incredible & unique area."}, {"username": "Mel Matt", "comment_text": "We’re traveling as a group of 5 and decided to take the train between towns because it was very difficult and expensive to find a car big enough for us and all our luggage. Also I only drive automatic!\nWith a train, you can walk around, change a diaper, sleep…."}, {"username": "Betty Stilt", "comment_text": "With only 5 days. Stay in one location. Genoa, Sorrento and Lucca are good based for side trips."}, {"username": "Dafne Vassetti", "comment_text": "Venice and Pisa train. Then you walk everywhere. If from Pisa you want to visit the rest of Tuscany hire a private driver.\nGet a Train to get to either Naples or Salerno and then have a private driver pick you up from there.\nAnd you really should not be driving on the Amalfi coast, especially with a big car. Again private driver."}]}, {"id": "2205113293221082", "text": "Is there a skip the line tour for the Vatican in the afternoon? We won’t be able to do the early morning tour.\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2205113293221082/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nExclusive-Vatica\nn-Evening-Small\n-Group-Tour/\nd511-6718P25?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Jenn Messina Babore", "comment_text": "Buying tickets in advance is how you “skip the line”. Tickets are available in the afternoon if you can secure them."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205116186554126", "text": "Planning our trip of 4 adults for 2024. Looking at accommodations. Trying to decide between VRBO and hotels. Planning on going to Rome, Florence, Venice and Bologna. Thoughts on hotel vs VRBO? Any recommendations", "link": "facebook.com/groups/1373361046396315/permalink/2205116186554126/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Hotels https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187791-d39647\n72-Reviews-Rome\n_Times_Hotel-Ro\nme_Lazio.html"}, {"username": "Lucrezia Folger", "comment_text": "Days, weeks, months? Time in each place, etc."}, {"username": "Gena Diaco Penland", "comment_text": "We just got back from 14 days in those cities(except Bologna). We have 2 adults and 2 teenagers and did Airbnb’s in all 3. We had great experiences and appreciated the extra space as well as a fridge/washing machine!"}, {"username": "Amy Schmelzle Walsh", "comment_text": "I'm usually a hotel person but did Airbnbs w my college daughter and her friend in Rome, Geneva and Paris- it was nice to have a washing machine and additional space but I was happy when we got to London to be in a nice hotel. If I go back w my husband and friends I would probably lean toward a hotel! If you all love to be together all of the time Airbnb/vrbo will work😊"}, {"username": "Miyuki Kanno Paul", "comment_text": "If all 4 of you can get along well, sharing an apartment is a good idea. But you may feel that you need some privacy besides your own bedroom. Consider regular family-run B&B along with hotels"}, {"username": "Pao Magnoler", "comment_text": "Airbnbs!!"}, {"username": "Stacey Esposito", "comment_text": "Bemate piazza navona if your budget allows 4 bedroom apartment in historic district. Steps from piazza navona, walking distance to trevi fountain st Angel's castle. The apartment was stunning. Washer with drying cycle 4 bedrooms 3 bathrooms living room w Netflix trust me after a day of sweating and seeing amazing things by 9 you ll be begging for some ac and Netflix lol. And taxi stand and supermarket on corner"}]}, {"id": "2205115729887505", "text": "We are going to Atrani and want to also go to Montecalvo Irpino where my husband’s great grand parents are from. Any suggestions on the best way to travel there?", "link": "facebook.com/groups/1373361046396315/permalink/2205115729887505/", "likes": 1, "comments": [{"username": "Philip Curnow", "comment_text": "Car seems the only way, via Salerno to reach the fast road towards Avellino. Did it once many years ago to arrive at Bagnoli Irpino."}]}, {"id": "2205116923220719", "text": "cathedral of milan italy😍", "link": "facebook.com/groups/1373361046396315/permalink/2205116923220719/", "likes": 834, "comments": [{"username": "Shula Hurvitz", "comment_text": "🇮🇹🎯💯🥇🎯✈️🇮🇹🇮🇱"}, {"username": "Yara Karime Vazquez", "comment_text": "Perlita Cabrera"}, {"username": "Savioo Ferrao", "comment_text": "Just awersome ✌️"}, {"username": "Brenda Carter Lancaster", "comment_text": "Wonderful pictures I can hardly wait to see ❤️"}, {"username": "Ryan Roberts", "comment_text": "Sheldon Thomas how beautiful is that cathedral 🤩"}, {"username": "Adytia Putri", "comment_text": "Imelda Yohana Situmorang ke sini kita yah nanti 🥰"}, {"username": "Said Chaiboub", "comment_text": "Amazing 🤩"}, {"username": "Cara Meyler", "comment_text": "Siân PhillipsGali Phillips"}, {"username": "Michelle King", "comment_text": "What Cathedral is this??"}, {"username": "Gali Phillips", "comment_text": "Can’t wait to see it 😃"}, {"username": "Vitya Volkov", "comment_text": "Beautiful buildings are the symbols of a city.😊"}, {"username": "Mark Wakefield", "comment_text": "Great photos... thanks for sharing"}, {"username": "Shaun Fagan", "comment_text": "Deborah Fagan"}, {"username": "Kiralee Philpot Phillips", "comment_text": "Hi lovely photos where are standing with the pillar to your back with the Cathedral in the background please ?"}, {"username": "NaNa Tran", "comment_text": "Very pretty pictures and you look also very beautiful like a Model😍"}, {"username": "Alaa Zaher", "comment_text": "Wow! Amazing!"}, {"username": "Veronica Tame", "comment_text": "So amazing. I love Italy 🇮🇹 ♥️"}, {"username": "Cleo Forrey", "comment_text": "What hotel did you stay in Milan?"}, {"username": "Carmine Del Sordi", "comment_text": "Very nice 👍"}, {"username": "Rikki Golding", "comment_text": "Steve Golding"}, {"username": "Stuart Vogt", "comment_text": "All of the scenery is beautiful!"}, {"username": "Jacqueline Anderson", "comment_text": "Megs Anderson … a must to see!"}, {"username": "Sande Ricci", "comment_text": "Loved Milan! The Cathedral is beautiful in photos and even more beautiful in person."}]}, {"id": "2205117089887369", "text": "There is a place ppl posted in Rome.\nIt was an embroidered place with a lot of cute items", "link": "facebook.com/groups/1373361046396315/permalink/2205117089887369/", "likes": 0, "comments": []}, {"id": "2205117826553962", "text": "Here in Florida I use my American Express card for everything because it collects hotel points. (I haven’t had to pay for a hotel in years!) That being said, will there be a lot of places in Italy that don’t accept an American Express? Or do most places typically take every type of credit card in your experience?￼", "link": "facebook.com/groups/1373361046396315/permalink/2205117826553962/", "likes": 6, "comments": [{"username": "Liz Anne", "comment_text": "Just returned from a 10 day trip to Italy. Only one smaller store turned down Amex."}, {"username": "Heather Sechrist", "comment_text": "We used our chase visa (we use the southwest card) and it was not a problem anywhere."}, {"username": "Carlotta Crespi", "comment_text": "Most places will take it (even Italians use Amex!), especially in touristy areas but better have Mastercard or Visa as a back up."}, {"username": "Stacey Esposito", "comment_text": "Visa was taken everywhere. Amex I only saw a few shops accept it"}, {"username": "Jennifer Stanek", "comment_text": "Everywhere we went took American Express. We were a little surprised after being told they didn’t. Rome airport is covered with American Express advertisements.\nI would bring it next time!"}, {"username": "Kris Beacham", "comment_text": "If you’re in populated areas you’re in good shape.\n\nSome farm town in the middle of nowhere-you’re in trouble."}, {"username": "Heather Nixon", "comment_text": "Most places we went in Italy took Amex. A few didn’t."}, {"username": "Dawn Falsinotti", "comment_text": "Amex is widely accepted."}, {"username": "Ashley Martins", "comment_text": "You will want a back up card that is Visa or Mastercard. Amex is not taken as widely there as it is in states."}, {"username": "Joan Belserene Forcheski", "comment_text": "We just returned from many towns along the Amalfi Coast & AMEX was not taken. Master card, Visa & Cash/euros were accepted. Our hotel didn’t take Amex either."}, {"username": "Mary White", "comment_text": "Even America is starting to back off from Amex. Had it refused several times recently"}, {"username": "JeriLynne Clifford", "comment_text": "Italy is a large country and everyone’s gonna have different experiences. I would bring your American Express along with backup credit cards, and then go from there.\nIn general, I would say, mom and pop places don’t except it because of the fees and larger places might accept it."}, {"username": "Barbara Bastianini", "comment_text": "In my experience AMEX is not widely accepted in Italy but Visa and Mastercard are."}, {"username": "Rochelle Yngks", "comment_text": "Last year, I was able to use Amex in Milan. In Stresa and Trieste - Visa only."}, {"username": "Wendy Spano Bracco", "comment_text": "I also use my Amex Platinum while traveling. After my first trip to Paris and not knowing, I got a backup. The card works in most hotels, high end stores, airports…not all restaurants take the card, I always ask though. If I can’t use it, I either pay cash or use the backup card. However, I prefer to have all my charges in one place."}, {"username": "Patti Porter", "comment_text": "Some won’t. Take another card too…visa or mc"}, {"username": "Angela Marsala-Gaydos", "comment_text": "I bring both AMX and Visa"}, {"username": "Angela Genduso", "comment_text": "American express is key u need cash for tips and street vendors"}, {"username": "Shannon Madison", "comment_text": "I just returned - some places just don’t take it so take both Amex and a visa or Mastercard"}, {"username": "Monica Roman-Fazio", "comment_text": "American Express is horrible in italy use visa or mc where there's no exchange fees I know capital one doesn't have fees. Don't get me wrong American Express is accepted at most places but they were charging exchange fees"}, {"username": "Georgeann Farinacci Greene", "comment_text": "Many places don’t accept AMEX because of the high fees the merchant has to pay. We have a business in the US & no longer accept it. Only MC, Visa or Venmo"}, {"username": "Frances Younger", "comment_text": "Please check to see if your card charges a Foreign Transaction Fee. You may still elect to use it, but at least you are informed first."}, {"username": "Julie Tran", "comment_text": "I live in florida, went to italy a few weeks ago amex is very limited in italy"}, {"username": "Jaime Cleek", "comment_text": "It's very limited."}, {"username": "Carol Taylor Tisdale", "comment_text": "Larger hotels perhaps but we finally quit asking at other places because the answer was no so often."}, {"username": "Tami Frediani", "comment_text": "Just did five weeks in Italy. 26 cities, large and small. We too, have an Amex card that’s linked to a major hotel chain. Didn’t use our Amex the entire time. It’s not taken most places. VI, MC or a debit card with no fees is the way to go."}, {"username": "Patricia Hall", "comment_text": "Yes they're not real big on America Express"}, {"username": "Mary Patzke", "comment_text": "Use it whenever you can, just bring a backup card."}, {"username": "Mike Guluk", "comment_text": "Mike Guluk"}, {"username": "Alla Zats", "comment_text": "Most places do not accept Amex."}, {"username": "Charlie Louise Moore", "comment_text": "I can’t speak for Italy, but I know a lot of places where I live in the UK do not take AMEX so worth taking a back up just incase :)"}, {"username": "Robert Lawshe", "comment_text": "The larger hotels will accept American Express. Most of your smaller merchants will not, the acceptance rate is definitely way way way below what it is here in the US."}, {"username": "Jenn Messina Babore", "comment_text": "AMEX is not widely accepted in Italy. You will want to use a no foreign fee Visa (or MC)."}, {"username": "Dawn Michele Evans-Hall", "comment_text": "In my experience, most places in Italy do not take American Express."}, {"username": "Yvonne Ormson", "comment_text": "Amex has very limited acceptance outside of the US. This is because they charge much higher merchant fees. Best to use visa/\nMasterCard which are accepted almost everywhere."}, {"username": "Andrea Trasferini-Slown", "comment_text": "We had very few problems using our American Express while in Italy. We did find a few smaller places didn't take it, but for the most part we were fine. We used our Gold card as much as we could for dining. We brought a couple of Chase cards for anywhere that didn't take AMEX."}, {"username": "Rodger Cravens", "comment_text": "They call it AMERICAN express for a reason. Lol"}, {"username": "Lisa Valdovinos", "comment_text": "We used Amex for our trip and only a couple of places didn’t take it."}, {"username": "Erin Grosh", "comment_text": "Almost all the small shops had signs saying that AmEx was the one card they didn’t take."}, {"username": "Jenny Frank", "comment_text": "all hotels in italy take amex."}, {"username": "Kim Sobczak Traina", "comment_text": "We couldn’t use Amex in Italy."}, {"username": "Anthony Martini Jr.", "comment_text": "Virtually no amex and zero discover card"}, {"username": "Mike Guluk", "comment_text": "Yes Amex is used at major hotels but smaller hotels and restaurants no."}]}, {"id": "2205119816553763", "text": "Looking for some suggestions for dining. I’m going to Italy for my first time in September and it is a solo trip. I want to treat myself to a solo dinner date with a view in Rome, Florence, and Venice. Any suggestions would be appreciated. BTW I love this group and all the helpful tips I’ve been learning 💕", "link": "facebook.com/groups/1373361046396315/permalink/2205119816553763/", "likes": 5, "comments": [{"username": "Lainie Bennett", "comment_text": "Try https://\nwww.eatwith.com/\nYou go to a dinner party at someone's house in Italy for a homemade authentic meal. All hosts are vetted by the website for safety. Group size varies from 6 to 18. I recommend in Rome: Eatwith Barbara and Federica in Trastevere. Enjoy!"}, {"username": "Mindy Fey Kinser", "comment_text": "I’m sure you’ll get lots of suggestions here. Just wanted to say have the time of your life! Last fall, I spent several days by myself in Rome before being joined by friends for the rest of the trip. Although the group trip was wonderful, my solo time was perhaps the best few days of my life. So relaxing and just magical. ❤️ 🍷"}, {"username": "Rodger Cravens", "comment_text": "The places with views are not usually the best places to eat, they get away with average food, and higher prices, for the views.\n\nThe best places I have eaten in Italy are on side streets and off the beaten path. Attached is my favorite place in Venice..."}, {"username": "Jenny Payne", "comment_text": "The roof top bar for a drink in Rome at the department store La Rinascente is good or look up on google roof top bars 🌻"}, {"username": "Lucrezia Folger", "comment_text": "Some of the best restaurants do not have views. These are mainly for tourists. In Rome, I always return to the Jewish Ghetto for dinner. 17 times so far."}, {"username": "Dixie Kotylak", "comment_text": "Sounds perfect! Excited to hear what others recommend!"}, {"username": "Alice Francesca", "comment_text": "https://\nterrazzaborromin\ni.com/"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Rhinoceros"}, {"username": "Chantal Adams", "comment_text": "The rooftop bar at www.hotelforum.\ncom is amazing and no reservation required only for the restaurant."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Go for a drink with a view. The best food in Italy is usually a small Osteria without a view. Lots of hotels have rooftop bars with great views."}]}, {"id": "2205119336553811", "text": "We are staying 3 nights in Maiori - the have another 3 nights before flying home from naples. Is it worth spending the other 3 nights in or near sorrento or is there somewhere else we should visit thanks", "link": "facebook.com/groups/1373361046396315/permalink/2205119336553811/", "likes": 2, "comments": [{"username": "Gillian Docherty", "comment_text": "Should mention we are public transport so would need to be somewhere easily accessible by ferry, bus, train thanks"}, {"username": "Rachael Richardson", "comment_text": "I loved sorrento and that area plenty to do"}, {"username": "Viktoria Gulnik", "comment_text": "Restaurant Casa Mandina is a must."}, {"username": "Kally Trahearn", "comment_text": "Sorrento is lovely. From there, you can pop to Pompeii or Capri or just hang out in Sorrento town. There's nothing special to see there, but a lovely place all the same. It's one of my favourite places in Italy - been there a couple of times already and booked to go again.\n\nFrom Maiori, I think you would have to get a bus to Amalfi, where you can pick up another bus (or ferry) to take you to Sorrento.\n\nThere's a cute little train that you can take, which takes you on a tour around Sorrento, including the harbour. https://\nwww.sorrentotrai\nntour.com/en/\n\nSorrento has it's own train station, so ideal for getting you back to the airport in Naples, if you have time."}, {"username": "Starla Dawn", "comment_text": "Sorrento with a day trip to Amalfi coast, (Positano & Ravello)\nHighly recommend a private driver for the experience."}, {"username": "Donna Russonello Merlino", "comment_text": "Sorrento is great."}, {"username": "Carole Tarlap", "comment_text": "I would stay 2 days in Sorrento and the last day in Naples. See a little AND no rush to the airport.🤷"}, {"username": "Pat Cray", "comment_text": "Sorrento is a must!!\nSo beautiful!!!"}, {"username": "Andrew Mircovich", "comment_text": "Stay in Sorrento . It is the best !"}, {"username": "Liz Del Signore", "comment_text": "Sorrento for sure. Naples for a day and evening. There are many places to see Caravaggio paintings, as he lived there for a while in later years."}]}, {"id": "2204824289916649", "text": "We're debating between visiting either the last week in March (holy week) or the beginning of June.\n\nAny input on those timeframes?\n\nEdit: We don't have an itinerary yet, but definitely plan the Amalfi coast, Rome and Florence. Possibly Cinque Terre as well.", "link": "facebook.com/groups/1373361046396315/permalink/2204824289916649/", "likes": 0, "comments": [{"username": "Ville Lignell", "comment_text": "Where would you visit? Rome might be busy due to the Easter week, but generally speaking in March many cities have fewer tourists than in early June."}]}, {"id": "2205120356553709", "text": "Hi everyone! I have an iPad Air 5 with cellular option that I was going to use for data and hotspot. Airalo esim supports it but there a lot of negative reviews (I.e.stopped working, unable to reach customer service, etc). While I understand it can happen with anyone and anywhere I’m concerned as I need to stay in touch with my family and changing the number is not an option for me :(( . Any ideas and suggestions are greatly appreciated!!! TIA", "link": "facebook.com/groups/1373361046396315/permalink/2205120356553709/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "I had no issues with Airalo other than it being a data only plan. You would need to use WhatsApp with it to make phone calls."}, {"username": "Vasthi Cheddar", "comment_text": "Maybe the bad reviews are related to the ipad. I used Airalo on my Samsung S22 Ultra and I had no issues whatsoever."}, {"username": "Virginia Lane", "comment_text": "I tested Airalo out with the smallest plan available for my home country, so I could see how to install it and how it works. I had no problems."}, {"username": "Daisy Yoo", "comment_text": "esim u will not change ur number and u can use whatsapp"}]}, {"id": "2205124463219965", "text": "Suggestions for active teens in cinque terre? Lots of beaching but Cliff jumping? Our boat tour cancelled for Friday because of bad sea conditions.", "link": "facebook.com/groups/1373361046396315/permalink/2205124463219965/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/\nMonterosso-al-Ma\nre/\nExperience-in-Ka\nyak-with-Snorke\nling-in-Punta-M\nesco/\nd51036-274547P1?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/\nCinque-Terre/\nPrivate-Cinque-T\nerre-Trekking-T\nours/\nd22149-7226P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Jenine Gallardo", "comment_text": "Go to Manarola and have them spend the day cliff/rock jumping-"}, {"username": "Cheryl Valvano", "comment_text": "I remember watching those cliff jumpers!! Pretty scary."}, {"username": "Jenni Pearl Leavitt", "comment_text": "The same thing happened to our boat tour. Look for one out of La Spezia. When the sea is rough at the cinque terre, it is much calmer by Porto venere and boats still run."}, {"username": "Sue Levy Avinir", "comment_text": "Walk/hike between the towns."}, {"username": "Marian Van Soelen Hand", "comment_text": "We did a pesto making class in Manarola through Nessum Dorma and there were definitely teens there. They make it very energetic and fun!"}]}, {"id": "2205128919886186", "text": "Ahh, what to do in Ostuni for a day?", "link": "facebook.com/groups/1373361046396315/permalink/2205128919886186/", "likes": 1, "comments": [{"username": "Laura DeCicco", "comment_text": "Explore the town, there doesn’t always have to be things to do. Walk, look, pop into churches, sit in the piazza and have lunch"}, {"username": "Carin Corriero Volpe", "comment_text": "It's a wonderful town just walk around and enjoy."}]}]