[{"id": "2211222055943539", "text": "Anyone know where to reserve or the location to get a hop on hop off bus in Marseille and Genoa?\nThanks we will be going with the cruise ship.", "link": "facebook.com/groups/1373361046396315/permalink/2211222055943539/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Just tagged you in another post with the same question yesterday. 🤗"}]}, {"id": "2211225079276570", "text": "Lake Garda: namely magic.", "link": "facebook.com/groups/1373361046396315/permalink/2211225079276570/", "likes": 1, "comments": []}, {"id": "2211206699278408", "text": "We will be in Milan on 28th September and would like to buy tickets to see the last supper all suggestions would be appreciated. Tia", "link": "facebook.com/groups/1373361046396315/permalink/2211206699278408/", "likes": 0, "comments": []}, {"id": "2211218279277250", "text": "Hello friends, I will be in Venice in a few weeks and asking for recommendations for a good local authentic Italian restaurants there.", "link": "facebook.com/groups/1373361046396315/permalink/2211218279277250/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "We liked Agli Alboretti and asked for a table in their garden."}, {"username": "Valerie Ward", "comment_text": "We loved Trattoria Al campanile restaurant. We just returned from a two month￼ trip where we stayed in a lovely apartment in Venice. We ate at this place at least twice a week. ￼ The prices are reasonable and the food is delicious."}]}, {"id": "2210817439317334", "text": "Any recommendations for a nice restaurant for lunch in Bellano? Thanks in advance 😊", "link": "facebook.com/groups/1373361046396315/permalink/2210817439317334/", "likes": 2, "comments": []}, {"id": "2210826325983112", "text": "Taxi rules and fixed rates, from airport to accommodations.\nFound this to be very helpful!\n\nhttps://www.rome-airport.info/rome-airport-taxi.html", "link": "facebook.com/groups/1373361046396315/permalink/2210826325983112/", "likes": 8, "comments": []}, {"id": "2210830562649355", "text": "Just so love this place....so beautiful.", "link": "facebook.com/groups/1373361046396315/permalink/2210830562649355/", "likes": 24, "comments": []}, {"id": "2210834892648922", "text": "Looking at staying in the Umbrai area on the Tuscany border. Hotel is beautiful but I know nothing of the area!\n\nAny recommendations? Is it a beautiful area?\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2210834892648922/", "likes": 3, "comments": [{"username": "Luca George Tudor", "comment_text": "It’s quite far from everything. Maybe beautiful itself but I assume you would like to visit places around. I would suggest Castiglione del lago, 25 minutes from montepulciano and Pienza, 30 min on the freeway to Perugia and very beautiful and welcoming small city"}, {"username": "Romilly Farina", "comment_text": "We stayed in Montefalco. It was magical. We loved it as a small village. We walked to dinner every night. We did a cooking lesson nearby. Also loved the sagrantino wine."}, {"username": "Gayle Moores", "comment_text": "We took a tour from Florence that took us to Cortona on the border of Tuscany and Umbria and then to Assisi in Umbria.Assisi is a UNESCO heritage site and the birthplace of St. Francis. It is truly a beautiful place overlooking a valley.Take a guided walking tour and see the 12 th century Basilica of St.Francis.The upper and lower churches are decorated with frescoes. Climb up hill to the medieval castle fortress Rocco Maggiore.The view is amazing of the entire valley and basilica.Walk around the Via San Francesco( the main part of Assisi )It has lots of boutique shops that sell food and souvenirs.Assis\ni is located close to Perugia in Umbria."}, {"username": "Georgie Davis", "comment_text": "Would you mind telling me what that tour cost?\nI’ve been pricing a three day package but just so expensive however nothing is cheap is it …\nMaybe I have to pay for the no stress option 🤷‍♀️"}]}, {"id": "2210835235982221", "text": "Venice 💙 Stole our hearts", "link": "facebook.com/groups/1373361046396315/permalink/2210835235982221/", "likes": 18, "comments": [{"username": "Saška Bajat", "comment_text": "If anyone needs any tips for Venice Im here for ya!"}, {"username": "Clint Foster", "comment_text": "Looks awesome but I felt like my buzz kicked in and I was spinning lol. Yes please. Will be there 8/29-9/2. Would love to know the bars/\nrestaurants the locals go to. Away from the touristy areas but safe."}]}, {"id": "2210835385982206", "text": "Highly recommend Amadomus Luxury Suites in the heart of Naples. It’s perfectly situated close to the historic centre and right next to the metro. About a 15 minute walk to the train station. It is a smallआणखी boutique hotel on the fifth floor of one of the buildings of piazza Nicola Amore. The hotel itself is charming and the hostess and staff are lovely. We are staying in the “black and white” suite and it’s gorgeous, spotlessly clean with an amazing bath and huge walk in shower. Sound proof windows so although you are in the heart of bustling Naples it is quiet and relaxing inside. A great choice if anyone is looking to book somewhere in Naples 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2210835385982206/", "likes": 65, "comments": [{"username": "Nancy Pileggi", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Irene Oda", "comment_text": "I love visiting Naples"}, {"username": "Angela Gilmore", "comment_text": "Gorgeous! 🤩"}, {"username": "Victoria Russo", "comment_text": "Looks lovely"}, {"username": "Margarita Fergusson", "comment_text": "Absolutely awesome! Jocelyn Morrison"}, {"username": "Sheyla Enrich", "comment_text": "It is beautiful +"}, {"username": "Suzanne Grundy", "comment_text": "Hannah Brxwn for Naples"}, {"username": "Sofia Lucia", "comment_text": "Hermoso!!"}]}, {"id": "2210839252648486", "text": "Anyone have any restaurant recommendations in Siena?", "link": "facebook.com/groups/1373361046396315/permalink/2210839252648486/", "likes": 0, "comments": [{"username": "Holly Frederick", "comment_text": "Yes!!! This place: Osteria Cice. One of the best steaks I have ever had. 14 euros. One of my favorite restaurants in Italy. It is a tiny mom and pop place. http://\nwww.osteriadacic\ne.it/"}, {"username": "Holly Frederick", "comment_text": "Holly Frederick"}, {"username": "Antonio Aloè", "comment_text": "Don't listen to tourists they will send you to tourists restaurants.Goo\nle in google.it \" i migliori ristoranti di Siena\" or i migliori ristoranti a Siena or i 10 migliori ristoranti a or di Siena.\nBuon appetito"}, {"username": "Jill Halleman Timmermann", "comment_text": "https://\nwww.osteriadadiv\no.com/"}, {"username": "Laura Hanis", "comment_text": "LOVED this one\nLA TAVERNA DI SAN GIUSEPPE\nThey have a cool lower level ( only a few steps lower) what they age cheese.\nIt was one of our favorite dinners.\nFabulous!!!"}, {"username": "Yuko Y Smith", "comment_text": "Ristorante Numero Unico.\n\nRabbit with pork and potato porcini flan was 👍 especially porcini was so flavored and deep aroma."}, {"username": "Heather Sechrist", "comment_text": "This place is not far from the center and absolutely delicious. Must make reservations. Although we just stood around and offered to wait. And then we asked if we could drive k wine while we waited and I think they got annoyed with us so they just sat us down. Lol"}, {"username": "Heather Sechrist", "comment_text": "The other place my husband found was Ristorante San Dominica. It’s up on the hill overlooking the Duomo and gorgeous. Food was absolutely delicious as well. And the service was top. Here’s a picture of the view. Make a reservation and get a prime table to have the view."}, {"username": "Angie N Ken Battistone-Potosky", "comment_text": "Osteria La Chiacchera on steep hill."}, {"username": "Mike Conway", "comment_text": "There is no better place than taverna di san guiseppe."}]}, {"id": "2210841492648262", "text": "Thank you for your permission to post this stunning video of Lago di Ladro🥰🇮🇹!", "link": "facebook.com/groups/1373361046396315/permalink/2210841492648262/", "likes": 12, "comments": [{"username": "Stefano Bressanelli", "comment_text": "Lago di Ledro."}]}, {"id": "2210843569314721", "text": "Is it crazy to go to Italy in December? Do they have Christmas Markets and such? We fly standby (I know, crazy) but we really want to get there, it’s a bucket list trip. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210843569314721/", "likes": 32, "comments": [{"username": "Daisy Yoo", "comment_text": "We are going Dec 1-16 th before the Christmas and new year crowd"}, {"username": "Starla Dawn", "comment_text": "Christmas in Italy has a nice ring to it."}, {"username": "Jackie Dempsey", "comment_text": "We are in Rome at the moment . Our cab driver said all it does is rain in November and December"}, {"username": "Frannie Spinoso", "comment_text": "Italy is never crazy!"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "My sister went over Christmas and loved it!"}, {"username": "Phyllis Snyder", "comment_text": "It’s beautiful time to go!"}, {"username": "Joey Chopra", "comment_text": "I’m glad you asked this as we’re also going early December- encouraged by the responses! 🥳"}, {"username": "Rob MacFarland", "comment_text": "We are going in November, we'll high five you at the airport!"}, {"username": "Ilaria Giorgulli", "comment_text": "We do not have a strong Xmas market tradition, the most beautiful ones are in Trentino-Alto Adige, and many in Tuscany. I’m from Rome, the city centre is nicely decorated anyway and usually Dec is still not that cold"}, {"username": "Mario Torre", "comment_text": "Search out Christmas markets in Bolzano and Merano, you will not be disappointed.\n\nhttps://\nopen.spotify.com\n/episode/\n2exrEKnqTFt7LGH3\nwq7gns?si=Xmr0-\nXNeTQyL4YgQEOnq\n-g"}, {"username": "Sue McIntyre", "comment_text": "We went at Christmastime one year and there was a great Christmas market in Piazza Navona in Rome. And the lights were beautiful!"}, {"username": "Erica Sylva", "comment_text": "Christmas alley in Naples is amazing."}, {"username": "Frank Hunt", "comment_text": "Yes, crazy."}, {"username": "Susan Rathke", "comment_text": "Italy, any time of year is a great choice. I enjoyed the markets in Milan and Bergamo in early January."}, {"username": "Nicole Bedree", "comment_text": "Following"}, {"username": "Amber Jozsa", "comment_text": "Not crazy at all Florence is amazing during christmas time they have alot of different foods and stuff at there Christmas market"}, {"username": "Carol Fisher Castagna", "comment_text": "Of course, just GO!!! Great time to shop for boots and clothing too, just sayin"}, {"username": "Mary Agnes Parisi Citro", "comment_text": "I went first week in December. It was lovely. Mild. Wore a sweater every day but mild. Christmas decorations were all up."}, {"username": "Robyn McCabe", "comment_text": "Christmas in Italy, the lights & decorations are beautiful. We ate lobster & pasta for Xmas lunch"}, {"username": "Cynthia Marie", "comment_text": "I watched the weather closely last December to get an idea of what to expect for our trip this December. From what I saw last December, the weather was wonderful! Mild temperatures and I don’t remember any rain. 40-60 degrees is perfect for us during a city stay.\nOf course you can get rain anywhere anytime. Be prepared and enjoy!"}, {"username": "Alicia Cox", "comment_text": "You will LOVE it! Beautiful decorations & definitely Christmas markets!"}, {"username": "Ronit Gorenstein", "comment_text": "We were in Napoli in december and we sat by the beach 20 degrees Celsius is about 68 Fahrenheit."}, {"username": "Michele Boubede Granito", "comment_text": "Go"}, {"username": "Vickie McMurchie", "comment_text": "Just be careful in regards to traveling around religious holidays as most businesses will close for holidays."}, {"username": "Andrea Laurie-Cruz", "comment_text": "Stand by at Christmas? You may get on, on the 25th. Best of luck though. I don’t even try during high peak seasons and holidays, that’s crazy!"}, {"username": "Allan Olexa", "comment_text": "We spend a wonderful week in Napoli, annually at Christmas."}, {"username": "Susan Martel", "comment_text": "Enjoy"}, {"username": "Gemma Marie", "comment_text": "How do you fly standby? What does this mean, it sounds cheap, teach me more! Lol"}, {"username": "Lorenza Simile", "comment_text": "Will be travelling for 4 weeks through Milan, Venice, Florence, Abruzzo and having Christmas in Rome. Can’t wait.\nIf it’s the only time you can go then just to it. 😊"}, {"username": "Renee Rundle Stoneham", "comment_text": "Christmas in Europe is magical! The cities and towns put up lights etc…\nHowever markets are before Christmas. Even in Germany where Christmas markets rule they close down on Christmas Eve. Some countries do transition into New Years Markets, so do your research and the dates etc…\nWe use Christmas Day as a travel day since many things are closed. Many things close up on Christmas Eve around 12-2pm too so be aware of that.\n\nBut definitely worth a trip! I’d include Germany ir another country like Austria etc as well.\nMy profile picture is from Christmas in Vienna 2019."}, {"username": "Helen Pottle", "comment_text": "My friend just went to Florence and they said to come back in December for Christmas market."}, {"username": "Colleen Dawson", "comment_text": "We have spent many Christmases in Italy, usually in the north and will be there this year."}, {"username": "Samantha Edmonds", "comment_text": "We are planning our first trip for December. We hate crowds and hot weather and don’t mind cold or rain. Really looking forward to it"}, {"username": "Vivien Paulik", "comment_text": "Italy is still there in Winter so it is not a ceazy thing to go there. Also there are Christmas Market, but you can sightseeing, walk around, go to eat, go for museums and do anything which is not the swimming or sunbathing 😅"}, {"username": "Judith Pishnery", "comment_text": "It's lovely"}, {"username": "Sonia Scotto Lubrano", "comment_text": "Great time to go site seeing. Obviously if swimming in the med is you’re thing, not the greatest time to go lol.\n\nI use to fly standby to Italy every year. I loved it"}, {"username": "Mary Evelyn", "comment_text": "We are doing Nov 23-early December and am so excited. I’m from Michigan so “cold” is definitely subjective for us but I’m ok bundling up to see everything. I’m most worried about Venice and whether I should skip that because of rain."}, {"username": "Linda Gatta", "comment_text": "We are also planning to go in December. Haven't seen alot of posts about traveling during the holidays."}, {"username": "Simone Clark", "comment_text": "We were there last Christmas and New Year. They do lovely Christmas markets everywhere. From Rome to Arezzo, Bolzano, Merano and Bressanone."}, {"username": "Mallory Kathryn", "comment_text": "We did a Christmas in Italy and it was beautiful! Naples had a little Christmas market but we visited the rest of Italy after Christmas. The streets were still decorated though. Naples was in the low 60s and Venice was a little chilly, maybe in the 40s/50s and rainy. But nothing freezing. We’re from Florida so anything below 70 is cold lol"}, {"username": "Gina Sowizral Gillan", "comment_text": "Our son is studying abroad and our family of 7 is flying out to meet him and enjoy Italy. We arrive Dec 9th and so excited."}, {"username": "Polly Smith", "comment_text": "We have spent a few New Years in Rome and Milan. Really enjoyed ourselves and had crisp dry days except one really rainy day in Rome. Managed to sit out most days for lunch. Lots of restaurants have patio heaters. X"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Some places may close for the holidays but Christmas and NYE are really fun times to visit Italy."}, {"username": "Erica Margaret", "comment_text": "I’ve done Christmas markets in Vienna and LOVEd being in Europe that time of year. Was magical!!!! So I’m sure Italy would be the same"}, {"username": "Roxanne Boccardi", "comment_text": "They have every kind of holiday market ."}, {"username": "Rhonda Dinzey", "comment_text": "Italy is such a diverse country, best to say which part you are going to."}, {"username": "Angie Mattin", "comment_text": "Some places, like Gaeta and Salerno, have beautiful Christmas lights set up for the season, quite a few castles have Christmas markets on, Milan has a Swarovski Christmas tree in the main gallery and some lovely decorations.. I’m sure you’ll enjoy Italy at Christmas!"}]}, {"id": "2210843985981346", "text": "Any suggestions as how to get from Florence to Basel?", "link": "facebook.com/groups/1373361046396315/permalink/2210843985981346/", "likes": 0, "comments": [{"username": "Grg Cozzetto Oetterer Mra", "comment_text": "Check :\nRome2Rio.com"}, {"username": "Colleen Dawson", "comment_text": "Trenitalia with a change in Milan.Or you can check the Rome2rio app for other options."}, {"username": "Kejdi Okej", "comment_text": "Trenitalia witha a change in milan or you can check the rome 2rio app for other options"}]}, {"id": "2210834452648966", "text": "Don’t miss to join our NEW walking tour! Our local guide Patrizia will show you the highlights of this picturesque village, you will virtually stroll through the historic center of Pienza, you will admire theआणखी famous Piazza Pio II, Pienza’s central main square, the heart of the city’s Renaissance design and you will explore its narrow streets, beautiful palaces and charming corners.\nJoin our NEW virtual experience: https://nextstop-italy.com/virtual-tours/pienza/\n\n#italytravel #artlovers #hiddengems #italygram #vacationmood #virtualworld #history #italytrip #medievalarchitecture #medievalart #medievalhistory #medievalcastle #italytrip #hiddengems #artlovers #tuscany #tuscanygram #tuscanyitaly #tuscanytravel #tuscanypeople #tuscanyexperience #pienza #pienzaitaly #pienzatuscany #renaissance #renaissanceart #orciavalley #valdorcia", "link": "facebook.com/groups/1373361046396315/permalink/2210834452648966/", "likes": 3, "comments": []}, {"id": "2210758482656563", "text": "Grena Porto, I think you would enjoy everyones reviews and experiences.", "link": "facebook.com/groups/1373361046396315/permalink/2210758482656563/", "likes": 1, "comments": []}, {"id": "2210598322672579", "text": "Thinking about a few nights in Tuscany next summer after visiting Venice (4 nights) and Rome (5 nights). Plan after 9 days of city/sightseeing would be to spend time by a pool relaxing with the option of driving the surrounding areas when we feel inclined. Have seen a few Tuscany hotels / accommodation that appeal!\n\nWould you?\n\nA - Have 5 nightsआणखी in Tuscany (and possibly drive to Florence for a day trip during this time)\n\nOR\n\nB - Have 4 nights (maybe 5 if can push the budget) in Tuscany and spend last day/night in Florence before flying home.\n\nMany thanks", "link": "facebook.com/groups/1373361046396315/permalink/2210598322672579/", "likes": 0, "comments": [{"username": "Charleen Siegler Schuss", "comment_text": "4 nights in Venice is a long time fir such a small town"}, {"username": "Renae Larcus", "comment_text": "Look at La Lucciolaia Agriturismo - San Gimignano. Lovely!"}, {"username": "Kejdi Okej", "comment_text": "4 inghts in venice is a long time fri such a smll town"}, {"username": "Daniele Zarka", "comment_text": "If you’re interested in Umbria, spent an incredible week at Villa Monte Solare. Perugia, Montepulciano… were all easy to access."}, {"username": "Stephen Henn", "comment_text": "I would stay at an agriturismo and do a day trip to Florence. If you are flying out of Florence, then I would spend the night there before your flight. Tuscany is a great place to relax after visiting busy cities."}, {"username": "Graham Sherlock", "comment_text": "Day trip is best, the less you move accommodation the better"}]}, {"id": "2210768445988900", "text": "Anyone know where to reserve or the location to get a hop on hop off bus in Marseille and Genoa?\nThanks we will be going with the cruise ship.", "link": "facebook.com/groups/1373361046396315/permalink/2210768445988900/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Did you check the Marseille Hop On Hop Off bus site? This is the route… https://\nwww.colorbus.fr/\nen/\ninteractive-tour\n-map/"}, {"username": "Kejdi Okej", "comment_text": "Thank you so much"}, {"username": "Emma Chadwick", "comment_text": "The hop on hop off bus goes from by the aquarium in Genoa. It’s not far from where the cruise ships come in. If you check the website it shows you the route."}]}, {"id": "2210773269321751", "text": "Need recommendations\nfor train from Rome to Florence. It will be on a Sunday. Best time to travel?\n\nThanks.", "link": "facebook.com/groups/1373361046396315/permalink/2210773269321751/", "likes": 0, "comments": [{"username": "Stephanie Dean", "comment_text": "The best time is the one that gets you there when you want to be there."}, {"username": "Jenn Messina Babore", "comment_text": "Any time is good to travel although I’d get there before it gets dark so you can walk around and see the city a bit during the day."}, {"username": "Gaby Devyll", "comment_text": "Book in advance with Trenitalia for price and time."}, {"username": "Sheila La", "comment_text": "I got up early to take the train from Rome to Florence. Had the whole day there and was back in Rome that night."}, {"username": "Paola Barbetti", "comment_text": "The high speed train companies available in Italy are two:\nTrenitalia and Italotreno, you can easily check timetable and tickets price. Trenitalia is sometime a little more expensive, but they are both fine. The earlier you purchase the tickets, the less they cost. Pay attention to travel conditions, cancelation policy, change of date or time of the trip, refund and so on, though"}, {"username": "Marty Harte", "comment_text": "Download this app and sign in to get set up. Take the high speed freccirossa train to Firenze. There is no Florence on the app it goes by Firenze in Italia. No need to validate the tix. Super easy."}, {"username": "Colleen Dawson", "comment_text": "Only 2 choices , Trenitalia and Italo."}, {"username": "Renae Larcus", "comment_text": "Go to Trenitalia and book the fast train to Florence. Easy. It will say Firenze."}, {"username": "BatEl Kogman", "comment_text": "Trenitalia"}, {"username": "Gary Fossaceca", "comment_text": "Download Rome2rio it gives you everything you need"}, {"username": "John Bruckman", "comment_text": "There are trains every hour… just pick a Freccia Rossa or Italo fast train. Only 1 hour 20 ride. Splurge an extra few Euros and go business. Enjoy the ride."}, {"username": "Pam McIntyre", "comment_text": "take the Frecciarossa"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2210774942654917", "text": "I definitely left my heart in Italy🥰🇮🇹! We were mostly in the northern part of the country and I just loved it. I wish we also spent more time in the stunning Dolomites.", "link": "facebook.com/groups/1373361046396315/permalink/2210774942654917/", "likes": 335, "comments": [{"username": "Rolyn Paderanga", "comment_text": "Hi,view is smashing!What is the name of this lake?"}, {"username": "Sandy Heim", "comment_text": "Beautiful!"}, {"username": "Lori Mammano", "comment_text": "Beautiful"}, {"username": "Margaret Carloni", "comment_text": "Awesome pics! You and your daughter have great style!"}, {"username": "Charlie McDonald", "comment_text": "Beautiful pictures. Thank you so much for sharing. I’ll be in Lausanne Switzerland beginning of September and plan to hike around the Dolomites. I had no idea of the beautiful places close by. I will definitely take a side trip and spend some time there.\nOnce again thank you for sharing"}, {"username": "Jacqui Warsama", "comment_text": "How did you go to the Dolomites, was it on a day trip when you stayed in north Lake Garda?"}, {"username": "Verche Jovcheska", "comment_text": "You sure found the best spots to take pictures. Bravissimo!!!"}, {"username": "Gina Bowman Levek", "comment_text": "Gina Bowman Levek"}, {"username": "Paola Girelli Harding", "comment_text": "Wonderful pictures! I am a veronese nel mondo, or 🌎 in the world and want to thank you for them and the compliments! It’s such a great area, not as popular as it should be, but it’s greatly loved by me!🤗"}, {"username": "Gina Alexander", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Shelton McBride", "comment_text": "Thanks for sharing!"}, {"username": "Kate Laidlaw", "comment_text": "Wow!! 😍 Did you hire a car?\n\nWe just did Rome, Florence and Cinque Terre and I’m already planning our next trip.. a bit more off the beaten path."}, {"username": "Krissy DaRusso", "comment_text": "Did you rent a car?\n\nYour pictures are beautiful!"}, {"username": "Sarah Bovington", "comment_text": "Great pictures!!"}, {"username": "Eva Johnson", "comment_text": "Wow lots of different clothes and shoes!!!!\nGreat pictures."}, {"username": "Refki Gashi", "comment_text": "Refki Gashi"}, {"username": "Anita Lawrence Mundy", "comment_text": "Great photos"}, {"username": "Celeste Richardson-Foster", "comment_text": "Just came back from northern Italy 2 weeks ago. Thanks for reminding me of its beauty"}, {"username": "Kathy Brooks Taveira", "comment_text": "Thanks for the beautiful photos and the locations!"}, {"username": "Cheryl Sylvia", "comment_text": "Your pictures are absolutely gorgeous. I was there in June, it really is heaven on earth…"}, {"username": "Regan Verwey", "comment_text": "Lovely photos"}, {"username": "Rona Beattie Chai", "comment_text": "Would you say a day trip from Venice would be worth it?"}, {"username": "Judy Keenmon Janik", "comment_text": "Looks lovely!"}, {"username": "Anne Smith", "comment_text": "Beautiful photos"}, {"username": "Elena Rodriguez", "comment_text": "Absolutely stunning!🥂"}, {"username": "Dorothy Press", "comment_text": "Awesome pictures! Where did you stay when you were at the Dolomite’s? Which hotel? What town? We were at Lake Como in May, thought about doing another Lake , but went to Santa Margarita to see Portofino and Cinque Terre. We want to return again next year."}, {"username": "Carmen Martin", "comment_text": "Carmen Martin"}, {"username": "Isabella Myrah", "comment_text": "Wonderful pictures"}, {"username": "Mʌjɩɗ Aɭɩ Sʜʌʜ", "comment_text": "Beautiful"}, {"username": "Leanne Dixon", "comment_text": "Lovely pictures"}, {"username": "Arnie Lagadia", "comment_text": "Wonderful pictures"}, {"username": "Karin Carmignani", "comment_text": "Karin Carmignani"}, {"username": "Elaine Wilson", "comment_text": "Wonderful pictures"}, {"username": "Kejdi Okej", "comment_text": "Wonderful pictures"}, {"username": "Diana Masarsky", "comment_text": "Great Pics! I like your style 😎"}, {"username": "Andreanna Miteff", "comment_text": "Just gorgeous!"}, {"username": "Brittney Eng", "comment_text": "How did you get to the Dolomites mountains?"}, {"username": "Toni Marie", "comment_text": "Me too hard to come\nBack"}, {"username": "Susan Maxwell", "comment_text": "Great pics and love your style!"}]}, {"id": "2210212602711151", "text": "Has anyone rented a car from the rental company “Scicily by Car”? How was your experience? We are looking to rent a car from Florence airport and return it at Roma Termini.", "link": "facebook.com/groups/1373361046396315/permalink/2210212602711151/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Steve Bouffard", "comment_text": "We rented a car in La Spezia and returned it to Rome airport. We used Budget. It should be possible. Just book early."}, {"username": "Marion Albers", "comment_text": "Was perfect, very easy."}, {"username": "Carole Tarlap", "comment_text": "GET your International Drivers license AND FULL COVERAGE on the car💥"}, {"username": "Kejdi Okej", "comment_text": "We rented a car in la spezia and returned it to rome airport we used budget lt should be possible just book early"}, {"username": "Greg Saba", "comment_text": "Yes, but we rented from them via highly regarded broker AutoEurope. Often AutoEurope has options that include full insurance that are cheaper than the surprise you usually get at the desk. And, AutoEurope is based in Portland, Maine, if there are issues after you get home."}, {"username": "Jaci Rummel", "comment_text": "We rented in Bologna and went to Ravenna for a cruise. We used LocAuto. They charged a $500 deposit that I did not get back. Expect a charge like that when you drop the car off at a different destination. Yes, get your International drivers license and insurance.\n\nBe aware there are many areas you cannot drive. Not all accommodations have parking, make sure your hotel does.\n\nThere are designated times that parking is illegal- especially in the cities.\n\nAlso be aware that if you return your car anytime between Saturday noon and 10AM Monday, you will have trouble finding a ride."}, {"username": "Yvonne Donnellan", "comment_text": "Don’t. Nooooooo"}, {"username": "Daniele Zarka", "comment_text": "Used them a couple of times out of Milan. No issues, no fuss."}, {"username": "Mary Scovill", "comment_text": "we used them. experience was good except for the 2 tickets we received 6 months and 9 months later. the 50 euro research charge for the police was a little steep. if I were to rent a car again, I would shop around to see if all companys charge for this service."}]}, {"id": "2210782005987544", "text": "I would love some help! I’m so confused! I need to go to Florence from venice to see David (already have those tickets) but the trains are so confusing! Can someone help me out? I’ve already looked at previous posts and my question isn’t fully answered. Thanks for any assistance.", "link": "facebook.com/groups/1373361046396315/permalink/2210782005987544/", "likes": 0, "comments": [{"username": "Marina Rosa Moni", "comment_text": "What's confusing? Explain"}, {"username": "Stacy Gray", "comment_text": "Was on the trantalia app and there are several different classes of tickets. But a few times I was able to pick the schedule that I wanted, I opted to pick my seats, there were some available on the site and then it says train sold out. Am I looking at the wrong class of tickets, do I need to change stations? I just don’t want to screw it up and miss seeing Florence."}, {"username": "Casarine Temple", "comment_text": "What’s your question?"}, {"username": "Shannon Madison", "comment_text": "Try the train line app . It’s a tiny bit more expensive because they charge a booking fee , but easier to navigate"}, {"username": "Joy Pascxa", "comment_text": "get Italo"}, {"username": "Charleen Siegler Schuss", "comment_text": "Show us your ticket"}, {"username": "Sabrina Marie", "comment_text": "They’re really not that confusing. The basic tickets are fine. Just google search your train destinations like you would a flight and book it"}, {"username": "Terri Bradford", "comment_text": "Use Rome2Rio. It will give you all the options to get from A to B"}, {"username": "Alicia Burno", "comment_text": "Go to the train station in Venice and get in the office of italotreno, the people who work there are very helpful. I did that route a few days ago and got my tickets the train that was leaving in 7 minutes…😂😂…we just had to run!!"}, {"username": "Ibbu Mohd", "comment_text": "Italo train app\nVenice station (lucia)\nflorence station (novella)\nBook seats as well"}, {"username": "Laura Uribe", "comment_text": "See attached picture. 2 hr 13 min"}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "A"}, {"username": "Valerie Nicole", "comment_text": "Hello! I was in Italy for 2 weeks at the end of March and used this app to book mostly all of our tickets. Real easy to use and it compares all different types of transportation and companies. Good luck and have a great time!\n\nhttps://\nwww.omio.com/\ntravel/italy"}, {"username": "Frank Hunt", "comment_text": "It’s really simple, get the Trainline App, choose the appropriate ticket, time and day, job done."}, {"username": "Stacy Gray", "comment_text": "I’m trying to go 09/05/2023. I will try all of the options given tomorrow morning and fill everybody in. Thanks for the assistance!"}, {"username": "Antonio Aloè", "comment_text": "You can book the ticket in trenitalia app"}, {"username": "Gillian O'Callaghan", "comment_text": "I used Trainline app for 13 trips in Italy. Put in Venezia Santa Lucia to Firenze. There are direct trains but for some you may have to change in Padua (but that's easy).\nNot sure what's causing your confusion."}, {"username": "Robin Darmstadt Mancil", "comment_text": "Ck out Rome2rio. It shows every possible option to get to Florence from Venice."}]}, {"id": "2210788502653561", "text": "TRAIN OR FERRY FROM NAPLES TO SORRENTO\n\nHi all!\n4 of us are travelling from Naples to Sorrento in September and were wondering which is better to do?\nTake the ferry or train from Naples to Sorrento ?", "link": "facebook.com/groups/1373361046396315/permalink/2210788502653561/", "likes": 1, "comments": [{"username": "Rob Wolfe", "comment_text": "We took the ferry because I thought it would be nice to see everything from the water. It was chaotic at the port. So bad that we almost got on wrong boat because they had like 4 boats boarding in same area. Then once we got in you couldn’t really see anything because the windows were so dirty and get wet during the trip. If we had it to do again we’d take the train. That’s just one opinion though."}, {"username": "Angela Hall", "comment_text": "We’ve booked a Zip transfer and for four of us it’s not too expensive and very convenient."}, {"username": "Fiona Mac", "comment_text": "Ferry"}, {"username": "Lydia Leyla Cosgrove", "comment_text": "Train - cheaper, don’t have to go down to the port and less chance of it getting cancelled in case of bad weather"}, {"username": "Kejdi Okej", "comment_text": "Ferry"}, {"username": "Donna Harrison", "comment_text": "We took Train it was quick and easy and very cheap 👍🏻"}, {"username": "Wahab Sidharta", "comment_text": "Private transfer"}, {"username": "Sandy Michelle Duggan", "comment_text": "I did both, did ferry over to Sorrento, it was caos, taxi was costly, didn't want to do train, but the train was so easy, did it on return trip, caught 8.45 am train to Naples, plenty of seats, it was one of the better trains on that route, air con etc, much better experience than ferry, we got hit with a charge of 3 euros each on ferry for luggage after prepaid tickets. ferry terminal was beyond busy. Train was cheap and right in town"}, {"username": "Patty Van Curen Wandell", "comment_text": "We did the Campania Express from Sorrento to Naples. Super easy."}, {"username": "Ian Fawkner", "comment_text": "Italian trains are the best !"}, {"username": "Aimeelee Tillett", "comment_text": "A private transfer car or train.\nThe trains in Italy are the best🙌"}]}, {"id": "2210785952653816", "text": "La sciuta di San Sebastiano a Palazzolo Acreide!\n\nVideo di @diario_di_una_vagabonda", "link": "facebook.com/groups/1373361046396315/permalink/2210785952653816/", "likes": 5, "comments": []}, {"id": "2210788612653550", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2210788612653550/", "likes": 6, "comments": []}, {"id": "2210757119323366", "text": "Looking for good hiking on Lake Como. We are staying in Bellagio but can take ferry to most little towns. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2210757119323366/", "likes": 0, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Greenway, and the path to Castello di Vezio"}, {"username": "Kejdi Okej", "comment_text": "Greenway and the path to castello di vezio"}, {"username": "Kerry McMillen", "comment_text": "Yes. Take the western path up to Vezio. Have good shoes"}, {"username": "Annette Brin", "comment_text": "How adventurous leisurely or more challenging- how many days you there. Got some serious epic ones to recommend in nearby Switzerland"}]}, {"id": "2210755679323510", "text": "Hello!!\n\nI am curious about catching a train after a flight! I will be landing in malpensa terminal 1 at 1750. I am wondering if it would be appropriate for me to book the 1813 train or if that is pushing it. Is there a fair distance between flight security and where the train stops? Thanks for any info!!", "link": "facebook.com/groups/1373361046396315/permalink/2210755679323510/", "likes": 0, "comments": [{"username": "Anthony Felice", "comment_text": "Do you have to clear customs?. What I'd yiyr flight is delayed? I would day it's too close"}, {"username": "Uroš Agič", "comment_text": "Transfer time is too short bro. Book in next available departure. Malpensa is not a small airport."}, {"username": "Donna Mangone", "comment_text": "That's cutting it too close for comfort."}, {"username": "Irene Oda", "comment_text": "If you have to clear customs this is way too tight. Even if you don't have to clear customs, it's very tight. You have no control over flight delays, number of flights having to be processed on arrival heck the plane may have to circle before landing."}, {"username": "Lisa Akira", "comment_text": "Ooh that’s tight!\nI found trains from airports to run frequently enough. Get a ticket once you are at the station.\nIf you prebooked first class with an assigned seat, just turn the ticket in and they will issue a new one. But therefore what’s the point of pre booking?"}, {"username": "Julie Kov", "comment_text": "Definitely not enough time to clear customs and make the train"}, {"username": "Lean Ni Chleirigh", "comment_text": "I don’t think you need to book. Just head to the train when you arrive. No point trying to guess. Also without knowing where you’re coming in from and if you have carry on only, this is an impossible question to answer."}, {"username": "Mohor Chakraborty", "comment_text": "Which station ? Malpensa station is just below the airport terminal. But I had to wait for nearly 2 hrs to clear immigration at Malpensa (early morning)"}, {"username": "Angela O'Donnel", "comment_text": "You don't need to prebook the Malpensa express. Just buy it when you clear immigration, baggage, customs. There is a ticket booth right by baggage, also numerous in the station. I was just there in May, June, and July and there was plenty of room"}, {"username": "Frank Hunt", "comment_text": "No need to prebook. However, you could use the trainline app after you land to get you tickets when you are ready to go. Either way, it’s not a problem."}]}, {"id": "2210562152676196", "text": "Planning a trip to Matera (Basilicata) on September 20th 2023. Anybody would go there on that time?", "link": "facebook.com/groups/1373361046396315/permalink/2210562152676196/", "likes": 4, "comments": [{"username": "Carole Tarlap", "comment_text": "I was there last September (not enough time) ....need 2 days minimum IMO"}]}, {"id": "2210686732663738", "text": "Going to Italy for the first time 9/12-9/26! Our stops are: Sorrento with day trip to Capri and Amalfi, Train to Rome, rental cars Rome to Tuscany ( San Giamangio home base) Florence to Venice. I’m looking to purchase : Leather jacket, something alabaster, and a Murano glass ornament. Recommendations? And any other travel tips for first timers? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2210686732663738/", "likes": 4, "comments": [{"username": "Kay M Gregan", "comment_text": "Just left Sorrento after 3 days, with a trip to Capri, Positano, a day trip to Pompeii and Naples."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Leather jacket Florence, Alabastro try to go to Volterra where they have everything, Murano glass in Venice.\nBe careful with ZTL areas in city center, you are not allowed to drive there by car."}, {"username": "Kay M Gregan", "comment_text": "I had 3 night's in July in Siena, 2 in Montepulciano, wine tasting in Chianti, and time in San Gimiango, with the best gelato I have tasted. Award winning Gelato. Allow yourself time, to enjoy!"}, {"username": "Anthony Felice", "comment_text": "I did a similar trip using the trains and then booked a few tours. It was hastle free"}, {"username": "Tonia Bennett", "comment_text": "May I inquire ... did you book this trip using a Travel Agency? If so, would you mind to say which one? TIA"}, {"username": "Renae Larcus", "comment_text": "When in Venice, take the vaporetto to Murano and buy your glass there. You can also find Murano glass in Venice. Also, San Gimignano is a great base in Tuscany."}, {"username": "Serenna Davies", "comment_text": "We thought Capri was disappointing. Very touristy and very pricey. The rest was excellent."}, {"username": "Vanessa Durkin", "comment_text": "Florence best place for leather san lorenzo area all leather stalls and incidentally a marvellous food market"}]}, {"id": "2210732409325837", "text": "Which Regions in Italy will be best for teens to spend the summer? Planning to stay for a minimum of 30 days.", "link": "facebook.com/groups/1373361046396315/permalink/2210732409325837/", "likes": 0, "comments": [{"username": "Tom O'Hara", "comment_text": "Gardaland"}, {"username": "Paul Anderson", "comment_text": "I love cesenatico. There are dozens of sport, music, and theater camps. These are a fun way to meet other kids and learn Italian. It is also on the beach and as it’s a resort town there are lots of fun things to do. I’m heading there now."}, {"username": "Linda Petursdottir Simonsen", "comment_text": "Lake Garda"}, {"username": "Gianni Pompilio", "comment_text": "I heard Gallipoli, southern of Puglia, it’s the new teens hotspot 🤌🏻"}, {"username": "Esther Starren", "comment_text": "Rimini, Jesolo"}, {"username": "Pietro Di Sorbo", "comment_text": "Maybe Emilia Romagna (Rimini, Cesenatico, Riccione, Milano Marittima), Veneto (Jesolo), Friuli Venezia Giulia (Lignano Sabbiadoro), Tuscany (Versilia, Vjareggio).\nThese are fun places for teen and over but the water is not clear as other places."}, {"username": "Renae Larcus", "comment_text": "Summer with teens, better have a beach. Lake Garda!"}, {"username": "Ted Cabot", "comment_text": "The Tuscan coast is a great spot, Marina di Grosseto is a hot spot beach area, tons of teens and a good spot for jumping off to the rest of Tuscany"}, {"username": "Stefano Bressanelli", "comment_text": "Riccione (Romagna, adriatic see)"}, {"username": "Cindy Sguazzin", "comment_text": "Lignano Sabbiad’oro, Bibione, Grado!!! Fabulous beaches, restaurants, nightlife!"}, {"username": "Tonsia Keytel", "comment_text": "Monterosso, Cinque Terre."}, {"username": "Ike Simoncini", "comment_text": "Lake garda or rimini"}]}, {"id": "2210538802678531", "text": "Will be our first visit to Italy next year. We’re staying in Sorrento for 4 nights. Would like to see Capri, Amalfi and Positano while there. Can this be done in a day or would it best over a couple of days? And would boat be best to travel from sorrento to each?", "link": "facebook.com/groups/1373361046396315/permalink/2210538802678531/", "likes": 1, "comments": [{"username": "Jennifer Avrett", "comment_text": "Definitely cannot be done in one day. Capri needs its own day and the other two need their own"}, {"username": "Kejdi Okej", "comment_text": "Definitely cannot be done in one day , capri needs its own day and the other two need their own"}, {"username": "Renae Larcus", "comment_text": "Way too much for a day. Spend a day on Capri. The other two in one day maybe. Also Ravello."}, {"username": "Katherine Azcue", "comment_text": "Over a couple of days. Positano needs one full day. Capri and Ana Capri I would say a full day also, amalfi half a day will do. Not much to do there."}, {"username": "Melissa Hammond", "comment_text": "Check out mondo guide tours. They offer a small group boat trip to Capri and blue grotto and a small group minivan tour to Positano, Amalfi and Ravello. Reasonably priced and both tours were great."}]}, {"id": "2210159582716453", "text": "Well the inevitable happened today. My bf was pickpocketed on an escalator in Rome-Piazza barbarini. Luckily, only cards. We called them all. The thief was quick. Tried to use them right away.\nThere was a diversion-on the escalator this guy was playing with his shoe. I think he was the culprit. Lesson learned. Watch more. Carry what youआणखी need only. Cash and passports were safe!\n\nMy bag has those zipper locks everyplace.\n\nJust wanted to post to warn my fellow travelers. It’s my bf’s first time in Europe. If I had known all that he brought I would have said something. But, we are safe and got our health.\n\nSide note-Naples-I was safer in the streets. You don’t mess with the Neapolitan ppl.", "link": "facebook.com/groups/1373361046396315/permalink/2210159582716453/", "likes": 71, "comments": [{"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Kimberley Samlalsingh-Jodhan", "comment_text": "Roxanne Franquelli what type of bag with the zipper locks do you have? Can you recommend it?\nAnd thanks for the info"}, {"username": "Kejdi Okej", "comment_text": "Was the wallet in front or back pocket"}, {"username": "Amy Burniche-Christello", "comment_text": "Years ago , I believe it was Florence- a young child maybe 9 or 10 came up to me with a map and put it over my Fanny bag trying to distract me with the map- I immediately put my hand on top of the bag- the young child ran away\n\nIt was quick, and made me sad for the child"}, {"username": "Vivien Paulik", "comment_text": "Was his wallet in his pocket? Never do this? You have to put it in a bag or a pocket which is not easy to pickpocking"}, {"username": "Jay Cabrera", "comment_text": "Always be aware of a man playing with a shoe, especially on an escalator. It’s the oldest trick in the book"}, {"username": "Bill Elias", "comment_text": "Where was his wallet on him?"}, {"username": "Denise Adams", "comment_text": "Some amount of thieving going on in Rome, awful!!!"}, {"username": "Krishna Yalla", "comment_text": "I don't know you but i feel for you. Just came back and someone stole my bag containing my camera and laptop on a train from Florence to Milan. The bag was literally above us and they took it. The Italian police are completely useless. Be vigilant everywhere"}, {"username": "Vu Anh Tran", "comment_text": "Attentions pickpockets everywhere"}, {"username": "Jo MataSant", "comment_text": "Rome is notorious for pick pocketers! Sometimes you have to use a crossbody bag(thin) for your cash and card/passport and wear under your shirt lol. I swear it works.😀"}, {"username": "James-Kathy Dickerson", "comment_text": "Thanks for the info 😔"}, {"username": "Patty Ham", "comment_text": "May I recommend Clothing Arts for pickpocket proof pants?"}, {"username": "Kate Fisher", "comment_text": "sorry about what happened but the majority of tourists do not get robbed so it is not 'the inevitable' that this happened"}, {"username": "Shelley Perelmuth Sperling", "comment_text": "I bought two north Carry bags. Front of body. Close to body. Fingers crossed"}, {"username": "Babi Tsilosani", "comment_text": "This can happen anywhere, I have been to Rome 5 times and have always been smart how I carry my belongings never any issues."}, {"username": "Bea Kuckens", "comment_text": "Men need to keep wallets in their FRONT pocket, as deep as it will go. My husband is from NY, has always done this regardless of where we are - it's just normal for him."}, {"username": "Susan Marten", "comment_text": "Inevitable?"}, {"username": "Jeannie Morris Wierman", "comment_text": "I hope I am prepared for the thieving scum."}, {"username": "Holly Marie", "comment_text": "Sorry that happened to you. I carry all my cards and stuff in my bra or phone case."}, {"username": "Mario Torre", "comment_text": "I am always worried that carrying a cross bag says: come steal me I have valuables! I am getting dressed just thinking about what could happen."}, {"username": "Laurie Denoni", "comment_text": "Sorry to hear."}, {"username": "Jennifer Gadaleta", "comment_text": "So sorry for your friend it spoils a lovely holiday"}, {"username": "Selena Boucher", "comment_text": "So was the guy playing with shoe a decoy type diversion and someone else did the theft?"}, {"username": "Isabelle Truong", "comment_text": "I was travelling solo in Italy recently for 3 weeks, walking, catching metro and train and I was lucky not to encounter any theft and there’s not much to steal because I would only carry 1 debit card with a low balance in it, very little cash and my CC are in my digital wallet on the phone. The phone was always in my hands because I constantly took photos with it. The passport was either in the hotel safe or hidden in my suitcase. It doesn’t matter what countries you’re visiting you just have to be aware of your environment and not carry around too much when you’re out and about."}, {"username": "Lynne Keegan", "comment_text": "Pat Keegan !!"}, {"username": "Robyn Braithwaite", "comment_text": "Inevitable? Not unless you ignore all the advice about taking care!"}, {"username": "Rosa Zordan", "comment_text": "Always feels terrible when this happens. Try not let it spoil your holiday. Whenever I travel I only have a money belt with cash and 1 card, photocopy of passport. No jewellery except wedding ring. All the rest I leave in safe at hotel. Not even my mobile."}, {"username": "Princess Queen", "comment_text": "I am european living in Europe,i was never in my life pickpocketed,it\nmust be something about you tourists that you are targets to pickpocketers,t\nhe way you dress so touristy i think,your dress scream from a distance i am American tourist"}, {"username": "Daniel Geiger", "comment_text": "Inevitable?!"}, {"username": "Jonalee Wilson Stephens", "comment_text": "Was the wallet in front or back pocket?"}, {"username": "Jan Armstrong", "comment_text": "Thx for posting. We had a near miss at Collosseo metro. Another distraction which, thanks to this Group, we recognised. Wallet was taken but dropped when we both shouted at lady in the metro carriage. As you said, everything inside my OH didn’t need to have brought as he used his phone and Apple Pay. Passports and money safe in my crossbody bag. Luckily much of Rome is walkable do we avoided the metro"}, {"username": "Lisa Moak", "comment_text": "What do you mean, \"playing with his show\"?"}, {"username": "Shannon Madison", "comment_text": "Sometimes It seems like people with the “theft proof” bags are the ones hit the most"}]}, {"id": "2210743282658083", "text": "Looking for recommendations to hire a boat to get us from Positano to Sorrento. Where do I start?", "link": "facebook.com/groups/1373361046396315/permalink/2210743282658083/", "likes": 1, "comments": [{"username": "Barb Krieg-Stepien", "comment_text": "https://\nwww.joebananalim\nos.net/\n\nGreat company!"}, {"username": "Marta Kleczkowska", "comment_text": "Bluestar Positano - Private boat tour"}, {"username": "Kally Trahearn", "comment_text": "Try this site: https://\nwww.directferrie\ns.co.uk/"}]}, {"id": "2210748625990882", "text": "How long does it take to drive from the Trevi fountain to the airport at 7am on a Sunday? Thx.", "link": "facebook.com/groups/1373361046396315/permalink/2210748625990882/", "likes": 2, "comments": [{"username": "Diana Bonifaci", "comment_text": "In August? To Fiumicino? I would say 45 mins"}, {"username": "Iris Garza", "comment_text": "Anywhere from 30 to 45 minutes. We stayed @Harry's Bar & Restaurant Rome- Trevi (less than half a block to the Trevi fountain) it took us 26 minutes to FCO T3 at 6:30 AM this past Monday."}, {"username": "Rose Turdo", "comment_text": "Google maps"}, {"username": "Laura Uribe", "comment_text": "It took us about 30 minutes at 5am on a Sunday."}]}, {"id": "2210720855993659", "text": "Hello, wanted to buy tickets for this Friday soccer game between Napoli and Apollon through TicketOne but I keep getting this error message when I want to check out. Any idea how to buy the tickets is really appreciated. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2210720855993659/", "likes": 0, "comments": [{"username": "Rita Scotto Epifanio", "comment_text": "Are you in Italy now? Go to wherever they sell tickets and buy them in person."}, {"username": "Carmela Noble", "comment_text": "I believe on certain sites you need to be a club member. Have you tried stub hub?"}, {"username": "Elena Innocenti", "comment_text": "Something wrong in the personal data of ticket’s owner."}, {"username": "Alessandro Iannelli", "comment_text": "first of all, whenever a person uses the word \"soccer\", a thousand kittens die of sadness. with that said, a possible reason is an error in the \"codice fiscale\", you have to select your country and then write EE1 in the \"codice fiscale\" box. you also have to identify yourself via otp, with your phone. if you have done everything correctly and it still doesn't work, you can contact ticketone with this online form: https://\nwww.ticketone.it\n/campaign/en/\ncontact-form"}]}, {"id": "2210735945992150", "text": "Planning on traveling with a carry on only. The airline we are on is very strict with weight of hand luggage, total is 7kg only. Which isn't a lot, But can manage on the outbound. We plan on buying stuff along the way so are thinking of checking in a bag on the return. Is is easy to buy a cheap duffle bag that will survive the travel? We will fly out of Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2210735945992150/", "likes": 5, "comments": [{"username": "Leslie Goodland", "comment_text": "Yes!"}, {"username": "Gena Diaco Penland", "comment_text": "Tons of little shops sell suitcases."}, {"username": "Iris Garza", "comment_text": "Absolutely! They are usually sold outside the train stations or the street vendor stands."}, {"username": "Samantha Mann", "comment_text": "Great question! Was wondering the same!"}, {"username": "Stacey Miller", "comment_text": "Can you just pack one within your big purse? Then no need to buy one!"}, {"username": "Stephen Henn", "comment_text": "Street vendors have the duffle bags in all sizes and cheap too. We stuffed our dirty clothes in it for return trip and then used a hard sided checked bag for wine & olive oil."}, {"username": "Norma McElroy Frisina", "comment_text": "Yes I’ve done this before . Me and my sister both had to buy an extra bag for all our purchases. We bought ours from street vendors near the Vatican . Very cheap and still have the bag and used a few times in the US ."}]}, {"id": "2210729089326169", "text": "Flying into Rome and will take a train to Florence.\nShall I buy a ticket to Rome Termini and then buy another ticket to Florence?\nOR\nBuy a ticket Rome airport (FCO) to Florence. There is a change in Rome termini have approx 25 mins. Is this enough time to change platforms? I know there is a train the goes directly from FCO-Florence but it is in the afternoon but my flight gets in around 7am and I don't want to wait around that long.", "link": "facebook.com/groups/1373361046396315/permalink/2210729089326169/", "likes": 4, "comments": [{"username": "Graham Sherlock", "comment_text": "Buy your ticket at the airport and jump on the next Leonardo express to termini, then get your ticket to Florence at termini or purchase it online as you're travelling on the Leonardo express. The only issue you may have is the Termini to Florence train you want may be full, but unlikely, if it is you will need to get a later one."}, {"username": "Jenny Payne", "comment_text": "I travel to Italy a lot and I use to take the train from airport to Rome termini and then I would buy my ticket to Florence as I use Italo train company mainly as they only use numbers 3,4,5 platforms and they are always easy to get there rather then running to all the other numbers 🌻"}, {"username": "Graham Sherlock", "comment_text": "Let the group know how you go."}]}, {"id": "2210712829327795", "text": "We are doing a rather last-minute trip to Italy in October for 14 days. We really want to see the Amalfi Coast but I have concerns about all of the steps and it being too much walking. Both are in our 70's - I'm fine but my husband has a few physical limitations with too many steps. Not sure where to start planning these 3 days so thought I would ask for suggestions Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2210712829327795/", "likes": 40, "comments": [{"username": "Ally Dickerson", "comment_text": "Skip Positano it is horrendous, absolutely tourist trap of a town, no decent food and it’s expensive, if you drive past it and see the view it will be enough.\nDefinitely recommend Sorrento, still feels like it has some culture left, it’s quite flat and has a lift down to the beach. I’d recommend getting a ferry around\nAmalfi is the same as Positano but a little flatter and a lot smaller, still lacking in actual Italian food or shops and the beaches aren’t nice\nAny particular reason it has to be Amalfi coast?"}, {"username": "Rita Bivona Morgan", "comment_text": "stay in sorrento center, it’s flat. ferries or buses can get you to the towns along the coast"}, {"username": "Fetchin Gretchen", "comment_text": "Many places have elevators but there is a fair amount of walking. Base in Sorrento and take ferry to other places like positano, Capri, Serrano, and bus along the coast from Sorrento to Serrano to minimize strain of walking."}, {"username": "Stephanie Osborn Rushing", "comment_text": "We are in positano now and it’s our favorite place so far. We are staying here though so can always go back to hotel to avoid day trippers. Or we booked a boat excursion and beach club to minimize crowds!"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Agree with a lot of above. We are in our 70s as well but we’re physically fit but stairs are stairs lol! Stay in Sorrento take the boat ride to see Positano and Almalfi ….￼ Go to Capri and take a taxi up to Anacapri and walk around that small quaint town. It’s pretty much flat."}, {"username": "Kejdi Okej", "comment_text": "Boat tours are the easiest but getting to the marina could be lots of steps depending on where you stay"}, {"username": "Nancy Lewis", "comment_text": "Go to Lake Como instead by train. The train ride is fantastic!\nSimilar vibe but much easier for the 70s group."}, {"username": "Valerie Collanton", "comment_text": "As others have said Sorrento is best for a base for your stay. If you arrive by Ferry you can take the elevator up to the main square to avoid the steps from the ferry. Then it’s flat walking in town. If you go to Capri take the funicular up to the main square. You can get a boat tour there that goes around the island. It’s beautiful ! Just be careful getting on and off the boat but they will help you. Enjoy !!!"}, {"username": "Pam Kimak", "comment_text": "I had concerns also and recently went to Maiori, about an hour south of Naples airport. We actually started out trip flying into Rome for 3 days, and took a train to Naples and J&J Transfer to Maiori, enjoyed the ride. Next time, we would just stay in Maiori..it's a wonderful town, with a nice main street perpendicular to \"Ocean Ave\" and cobblestone boardwalk, and near ferrys..no hills.. completely flat.We stayed at Hotel Panorama, and there are other hotels in area. I booked directly with hotel."}, {"username": "Bonnie Rupprecht", "comment_text": "There is so much more to Italy than Amalfi. Maybe stay relatively close and take a bus tour along the coast."}, {"username": "Kathi Connell Keller", "comment_text": "This is so helpful, we are also planning a last minute October visit. Thank you for the comments."}, {"username": "D Rochelle Milton", "comment_text": "Sy Sandblom"}, {"username": "Debra Kingston", "comment_text": "It is best to get a driver. I did a 5 hr tour and we walked the flat areas of Amalfi and Positano. Email the hotel and they can arrange it."}, {"username": "Marilyn Kedves", "comment_text": "Many, many steps. But wonderful!"}, {"username": "Susan Dolin Rothschild", "comment_text": "We are going in September and staying in Sorrento. Told there are a lot less steps!"}, {"username": "Linda Yanni", "comment_text": "Steps a problem? Do not go to Positano"}, {"username": "Sandy Sayers", "comment_text": "I loved Italy, this is one of the favorite things in my house!"}, {"username": "Christine Aird Craig", "comment_text": "Check out the Hotel Pupetto. It is at beach level with a fairly easy walk to town"}, {"username": "Raquel Millikin", "comment_text": "Agreed with Sorrento for a base! Make sure you go to IL BUCCO for supper!!! Best food of my life!\nTake boats to all the islands and boat around Capri. You can take tile convertible taxis in Capri as well to tour the island. Enjoy!! We are back in Italy again in September. My favorite place in the world!!"}, {"username": "Nancy Rae Woodbury", "comment_text": "Thank you all so much! Everyone has been so helpful."}, {"username": "Kathy Cash", "comment_text": "Is Positano all steps?"}, {"username": "Graham Sherlock", "comment_text": "Amalfi is hard work, you need to be fit, I'd rethink, much better places to go"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Stay in Salerno which is mostly flat in their centro storico. Take ferries to the Amalfi towns. They will be less crowded than the summer and will be winding down."}, {"username": "Jennifer Gustafson", "comment_text": "Amalfi is hills and steps, you need to be fit. Conca dei Marini is all steps (360 down to the beach) and ramps i walked a thousand lol. It is absolutely beautiful and so worth it to see, but it is a challenge."}, {"username": "Beverley Ford", "comment_text": "I went last October and in my late 60’s with feet n knee problems and was fine until I went to Pompeii as they have a lot of high stones and I pulled a muscle in my leg from going up and down constantly. We had walked all around Sorrento that morning first though due to an impromptu train strike that meant we couldn’t go until early afternoon so that didn’t help. Enjoy it’s amazing!"}, {"username": "Rosa Zordan", "comment_text": "I recommend picking a couple of places as base camp place like Sorrento or Mairoa and then use hotel recommended transport to explore. Remember if you get tired or too much for husband sit in a Cafe, have coffee's and pastries and enjoy the passing parade, then go again or taxi home to hotel."}, {"username": "Kimberly Jo", "comment_text": "I agree with Sorrento. The main square area is fairly flat and I remember there are a few hidden elevators in the rock faces to get down to some of the restaurants below the cliffs. The ferries will be able to being you to the neighboring islands like Capri, Amalfi and Positano. Enjoy🍋🥂"}, {"username": "Barbara Britschgi", "comment_text": "Go to Rick Steves site. He’s the expert on Italy"}, {"username": "Melanie Peterson", "comment_text": "I recommend an escorted tour as they make it easier than doing it on your own. That’s how I book my travel clients. That being said, you can do it on your own. But many of the sites have lots of stairs and uneven footing so no matter what you book, be careful. And definitely purchase a great travel protection plan!"}, {"username": "Karen Speziale", "comment_text": "Can anyone recommend what to see in Sicily? There's 4 of us, all 65,plus ages. Ty"}, {"username": "Fiona Mac", "comment_text": "Positano really steep\nAmalfi not as bad\nSorrento is OK if u keep to the centre but out and about is hilly\nThere is a lift to the beach/marina 1 euro each great service"}, {"username": "Lucrezia Folger", "comment_text": "It is steep as it's built into a mountainside. It is a trek even in good shape."}, {"username": "Paul Anderson", "comment_text": "Boat tours are the easiest but getting to the marina could be lots of steps depending on where you stay."}]}, {"id": "2210710879327990", "text": "Best places to stay in Rome / best way to get from airport to town? Also if you have been to Italy in March how is the weather?", "link": "facebook.com/groups/1373361046396315/permalink/2210710879327990/", "likes": 3, "comments": [{"username": "Sharon Menegoni", "comment_text": "I was there this past March. It rained one day, the remainder of our two weeks there, the weather was perfect. Temps were in the mid 60’s and sunny!"}, {"username": "Phyllis Snyder", "comment_text": "The Leonardo express - airport to town’s main station ."}, {"username": "Cheryl Swiatko", "comment_text": "From the airport to Rome, we took the taxi at the airport. 50 euros set price."}, {"username": "Amy French Baillie", "comment_text": "Taxi - your hotel may be able to help out.\nJust back. Loved staying in Trastevere- beautiful and full of life and easy to walk most places"}, {"username": "Jami van Wezel", "comment_text": "Leonardo express train from airport to rome termini station. 100% so easy and cheap"}, {"username": "Kejdi Okej", "comment_text": "The leonardo express Airport to town s main"}, {"username": "Renae Larcus", "comment_text": "Take Leonardo Express from the airport to Roma Termini"}, {"username": "Adeline Alex Tanfara", "comment_text": "Rainy"}, {"username": "Jennifer Moody Whitlock", "comment_text": "I stayed at Otivm in Rome. It was perfect with a gorgeous rooftop. Right in the city center.\nEverything is within a couple of minutes to 15 max walking.\nThe staff was wonderful."}, {"username": "Stephen Henn", "comment_text": "Leonardo Express at FCO (14€) or taxi (approximately (50€)."}, {"username": "Darcy Jessen", "comment_text": "We are currently here. Used Movin Rome to transfer from airport to hotel (45 euro) and staying at Della TorreArgentina.\nVery general location, breakfast is optional ; rooftop terrace with honesty bar. Lovely place"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2210708602661551", "text": "Can anyone suggest something special to do in Brindisi, don’t know anything about it but I will be there on my birthday in June and want it to be special", "link": "facebook.com/groups/1373361046396315/permalink/2210708602661551/", "likes": 0, "comments": []}, {"id": "2210707312661680", "text": "Top 5 day trips from Florence suggestions. I am debating between Cinque Terre and Sienna plus nearby towns. I can only do 1 day trip. So, please share your recommendations. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2210707312661680/", "likes": 2, "comments": [{"username": "Phyllis Snyder", "comment_text": "I’d go to Siena-"}, {"username": "Diana Himes", "comment_text": "Do the Tuscany day trip through walks of Italy (small group) or Walkabout Florence. Cinque Terre is a couple hours each way and waiting for trains or ferries between villages also eats up time. Having done MANY day trips from Florence, I just don’t feel Cinque Terre is the best use of time if you only get to do one day trip."}, {"username": "Kejdi Okej", "comment_text": "Thank you l will check out walks of italy them in rome"}, {"username": "Anna Buchan", "comment_text": "Both are beautiful but i would go to cinque terre"}, {"username": "Alice Engstrom", "comment_text": "San GImignano and Siena in a day... Easy."}]}, {"id": "2210697032662708", "text": "Where can you safely store luggage in Rome? Other than the train station ? We’re going to the Amalfi coast and would rather not carry luggage around there on the ferries. We are staying in Rome on the way back, ￼ but our hotel won’t keep the luggage while we’re not staying at the hotel", "link": "facebook.com/groups/1373361046396315/permalink/2210697032662708/", "likes": 1, "comments": [{"username": "Steve Grossman", "comment_text": "Traveling without luggage? Are you planning on going for the day? I hope that's not your plan"}, {"username": "Heather Sechrist", "comment_text": "Just for the day we used a “stow your luggage” location down the street from Termini. I have no idea how much it would cost for multiple days."}, {"username": "Cheryl Ann", "comment_text": "Download the app Bounce. It will give you options where to store your luggage around the train station."}, {"username": "Kejdi Okej", "comment_text": "Just for the day we used a stown your luggage location down the street from termini l have no idea how much it would cost fro multiple days"}, {"username": "Gillian O'Callaghan", "comment_text": "Try Stasher or Bounce apps 👍"}]}, {"id": "2210700285995716", "text": "What is the best option to acquire a sim card when arriving in Italy? Thanks a lot 🤗", "link": "facebook.com/groups/1373361046396315/permalink/2210700285995716/", "likes": 1, "comments": [{"username": "Marie Cunningham", "comment_text": "Buy from Holafly beforehand or on arrival. Unlimited GB and calls"}, {"username": "Darren Embley", "comment_text": "I bought two SIM cards from TIM in Rome. They were supposed to work throughout the EU but only worked for a few days in Rome and Athens and then no service."}, {"username": "Brice Blosser", "comment_text": "Look into your current service provider. I use what I appear have"}, {"username": "Paul Anderson", "comment_text": "Orange worked really well for us."}, {"username": "Daniele Zarka", "comment_text": "Would your phone take an eSim? If yes, Airalo is super easy to install and I paid 24$ for 30 days (and 10gb)"}, {"username": "Michelle Lacson", "comment_text": "If you can get your phone unlocked, Airalo eSIM 100%!"}, {"username": "Allan Olexa", "comment_text": "Buy an esim before you go then activate it as you arrive."}, {"username": "Antonio Aloè", "comment_text": "They might sell them at the airport otherwise at any shop of Vodafone or TIM or Wind,in Italy or you might find others such as Orange.Most used in Italy are Vodafone and TIM"}, {"username": "Beatriz Davalos Moreno", "comment_text": "buy orange, I looked at the airport in Barcelona and did not find a store, when we got to our Airbnb there was one little store right next to it, they are very common all over Europe, I paid 34 dollars for a 100 gigabyte, used it for 23 days, txt, messages, I posted on facebook, made calls to my kids in the USA and still had some left."}, {"username": "Rose Turdo", "comment_text": "Cellhire before you go"}, {"username": "Frank Hunt", "comment_text": "There are shops selling everywhere….."}, {"username": "Jenny Payne", "comment_text": "I use Tim company for my sim card"}, {"username": "Fetchin Gretchen", "comment_text": "Airport or local phone store. I prefer Vodafobe though there are several others."}, {"username": "Deborah Eaton", "comment_text": "Tom Chisholm"}, {"username": "Nancy Surprenant Leclair", "comment_text": "At the airport"}, {"username": "Eddy Zenga", "comment_text": "Get Airalo, it’s an app based Esim, I’m using now vacationing in the south of Italy, first time using it, so far works very well."}, {"username": "Jeff Ronald", "comment_text": "Used an eSIM from Airalo for data only. It worked well and was cheaper than using Verizon’s international plan."}]}, {"id": "2210696645996080", "text": "Venice italy 🇮🇹\n#italy #venice #venezia", "link": "facebook.com/groups/1373361046396315/permalink/2210696645996080/", "likes": 44, "comments": []}, {"id": "2210676875998057", "text": "Do most train stations in Italy have lockers for rent for luggage storage?", "link": "facebook.com/groups/1373361046396315/permalink/2210676875998057/", "likes": 2, "comments": [{"username": "Rebecca Martin", "comment_text": "Not all, and not all the time, esp the smaller ones."}, {"username": "Vivien Paulik", "comment_text": "Not all train station. The bigger ones, main one, bigger cities. But there are a lot of teain station without it"}, {"username": "Kejdi Okej", "comment_text": "Not all train station the bigger ones main one bigger cities but there are a lot of teain station without it"}, {"username": "Emily Frazzetta", "comment_text": "Not all of them do, it depends on the location but you can also look up “deposito bagagli” to see the closest ones. Sometimes even the bigger train stations are full so you can find alternatives for like 5€ a day per bag. Usually those that hold your bags are stores with some space in the back, they are all safe and my husband and I did it plenty of time 🙂"}, {"username": "Theresa Spare Proia", "comment_text": "Thank you for your replies, they were very helpful!"}, {"username": "Amelia Bonannella", "comment_text": "There’s also the “Bounce” app which will tell you where luggage lockers are located"}]}, {"id": "2210686979330380", "text": "Good Day to all - going to be in Venice on a Sunday morning. Is there an outdoor Catholic Mass held that someone could steer me to? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2210686979330380/", "likes": 0, "comments": [{"username": "Edoardo Casolo", "comment_text": "Outdoor?"}]}, {"id": "2210676085998136", "text": "I miss Italy🥰🇮🇹!", "link": "facebook.com/groups/1373361046396315/permalink/2210676085998136/", "likes": 4, "comments": [{"username": "Stefano Bressanelli", "comment_text": "Torbole ..wow"}]}, {"id": "2210670122665399", "text": "Trying to decide where in Taormina is a good place to stay!\nThanks so much", "link": "facebook.com/groups/1373361046396315/permalink/2210670122665399/", "likes": 12, "comments": [{"username": "Mat PO", "comment_text": "Belmond! Grand Hotel Timeo, Villa Sant'Andrea or (even better) both."}, {"username": "Stephanie Adams", "comment_text": "Hotel Villa Taormina, a lovely boutique hotel, friendly staff, rooftop view, close to all"}, {"username": "Lynne Meyer", "comment_text": "It’s very booked and super expensive right now."}, {"username": "Christine Chimi Inman", "comment_text": "Anywhere!"}, {"username": "Tracey Pino", "comment_text": "Hotel Villa Belvedere was a good place to base myself in June. U can get shuttle to beaches and walk distance to town. Also can walk to SAT bus station for tours"}, {"username": "Mariana Andrade Lima", "comment_text": "We stayed at Villa Britannia last June and had a wonderful time!"}, {"username": "D.N. Virgo", "comment_text": "Anyplace is probably good, especially if there are not many choices. We stayed at the Hotel Villa Schuler which was great, but they were booked solid. Couldn’t do all the dates we wanted. I’d search on Booking and then call them directly to see what they can do for you."}, {"username": "Sergio Milone", "comment_text": "If you are looking for a full apartment, right in the center of Taormina, I can recommend LacasadiAngelin\na Taormina. The owners are a lovely couple (Angelo Saglimbeni and Taty Vel)"}, {"username": "Janie Moore Kidd", "comment_text": "Hotel Mediterranean !Has a pool with a view and a great breakfasts Get a room with a balcony!!"}, {"username": "Beatriz Davalos Moreno", "comment_text": "Taormina is sooo beautiful!"}, {"username": "Suzanne Sorgi", "comment_text": "We did wonderful Airbnb\nSuperbe view\nGréât appartement\nFew steps from bus station"}, {"username": "Sharon Godino", "comment_text": "We stayed at unacapatoramina\nnot good very expensive, also stayed at villa Carlotta old and beautiful."}, {"username": "Christine Calleja", "comment_text": "It is :)"}, {"username": "Elizabeth Crombie", "comment_text": "Beautiful town. Very busy but I would love to stay there."}, {"username": "Sabrina Lisa", "comment_text": "ATA hotel capo Taormina ! Every year"}, {"username": "Andrea Corey Andrews", "comment_text": "Taormina is beautiful"}, {"username": "Lynda Petralia", "comment_text": "We stayed at the Una Capotaormina hotel. Very reasonable. Great buffet breakfasts and dinners by the beach. Beautiful beach was the setting in White Lotus series season 2. Very cool!"}, {"username": "Caron Marsh", "comment_text": "Just stayed at Hotel Villa Diodoro, great location & beautiful pool"}, {"username": "Brandee Cate", "comment_text": "When are you going?"}, {"username": "Patricia Hall", "comment_text": "I'm just researching now too"}, {"username": "Angelina Luppino", "comment_text": "We stayed at Eurostars Monte Tauro great view and location."}, {"username": "Wendy Anne Breuer", "comment_text": "Four seasons is incredible. The best stay i have ever had."}, {"username": "Lisa Giunta", "comment_text": "Anywhere!"}, {"username": "Hudd Cass", "comment_text": "We stayed at Grand Hotel Miramare in June. It was very good and central and quite reasonably priced! I think around 250 euro a night."}, {"username": "Christine Pelosi", "comment_text": "Yes🤗 you'll love it😉"}, {"username": "Ken Vecchia", "comment_text": "Many places to discover"}, {"username": "Rosa Morabito", "comment_text": "Hotel Casa Adele. Fantastic location. Run by the owner. Beautiful breakfast. Garage next door if you have a car."}, {"username": "Annette Del Pizzo", "comment_text": "Casa Adele small hotel we stayed in may faultless service food cleanliness. Wouldn’t stay anywhere else"}, {"username": "Gina Mannino", "comment_text": "Yes, try to go for a few days. it’s beautiful! Look up Hotel Casa Adele- it’s super clean, people who own it are very friendly, breakfast included, elevator up to the rooms if you need, they have parking if you request a spot. We loved it and we will stay there again when we visit!"}, {"username": "Chelda Dellise Kevorkian", "comment_text": "Hi Her Salty Kisses can you help this person out with your recommendations\nto stay in Taormina?"}]}, {"id": "2210674465998298", "text": "Hello, we have a very early 6 am flight from Florence in November. What recommendations for a hotel for the early morning flight?\nCity Centre ￼?\nTIA.", "link": "facebook.com/groups/1373361046396315/permalink/2210674465998298/", "likes": 0, "comments": [{"username": "Mike McClane", "comment_text": "And where to?"}, {"username": "Kejdi Okej", "comment_text": "And where to"}, {"username": "Valerie Collanton", "comment_text": "Florence airport is not far from city center. About 6 miles. So anywhere should work."}, {"username": "Virginia Lane", "comment_text": "I always stay by the airport, when I have an early morning flight."}]}, {"id": "2210664765999268", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2210664765999268/", "likes": 1, "comments": [{"username": "Dr-Jon Warnecke", "comment_text": "Location???"}, {"username": "Greg Hamilton", "comment_text": "Val d'Orcia? Photo taken from the Gladiator scene lookout?"}, {"username": "Kejdi Okej", "comment_text": "Location ???"}]}, {"id": "2210664062666005", "text": "hope one of my friends here can help me\nI’m in need of a taxi from Cetera to Salerno but can’t seem To find a taxi driver to do this reasonably as it’s a short drive (4 kn)\nCan anyone help?\nI have tried google with no luck", "link": "facebook.com/groups/1373361046396315/permalink/2210664062666005/", "likes": 0, "comments": []}, {"id": "2210662429332835", "text": "Hi in Amalfi from 24th Sept to 30th sept with a 2.5yr old. Looking at renting a car.. will it be feasible?", "link": "facebook.com/groups/1373361046396315/permalink/2210662429332835/", "likes": 5, "comments": [{"username": "Steve Grossman", "comment_text": "To the best of my knowledge, there are no car rental places on the entire peninsula. You would need to rent one in naples I believe. But in amalfi You have the transportation hub. Bus, Boat, Uber, Taxis. You shouldn't have problems going anywhere you want to go"}, {"username": "Toni Green", "comment_text": "I wouldn’t do it. The street is very winding and close to edge."}, {"username": "Rachael Richardson", "comment_text": "Would not drive on those roads in Italy ! Dangerous"}, {"username": "Lisa Akira", "comment_text": "I heard they were restricting cars on Amalfi roads to every other day because of overcrowding. For example: If your plate ends in an odd number you get M, W, F. If even T, Th, S.\nRealize the roads are steep and very winding. Often narrow. Unless you are very experienced it’s pretty risky. There is ample public transit and then you don’t have to worry about driving schedules or parking."}, {"username": "Brice Blosser", "comment_text": "Reconsider and good luck"}, {"username": "Jennifer Avrett", "comment_text": "Yes, there is a big area with rental car companies just outside the Naples airport"}, {"username": "Laura Uribe", "comment_text": "A bus driver drove off the edge and was killed a few months ago. It is a very narrow road and as a car you may have to back up multiple times to allow buses through a turn. And you will have to drive within inches of a bus to avoid going over the edge. Is that really something you want to attempt with your child in the car?"}, {"username": "Jose Velez", "comment_text": "In Positano you have next to a church a parking (they park the car). Amalfi there is a public parking in the rock mountain with a tunnel access to the town"}, {"username": "Julie Atkinson", "comment_text": "DO NOT rent a car for the Amalfi coast. It’s not the place to drive in Italy if you’ve never been, especially with a young child. Roads are very tricky. Consider a private driver. Trip Advisor and I recommend Benvenuto Limos. Worth every penny."}, {"username": "Phyllis Flowers", "comment_text": "Yes we rented outside of amalfi sorrento I believe"}, {"username": "Robert Baumann", "comment_text": "ITs pricey,plus make sure you have a place to park it, parking very expensive in towns and cities..."}, {"username": "Eliz Fragoso", "comment_text": "Take the train 🚂"}, {"username": "Jill Mason", "comment_text": "Those roads are insane. Don’t drive if at all possible. Lots of other choices of transport."}, {"username": "Lexington Niteli", "comment_text": "Do not drive high in a rental car in Amalfi with a 2.5 yoa. Punctuation counts🤣"}, {"username": "Lucrezia Folger", "comment_text": "NO."}, {"username": "Sherri Leis Dillavou", "comment_text": "Driving in Italy is not for the faint of heart"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Geoff Roush", "comment_text": "🤙"}, {"username": "Linda Wallace Smith", "comment_text": "Take the bus to get around. You don’t want to drive the Amalfi coast. Plus parking is a challenge."}, {"username": "Suzanne Mills", "comment_text": "NO"}, {"username": "Barbara Beer Brown", "comment_text": "Difficult driving even for the best of drivers. Narrow winding roads on cliffs overlooking the sea. It’s beautiful as long as you don’t have problems with heights. But with 2.5 little one I would hire a car, take a bus or a boat from Naples. Also I would make reservations ahead of time for whatever mode of transportation you decide. We drove down from Rome (with a driver) stopped in Naples (which we had absolutely no use for) and of course Pompeii. The drivings not bad until after Pompeii."}, {"username": "Anita Lawrence Mundy", "comment_text": "Of course."}, {"username": "Rosa Zordan", "comment_text": "Yes but hire a sitter and enjoy yourself. I would never drive with a child on board."}, {"username": "Allan Olexa", "comment_text": "Where are you going to drive? Amalfi has one narrow, crowded coastal rode to Napoli."}, {"username": "Laura Ragusa", "comment_text": "Do not rent a car the traffic is literally impossible there. Take water taxis"}]}, {"id": "2210659609333117", "text": "Praiano in October. We have 2 day Pre and post … what should we do, where should we go?", "link": "facebook.com/groups/1373361046396315/permalink/2210659609333117/", "likes": 0, "comments": []}, {"id": "2210659605999784", "text": "First time traveling to Italy and Europe so I’m not sure how things work when you return to the US. My return flight takes us to the Atlanta USA airport and we have one hour and a half for our 2nd flight to Florida. Do we get our luggage and go through customs in Atlanta and if so is an 1 hour and a half enough time to make it to our second flight? What is the procedure? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2210659605999784/", "likes": 3, "comments": [{"username": "Heath Conn", "comment_text": "If you are able, life will be much better if you clear customs at your final location."}, {"username": "Kejdi Okej", "comment_text": "We just had a 2 hour layover in atlanta from rom you do collect your bags and go through customs we had global entry so that helped woud say we got"}, {"username": "Virginia Lane", "comment_text": "Download the Mobile Passport app. You get in a faster line."}, {"username": "Valerie Collanton", "comment_text": "I flew through Atlanta returning from Italy last October. It was very fast through customs. Passport control is more iffy depending how long the lines are. 1.5 hours is probably enough time but it is cutting it a little close. I try for two hours minimum."}, {"username": "Iris Garza", "comment_text": "It's a tight connection, but doable. When you arrive in Atlanta you will have to go through customs ( if you are eligible & have acces to the MPC app fill out your info prior to arrival & this will save you tons of time. We literally walked up to the Customs station & were in and out in less than 2 minutes) once you go through customs you then proceed to retrieve your checked in luggage at the assigned luggage carousel (if any). You have to go through security (it's faster if you have TSA precheck) and then proceed to check in your luggage (if any) Finally, make your way to your next gate."}, {"username": "Iris Garza", "comment_text": "This is the info on requirements for eligibility to the MPC app.\n\nhttps://\nhelp.cbp.gov/s/\narticle/\nArticle-3693?lan\nguage=en_US"}, {"username": "Cheryl Barowski", "comment_text": "Tbh I do not think it’ll be enough time, even with global entry. You’re going from arriving international to having to get to the domestic section of the ATL airport. I would say even 3 hours is bare minimum."}, {"username": "Fei Dadulla Miranda", "comment_text": "Usually you would have to clear customs at your point of entry into the US."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "I just did this in DC - it’s not terrible as long as you have time. We went through passport control, got our luggage and then dropped the luggage off again, it wasn’t far to drop off. Then proceeded to our connecting gate."}, {"username": "Andrea Rhodes Harris", "comment_text": "That will be a tight connection especially if there are any delays at all. We have gotten through customs quickly only to have to wait 30 more mins for our bags to come off the plane. If you do carryon only it will eliminate some time and make it an easier connection."}, {"username": "Ericka Blanco", "comment_text": "Please 1.5 hrs is too short of a time I learned the hard way 😔"}, {"username": "Allan Olexa", "comment_text": "That schedule is way too tight. You will land in Terminal E or F, go through passport control, have to wait for your luggage, have to take your bags for recheck, walk to the Airtrain, go to your connection terminal, then walk to your gate. I do this several times a year in ATL. I don't think you'll make it in 90 minutes."}, {"username": "Rose Turdo", "comment_text": "Not enough time."}, {"username": "Charlene Noll", "comment_text": "Ask the airline when you check in if luggage is checked to final destination. I’ve not had to get and recheck my luggage for a US connection, only in Japan.\n\nThe new MPC app saved me an hour in Washington DC and it’s free"}, {"username": "Dianne Ellis Patureau", "comment_text": "I wouldn’t want a 1.5 hour layover in Atlanta even for domestic flights. I’ve flown thru ATL hundreds of times and that is cutting it close. Plus you arrive in the international terminal and will most likely have to take the train to a different terminal for your FL flight."}, {"username": "Michele Liggett", "comment_text": "Download Mobile Passport Control App. You complete some of the customs questions and get through customs quicker."}, {"username": "Suzie LG", "comment_text": "If you have Global Entry you will pass a line of 400 people in Atlanta for reentry into the USA!"}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "Book it as a connecting flight to skip having to get your luggage twice. It might be tight. It depends on how quickly security and customs is"}, {"username": "Don Bentivoglio", "comment_text": "It's very tight and everything has to be in sync for it to happen. The plane has to land on time, no delays on the taxi way, bags have to come off quickly, no long lines at immigration and your next gate can't be on the other side of the airport."}, {"username": "Lucia Cefalu Dilg", "comment_text": "What is the difference in TSA preck and Global Entry?"}, {"username": "Ray Haneski", "comment_text": "Entered US in Boston from rome with carryon, no one checked our luggage but the passport agent did ask if we had anything to declare. Exited that terminal and went through tsa to get to the elusive terminal A for our flight to Florida"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Not sure about the baggage because we only dud carry-on, but it took us a little over an hour at JFK to go through customs. If you have to wait for luggage in addition to customs, you'll never make it."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "Do you have TSA pre check?\nLast year coming back from an international flight we made it through customs pretty quickly. It was when we climbed the stairs to get through regular airport security that we knew we were going to miss out flight. The line was across the airport. After that I bought TSA pre-check to cut the line. It just depends how busy the airport is and how quickly they are moving"}, {"username": "Diane Plott Miller", "comment_text": "Download this app. A friend just used it and it worked well for her."}, {"username": "Kathy Wilkey Smith", "comment_text": "Your 1st point of entry, if you have a connection, is when you must have luggage and proceed to customs and then re check it again for next flight."}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Angelina Dattini", "comment_text": "Yes, you should have enough time. I have gone through Atlanta many times after transatlantic flight."}, {"username": "Samantha Edmonds", "comment_text": "I wouldn’t chance it. I hear so many complaints about that airport. And if the gates are far apart could be unmanageable."}, {"username": "Charlotte Perry Henrichs", "comment_text": "Not unless you have Global Entry. I recommend it. U could stand in customs longer than that."}, {"username": "Heather Hills Jacobs", "comment_text": "Get Global Entry!! It will save you so much time!!!"}, {"username": "Sharon Menegoni", "comment_text": "Yes, you will have to go through customs in Atlanta, an hour and a half might be a tight connection"}, {"username": "Eric Parks", "comment_text": "I wouldn't want a domestic connection at Hartsfield with 1.5 hrs much less international"}, {"username": "Luciane H Azevedo", "comment_text": "You always go through immigration and customs at the first port of entry! So when you get to Atlanta, you first go through immigration, wait for your bags, go through customs and recheck the bags! Your bags will most likely be tagged all the way to Florida anyway, but you need to handle them back to the airline once you get out of customs! It’s easy and very simple! Once you’re done with that, you go through regular airport security (tsa) one more time and then proceed to your next gate!"}, {"username": "Susan Morlan", "comment_text": "You will go through passport control, then claim luggage from carousel, then walk through customs, then re-check your luggage for next flight. Then get on train to get to the terminal for your next flight. 1.5 is do-able if everything goes perfect. No room for error."}, {"username": "Mary Ann Baird", "comment_text": "We just had a 2 hour layover in Atlanta from Rome. You do collect your bags and go through customs. We had global entry so that helped. I would say we had about 30 minutes once we got to our gate before our fight boarded so it may be tight if your plane is delayed any leaving Europe."}, {"username": "Angela Dempsey", "comment_text": "We changed our flight for that exact reason. Not enough time in Atlanta"}, {"username": "Susan Ramirez", "comment_text": "I have the same situation when I fly back but in Chicago. Now I’m nervous. So they don’t transfer the luggage? We have to get it and do security again??"}]}, {"id": "2210648682667543", "text": "We staying in the Best western outside of Rome(tour group). Would it be safe for 2 ladies to travel by train back to the hotel at night time? Anyone else travel at night using public transport?", "link": "facebook.com/groups/1373361046396315/permalink/2210648682667543/", "likes": 0, "comments": []}, {"id": "2210621496003595", "text": "Hi all, my wife and I have 4 days in mid September on the Amalfi coast staying in Amalfi. We’d love recommendations for what to do, great restaurants and beaches. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210621496003595/", "likes": 1, "comments": [{"username": "Bernadette McKay", "comment_text": "Take taxi to hilltop village of Ravello it’s magical my hubby proposed there in the gardens of the villa Ruffolo\nTake ferry to Sorrento"}, {"username": "Judy Orloff", "comment_text": "Capri is a must! Heaven on earth!"}, {"username": "Dianne Ellis Patureau", "comment_text": "Take the Lemon Tour in Amalfi!!"}]}, {"id": "2210432012689210", "text": "Looking for a private driver to go from Puglia to Bari (in a day) that would make a few stops along the way. Any companies or suggestions would be greatly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2210432012689210/", "likes": 0, "comments": [{"username": "Heather Hills Jacobs", "comment_text": "We used Venice Group Services! Give Domenico a call to see if he can arrange something for you!!"}]}, {"id": "2210194022713009", "text": "Hi we are planning to go to Italy for 2 weeks in November covering Milan, Venice, Florence and Rome. Will November be very cold? Is it easy to move about in trains with luggage between cities? What is best way for sightseeing Florence and Rome etc? Do I need to plan each day and book day trips in advance?", "link": "facebook.com/groups/1373361046396315/permalink/2210194022713009/", "likes": 0, "comments": [{"username": "Paul Anderson", "comment_text": "Some people pre book everything and run around on a tight schedule. I go on vacation and look forward to having no schedule at all. There is always a way to see what you want to see. good example is the louvre in Paris booked up for days. I went there volunteered to push a person in a wheelchair around. I got in for free and didn’t have to wait in any lines. We also became good friends. Double bonus."}, {"username": "Alicia Burno", "comment_text": "I recommend you to book for the coliseum and the Vatican if you are planning to visit them. The other ones you can get them the same day. Trains are pretty easy to get tickets, even for the same day, I go to the italotren office and the people are very helpful, they help me getting the tickets."}, {"username": "Leslie Goodland", "comment_text": "Lots of luggage on trains isn't easy. They don't give much time to board/\ndisembark and trains can be crowded. I booked my shorter rides a couple of days in advance or the night before. That way I knew what time I had to be at the station. I used Rome 2 Río, my ticket was downloaded to my phone which made everything easy.\nFor the more popular sights, book those in advance, although you shouldn't have too much trouble in November. For that I used Get Your Guide, also went to my phone.\nSpend plenty of time in each city and count a travel day as more or less a full day. I was able to leave my luggage at a hotel if I got there earlier than check-in. Google Maps was a lifesaver, also download Whatsapp of you don't have it already. I was in Italy April/early May, PM for more details if needed."}]}, {"id": "2210171566048588", "text": "I’m just here to say to allll of the Italian people here- i absolutely LOVE your country and all of the people. Your are warm kind an so welcoming. And in fact if anyone from Italy wants to adopt me- I’m in!\n😉", "link": "facebook.com/groups/1373361046396315/permalink/2210171566048588/", "likes": 114, "comments": [{"username": "Jennifer Lynn Davis", "comment_text": "I completely agree!"}, {"username": "Nóra Fonyogábné Zsebeházy", "comment_text": "I never thought of being adopted. But I like your idea :-)"}, {"username": "Gianni Pompilio", "comment_text": "Please clarify:\n1. You will drop the guy that is in every single pic of yours\n2. You will learn to make pasta\n3. You will learn to move your hand in sync with your mouth when talking\n4. You will learn to speak at a volume that seems you’re having an argue everything you saying.\n\nIf so…we can consider it 🤣🤣🤣"}, {"username": "Kejdi Okej", "comment_text": "I never thought of being adopteb but l like your idea"}, {"username": "Anna Barraza", "comment_text": "I'm right there with you! I want to be adopted, too!"}, {"username": "Luisa Ravenna", "comment_text": "Thank you!!!!!"}, {"username": "Paula Brink", "comment_text": "Me too! 🙋🏼‍♀️"}, {"username": "Carola Blödgen", "comment_text": "Me too"}, {"username": "Ri Nata", "comment_text": "Ri Nata"}, {"username": "Dixie Kotylak", "comment_text": "Dixie Kotylak"}, {"username": "Renae Larcus", "comment_text": "Marina Bohrer, I’m first in line!!😄"}, {"username": "Sheila Anthony", "comment_text": "I am up for adoption by the Italian people too!! Just got home from a fabulous trip and planning the next! Love Italy, love the people, the food and the wine!"}, {"username": "Lorraine Christina", "comment_text": "Lorraine Christina"}, {"username": "Frann Todd", "comment_text": "I have 3 weeks before I am in Italy . . . I want to be adopted, as well!! I love cooking and baking, but may have trouble with moving my hands and my mouth at same time!!"}, {"username": "Francesca Sterzi", "comment_text": "Thank you very much, as an Italian I feel honoured. Please, keep on bringing your smile and positivity to my beloved Country! Italy loves you! 😊🇮🇹"}, {"username": "Daniela Benzoni", "comment_text": "Daniela Benzoni"}, {"username": "Patrizia D'Arcangelo", "comment_text": "I'm Italian. Are you American?\nI am willing to adopt an American but the American must adopt me.\nMy dream is to go to America and spend a lot of time there.\nSeriously, thank you for your love for Italy.\nYou're welcome ❤️"}, {"username": "Donna Harrison", "comment_text": "I joke all the time to my kids if l ever leave your Father you’ll find me in Italy 🇮🇹 ❤️"}, {"username": "Joanne LeGatt Danyliuk", "comment_text": "This is a beautiful post!!❤️"}, {"username": "Gloria Di Francesco", "comment_text": "Thank you 🧡🧡"}, {"username": "Jen Lim", "comment_text": "me,too. i will have to practice talking and moving my hands all at the same time, and also finding the right time to say \"allora\" 🙂"}, {"username": "Jo Just-Jo", "comment_text": "Me too ❤️🇮🇹❤️🇮🇹"}, {"username": "Lianet Benítez", "comment_text": "Ah yo también! Adopte un cubano salve una vida! Y los más importante!!(🤌)"}, {"username": "Enas Mourad", "comment_text": "+ 1 please if any Italian wants to adopt an Egyptian 😂 the love for this country and its people is endless and it’s the only place I leave with a heavy heart, loads of love ♥️"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2210735489325529", "text": "Hi can anyone tell me does the amalfi coast close on the 1st of November?", "link": "facebook.com/groups/1373361046396315/permalink/2210735489325529/", "likes": 2, "comments": [{"username": "Janet Lawrence", "comment_text": "No"}, {"username": "Paula Bodden", "comment_text": "I think I would be inclined to contact one of the hotels in your area of interest via email with questions. I’m sure they would be happy to provide information."}, {"username": "Ralf Eisermann", "comment_text": "The coast itself?"}, {"username": "Yvonne Donnellan", "comment_text": "No"}]}, {"id": "2210645582667853", "text": "I’m thinking of taking my 14 and 16 year old granddaughters to Italy. (7/9 days) Any suggestions on a possible tour group for their ages. We would like to include Rome and Venice but also other areas that teenagers would enjoy. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2210645582667853/", "likes": 3, "comments": [{"username": "Lora de Vries", "comment_text": "It is probably better to ask them what their interests are and start from there. A tour for their age group, may not be for them. Not all kids like the same things. What would they like to do? If you put in their interests on the web, you may be able to come up with a lot of ideas this way. It is very thoughtful of you to bring your grandkids on a special trip."}, {"username": "Deborah Clegg-Wolfe", "comment_text": "Railbookers.com\n. You can customize your trip if want"}, {"username": "Tara McCloud Odebrecht", "comment_text": "We did the family Rick Steve’s tours. They are more than just Italy but it was fantastic and there were grandparent / kid combos on both. I think they just have one now, but highly recommend."}, {"username": "Debbie DiOssi", "comment_text": "I took my 14 year old granddaughter in March. We went to Florence and Bologna. She loved Florence!"}, {"username": "Brian Osman", "comment_text": "Check into EF Go Ahead tours, they are great and handle everything"}, {"username": "Joanne-Peter Hart", "comment_text": "We have just finished a Trafalgar ‘Italian Holiday’ and there were several families with children ranging from 8 to my 22 year old son, mainly teenagers. They all loved it and I highly recommend Trafalgar Tours. I will point out it is summer holiday time in the States so that increased the number of families as 3/4 of the tours, and all families except ours, were from the States."}]}, {"id": "2210611092671302", "text": "Trying to plan a week in Bolzano in early December. Flights available to Milan, Turin & Venice. What is best way to travel. I dont drive. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2210611092671302/", "likes": 1, "comments": [{"username": "Pao Magnoler", "comment_text": "Venice Marco Polo is the best way."}, {"username": "Debora Mazzierli", "comment_text": "Train"}, {"username": "Lisa Akira", "comment_text": "Use the trains. I found them very easy and efficient."}, {"username": "Andrea Bainbridge", "comment_text": "Download the Trenitalia App. Easy from Milan or Venice"}]}, {"id": "2210603089338769", "text": "Any recommendations for accomodation in Como?\nThanks 🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2210603089338769/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187834-d5571\n21-Reviews-Hote\nl_Il_Perlo_Pano\nrama-Bellagio_L\nake_Como_Lombar\ndy.html"}, {"username": "Beth Searight Millar", "comment_text": "I stayed at Hotel Il Loggiato Dei Serviti and found it very nice. It is close to the train station and a little way from the centre but easily walkable."}, {"username": "Clint Foster", "comment_text": "Any way to get there from Milan without driving?"}, {"username": "Beth Spiehler Selvia", "comment_text": "Hotel Villa Marie in Tremezzo"}, {"username": "Justin Palyu", "comment_text": "Albergo Milano"}]}, {"id": "2210600949338983", "text": "Which are the best catacombs to see in Rome and Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2210600949338983/", "likes": 0, "comments": []}, {"id": "2210585459340532", "text": "How strict is the carry on policy for local airlines? Trying to fit 12 days into a travel backpack (40 liter) and looking at one that is 1/2\" over the 22\" carry on limit.", "link": "facebook.com/groups/1373361046396315/permalink/2210585459340532/", "likes": 7, "comments": [{"username": "Alice Dzimiera", "comment_text": "I flew on United to Rome recently & I saw them making people check carryons including large backpacks. I traveled for work for a few years & people take way too much carryon now! That's one of the things that makes boarding take so long"}, {"username": "Lisa Adams Robertson", "comment_text": "It would probably be OK, but even if you meet the restrictions they can gate check your bag. I wouldn't risk giving them another reason, just in case."}, {"username": "Pat Francis Moslow", "comment_text": "They measure and weigh."}, {"username": "Alicia Burno", "comment_text": "I am doing 15 day trip with a carry-on and a backpack."}, {"username": "Kerri Bevilacqua", "comment_text": "Cinch it up good and don’t overstuff it and they will most likely not bat an eye. As long as it squishes into the sizer you should be ok. I took a 40L Osprey last summer and didn’t have any issues. Flew United and Lufthansa. Also be aware of any weight restrictions"}, {"username": "Charlene Noll", "comment_text": "Witnessed a couple struggling, they squeezed their roller bag into the metal sizing box and couldn’t get it out 🤦🏼‍♀️. The guy was turning the sizing wrack upside down. Not sure how they got it out."}, {"username": "Heidi L Nunez", "comment_text": "I did 14 days in an adidas ( school size) backpack and didn’t have any issues."}, {"username": "Terri Gliatti", "comment_text": "Nice thing is they may check it for free?"}, {"username": "Dominika Varga", "comment_text": "Take a pillowcase and fill it up with clothes. I went to Tenerife for 2 weeks with a small backpack and a pillow full of cloth🤣 they let you take the pillow on board."}, {"username": "Patty Crowther Pearce", "comment_text": "Traveled from Munich to Norway last year, onward flight Lufthansa and return Iceland Air. I had a travel backpack, my husband a small (carryon) roller bag. We were fine on Lufthansa but my husband paid $75 at the gate for the Iceland Air. If you are pushing the envelope, (as my better-half did 😉), just be prepared as you never know."}, {"username": "Bonnie Loftspring", "comment_text": "Short answer Strict! You might get lucky but foolish to plan on it"}, {"username": "Michele Liggett", "comment_text": "We are wondering the same thing. We have a hardside carryon that is 1/2\" too tall counting wheels. We're putting an air tag in it in case they make us check it."}, {"username": "Sue Allanby", "comment_text": "Don’t do it! Just check it in!"}, {"username": "Alicia Cox", "comment_text": "I think in addition to airline, & agent, it may depend on how full the flight is. Use air tags for sure. If you are flying within Europe, the requirements are often different in a more restrictive way."}, {"username": "Gillian O'Callaghan", "comment_text": "Very strict everywhere at the moment so just take what you need and be prepared for it to be checked."}, {"username": "Christy Arneson", "comment_text": "Have you tried the zippered compression bags to go into your backpack?"}, {"username": "Russ Whitley", "comment_text": "If your used to flying in the US you’ll be disappointed by carry on in other parts of the world. They know what US travellers are like and are pretty strict, though nice about it."}, {"username": "Amanda Ying Hwang", "comment_text": "Some will make you weigh it so even if the dimensions fit for carryon, if it exceeds the carryon weight limit, they’ll make you check it."}, {"username": "Allison Mir", "comment_text": "Very"}, {"username": "Lucrezia Folger", "comment_text": "You never know who you will get at the ticket counter or going through security, impossible to predict."}, {"username": "Olga Plitt", "comment_text": "Whats the problem?. All international flights allow one check bag and one carry on at no cost.I go hiking multiple times a year to Europe check one in."}, {"username": "Sherri Leis Dillavou", "comment_text": "Lufthansa to Italy from Chicago was fine with it but from Italy on the way back had to check it"}, {"username": "Lori Greco", "comment_text": "Strict"}, {"username": "Shari Hollander Baron", "comment_text": "Does anyone have experience with SAS airlines?"}, {"username": "Pat King", "comment_text": "We flew American in June Rome-JFK. My son's carry on was the Away \"larger\" carry on suitcase. The agent made him put it in the sizer and it just fit perfectly. The rest of us had the regular Away carry on cases and apparently the agent could tell the difference because she did not ask any of us to use the sizer."}, {"username": "Pegi Fuller", "comment_text": "When going through Heathrow a few years ago, you were restricted to 1 carry on bag including a purse. Everyone was jettisoning everything that wasn’t essential to fit their purse into their 1 bag"}, {"username": "Jill Kalman", "comment_text": "Is a 20” carry on within size limits?"}, {"username": "Jon P Teconchuk", "comment_text": "Strict!"}, {"username": "Cee Esperance", "comment_text": "Check the carry-on luggage dimension requirements by which ever airline(s) you are flying with. All the important, must-have items and a change of clothes for 2 days and 1 sleepwear I put in my backpack just in case they ask me to gate check my carry-on luggage and it gets lost."}, {"username": "Annette Bertram", "comment_text": "If it’s a backpack, 1/2 inch can be squished in. If it’s a hard sided suitcase then that’s another story."}, {"username": "Anna Gambino", "comment_text": "Always depends on the airline."}, {"username": "Amy Kaye", "comment_text": "You never know if flight is packed and they may require you to check your carry on."}, {"username": "Iris Garza", "comment_text": "Agree, it depends on the airline. We took a trip to Paris from Milan with Easy Jet and the agents at the gate were inserting bags small luggage into the metal box used to measure. On the way back via Air France, everyone just got on with no measurements of their bags..."}, {"username": "Doug Burke", "comment_text": "\"Depends on the airline\" and the mood of the agent at the gate. If he/she just won an amount in the lottery, you're probably good. OTOH if he/she just found out their partner is sleeping around, plan on the bag being checked."}, {"username": "Laura Fournier", "comment_text": "It may depend on how full it is. If it is over the limit but not full and you can squish it down? Are you flying first or premium where bin space is guaranteed?"}, {"username": "Stuart Parnell", "comment_text": "Count on it being a problem."}, {"username": "Jessica Stewart", "comment_text": "I believe it’s 21” or at least ita it is"}, {"username": "Irma Hurlbert", "comment_text": "Flew recently and they had you place the carryon in a sizer. If it didn’t fit, they took it to check it. Those that did fit, they placed a tag on it as having been checked for size compliance"}, {"username": "Denise Ward", "comment_text": "Sometimes that 1/2\" is enough to not fit in overhead compartment."}, {"username": "Fiona Mac", "comment_text": "Easyjet are strict I had to pay extra when travelling to naples"}, {"username": "Becky Reed Bushkuhl", "comment_text": "Better safe than sorry 😞"}, {"username": "Anthony Martini Jr.", "comment_text": "Strict!"}, {"username": "Robin Anderson-Keller", "comment_text": "Worse case they'll have you check it, I say go for it!"}, {"username": "Fetchin Gretchen", "comment_text": "Last several flights almost all economy had to check any wheely bags. And they do weigh them...with strict weight limits. Hit or miss on measurements though."}, {"username": "Angela Marsala-Gaydos", "comment_text": "We were traveling back to the US from Barcelona on American and they measured someones carry on and made them check it."}, {"username": "Stuart Parnell", "comment_text": "For what it’s worth I did 19 days in Europe last year with a hard shell roller that fit the carry on rules. And a smaller backpack."}, {"username": "Alexandra A Welker", "comment_text": "They are pretty strict."}, {"username": "Margaret Fanelli-Granger", "comment_text": "I just packed 14 days of clothes etc. in a carry-on suitcase and used a “travel backpack”” for shoes, and toiletries. It worked out great. ￼"}]}, {"id": "2210567566008988", "text": "Recommendations on where to hire a mini van in Catania with drop off in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2210567566008988/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Stephen Henn", "comment_text": "I didn’t see a lot of mini vans in the car rental lots. There were bigger passenger vans (like Ford Transit) or SUVs."}]}, {"id": "2210552266010518", "text": "Looks like Vatican tickets are all sold out for when we are there in October. What are my chances of lining up and getting tickets on the day ? Or try a third party?", "link": "facebook.com/groups/1373361046396315/permalink/2210552266010518/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Rome/\nVatican-Museums-\nSistine-Chapel-\nBasilica-Entry-\nskip-the-line/\nd511-21175P39?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Mike Crawford", "comment_text": "Tickets come out 30 days in advance.\nSo in September, book your tickets."}]}, {"id": "2210547176011027", "text": "Suggestions for accommodation (family of 4 - need 2 rooms, 3 beds) in Cinque Terre. Which town is best to stay close to beach.\n\nAlso how easy is it to travel to other regions in Tuscany for wine tasting etc from CT.", "link": "facebook.com/groups/1373361046396315/permalink/2210547176011027/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187820-d5649\n68-Reviews-Hote\nl_La_Spiaggia-M\nonterosso_al_Ma\nre_Cinque_Terre\n_Italian_Rivier\na_Liguria.html"}, {"username": "Renae Larcus", "comment_text": "Monterosso. Bigger, more signing options and a beach."}, {"username": "Amanda Rogers", "comment_text": "Definitely Monterosso ❤️"}]}, {"id": "2210546789344399", "text": "Hello!\n\nMe and my partner are traveling to Italy in October 1st week for 5-7 nights and looking for recommendations, we plan to stay in Sorrento:\n\n• We plan to travel to go to Positano, Amalfi and Capri - how do we travel to these places without a car from Sorrento?\n• Any recommendation on where to stay in budget in Sorrento? Also looking for something centrally located.\n• Absolute must-dos in those places?\n• Weather in October?", "link": "facebook.com/groups/1373361046396315/permalink/2210546789344399/", "likes": 0, "comments": [{"username": "Karol Sabat Hoffman", "comment_text": "Villa di Sorrento. Its in the center of the city, they offer the breakfast. And they arrange for you the tours to Capri, Amalfi and Sorrento! 💯"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2791\n84-Reviews-Gran\nd_Hotel_Riviera\n-Sorrento_Provi\nnce_of_Naples_C\nampania.html"}, {"username": "Kejdi Okej", "comment_text": "Villa di sorrento lts in the center of the city they arrangre for you the tours to capri amalfi and sorrento 100"}]}, {"id": "2210523356013409", "text": "Just wanted to pass along info on a great little tour, the Rome Twilight Trastevere Food Tour. After a 10-hour flight from the US and arriving in Rome the next day, we wanted an activity for later in the day that would be both relaxing yet keep us active so we could (hopefully) be able to sleep that evening. The tour was small group (12) and went from 5:00-9:00. We had a charming and engaging host who took us to 7 different locations to sample various Italian dishes, accompanied by a nice pour of wine, and the last stop was for delicious gelato. Our small group were folks from all over the world and we enjoyed meeting them and hearing about their Roman adventures and travel tips. Plus, it was great to explore Trastevere and find places we’d like to re-visit (which we did). We also did the Skip the Line Small Group Colosseum/Forum/Palatine Hill tour, and the Sistine Pristine small group tour of the Vatican/St.Peter’s Basilica/Sistine Chapel, both of which can be found on Viator or Tripadvisor, and both very well done (we lucked out with super-enthusiastic and knowledgeable guides). Hope this is helpful while planning activities in Rome - Ciao!", "link": "facebook.com/groups/1373361046396315/permalink/2210523356013409/", "likes": 161, "comments": [{"username": "Chuck Malburg", "comment_text": "Staying in Trastevere when we visit in the spring. Your favorite restaurants there? Thanks!"}, {"username": "Kelly Page", "comment_text": "We booked it a few days ago! So excited !"}, {"username": "Kejdi Okej", "comment_text": "Staying in trastevere when we visit in the spring your favorite restaurants there thanks"}, {"username": "Eileen Reynolds", "comment_text": "This sounds wonderful! What were the ages of people~ young,old or a mix?"}, {"username": "Marybeth Obrien", "comment_text": "How much was the food your"}, {"username": "Theresa Caruthers Ansbaugh", "comment_text": "I have seen this recommended several times so it’s now on my list! Thank you it sounds great"}, {"username": "Michelle Riopelle", "comment_text": "Barbara Cholewa Jill Stevens McGeoch Linda Lakin Sheryl Reed Kurtz ... some Italy tour options mentioned above...."}, {"username": "Mandy Pusateri", "comment_text": "Where did you book this? It sounds fun!"}, {"username": "Anne Goodwin Benson", "comment_text": "Where did you stay in trasteverre?"}, {"username": "Karen Ries", "comment_text": "I did the same on my 1st day in Venice."}, {"username": "Jody Lynn", "comment_text": "Margaret Ann Schneider"}, {"username": "Cathy Donnie Critch", "comment_text": "Danielle Critch Barb Robichaud Sherrie Noseworthy"}, {"username": "Eileen Serfilippi Maringo", "comment_text": "We did the same food tour and it was fabulous! Our guide Giuseppe was fantastic. !!"}, {"username": "Mbell Arteaga", "comment_text": "We just did this food tour tonight! It was fantastic! But I would definitely recommend either skipping lunch or having a light lunch because there is a lot of small bites of food that adds up!"}, {"username": "Victor Martinez", "comment_text": "Do you have the link for the food tour, we are staying there"}, {"username": "Janet Thom", "comment_text": "Ooh thank you"}, {"username": "Dina Witter Pradel", "comment_text": "We loved this tour. Our guide Luca was hilarious, and we loved getting to try so many things in one evening. We had tried a couple of the dishes elsewhere, but the versions we tried on this tour were SO much better."}, {"username": "Bea Kuckens", "comment_text": "I have to hand it to you! After the overnight flight I am a zombie by noon and comatose by 8:00 p.m.😜"}, {"username": "Maggie Kilar Wojtkowiak", "comment_text": "One of our favorite things we did there!"}, {"username": "Christine Reilly Heenan", "comment_text": "That is exactly what we did our first day in Rome after a red eye. It was one of the highlights of Rome!"}, {"username": "Karen Bowman", "comment_text": "Colleen Effler this looks good!"}, {"username": "Mel Murphy", "comment_text": "Lisa Collyer"}, {"username": "Sarah Down", "comment_text": "Great tips with the tours, thanks 🙂"}, {"username": "Deborah Fagan", "comment_text": "Shaun Fagan we are staying in this area in time so would also be ideal to see our surroundings. This sounds like a great tour. I think I will add it to our list."}, {"username": "Melissa Kelly", "comment_text": "Maryann this is us!!"}, {"username": "Michelle Cummins", "comment_text": "Kim Grace"}, {"username": "Beth Wright Albrecht LaSasso", "comment_text": "Jodi Snare this sounds like fun!"}, {"username": "Robyn Klade", "comment_text": "Thank you for sharing! We are doing the Food Tour in October!! ☺️"}, {"username": "Rose Turdo", "comment_text": "Jenifer Ahern Neverman"}, {"username": "Debbie Milne Jenkins", "comment_text": "Thank you for the great info!"}]}, {"id": "2210292492703162", "text": "First time to Italy… should I book tours or just buy tickets online to the popular tourist spots on our own? Here is somewhat of a list for the places we are considering….\n\nRome: November 19-22: coliseum, Trevi Fountain, Mercato Central, Pantheon, Vatican, Sistine Chapel, Basilica, day trip to Pompeii\n\nFlorence: Nov 23-26: Uffizi, Academia, Boboli Gardens, day trip to Tuscany\n\nVenice: Nov 26-28: Dodge’s, Basilica, gondola ride, Treviso, Murano, Burano\n\nAny advice is appreciated. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2210292492703162/", "likes": 2, "comments": [{"username": "Paul Anderson", "comment_text": "Many of the things you list are free and just open to the public. The basilica , Trevi fountain to name a few treviso Murano and Buran are towns Tuscany is a ( state). Enjoy them as they are free. Saturnia hot baths are free in Tuscany and well worth the visit."}, {"username": "Kejdi Okej", "comment_text": "Many of the things you list are free and just open to the public the basilica trevi fountain to name a few trevisto murano and buran are towns murano and buran are towns tuscany as baths are free in tuscany and well woth the visit"}, {"username": "Dafne Espinoza", "comment_text": "Just went to Murano and Burano today using the public ferries (day pass (including Venice) is EUR25). We enjoyed walking around and not being limited to a time schedule although there was a line at the ferry from Murano to Burano then back to Venice."}, {"username": "Leslie Goodland", "comment_text": "I was just in Italy. I booked tours for the Vatican and Murano/Burano through Get Your Guide. The guides were a wealth of information that I wouldn't have gotten otherwise."}, {"username": "Jackie Farside", "comment_text": "I’m in Italy now and booked several tours with skip the line passes and with the intense heat they were worth every penny."}, {"username": "Kimberly Lampros", "comment_text": "Rome: I'd only book Vatican tour and a private tour of Pompeii\n\nFlorence: skip the line for museums and the tour for countryside Tuscany"}, {"username": "Deborah Schroeder", "comment_text": "Venice-get the vaporetto pass for every full day you are there. Use it smartly because it will save you so much walking. Plus it is fun to ride at night with all the lights. Think a city bus on water, stops at all the main places. Take it to Murano, Burano and Torcello. Gondola up to you and where you want it to take you. Doges Palace and Basilica, up to you, I just got there early and walked right in. Do the Campanile, it offers an amazing view of Venice. Florence, everything you listed requires a ticket. There is so much to see and do there, look at the FB site Florencewise to get some ideas. Rome, need tickets to Colosseum, Vatican Museum. St Peter's is free and it you get there at 630 am to get through security, you will have the place to yourself. Pantheon is now ticketed. Check out the FB site Romewise."}, {"username": "Gene Hamilton", "comment_text": "Book many things were sold out according to the people we talked to there we booked all of ours in advance"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We booked a tour for Pompeii through Viator. Highly recommend it. The tour guides are archeologists and provided a wealth of information."}]}, {"id": "2210448862687525", "text": "Hello! Any recommendations for guided tours to the Vatican Museums in September for large groups (42Pax)?", "link": "facebook.com/groups/1373361046396315/permalink/2210448862687525/", "likes": 0, "comments": [{"username": "Sandra Rodrigues", "comment_text": "I booked for my group this one and the guide was very good 👌 https://\nwww.getyourguide\n.com/rome-l33/\nrome-vatican-mus\neums-sistine-ch\napel-skip-the-l\nine-tour-t41173\n2/\n?partner_id=RRX2\nS3W&utm_medium=\nonline_publishe\nr"}]}, {"id": "2210477286018016", "text": "Hi, we are trying to hire a car in Grosseto but we can’t find a single place that has any. That’s just off google on flexi car, webjet etc. does anyone have any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2210477286018016/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "try here https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}]}, {"id": "2210416156024129", "text": "Planning a trip to Italy in Sept. 2024. Would like to do a tour and thinking of Insight Vacations, either the Best of Italy tour or Italian Elegance tour. Has anyone done either of these tours and could you give your thoughts on food, hotels and overall experiences if you have been on one. Thank you for your comments.", "link": "facebook.com/groups/1373361046396315/permalink/2210416156024129/", "likes": 0, "comments": []}, {"id": "2210396216026123", "text": "My brother and his wife will be flying into naples. They would like to arrange a car to pick them up at the airport and drive them to Sorrento. They would like to stop at Pompeii and Herculaneum and a winery on the way. I did something similar....except round trip from the cruise terminal. I used Taxi Mister Cab Driver-Naples & Amalfi coast- . He was absolutely wonderful. But I don't think he has the availability to complete this trip for my brother any other suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2210396216026123/", "likes": 2, "comments": [{"username": "Frances Scannapieco", "comment_text": "Tell them to contact the hotel they are staying at. They all usually have drivers they use and would be able to arrange something.\nI always have my hotel arrange pickups and stops"}, {"username": "Kejdi Okej", "comment_text": "Tell them to contact hotel they are staying at they all usally have drivers they all usually have drivers they use and would be able ot arrange something l always have my hotel arrange pickups and stops"}, {"username": "Mack Sperling", "comment_text": "I used Astarita Car Service (https://\nwww.astaritacars\nervice.com/) for something very similar. They picked us up near Amalfi, arranged for a guide at Pompeii and Herculaneum, and dropped us at the Naples train station. Nice car, good driver, great guide. I would use them again."}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers"}, {"username": "Barbara Brosnan", "comment_text": "We used Joe Bananas for several trips in the area and they were awesome!"}, {"username": "Mary Anne", "comment_text": "Guemar travel is amazing."}, {"username": "Andria Saia", "comment_text": "They want to get off the plane, see two massive archeological sites and a winery in one day? Having done those things that sounds like a lot especially right off the plane"}, {"username": "Karen Espinoza", "comment_text": "Raffaele Giordano he is the best 🫶\nHe took care of me and my family. Best experience ever."}, {"username": "Ibbu Mohd", "comment_text": "Hire him, he is good. Whatsapp him for schedules, good pricing as well."}, {"username": "Bev Madill", "comment_text": "Transferelax are a good, efficient private transfer company. I'd contact them."}, {"username": "Gina Spyker Fairfield", "comment_text": "We were very happy with the service from Autoservizi De Martino. We used them multiple times in Naples, Pompeii, Sorrento, and Amalfi Coast."}]}, {"id": "2210388876026857", "text": "One more question! What Tuscan food included hotel/stay do you recommend outside sienna that kids would love? (Pool, etc). Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2210388876026857/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Tina Ayoub Kassab", "comment_text": "Bump"}]}, {"id": "2210381856027559", "text": "Hey there !!!!\n\nWhat Sicily excursion/tour have you done?\n\nWe have from 9am to 6pm that day on our cruise\n\nThanks in advance\n\n❤️💚❤️💚❤️💚❤️💚❤️💚", "link": "facebook.com/groups/1373361046396315/permalink/2210381856027559/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Irina Murphy", "comment_text": "Following"}, {"username": "Wendy Powell", "comment_text": "F"}]}, {"id": "2210378639361214", "text": "Pizza cooking class recommendations in Rome. We have 2 boys (10 and 13).", "link": "facebook.com/groups/1373361046396315/permalink/2210378639361214/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nPizza-Cooking-Cl\nass-in-Rome-Ita\nly/\nd511-348924P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2210346902697721", "text": "can anyone recommend a guided walking tour of Bologna and Ravenna?", "link": "facebook.com/groups/1373361046396315/permalink/2210346902697721/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Bologna/\nBOLOGNA-CITY-WAL\nKING-TOUR/\nd791-123886P63?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Ravenna/\n2-Hour-Guided-Wa\nlking-Tour-of-R\navenna-with-Ape\nritif/\nd4236-162855P20?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2210340176031727", "text": "Hi I have been reading all your posts and recommendations for a couple weeks and finally narrowed down where I want to go on my first trip. Looking for hotel recommendations for Rome, Florence, and Sorrento. I will be flying in and out of Rome. I’m thinking we have 12-14 days.", "link": "facebook.com/groups/1373361046396315/permalink/2210340176031727/", "likes": 6, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Sorrento https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2791\n84-Reviews-Gran\nd_Hotel_Riviera\n-Sorrento_Provi\nnce_of_Naples_C\nampania.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2029\n88-Reviews-Brun\nelleschi_Hotel-\nFlorence_Tuscan\ny.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Rome https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2050\n44-Reviews-Hote\nl_Artemide-Rome\n_Lazio.html"}, {"username": "Renae Larcus", "comment_text": "In Florence, Hotel Roma. Near the train station and a short walk to the Duomo. Great breakfasts and helpful staff"}, {"username": "Frances Scannapieco", "comment_text": "In Sorrento…..Hote\nl Antiche Mura. Less than 50 feet from the center of Sorrento.\nFabulous hotel and staff"}, {"username": "Alicia Burno", "comment_text": "We are doing the same route. We are now in Sorrento. Did Rome and Bologna as bases."}, {"username": "Valerie Collanton", "comment_text": "Florence: Hotel Monna Lisa; Hotel Cellai; Hotel L’Oralogio\n\nRome: Eitch Borromini; Albergo Santa Chiara\n\nSorrento: Hotel Regina (definitely book sea view with a balcony)"}, {"username": "Karin Czachorowski", "comment_text": "Following. Looks like the perfect route. I will add some time outside of Florence."}, {"username": "Nathan Earl Stellenberg", "comment_text": "Great choices, I have exactly the same except I've also thrown in LA Spezia/Cinque Terre. Enjoy"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Visit Venice instead of Sorrento."}, {"username": "Rose Turdo", "comment_text": "Michelangelo Hotel in Florence"}, {"username": "Fiona Cameron", "comment_text": "Rome- Residenza Praetoria Roma\nVia Milazzo 42- near Roma Termini, area may seem a but dodgy but I’ve never felt unsafe walking there even at night. (Mature age solo female traveller)\nFlorence - Alloro BnB not really a bnb more small hotel\nSorrento - hotel IL Nido\nYou can book direct with all these 3, dont go through a 3rd party like booking/\nexpedia etc."}, {"username": "Starla Dawn", "comment_text": "Rome: @Hotel Barocco"}, {"username": "Margaret Bjorksten", "comment_text": "Hotel Regno in Rome is in an excellent location within 5 minute walk from Trevi fountain & Pantheon . Wonderful location. Great hotel."}, {"username": "Kally Trahearn", "comment_text": "Hotel Plaza Sorrento is next door to Hotel Antiche Mura but cheaper and has fabulous views to Vesuvious from their rooftop infinity pool"}]}, {"id": "2210332056032539", "text": "Can anyone give me suggestions on areas to stay in Venice? Any hotel/air bnb suggestions? I’m not sure the best route to take as far as the best most affordable locations etc. Thanks so much in advance😊", "link": "facebook.com/groups/1373361046396315/permalink/2210332056032539/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d5061\n55-Reviews-Hote\nl_Tiziano-Venic\ne_Veneto.html"}, {"username": "Shannon Madison", "comment_text": "I came in by train so we stayed near the train station, which is not as pretty as other areas but then you don’t have to walk all over with bags over bridges or spend 80plus euros on a water taxi."}, {"username": "Darla Ehrhard", "comment_text": "https://\nwww.casangiorgio\n.com/\n\nThis place is super friendly, clean, and nice!"}, {"username": "Mandy Pusateri", "comment_text": "We are staying at an AirBnB for $370 for two nights. It's not right in town but a 10 tram ride into town."}, {"username": "Kejdi Okej", "comment_text": "Thank you"}, {"username": "Renae Larcus", "comment_text": "We stayed at an Airbnb once and at Hotel A La A la Commedia Hotel another time. Both were great. Venice is small and you walk everywhere."}, {"username": "Elizabeth May La Duca", "comment_text": "I recommend Hotel Castello conveniently located in the Castello section near St. Mark’s Square and just a 3-4 minute walk to vaporetto (water bus)stop/\nfermata San Zaccaria..motos\ncafo Alilaguna also stops there (faster to train station) .. hotel address: Campo SS=Santi Filippo e Giacomo - Castello 4365, Venice 30122, Italy [ l recommend Google Maps /\ndirections for up-to-the-minute,\nreal time info and directions and options ] ..room price includes WiFi and breakfast buffet in hotel’s restaurant"}]}, {"id": "2210314112701000", "text": "Best places to stay in Naples for one night? Also best pizza places/things to do in Naples in the evening? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2210314112701000/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nDowntown-Naples-\nFood-and-Wine-T\nour/\nd508-20455P6?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187785-d1563\n712-Reviews-Pal\nazzo_Caracciolo\n_Napoli_MGaller\ny_Hotel_Collect\nion-Naples_Prov\nince_of_Naples_\nCampania.html"}]}, {"id": "2210279922704419", "text": "Hello all! I am looking for the best, most comprehensive golf cart tour in Rome. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2210279922704419/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nRome-Golf-Cart-T\nour-Best-Activi\nty-in-Rome/\nd511-360122P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Lara Grom", "comment_text": "Livtours you’ll love it"}]}, {"id": "2205435213188890", "text": "Hello fellow travelers!\nI have planned my entire trip for next June with 3 days Venice, 4 days Florence, 2 days to see Cinque Terre (1 full and two 1/2 days) and 3 days Rome\n\nI booked an AirBnB in Monterosso but now I’m thinking with luggage it may make sense to stay in La Spezia and then do 1.5 days exploring Cinque Terre. How is La Spezia as aआणखी place to stay. Definately want to do the Nesum Dorme Pesto class one day and walk the villages as well! Does it make sense to stay in La Spezia and go back and forth or just stay in one of the villages?", "link": "facebook.com/groups/1373361046396315/permalink/2205435213188890/", "likes": 1, "comments": [{"username": "Rachel Gray", "comment_text": "Honestly, Florence is pretty small compared to other places. You could probably get away with 2 days there and then have time to do the other areas."}]}, {"id": "2210273289371749", "text": "Could someone recommend a nice hotel in Orvieto within walking distance to town. We will not have a car so need to be able to walk to places. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2210273289371749/", "likes": 0, "comments": [{"username": "Nicole Douglas", "comment_text": "Orvieto is a very walkable town! We did not have a car and stayed in a air bnb there."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194843-d1262\n5187-Reviews-La\n_Luna_Sopra_Orv\nieto-Orvieto_Pr\novince_of_Terni\n_Umbria.html"}, {"username": "Mary Anna Machi", "comment_text": "Stayed nice hotel just across from church and main piazza. Small but nice room with good breakfast. Very convenient to drop bags and tour town. Ck booking. Com. It was last minute booking for us so don’t have name."}, {"username": "Kejdi Okej", "comment_text": "Orevieto is a very walkable town we did not have a car and stayed in a arir bnd there"}, {"username": "Roxanne Patti", "comment_text": "We booked La Magnolia for upcoming stay. It’s supposedly right by the Duomo. 🤷‍♀️ I can let you know once we stay."}, {"username": "Paul Davis", "comment_text": "Oksana Kravchun Lawson: casaselita.com\nThe owners speak good English, free parking, they provide a great breakfast, and the place is a five minute walk to the walls of Orvieto where you can take the elevator up to the town. I highly recommend it."}]}, {"id": "2210261776039567", "text": "Vatican Tours - the dates I am wanting are sold out on the Vatican website. Is buying on Viator the next best option?", "link": "facebook.com/groups/1373361046396315/permalink/2210261776039567/", "likes": 0, "comments": [{"username": "Sharon Wenzel", "comment_text": "Www.livtours.co\nm"}]}, {"id": "2210249936040751", "text": "Can anyone recommend the best way to tour Mount Edna in Sicily from Palermo? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2210249936040751/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sicily/\nEtna-Volcano-Sma\nll-Group-Tour-f\nrom-Palermo/\nd205-6738P23?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}]}, {"id": "2210245919374486", "text": "So me and my son will be traveling from Switzerland into Italy by train when we get into Italy and hop on the train we’d like to stop in Pisa or other stops along the way and then head down to Rome. Can we hop off at different stops and stay for a while and then hit the next train? Or do we have to stick on the train ￼ to the final destination? Thanks Dave and Jacob", "link": "facebook.com/groups/1373361046396315/permalink/2210245919374486/", "likes": 0, "comments": [{"username": "Kejdi Okej", "comment_text": "You need to different ticket"}]}, {"id": "2210241642708247", "text": "How strict is the carry on policy for local airlines? Trying to fit 12 days into a travel backpack and looking at one that is 1/2\" over the 22\" limit.", "link": "facebook.com/groups/1373361046396315/permalink/2210241642708247/", "likes": 1, "comments": [{"username": "Jaime Cleek", "comment_text": "We flew Aer Lingus it wasn’t checked. But they run their airlines all the way through"}, {"username": "Ryan Shearer", "comment_text": "Depends on your airports. Ryan air into and out of Italia and Malta no one cares."}, {"username": "Dianne Smith Durham", "comment_text": "Delta for me & my daughters & no one checked the size or weight of any of our carryons."}, {"username": "Keith Al-Dijaili", "comment_text": "AA no one checked"}, {"username": "Laura Uribe", "comment_text": "European budget airlines are rigid in following the size requirements. There have been multiple posts this week so you might want to check those out to see what others have experienced."}, {"username": "Brad Jinks", "comment_text": "Between myself and my family, we’ve flown Ryanair, AirFrance, FrenchBee and Easyjet (also Spirit, Frontier and JetBlue) all within the last few months - granted not in Italy. At various times we all used backpacks/\npersonal items that were a little oversized. We were never checked. That said, I did see a handful of people that were stopped, but they were clearly abusing the carry-on policy - you could tell at a glance that their bag was way too big. If your bag is just a little too big, you should be fine."}]}, {"id": "2210239582708453", "text": "I just returned from an amazing trip to Italy, but wanted to pass on a couple quick tips about passport control in FCO.\n\nIf traveling with children 14 and under(our daughter is 11), you have to go through a different line then the other US citizens without children. The other line it looked like you just scan your passport at the machine and you’reआणखी out in 5 minutes. Not the case in our line. Our wait was over an hour in line.\n\nWe also had to go through the same thing when departing FCO. We were flying out of gate E and arrived early, so we grabbed a seat prior to the gate waiting until about an 1:15 minutes to walk down. We didn’t realize we needed to do passport control again and this time the line was only about 30 minutes. Not bad, but if we knew we needed to do this we would have walked down an hour earlier.\n\nSide note: we still had to go through customs again when landing in the US.\n\nI hope this helps anyone who is trying to plan their own timelines.", "link": "facebook.com/groups/1373361046396315/permalink/2210239582708453/", "likes": 0, "comments": []}, {"id": "2210237786041966", "text": "I have a question. Traveling to Italy from Miami. Layover in Portugal going & coming back. Will I go through customs & immigration in Portugal & Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2210237786041966/", "likes": 0, "comments": [{"username": "Luca George Tudor", "comment_text": "No, just Portugal. It's like flying to NY and then Miami. Even if it's a different country but within EU it's considered domestic flight."}, {"username": "Jill-Ann Ockers Buro", "comment_text": "You will not go through customs as your bags will be with the airlines, but be prepared to show your ticket, passport, and have your hand carried items go through security."}]}, {"id": "2210233239375754", "text": "I have a question about Venice. What is the best way to get to your accommodation from the airport? Our hotel is in the San Marco area. I asked our hotel and was given a few options. They recommended the best way was bus to Venice and then boat Vaporetto but I have been reading that you can get Boat Alilaguna from the airport. We are travelling from Australia so after a 23 hours plus flight I want the easiest way possible to get there. Is it worth booking something privately? Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2210233239375754/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nPrivate-Limousin\ne-Transfer-Veni\nce-Airport-to-V\nenice-City-Cent\ner-by-Car-and-W\nater-Taxi/\nd522-12418P1?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Karen Blackmore", "comment_text": "I'd ask the hotel about private water taxi, the best (but most expensive) way to arrive in Venice!"}, {"username": "Annette Mayer", "comment_text": "Take the boat from airport. It's about 15euros pp. But after that long flight be warned it is a good walk to boat and buses"}, {"username": "Christine Smith", "comment_text": "I’ve done the trip from Australia many times & use Alilaguna from the airport."}, {"username": "Tanya Bitar", "comment_text": "https://\nwww.alilaguna.it\n/en"}, {"username": "Suzie Beck", "comment_text": "Boat, I believe is the best. It will be a good walk from the terminal gate but you will like the easy walk and good signage to get there. The boat gives you a view to look forward to and also gives you a good perspective of Venice. I have done the train and the bus too. All are easy to do ."}, {"username": "Julia Titus", "comment_text": "Private water taxi, 150 euros, absolutely worth it!"}]}, {"id": "2210218232710588", "text": "Hello beautiful people! We have time for a day trip during our Italy trip this October and we need to decide between a day trip to Cinque Terre from Florence, or a day trip to Amalfi coast from Rome. We would really like to visit Amalfi coast (Positano and Capri) but we are concerned it might be too much transportation for one day. We would appreciate any tips or advice.\nOur trip is early October so the ferries are still running.", "link": "facebook.com/groups/1373361046396315/permalink/2210218232710588/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "this for the weather. https://\nwww.viator.com/\ntours/Rome/\nPompeii-Amalfi-C\noast-and-Posita\nno-Guided-Small\n-Group-Day-Trip\n-from-Rome/\nd511-3731P159?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "LeAnn Bonkiewicz", "comment_text": "Too much for 1 day!"}, {"username": "Clint Foster", "comment_text": "We are staying in Sorrento and the Capri trip is over 6 hours. You wouldn’t have time from Rome I don’t think. You could do Amalfi if you went early. Disclosure, I’ve never been to Italy but have spent the last 3 months planning my three trip coming up. So my comments are from the research I’ve done."}, {"username": "Karen Schmidt", "comment_text": "Both are way too much for one day. I’d suggest something a little closer to each city. Otherwise, basically you’re travelling for most of the (very long) day, only to spend two or three hours actually there. ￼"}, {"username": "Sally Ann Tanasi", "comment_text": "I’ve never been to Cinque Terre but many times to Sorrento Capri Amalfi & Positano it would be warmer south I don’t know how many flowers would be out . That’s part of the charm. It will be colder up north. Anyplace in Italy is awesome"}, {"username": "Graham Sherlock", "comment_text": "CT over Amalfi anyday"}, {"username": "Rose Turdo", "comment_text": "Pompeii & Mnt. Vesuvius or Bolsena Lake or my favorite Alberobello *"}, {"username": "Basia Szokarski", "comment_text": "Both are too much and neither are day trips from those places. From Florence do some wine tours and visit walled villages in Tuscany. From rome go to Pompeii."}, {"username": "Barbara Bastianini", "comment_text": "I honestly wouldn’t do either of those as day trips from those locations. They’re too far away so you’d spend too great a time in transiting compared to the amount of time you’d spend sightseeing. You won’t have enough hours at the day trip destinations to justify the time spent getting there.\n\nFrom Rome I think Tivoli, or Frascati are reasonably located day trips.\n\nFrom Florence I think Fiesole , Siena, or Lucca are better options."}, {"username": "Linda Corriveau", "comment_text": "You also have to consider that daylight hours are much shorter in October - sunrise is after 7am and sunset is before 7pm - depending on what you want to see and do, it’s something to keep in mind."}, {"username": "Jeanette Ramos-Gonzalez", "comment_text": "Cinque Terre from Florence .."}, {"username": "Fiona Cameron", "comment_text": "Rome to Amalfi is to far for a day trip. You will spend your whole day rushing around, and not seeing or enjoying anything."}]}, {"id": "2210229242709487", "text": "Anyone have a beautiful b&b or hotel they’d recommend in Lucca?", "link": "facebook.com/groups/1373361046396315/permalink/2210229242709487/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187898-d5304\n77-Reviews-A_Pa\nlazzo_Busdraghi\n_Residenza_d_Ep\noca-Lucca_Provi\nnce_of_Lucca_Tu\nscany.html"}, {"username": "Anastasia Williams", "comment_text": "yes! I will PM you. Stayed there last year and I love Lucca, my second time. Our BnB was amazing"}]}, {"id": "2210226092709802", "text": "Planning a trip for late May next year and looking at traveling from Naples to Florence then Milan and didn’t want to train that far if we have long distances in b/w cities. Has anyone done air travel within Italy? ITA has some very reasonable flights only an hour or so destination to destination (yes I know the train is easy and how it operates, I’m asking specifically for air travel info ) 😊. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210226092709802/", "likes": 0, "comments": []}, {"id": "2210222412710170", "text": "I am looking to buy custom sandals in Anacapri or Capri. I have lots of names but wondering if anyone has personal referrals? I’m looking for a wedge heel", "link": "facebook.com/groups/1373361046396315/permalink/2210222412710170/", "likes": 0, "comments": []}]