[{"id": "2211752555890489", "text": "I’m planning a trip to Puglia in May 2024. Can someone suggest 5 best home base to stay. Thank you so much", "link": "facebook.com/groups/1373361046396315/permalink/2211752555890489/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Monopoli, Otranto, Gallipoli, Lecce and don't miss Matera (not Puglia)"}, {"username": "Cat Furness", "comment_text": "I just spent a month in Puglia. I spent 7days in Bari, Monopoli, Lecce & Gallipoli, then 4 days in Brindisi. These were all great towns, but my most favourite was Monopoli. Such a lovely small town, great people and lovely beaches."}, {"username": "Angie Harrop", "comment_text": "Vote for Lecce from me"}, {"username": "Rossella Montanaro", "comment_text": "Polignano a mare è vicino a Monopoli, Alberobello, Bari, Matera"}, {"username": "Barbara Bastianini", "comment_text": "I love Polignano a Mare."}, {"username": "Alberta Brack McAviney", "comment_text": "Monopoli"}, {"username": "Mary Fortura", "comment_text": "Bari, Polignano, Lecce, Monopoli, Salento. There are soooo many more along the coast."}]}, {"id": "2211750985890646", "text": "My husband and I leave for Italy tomorrow. I have been following this page trying to learn as much as possible as this is our first time. I keep seeing posts about VAT tax/claims. Can someone please explain to me what that is? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2211750985890646/", "likes": 4, "comments": [{"username": "Luca George Tudor", "comment_text": "Hi. When you are shopping and spend more than 155 in one store the same day, if the store is affiliated with a tax refund company, you can gen a refund at the airport when you leave for about 15-17% of the amount that you spend. Make sure you have your passport with you, or at least a picture of the passport"}, {"username": "Colleen Dawson", "comment_text": "Google has a great explanation on this. Short version: single purchase of €150 or more qualifies for a tax return which is 22% in Italy, other European countries have differing %. Have your passport with you as well need to verify, stores will fill out the form. If you do need to use VAT, I also suggest downloading the app Global Blue to help as well."}]}, {"id": "2211734449225633", "text": "I’d be traveling to Italy the ends of September with a group of ladies…\nI’d love some suggestions\nI was thinking of purchasing a “City Pass” “Rome Pass/GoCity” so i Can see 5/7 places for a certain price which is about 30-40% price difference…did any of you purchase one of these passes & did you a have good experience with this?\nOr do you recommend to purchase tickets individually for Vatican, colosseum etc?\n\nThank you I’m advance 🤍", "link": "facebook.com/groups/1373361046396315/permalink/2211734449225633/", "likes": 0, "comments": []}, {"id": "2211731645892580", "text": "Going to Italy next month for 2.5 weeks. How much money in Euros should we bring? What types of things (besides public bathrooms) will require euros and won’t take Visa? Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2211731645892580/", "likes": 1, "comments": [{"username": "Shannon Madison", "comment_text": "We took $500 for 6 people for 2 weeks in Italy and Greece. Mostly for smaller stores , souvenirs , markets , cash tips"}, {"username": "Alicia Burno", "comment_text": "So far we needed 80 euros for a gondola ride."}, {"username": "Keith Al-Dijaili", "comment_text": "Most everyone takes credit cards"}, {"username": "Jodi Homes", "comment_text": "We found some restaurants did not take cards. The biggest culprit was parking, almost none took cards & @ 50euro /day in places. It was a hassle. Also some cabs did not take cards"}, {"username": "Jenny Payne", "comment_text": "I like having euros for small things + bus tickets , u will be surprised how any they come in 🌻"}, {"username": "Lisa Valdovinos", "comment_text": "We took 500 euros with us and ended up getting 500 more while there. We did use our credit card for most purchases."}, {"username": "Kathy Mitchell", "comment_text": "Thank you for all the good advice; will start with getting about 500 euro👍"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211729932559418", "text": "Hello! What is the best beach club to hang out for the day in Positano in September. Also best restaurants with great views? Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2211729932559418/", "likes": 0, "comments": []}, {"id": "2211687465896998", "text": "Hey y'all. We are moving to Kuwait next week from Kansas. Then, we are vacationing in Italy for the month of December. We plan to stay at an air bnb either in Rome or Florence area. We have a 5 and 6 hear old daughter. Just wanting ideas of what to do as a family and some kid friendly places. Thank you 💙\nAlso, how's the weather in December? Kansasआणखी can either be 0° with a negative windchill or 60° LOL so, we are used to winter weather, that's not a problem. But, we'll be coming from Kuwait and that good ole 100° dry heat. We won't have much winter clothes, as I've donated them since we won't need them. So, I'll need to do shopping before we head out to Italy 🫣", "link": "facebook.com/groups/1373361046396315/permalink/2211687465896998/", "likes": 0, "comments": [{"username": "Brenno Bianchi", "comment_text": "Florence in December has a temperature around 30°F-50°F; Rome is more southern and closer to the sea, so is a bit warmer."}, {"username": "Mary Anderson Jenkins", "comment_text": "We loved renting from Italy Perfect"}]}, {"id": "2211726015893143", "text": "Hi!!\n\nWe’re looking to travel to Italy next May! We’re struggling on a destination. We LOVE the mountains and have considered Dolomites. We’d fly into Venice. We’re struggling in where we should stay. We’d love somewhere with a view!\n\nWe plan to rent a car while we are there!\n\nAny recommendations would be great! Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2211726015893143/", "likes": 0, "comments": []}, {"id": "2211723779226700", "text": "Ciao!\n\nI am planning our first trip to Italy (june-july 2024, 17 days). We will fly in and out of Venice and plan to rent a car (3 adults + 4 years old twins) to spend about 10 days in the Dolomites and 7 days around Florence.\n\nI was thinking of staying in Misurina and Val Gardena to hike around.\n- Tre cime\n- Lago di Braie\n- Cinque Torri\n- Secadaआणखी\n- Alpe di Siusi\n\n**Are these hike realistic for 4 yo kids?**\n\n**Do you have any other recommendations about what to visit, where to hike, things kids would enjoy ?**\n\nFlorence will be our base for the 7 other days. We will do day trips to:\n- Cinque Terre\n- Wine tour (obviously 🍷😅)\n- Spend a day or two visiting Florence\n\n**What should we do next? Should we stay somewhere else?**\n\nGrazie!", "link": "facebook.com/groups/1373361046396315/permalink/2211723779226700/", "likes": 0, "comments": [{"username": "Stephen Henn", "comment_text": "Not knowing how active your children are these are my thoughts. A 4 yo would be able to hike around Lago di Braie as the trail is pretty level and not that far. Tre Cime, if walking to the peaks, might be a bit too far. At Seceda, you can make the hike as easy or difficult as you want as there are many trails and options. They’d love the gondola rides! If at Seceda, be sure to have a meal at Daniel’s Rifugio - great food and unforgettable views. Cinque Terre, depending on which hike your doing, has many many stairs and might be too long. We hiked between Vernazza and Monterosso and it took 2.5-3 hrs."}]}, {"id": "2211706412561770", "text": "It has been almost 2 years since I flew international. Are we still required to provide Covid vaccine proof? I know United States made some changes in May regarding international travel into the US and it’s not required. I just wanna make sure everyone else’s doesn’t require proof.", "link": "facebook.com/groups/1373361046396315/permalink/2211706412561770/", "likes": 1, "comments": [{"username": "JB Jess", "comment_text": "Check the individual country. Just went to Italy though and no proof required."}]}, {"id": "2211705859228492", "text": "Need to go to Marco Polo airport Sunday morning. What is the best way to get there? 5 people, 10 bags (all carry on). Flight is at noon. Plan to be there by 9. What time should we leave?", "link": "facebook.com/groups/1373361046396315/permalink/2211705859228492/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nVenice-Marco-Pol\no-Airport-Link-\nDeparture-Trans\nfer/\nd522-2495VENHTLA\nPT?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}]}, {"id": "2211539225911822", "text": "What is the best (and reasonably priced) way to get a group of 8 people from the Rome cruise port into the heart of the city of Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2211539225911822/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/\nLake-Bracciano/\nCivitavecchia-Po\nrt-to-Rome/\nd29095-8314P39?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2212406112491800", "text": "Florence, Italy 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2212406112491800/", "likes": 0, "comments": []}, {"id": "2212402429158835", "text": "“Born from a thought of love and a dream of beauty”, as Giovanni Pascoli wrote, Pienza is known as the incarnation of the ideal city!\nJoin our NEW virtual experience: आणखीhttps://nextstop-italy.com/virtual-tours/pienza/\n\n#italytravel #artlovers #hiddengems #italygram #vacationmood #virtualworld #history #italytrip #medievalarchitecture #medievalart #medievalhistory #medievalcastle #italytrip #hiddengems #artlovers #tuscany #tuscanygram #tuscanyitaly #tuscanytravel #tuscanypeople #tuscanyexperience #pienza #pienzaitaly #pienzatuscany #renaissance #renaissanceart #orciavalley #valdorcia", "link": "facebook.com/groups/1373361046396315/permalink/2212402429158835/", "likes": 19, "comments": []}, {"id": "2212238449175233", "text": "A few things I learned from the trip so far that might be helpful for some:\n\n1. Train rides from Milan to Florence are frequent and have plentiful seats even in August, you can buy the tickets on the day of.\n\n2.आणखी So far, no needs for cash at all, credit card payments available in all the places.\n\n3. Uffizi museum in Florence has discounted tickets available before 8:45am walk in basis, go then, best time to see it without the crowds or the line up.\n\n4. So many hotels are available in Florence and Milan, prices also seem to reduce on the day of, I wouldn’t worry about no place to stay even in August.\n\nHope this helps.", "link": "facebook.com/groups/1373361046396315/permalink/2212238449175233/", "likes": 24, "comments": []}, {"id": "2212267815838963", "text": "Train luggage storage tip - you can put your heavy luggage between seats.", "link": "facebook.com/groups/1373361046396315/permalink/2212267815838963/", "likes": 2, "comments": []}, {"id": "2212280485837696", "text": "If you are in Firenze next week:", "link": "facebook.com/groups/1373361046396315/permalink/2212280485837696/", "likes": 3, "comments": []}, {"id": "2212288189170259", "text": "🇮🇹👍🏿 A TALENTED WAITER IN SICILY ‼🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2212288189170259/", "likes": 1, "comments": []}, {"id": "2212396455826099", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2212396455826099/", "likes": 1, "comments": []}, {"id": "2212321225833622", "text": "Hi all, I’m posting a review on an a day trip we booked through viator where we visited Pompeii and Positano.\nIf you’re not interested, scroll along because this is detailed but I hope it helps people in figuring out whether this would be worth it for them.\n- We booked a day trip from Rome to Pompeii and Positano (along Amalfi coast) with Viator, operated through City Wonders. You are on a coach bus with about 32 people total. The first stop is Cassini which is about an hour and a half from Rome, for a 15 minute pit stop.\n- Next stop is Pompeii, which is about 1 hr 30 min from Cassino, depending on traffic. Once there, you meet up with a separate tour guide that will walk you through the ruins, this was about 1.5 hr tour (did not cover ALL of pompeii). We had lunch at a restaurant in Pompeii but we opted to take our food on the bus so we could buy some souvenirs just outside the archaeological site as you do not have time before or after to browse.\n- Next stop is Positano, which took us about an hour to get to because of traffic. When you’re about 3/4 of the way there you switch over to a van since the roads are even narrower in Positano. We spent about an hour and 45 minutes there including the walk to and from where they parked the van. That gave us some time to dip our feet in the sea and do some shopping.\n- After that we had a 2.5 ish hour drive back to the first pit stop for a break, about 20-25 minutes. Then, we rode the rest of the way back to Rome, about 1-1.5 hr.\n- It was a LONG day but it was worth it as we have limited time in Italy. In total it was about a 13 ish hour day from pickup to drop off. My husband would have liked to stay in Pompeii to explore more but that wasn’t an option 🤣\nHope this helps!", "link": "facebook.com/groups/1373361046396315/permalink/2212321225833622/", "likes": 49, "comments": [{"username": "Gina Christopher", "comment_text": "We are doing this as well, but a private tour for $220 pp. I can't wait! Thanks for sharing!"}, {"username": "Kristy Bretagne", "comment_text": "Great review. Thank you."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nPompeii-Amalfi-C\noast-and-Posita\nno-Guided-Small\n-Group-Day-Trip\n-from-Rome/\nd511-3731P159?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Tracy Foss", "comment_text": "Thank you for sharing this!"}, {"username": "Sarah Miller Porter", "comment_text": "Thank you so much! I appreciate your thorough review because I was thinking of taking this tour."}, {"username": "Emily Thelen", "comment_text": "Thanks for your review too!"}, {"username": "Alane Riley", "comment_text": "Thomas Riley"}, {"username": "Tiara Jane Bantugan", "comment_text": "What time is the pick up?"}, {"username": "Bev Symes", "comment_text": "thanks for details.helpful"}, {"username": "Kelly A Hodson", "comment_text": "This sounds like the one I have booked for next month. Didn’t realize so much travel time. Hoping it’s all good 🤞"}, {"username": "Roxanne Franquelli", "comment_text": "Ty for posting."}, {"username": "Ivette Lugo", "comment_text": "Thank you for sharing!"}, {"username": "Annika Clair", "comment_text": "I've been looking into this too, it doesn't sound as though you get much time in your destinations though compared to the travel time?"}, {"username": "Tracy Glasgow", "comment_text": "We did this trip also and loved it. Booked through Expedia. Meeting time 7am and back in Rome around 8.30pm. Would have loved more time in Pompeii and Positano but we didn’t expect it given it was a day trip and really only getting highlights. The guided tour in Pompeii made sure we made the most of our time there (we did mid afternoon). Positano we had a great lunch, visit to the beach and stroll through the shops. Although it sounds like a lot of time on the bus it didn’t feel that way with the quick stop on the way there and back. It was a great way to sample the Amalfi coast … we’ll definitely go back and spend more time in the future."}, {"username": "Jim Campbell", "comment_text": "Thank you for sharing"}]}, {"id": "2212328132499598", "text": "I'm now home in Denmark but my heart is in Italy🥰🇮🇹!", "link": "facebook.com/groups/1373361046396315/permalink/2212328132499598/", "likes": 4, "comments": []}, {"id": "2212333399165738", "text": "For those who don’t have tickets and want to avoid crowds at the Vatican.\nWe arrived just before 6.30 am, when security opened, to attend 7 am Mass (we are practicing Catholics). We were the first in theआणखी Basilica, and attended a lovely Mass in Italian with around 20 others, mainly nuns.\nAfter we were able to wander around the Basilica with very few people.\nI then decided to go to the top of the Dome. It cost €10 with the elevator part way, again no queues, and not too hot.\nBy the time I left at 8.30 am there were long queues.", "link": "facebook.com/groups/1373361046396315/permalink/2212333399165738/", "likes": 412, "comments": [{"username": "Sarah Castellano Fisk", "comment_text": "Beautiful pictures! How did you manage to book the elevator for the top of the dome?"}, {"username": "Debra Quinney", "comment_text": "St Peter’s Basilica and the Vatican with the Sistine chapel are 2 separate places with 2 separate queues"}, {"username": "Diane Altman", "comment_text": "The key is an early start!"}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "Are masses every day"}, {"username": "Rbk Allor", "comment_text": "how do you find the mass schedule and do you have to buy tickets for it?"}, {"username": "Tammy Moore", "comment_text": "Do they have mass every morning. I am a practicing catholic also?"}, {"username": "Nina Truong", "comment_text": "F."}, {"username": "James-Kathy Dickerson", "comment_text": "U did it right! Amazing"}, {"username": "Lizzi Denisse", "comment_text": "What was the message of the mass (serious & respectful question)"}, {"username": "Steve Griggs", "comment_text": "They charge you to go to mass?"}, {"username": "Nancy Vales", "comment_text": "That’s great. Thank you. Will add the mass to our itinerary.\n\nAny tips on the Vatican museum entry?"}, {"username": "Tracey Fairbrother", "comment_text": "Fantastic photos. On two trips to Rome I've been lucky to see the pope give his blessings"}, {"username": "Cleo Forrey", "comment_text": "Thank you. We'll do this too."}, {"username": "Kristen Miller", "comment_text": "Smart"}, {"username": "Timothy O'Brien", "comment_text": "How was the dome at that time. Did you take pictures? I heard because of the shadows it is better for pictures in the afternoon."}, {"username": "Deborah Louise Clarke", "comment_text": "As beautiful as the Vatican is I wouldn't want to be there at mass is not on has I'm not realious is there anywhere I could visit when Mass is not on and no crowds"}, {"username": "Nicola Stuart", "comment_text": "Denise Stuart"}, {"username": "Belinda McNamara", "comment_text": "Julie Cramer Michelmore"}, {"username": "Rebecca Loughron", "comment_text": "Bernie Loughron"}, {"username": "Nancy Curmi", "comment_text": "Ali Sha"}, {"username": "Teresa Chang", "comment_text": "Excellent idea."}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "How was the dome climb is it tight and a lot of steps"}, {"username": "Adriana Sormani", "comment_text": "I think you were the first to mention going to mass… to see St. Peter’s, kind of sad that I didn’t think of that ( Also Catholic ) , yet Genius!\nBrava!"}]}, {"id": "2212050342527377", "text": "In Rome currently. Can provide more details later. For now:\nAccommodations: we are in the Rome Cavalieri -a Waldorf Astoria Hotel. It is on the outskirts of the city. This is the view from our balcony. Weआणखी can see the Colosseum and St. Peter’s Basilica clearly from our balcony. The room / suite is beautiful, the staff are attentive, lunch at the hotel restaurant yesterday was amazing. Hairdryer provided and was as strong as the one at home.", "link": "facebook.com/groups/1373361046396315/permalink/2212050342527377/", "likes": 8, "comments": []}, {"id": "2212332772499134", "text": "My ancestors are from Italy , and I would like to travel there some day", "link": "facebook.com/groups/1373361046396315/permalink/2212332772499134/", "likes": 16, "comments": [{"username": "Irene Oda", "comment_text": "Great goal for the future."}, {"username": "Ken Lerch", "comment_text": "Absolutely"}, {"username": "Virgz Van Møøre", "comment_text": "Go ! I did it"}, {"username": "Esther Newcombe Mahon", "comment_text": "I'm half Italian I've only been to the valley twice in my life where my late mam is from. But going back in 3 weeks and bringing my hubbyvhes never been"}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "I’d love to take my husband to Palermo because his grandpa was born there"}, {"username": "Joe Guzzi", "comment_text": "We'll probably go tuesday."}, {"username": "Lucie Belle-Isle", "comment_text": "You should! Absolutely! I’m French-Canadian\nand was in Italy for the first time fifty years ago, fell in love with the country, the language, the people, the history…\nI went back many times over the years and will go again! Now that I get by quite well in Italian, it’s even more enjoyable! GO! 😀"}, {"username": "Carine Brys", "comment_text": "Maybe a jar or an envelope, and put some money in it every week?"}, {"username": "Lorissa Gill", "comment_text": "Ok"}, {"username": "Kevin McClean", "comment_text": "Request approved. Proceed."}, {"username": "Joe Laricchia", "comment_text": "Do everything you can to make it happen. My father was born in Bari in 1931. We had plans to go and he passed away 10 months before we went. My only regret is that I wasn’t able to tell him how I fell in love with the country. We have since been back and will hopefully continue to go back Your life will be changed forever ❤️🇮🇹"}, {"username": "An Ma", "comment_text": "I'm from Lombardy the region of Milan. After the fall of the Western Roman Empire VIII century AD the region was occupied by Longobards (that gave also the name Lombardia). Considering that Longobards came from the southern part of Sweden I'm Swedish-even if I don't speak a word of Swedish and I don't know the culture and I would like to visit Sweden one day. I also consider myself Swedish because I bought a stoolie at Ikea once"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Go for it!! ♥️"}, {"username": "Peggy Frasca Prichard", "comment_text": "Mine are from Napoli. Going next month!"}, {"username": "Marco Brambilla", "comment_text": "Is it true we would need to apply for a visa from 2024?"}, {"username": "Mark Lynch", "comment_text": "Then do it!!"}, {"username": "Vlatko Jazz Mushkarski", "comment_text": "Wow.....great..\n..I'm not sleeping tonight...."}, {"username": "Joy Wilkinson Huggins", "comment_text": "Good. Plan a trip and go."}, {"username": "Brenda Tusing", "comment_text": "It’s why I went the first time. Second time was just because I loved it!"}, {"username": "Sherri Leis Dillavou", "comment_text": "Ok"}, {"username": "Lisa Akira", "comment_text": "It’s magnificent. Go!"}, {"username": "James Saxton", "comment_text": "Good story. Got any more?"}, {"username": "Joe Guzzi", "comment_text": "My wife is going after lunch, returning tomorrow or late tonight."}, {"username": "Doug Burke", "comment_text": "Well, don't wait. Book a flight and GO!"}, {"username": "Jennifer Pompa Strong", "comment_text": "Mine too!!"}, {"username": "Ian Fawkner", "comment_text": "Like some shoe company said …… ….”Just Do It”"}]}, {"id": "2212036362528775", "text": "Thanks for add... 🌸🌿\nHeading to Venice & Rome ... the best places please...❤️", "link": "facebook.com/groups/1373361046396315/permalink/2212036362528775/", "likes": 1, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211761052556306", "text": "We are staying in Positano and looking for the best cost effective way to goto Pompeii.\nWe don’t want to spend a whole day just a few hours, I heard you can catch a train?\nAny tips would be appreciated 💕", "link": "facebook.com/groups/1373361046396315/permalink/2211761052556306/", "likes": 4, "comments": [{"username": "Stacey Richards", "comment_text": "We booked a tour booked with the hotel. Just a last minute decision and it worked perfectly. They even dropped us halfway up, so the walking wasn’t bad."}, {"username": "Isabelle Scicluna", "comment_text": "There are no railway tracks along the amalfitan coast. You would have to catch the ferry or bus from Positano to Salerno and then the train from salerno to pompei city"}, {"username": "Alicia Burno", "comment_text": "From Positano you have to catch a ferry to Sorrento and from there take the train to Pompeii. I jus did it today."}, {"username": "Alicia Burno", "comment_text": "…..but it is an all day trip. Just the walking in Pompeii took us hours."}, {"username": "Franki Sbrocca Leonard", "comment_text": "We did it on our way out of Positano, had a private driver taking us to Naples and we paid more for him to make a stop for two hours @Pompeii , made sense for us rather than go back to Amalfi 🍋"}, {"username": "Barb Krieg-Stepien", "comment_text": "We did private driver from Naples on our way to Positano. 2 hours was plenty of time for us at Pompeii. It’s hot and no shade."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Nope. Definitely not a half day inexpensive commitment from Positano."}, {"username": "Michele Couzens Simourd", "comment_text": "If you don’t want to spend the whole day there, rent a car or hire a driver. It’s an hours drive, from Positano to Pompeii according to Google:) Pompeii is soooo worth it. But book a guide for the tour."}, {"username": "Ibbu Mohd", "comment_text": "Take ferry from positano to naples.\nferryhopper -get this app"}, {"username": "Angela Genduso", "comment_text": "Did not enjoy it. It was so hot several people passed out their literally is no way 2 get out of the heat. Went back to the hotel had to call a Dr and stayed in bed for 2 days from heat exhaustion. Never again just saying and it was September."}, {"username": "Rachael Richardson", "comment_text": "Train is easy get off at station in Pompeii , we did self guided skip the line tour got there for 9am out by 12:30-1"}, {"username": "Ian Fawkner", "comment_text": "Yep - trains are easy ….but don’t get sucked in by the ‘self appointed tour guides’ as you leave the station - walk up the road and enter the site ….also free rest rooms inside !!!"}]}, {"id": "2177044332694645", "text": "One Italian Summer is the perfect book to get you ready for your trip. It is set in Positano and is spot on with real-life Positano.\nThe protagonist is staying at the Poseidon and just went to La Tagliata for dinner.... Easy read!\nHave a look here : https://amzn.to/3N7whCU", "link": "facebook.com/groups/1373361046396315/permalink/2177044332694645/", "likes": 46, "comments": [{"username": "Lisa Linette Tillman", "comment_text": "Excellent book!"}, {"username": "Nancy D'Alessandro Ginder", "comment_text": "I’m listening to this book now!"}, {"username": "Lara Rebecca", "comment_text": "My daughter and I are planning a trip based on this book! We love it!"}, {"username": "Ileana Lara", "comment_text": "My mom and I went to Italy together after reading and loving this book!!! ❤️"}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "My daughter took me in July after reading this book. I am so very grateful for her and for the book that gave her the idea. Loved The Amalfi Coast and it was so fun to read the places in the book that the author described and have visited them as well!"}, {"username": "Lesley Epps Bowen", "comment_text": "Just put this on my “must read” list. I will never forget the trip my mom and I took to France. I miss her."}, {"username": "Katrina Koger", "comment_text": "I sadly couldn’t take the main character in this book! I didn’t get much past 75 pages. Her decision making 😣🤦🏼‍♀️"}, {"username": "Theresa Skipper", "comment_text": "Just bought it in a charity shop! Travelling to Florence in late August x"}, {"username": "Daryl Salese", "comment_text": "Reading this now too! Hope to be there next summer 😎"}, {"username": "Sian James", "comment_text": "This is next on my list, looking forward to reading it just before going away"}, {"username": "Fran Wohlenhaus-Munday", "comment_text": "A special way to visit Italy from your easy chair and remember being there."}, {"username": "Elie Loummer", "comment_text": "This really was a beautiful read when in Positano!!!!"}, {"username": "Judy Grayson", "comment_text": "Currently reading this... a very nice book!"}, {"username": "Cyndi Carcione", "comment_text": "I got so confused with this book. Was the woman her mother, was she dreaming????🤪"}, {"username": "Alice Bush Kachejian", "comment_text": "Reading it now in preparation for our trip to Italy next summer."}, {"username": "Monica Colavito", "comment_text": "I read this book last year & fell in love but cannot go. But still reading the book was great & made me look it up. So beautiful 😍"}, {"username": "Mallory Weber", "comment_text": "Planned most of my trip to Italy around this book!"}, {"username": "Lesley Wolfe Gillen", "comment_text": "I've been reading it this summer and am going to hand it off to my daughter to read next - then she is going with my husband and I to Italy in May!❤️"}, {"username": "Natalie Marie", "comment_text": "I enjoyed this book very much. I’ve wanted to visit Positano after seeing the Movie Under the Tuscan Sun. I’m planning a trip to Italy Sept 2024. Positano is on the itinerary. Can’t wait!🇮🇹🍷🥰"}]}, {"id": "2185828565149555", "text": "A little bit of heaven in Sorrento! 🍋\nThe view is unreal, the Grand hotel Sorrento has a wonderful terrace to enjoy the best sunsets and a beautiful panoramic swimming pool overlooking the Mediterranean coast,… आणखी surrounded by palm and eucalyptus trees 😍 simply a dream!\nDiscover more: https://www.anrdoezrs.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187782-d279184-Reviews-or20-Grand_Hotel_Riviera-Sorrento_Province_of_Naples_Campania.html%23REVIEWS", "link": "facebook.com/groups/1373361046396315/permalink/2185828565149555/", "likes": 38, "comments": [{"username": "Melinda George", "comment_text": "George Onofrio"}, {"username": "Andrea MacDonald Milham", "comment_text": "Staying here in June!"}]}, {"id": "2212252359173842", "text": "Discover Narni, one of the most beautiful villages in central Italy! You will explore a land of myths, legends and ancient history at the very centre of Italy!\nJoin our NEW virtual experience: आणखीhttps://nextstop-italy.com/virtual-tours/narni/\n\n#virtualworld #artlovers #art #vacationmood #history #italyiloveyou #italygram #italytravel #italytrip #medieval #medievalhistory #medievalart #medievalcastle #medievaltimes #medievalarchitecture #narni #narnia #chroniclesofnarnia #chroniclesofnarnia #hiddengems #hiddenplaces #magicalplaces #MagicalAtmosphere #umbria #umbriagram #umbrialovers #umbriatourism", "link": "facebook.com/groups/1373361046396315/permalink/2212252359173842/", "likes": 14, "comments": []}, {"id": "2211209409278137", "text": "Just a heads up that the CoopCulture website has night colosseum tours up for September. Limited tickets left in English... we just booked the Italian tour 😃\nhttps://www.coopculture.it/en/products/colosseum-by-night-colosseum-underground/", "link": "facebook.com/groups/1373361046396315/permalink/2211209409278137/", "likes": 10, "comments": [{"username": "Gina Christopher", "comment_text": "I never have any luck on that site!"}, {"username": "Kejdi Okej", "comment_text": "I never have any luck no that site l"}, {"username": "Joel Minter", "comment_text": "Alicia Thompson Minter"}, {"username": "Dianne Novak Iadanza", "comment_text": "14 available right now for August 18 night tour in English"}]}, {"id": "2211003049298773", "text": "I desperately need tips for packing for 14 days!! We will be traveling from Oct 6-20 this year on Regent Seven Seas! P.S. I am illiterate when it comes to fashion and color schemes", "link": "facebook.com/groups/1373361046396315/permalink/2211003049298773/", "likes": 77, "comments": [{"username": "Lisa Akira", "comment_text": "Less is best!!! It’s hard dragging luggage up/down stairs and cobblestones.\nOne carryon only!!!\n2 loose slacks,\n2 skirts,\n2 nice tees,\n2 blouses,\none cardigan,\nbathing suit.\nClosed toe shoes that are comfy for uneven terrain. I wore Dudes everywhere (with Spenco insoles).\nCrossbody bag with a solid zipper as your purse.\nTravel power adapter.\nLeave leggings, ball caps, and sportswear at home. You can have fun buying anything else you want/need!"}, {"username": "Mark S. Keller", "comment_text": "I will say our villa had a washing machine but Italians are not big on dryers. Plan accordingly"}, {"username": "Gail Dial Harris", "comment_text": "Less is more!!! Travel light! You will be glad you did!!!"}, {"username": "Frank Dragna", "comment_text": "We found a laundry. Dropped our clothes off in the morning and picked up in the afternoon."}, {"username": "Alicia Dombrowski", "comment_text": "Buy compression travel bags. Works great! I went for 10 days with just a backpack and mixed and matched several items and hand washed things in the sink and hung to dry. The hotels we stayed in had a laundry service we could have used but we didn’t. Best of luck!"}, {"username": "Patricia Hall", "comment_text": "Take everything out of your suitcase and then put a couple things back in"}, {"username": "Patricia Hall", "comment_text": "I packed for 21 days with a carry-on and still took too many clothes"}, {"username": "Rita Minasola", "comment_text": "Next time I go I am taking an empty suitcase and gonna shop till I fill it up!!"}, {"username": "Russell Weidner", "comment_text": "Pack light and layers…. Use the local laundry services!!"}, {"username": "Larry Basirico", "comment_text": "Carry on only and personal bag. Figure it out and make it work. Wash socks, underwear everyday when you bathe or shower. You’ll be happy you traveled light."}, {"username": "Donna Gebig Kotronis", "comment_text": "Buy compression packing cubes and pack for 7 days but lots of underwear you will be fine! Plus great shopping there"}, {"username": "Jacob Noah", "comment_text": "As long as there is a washer n dryer u are good."}, {"username": "Nancy Hettlinger Ackel", "comment_text": "Compression cubes"}, {"username": "Alice Moy", "comment_text": "When are you going? If it's during hot weather and you use compression packing cubes, you should have enough space to pack 14 days' worth of outfits in a carry on. Thinner crop tops, tanks and tshirts, socks and undies don't take up a lot of space. Throw in a few pairs of shorts, skirts or pants to mix and match. Or, if you decide to bring sundresses, you can bring fewer of some of the foregoing items."}, {"username": "Rayna Clarke", "comment_text": "You’ll need about four suitcases but you’ll only wear not even half of it."}, {"username": "Sarah Carden Bailey", "comment_text": "Travel fashion girls Facebook group. Join it."}, {"username": "Jenny Payne", "comment_text": "If you stay in airb&bs they have washing machines and take those sheets ( size of a tissue) that are washing sheets🌻"}, {"username": "Teresa Formichelli", "comment_text": "I checked in a carryon size suitcase with wheels and I boarded the plane with a backpack and handbag. Best decision I made for a five week euro trip."}, {"username": "Hollis H McGuire", "comment_text": "I’ve been reading these comments - but you’ll be on a luxury cruise, not backpacking!\nOn a ship, I plan to wear everything I take at least 3 separate times (not including boarding/\ndebark days) so that’s 4 evening outfits. Don’t worry, you won’t see the same people all the time anyway, and who cares?\nDid I say I hate overpacking? 😀\n\nDitto with daytime clothes, which are more casual.\n“Illiterate” made me laugh.\nChoose black - tan - white and you’ll be happy. Black is great for evening.\nA black cashmere poncho or wrap never hurts either.\n\nNow- will you be getting off the ship? Is she cruising in Italy? It will still be warmish there but you’ll need a warmth layer just in case - that cashmere thing maybe."}, {"username": "Sally Sharkey", "comment_text": "Shorts and sundresses! If you have access to clothes washer pack a few of each and re wear"}, {"username": "Craig Wilhelm", "comment_text": "🙄🙄🙄🙄"}, {"username": "Diane Pieri Adiliano", "comment_text": "We are traveling 30 days land and sea. Have big and carry-on"}, {"username": "Alexandra A Welker", "comment_text": "Pack light, use vacuum seal bags for your clothes or packing cube (I prefer vacuum bags). Pack clothes that you can easily mix and match. Neutrals for example; black, beige, white, gray, browns, blues and stripes/plaids of the same shade, linens, dresses, jeans (depending on where and when you go). Also, what helps me is create a spreadsheet and list my outfits for all the days, then I narrow things down because I can wash some of the clothes or buy them. 😃For footwear bring something that will compliment most of your outfits. For summer trips I usually bring flip flops, sneakers (I wear during travel), nice sandals or Tieks flats."}, {"username": "Cheryl Ann Petersilge", "comment_text": "My philosophy is pick a base color. Usually black. Pack 1 pant, 1 skirt and a dress. Clean top per day. These can give you the pop of color. A jacket for one temp cooler than expected. Ideally one that can roll and go in daily bag you are carrying. Plan to wear each base at least twice. I like clothes that are a knit or something that doesn’t wrinkle easy. You will also be able to buy shawls if cooler than expected. I like Tieks for nice looking comfy shoes. I’ve done two weeks travel in a carryon and no laundry."}, {"username": "Michelle Raymond", "comment_text": "We took some vacuum seal bags and used hotel vacuum to shrink it down so we could fit it all in one suitcase - allowed some space for items we purchased"}, {"username": "Sigrid Cormier", "comment_text": "For some assistance and ideas, google what to pack for 14 day cruise, female. See what works for you and your wardrobe. But it will give you some ideas how to coordinate and maximize your pieces. Have fun."}, {"username": "Merry Sterling", "comment_text": "We just returned from 28 days in Europe. Pack light. Take clothes that wash easily."}, {"username": "Elizabeth Lambi", "comment_text": "Regent will do laundry for you at no charge."}, {"username": "Jennifer Buatti Terrano", "comment_text": "I just don’t see how it’s possible to pack for a 2 or 3 week European trip in a backpack. At least not for woman. Need a couple pairs of shoes, dresses and casual wear, swim suits, make up and accessories. It’s not like packing for a camping trip or for somewhere that you wouldn’t care about fashion.."}, {"username": "Jeanne D'Orazio Curry", "comment_text": "I also just ordered costume jewelry to wear. I don’t want to have to worry about losing earrings etc. Mostly I wear Brighton at home and I love my pieces\nGood post"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Pack light and mix and match. I didn't wear half of what I brought and I only had a carryon."}, {"username": "Elisa Kukielski", "comment_text": "Bring as little as possible. Hotels and rentals all have hair dryers. Wear sneakers! No one will notice if you wear the same clothes on multiple days."}, {"username": "Elisa Kukielski", "comment_text": "Bring Tide packets for laundry! Rentals have washers!"}, {"username": "Jenny Jenn", "comment_text": "Packing for 18 days and I know I’m overpacking and I don’t care."}, {"username": "Tammy A Argento", "comment_text": "Cubes"}, {"username": "Sony Ucciferri", "comment_text": "thank you ! i cant wait for my trip september 11 to october 2"}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "Pack less pants and more tops. You can wear pants at least twice."}, {"username": "Catherine Lammers", "comment_text": "Love all these suggestions,,,b\nut my biggest dilemma always is …toiletries! I’m thinking of taking small containers and if I need more buy it there,,,We are going for a month in February,,,very\nexcited!"}, {"username": "Kurt Staples", "comment_text": "Tip #1. Leave everything at home but the credit card. Lol\nTip #2. Only take carry on. 2 pair of pants, 6 shirts, socks, underwear. Do laundry once on the trip."}, {"username": "Suzy Valla Pitts", "comment_text": "Roll your clothes, use packing cubes and wash stuff there. Good luck !"}, {"username": "Lori Finamore", "comment_text": "Pack half of what you normally will, bring two small bottles of fabric spray, pack extra shoes in case feet hurt, it is ok to run out of things because la farmacia is everywhere- we only did one carry on and one large personal item size backpack and we are fine 11 days bouncing around Italy- cannot imagine larger bags up and down stairs and there are lots of stairs and I stuck to one color combo to mix and match clothes"}, {"username": "Bruce Cicone", "comment_text": "Pack for 7. You’ll have more than enough."}, {"username": "Layla Maryam Razavi", "comment_text": "very easy, try luggage cubes, i do the zip bags with compression, then you can section parts of your trip - maybe you know one part is more at the beach or hiking, one is more city and nightlife, so that way when you get to a new place or hotel, just pull out the bag or cube you need, use those clothes, then put them all back in (dirty and separate) from what you will use in the next one. Also, invest in good luggage - a small carry on wheelie, with a good weekender bag that slides on the handle with lots of compartments in it can come in handy too for storing shoes, accessories, toiletries in the weekender so they are easy to access without having one massive suitcase you have to spill apart then repack in each city. I have done 30 days, 90 days, you will be fine, you got this!"}, {"username": "Sandy Hookerman Kriger", "comment_text": "I found that in Italy, especially in Florence Americans mostly look sloppy and extremely casual . Europeans and Italians generally are well dressed, but￼ still casual. Americans stick out like a sore thumb.! Be respectful of dress codes, especially in religious buildings ."}, {"username": "Maria Giordano", "comment_text": "Stick to one or 2 colors, roll your clothes, limit shoes to 3 pair including the ones you wear on the plane ( heaviest), pare down your toiletries to the bare necessities, leave bulky items like hairdryers & irons home & plan on washing out underwear at night if you can. I like to wear panty liners when I travel in case I run out of panties - semi clean once the liner is removed 😳. I always back a rather large nylon carryon tote with a makeup bag that contains my chargers & headphones- easy to grab plus snacks, advil, a pashmina & a hoodie. Download a few books instead of carrying them. Leave room for souvenirs!"}, {"username": "Christine Brookbank-Swider", "comment_text": "I went for 12 days & packed about 20 outfits - wore mostly everything I packed & loved having the variety & ability to change for dinner since it was very hot during day; definitely was not washing clothes on vacation; would do the same again when I travel (brought 1 checked bag & 1 carry-on)"}, {"username": "Inga Thomas Davis", "comment_text": "I just returned from a three week visit to Italy. I only packed a carryon and backpack. It was great only dealing with one suitcase. I packed 7 outfits that matched multiple ways. When returning back I purchased a duffle bag for gifts."}, {"username": "Rodica Surdu", "comment_text": "Count clothes for 5 days and you wash them every 3-4 days."}, {"username": "Rachael Richardson", "comment_text": "Half it half again and take more out !"}, {"username": "Aimee Owens", "comment_text": "My tip is to take a carry on and forget the stress of trying to get it all in a carryon. I was there for 15 days and could not have done it with carryon only."}, {"username": "Sandy DC", "comment_text": "Check out the Travel Fashion Girls FB page! Lots of terrific ideas."}, {"username": "Paula Gallagher", "comment_text": "Less is more"}, {"username": "Carla Snook", "comment_text": "Color coordinate your clothes so that way you only need to bring 2 maybe 3 bottoms and several different tops. Also, then only 1 maybe 2 pairs of shoes. And I always wear jeans on the plane since they take up the most space in the suitcase"}, {"username": "Adele Long", "comment_text": "Pintrest has lots of ideas"}, {"username": "Janelle Burlin", "comment_text": "We are leaving out of Rome on a 10 day cruise Aug. 18 Italy Greece Croatia Montenegro. Large check in suite case and backpack for plane?"}, {"username": "Anne Marie Reynolds", "comment_text": "Don’t overpack! It’s hot you won’t need much and your washing will dry quickly!"}, {"username": "Amber Pena", "comment_text": "I just packed for 10 days and I think I did good!"}, {"username": "Lisa Missigman Bianchini", "comment_text": "Packing cubes make all of the difference"}, {"username": "Lisa Missigman Bianchini", "comment_text": "I also wore a lot of the same colors so I could mix and march and always have the right shoes and accessories"}, {"username": "Patty Ham", "comment_text": "Two words. Packing cubes."}, {"username": "Lucrezia Folger", "comment_text": "It is best to have two pairs of bottoms (pants, shorts, or skirts) for each week that you'll be staying. Plan on bringing four shirts per week, and two jackets to layer for warmth (if you're traveling to a cool or cold destination). For a two-week trip, you need four bottoms and eight tops."}, {"username": "Patricia Skea Tsairis", "comment_text": "Patricia Skea Tsairis"}, {"username": "Patricia Skea Tsairis", "comment_text": "Same on the flip side"}, {"username": "Patricia Wagner", "comment_text": "Carryon with a small backpack or zip big bag. You won’t be seeing anyone for longer than 3 days so you only need 3 or 4 outfits to mix&match and two pair of shoes."}, {"username": "Julie Hunt", "comment_text": "Pack light , we didn’t and regretted big time . After walking up and down stairs , trains are the worst for big cases . You can wash things out and they dry well in your room . Carry on or a small easy case or bag ."}, {"username": "Sandra Timmons-Fratangeli", "comment_text": "Thanks for all the tips. Leaving for Italy for the month of sept. Great tips"}, {"username": "Bob Ingelhart", "comment_text": "Pack old socks and underwear and just throw them away after you use them. My wife hates this tip."}, {"username": "Denise Rocha", "comment_text": "Compression packing cubes. Stay with the Sam colour palette so you can mix and match."}, {"username": "Shelby Anderson Hefflick", "comment_text": "Sherrie Brookes good tips here"}, {"username": "Sharon May", "comment_text": "Minimal 😊"}, {"username": "Pam Kimak", "comment_text": "2 pairs of shorts white & gray, wore black long pants took 1 floral,1 white. 4 tops, wore white sweater..plane was cold, 1 nightshirt,1 bathing suit, undies, light single layer rain jacket..never used..perfect weather 11 days! Packed in carry on."}, {"username": "JoAnne Andrist Redwing", "comment_text": "Use packing cubes and roll all your clothes. Bring a couple bottles of travel size downy wrinkle releaser. I packed for 16 in a carry on. Good luck!"}, {"username": "Cathy Parrinello", "comment_text": "Pack Light…mix and match….nobody cares if u wear the same clothes..you will never see any of these people again..relax and enjoy your vacation.."}, {"username": "Joan Romiti", "comment_text": "Don’t pack alot and bring a extra bag you can put in your suitcase for extra thing you buy"}, {"username": "Brian Osman", "comment_text": "I packed light and went to a laundry mat about half way threw the trip, didn't take an hour and a half to wash and dry everything"}, {"username": "Jed Eldredge", "comment_text": "My wife and I were in Italy for two weeks. 2 Carry on bags and 2 backpacks total.\n\nPack light, re-wear often and do laundry when needed.\n\nDragging luggage around Italy is NOT advised at all.\n\nPack your fun and leave your vanity at home."}, {"username": "Kim Bend Smolinski", "comment_text": "We brought laundry sheets to wash undergarments in sink and a portable clothes line that you typically would use camping - there are no pins and it connects to anything. This allowed us to pack lighter. Not all VRBO homes/hotels have a place to hang things to dry. https://\nwww.amazon.com/\ngp/product/\nB09KP6BZBJ/\nref=ppx_yo_dt_b_\nsearch_asin_tit\nle?ie=UTF8&psc=\n1"}, {"username": "Michael Alea", "comment_text": "Pack for 7"}, {"username": "Mandy Thurmon McLaughlin", "comment_text": "I went with just a carry on and backpack. Took one cute dress for dinner and wine tours. One pair of capris, cute comfortable sandals, few shorts and tops, all coordinating colors to mix and match. Then a zip lock bag of detergent. Wash clothes as needed in sink, very hotel has a drying rack. No reason to drag around a huge suitcase. It's not worth it."}, {"username": "Mari Falcone", "comment_text": "We over-packed because we had 2 different climates to deal with (UK and Italy) so we sent home things via DHL."}, {"username": "Bea Kuckens", "comment_text": "If you'll be taking trains, pack light make your largest piece of luggage carry-on size."}, {"username": "Esther E. Sass", "comment_text": "Pack what you think you’ll need. Then next day go back n take out 1/2!!!!!"}, {"username": "Lesley Wolfe Gillen", "comment_text": "Go to Pinterest and look for packing suggestions like this one - they give me great ideas and even though I might not have the exact pieces in my closet, it still helps"}, {"username": "Lj Downs-Ahearn", "comment_text": "Light flowing clothing, sandles and trainers for walking"}, {"username": "Carmela Romo Alcon", "comment_text": "YouTube has great videos on how to pack. Packing cubes are very good and help keep things organized"}, {"username": "Jane Dalrymple", "comment_text": "Half as many clothes as you lay out, twice as much money"}, {"username": "Erica Merry", "comment_text": "I’d start now …"}, {"username": "Saura Prucey", "comment_text": "Just take a suitcase and pay for valets. Done and done."}, {"username": "Stacey Miller", "comment_text": "I focus on a color scheme, for me black and white w some pops of color, I can easily mix and match.\nMy list:\n2 sundresses\n2-3 skirts\n2-3 shorts\n6 tops\nSleep in a t-shirt and skip pjs\nHat\n2 prs shoes\nSocks if you need them, ie tennis shoes\n\nWash clothes (undies!) in sink as needed."}, {"username": "Barbara Burton Horstmeyer", "comment_text": "Less is best"}, {"username": "Cheryl Williams", "comment_text": "Pack for 8 days (a week's worth of clothes + an extra day's clothes to wear while you're doing laundry) and do laundry."}, {"username": "Janine Emma Lucas", "comment_text": "We’re doing 21 days in carryons! Pack light, easy to wash clothes, I bought 8 dresses (easier than 8 separates). Thin sweater, 1 pr capris, skort,3 matching tops, extra pair of shoes, pjs, toiletries. I still have room!\nWe also packed a thin folding duffle bag…for trip home I’ll stuff cloths in it, souvenirs in my carry on\n3 plain, 3 ferries, 2 trains and 1 bus\nCatania, Ortigia, palermo, Ischia, Capri, sorrento\nYou can do this!"}, {"username": "Brizee Kelly", "comment_text": "Reusable compression bags"}, {"username": "Beth Pierce", "comment_text": "Select 3 colors for your wardrobe. Makes packing shoes and outfits a lot easier"}, {"username": "Susan Donlan", "comment_text": "pack light really light and half way through stay at an airbnb with a washer. I throw in a small compact duffle bag just incase i see a thing or two or three I want to bring back."}, {"username": "Josette Legris Hughes", "comment_text": "Layers!"}, {"username": "Carol Taylor Tisdale", "comment_text": "Remind yourself... don't take all the \"what ifs\". You will be near pharmacies, retail, apple stores. You will be able to do laundry if needed. Take darker color clothes that don't show every little spot. Don't take your laptop - so heavy. Wear your comfortable pair of shoes and pack a 'dressier' pair. Don't worry about buying souvenirs for everyone at home - it takes up so much of your time and honestly it won't mean that much to them. This last trip i waited until we were leaving for home and shopped in the fabulous shops at CDG airport purchasing chocolates, macarons , cool foldable Paris totes for family members and then purchased a large tote to put it all in and carry on the plane."}, {"username": "Kelly Wren", "comment_text": "Travel Fashion Girls® (Official TFG Community) try this site they got me through my trip to Europe lots of great info"}, {"username": "Dan Lehew", "comment_text": "28 pairs of underwear"}, {"username": "Maureen King", "comment_text": "Amen to that ... me tooooo"}, {"username": "Denise Richards", "comment_text": "Mix and match. More tops than bottoms. Pinterest has some great suggestions. Remember you can do laundry and they have stores too if you need something"}, {"username": "Lori Iadevaia Francisco", "comment_text": "2.5 gallon ziplocks and packing cubes are my best packing hacks."}, {"username": "Nancy Lewis", "comment_text": "Carry on and a back pack to fit under seat. It can be done. I promise."}, {"username": "Ronna Fields", "comment_text": "I just did 4 weeks with a carry on only.\nI packed 2 of everything\n(except underwear).\nOne wind breaker.\nIt was perfect."}, {"username": "Bonnie Rodgers Henderson", "comment_text": "I packed very light. I wanted some new tops, things that were not like everyone else's at home. I was in Italy, France, Germany and Belgium for 11 weeks in February-April.\nFound some great sales and quality at reasonable prices."}, {"username": "Jennifer Drysdale", "comment_text": "Take basics. You’ll find you’ll wear same things most days. Trust me, don’t over pack. Anything you might need along the way, you can get. Even then, not very important because you’ll bring having such a great time."}, {"username": "Kimberly Poulos", "comment_text": "Take twice the money and 1/2 the clothes you think you need✅"}, {"username": "Deborah Coulter Cusick", "comment_text": "Roll clothes"}, {"username": "Sam Cupp", "comment_text": "I just got done with a 14 day trip and took a medium sized backpack (40L). I didn’t want to have to fight with a suitcase. I prefer to carry a backpack. So that part just depends on preference. I will say it was nice around Venice especially to not have to fight with a suitcase.\n\nAnyways, It was tight but I had everything that I needed. In the middle of the trip I washed clothes in the sink. (Mainly undergarments and the items I wore several times) It’s so hot everywhere that I wore running shorts and tanks , a skirt several days with different shirts, a tshirt dress, and a cute romper for nicer dinners. I also had bike shorts to mix it up. I find that having items that you can mix and match helps a lot.\n\nAs far as shoes, tennis shoes and Tevas were all I brought. I never found myself in want of any others.\n\nI made an itinerary and planned out what outfits could work for several days. I like to roll items to pack in a backpack, I feel like it helps maximize your space."}, {"username": "Melanie Shoemake Eason", "comment_text": "Add yourself to the Facebook group Travel Fashion Girls.. game changer!!"}, {"username": "Eugene Lee", "comment_text": "For everything else, there's VISA."}, {"username": "Sonny Timm", "comment_text": "Clothes would be nice. Why don’t you Google the weather and figure it out on your own."}, {"username": "Barb LaPlante", "comment_text": "Take a quick drying travel towel to help wring out your clothes you wash. Helps a lot!"}, {"username": "Gaye Watkins", "comment_text": "No ones going to see you often. 3 or 4 outfits, mix and match. done."}, {"username": "Lisset Berdeal Sassi", "comment_text": "I shrinked packed all my outfits by cities it was the best thing I did."}, {"username": "Lisset Berdeal Sassi", "comment_text": "Lisset Berdeal Sassi"}, {"username": "Lisset Berdeal Sassi", "comment_text": "Lisset Berdeal Sassi"}, {"username": "Tracy Young", "comment_text": "Minimize as much as possible is my biggest tip!! Take a carry on..it really is enough. Look at your suitcase packed and then take out 5 items. You can re-wear and layer things. Credit card, ATM/cash, travel medicine priority in case you get sick because you can’t easily just find a pharmacy always, and comfortable walking shoes."}, {"username": "Lucrezia Folger", "comment_text": "What month and where? North, South? Mountains, coast?"}, {"username": "Cece Coffee", "comment_text": "Pack for 7"}]}, {"id": "2210944859304592", "text": "following up from the last post-\n\nwhere is the best place to exchange $ for euros?\n\nthe rate is 1.10\n(my bank is charging 1.17... thought they were suppose to be better?)", "link": "facebook.com/groups/1373361046396315/permalink/2210944859304592/", "likes": 1, "comments": [{"username": "Paul Anderson", "comment_text": "At a bank ATM in the country that printed the money."}, {"username": "Brian Osman", "comment_text": "Get them from your bank before you leave"}, {"username": "Wayne Copes", "comment_text": "What if you have cash to swap to euros. Where is the best place to do it ?"}]}, {"id": "2211132225952522", "text": "I've seen some questions here about the\nbest way to travel with luggage to multiple cities using trains, boats, cars, planes and public transport. For my sister Catherine and I, it was pretty simple. Weआणखी traveled for 30 days all over France and Italy with our small rolling suitcases and a regular sized backpack. This proved to be invaluable when stowing in overhead plane and train bins, rental car trunks, and ferries. We stayed in a combination of hotels and airbnb's where washing machines allowed us to launder often. That saved space in our luggage and made for a much lighter load to carry. Here's a photo we took in Lake Como while waiting for the train to take us to Milan.", "link": "facebook.com/groups/1373361046396315/permalink/2211132225952522/", "likes": 124, "comments": [{"username": "Petra Pechan Groves", "comment_text": "Keryl Lesley Edwards do you think this is doable?"}, {"username": "Anne Marie Reynolds", "comment_text": "Norm Reynolds lets take a leaf........"}, {"username": "Gretchen Barretto", "comment_text": "Mel CastilloJoash Isaiah CastilloJoachim Miguel Castillo pack light."}, {"username": "Andre Le Huray", "comment_text": "Naomi Murphy"}, {"username": "Chrysa Arvaniti", "comment_text": "See? Where there 's a will, there is a way!!!👍👍👍"}, {"username": "Sandra Paul", "comment_text": "Can you share where you stayed in Milan?"}, {"username": "Paula Bennett", "comment_text": "I don’t see questions about luggage I see lots of answers though. All about how they packed for 6 months in a carry on, etc etc"}, {"username": "Nancy Lewis", "comment_text": "I made same trip. Loved Lake Como"}, {"username": "Mona Sidhu Samrari", "comment_text": "Oh Man nice. It’s so hard for fashionable person to take less clothes 😄😰😨🫣🫣"}, {"username": "Helen Layton Brechler", "comment_text": "Wow\nWhat kind of clothes\nDo you have"}, {"username": "Joe Pisano", "comment_text": "Washing machines are very few in Italy. Dryers aren’t even less. Notice all the clothes hanging outside on the lines. You could be a big person and pack a little more next time"}, {"username": "Katie Wilmoth", "comment_text": "Major props! 😂 🙌🏻 I want so badly to travel with just a carryon when we go to Italy to make life easier but there’s just no way. I can’t even go to our own vacation place in Florida without packing a suitcase. I just have to have lots of clothing options and shoes."}, {"username": "Shirley Lewis", "comment_text": "we take a medium roller bag and use the laundry ... no matter what kind of clothes it works ..."}, {"username": "Mario Torre", "comment_text": "Easy to find laundry supplies?"}, {"username": "Mona Ruff-Root", "comment_text": "Could I have the name of the purple suitcase ?"}, {"username": "Nancy Jones Bruscino", "comment_text": "We are doing the same in October. One rolling, small, suitcase and a backpack."}, {"username": "Bob Lampo", "comment_text": "I agree. A rolling suitcase and backpack per person worked very well. Rolling bags are a challenge on cobblestone but not much we could do about that lol."}, {"username": "Anwen Ingram", "comment_text": "My problem is, I ended up buying stuff."}, {"username": "Jacquie Johnston", "comment_text": "I’m 69 and my husband is 70 and we went to Italy with exactly the same type of luggage we did 21 days planes, trains, cruise ships and automobiles"}, {"username": "Catherine Saillant", "comment_text": "Hi all: I'm the sister and we had a lovely time (ask Christine Saillant Mitbo about the time we accidentally drove onto a goat trail in pitch darkness in Tuscany--travel\nmagic). My No. 1 travel tip is to pack light. Because you won't remember what you wore--but you will remember the amazing places you went because you weren't tied down with luggage. Buon giorno!"}, {"username": "Emily Ehlers", "comment_text": "What is the blue case"}, {"username": "Suzy Coler", "comment_text": "Suzy Coler"}, {"username": "Adriana Sormani", "comment_text": "Perfetto!"}, {"username": "John Spensieri", "comment_text": "Did the same in Italy for 6 weeks!!!"}]}, {"id": "2211739215891823", "text": "I keep reading about VAT tax, but it seems to be for high-end items? If I'm just buying a few souvenirs or personal items, am I required to request a refund? Is it worth it? Seems complicated.", "link": "facebook.com/groups/1373361046396315/permalink/2211739215891823/", "likes": 12, "comments": [{"username": "Colleen Dawson", "comment_text": "Not complicated. Single purchase of €150 or more qualifies.Googl\ne has a great explanation, and if you do use it download the Global Blue app to help you."}, {"username": "Tara Roed", "comment_text": "I thought so too. I made a few more expensive purchases. The stores do the work. They will give you all The paperwork you need in a large yellow envelope (think it was yellow…you won’t miss it). When I got to the airport in Rome saw signs for vat tax and stopped at the window. Handed them everything and passport I believe. It was done in a few minutes. Much easier than I assumed."}, {"username": "Donna Dougherty", "comment_text": "I purchased a handmade leather bag in Firenze. They shipped it me in the USA in exchange for the VAT. It made it to my house before I made it home"}, {"username": "Virginia Lane", "comment_text": "https://\nwww.ricksteves.c\nom/travel-tips/\nmoney/\nvat-refunds"}, {"username": "Stephanie Bock Newlun", "comment_text": "Follow"}, {"username": "Jaime Cleek", "comment_text": "No it’s when you spend a lot of money I think at least 154.95 EUR. Sorry I had an extra 0. This is what Google said"}, {"username": "Karen Lawrence Smith", "comment_text": "Any purchase over $155 I believe is eligible for VAT refund. Smaller purchases won’t receive any. Usually the store will do the paperwork for you."}, {"username": "Christie Grant", "comment_text": "We got the run around waste of time"}, {"username": "Eva Szalai", "comment_text": "Mostly for designer items 😉"}, {"username": "Kejdi Okej", "comment_text": "Mostly for designer items 😄"}]}, {"id": "2211742329224845", "text": "Has anyone taken the Italian Holiday tour with Trafalgar?", "link": "facebook.com/groups/1373361046396315/permalink/2211742329224845/", "likes": 2, "comments": [{"username": "Christine Giglia", "comment_text": "Yes, twice. Last time was 20 yrs ago but we were extremely happy with the tours."}]}, {"id": "2211746115891133", "text": "Hi 🙂\nI’m going to Rome at the end of august til September 2. What is the best way to visit the coliseum? Can I buy ticket the same day? I checked on coop culture and there’s no tickets available 😞 thank you :)", "link": "facebook.com/groups/1373361046396315/permalink/2211746115891133/", "likes": 1, "comments": [{"username": "Mil Myvegas", "comment_text": "If you are NOT looking for a guided tour then consider The PARCO Membership from CoopCulture. €80 includes two adults and up to three children under 18 yrs of age. You still need to reserve your free admission to the Colosseum by choosing your preferred date and time, but there is a special link for members to do this and there is currently availability (9:30 am - 5:30 pm) everyday through the first week of September. I purchased the membership and used it two weeks ago. You will need to redeem the voucher at the ticket booth, but there is a designated window for members and there’s no need to stand in the long line for same day tickets. If you purchase the membership you will need to present your passport/s. This is how I secured my entrance tickets. You do get access to the Forum, Palatine Hill, and Super Sites, No underground access and NO tour guide. This worked for my family. https://\nwww.coopculture.\nit/en/products/\nparco-membership\n/"}]}, {"id": "2211772362555175", "text": "Vernassa (cinque Terre) #reels #reelsinstagram #instagram #trending #viral #explore #love #instagood #explorepage #reelitfeelit #follow #photography #fyp #reel #instadaily #reelsvideo #like #आणखीmemes #foryou #music #facebookreels #facebook #facebookviral #reelsviral #reelsviralvideo #reelstrending #trendingnow #reelstrendingvideo #facebookpost #riomaggiore #monterossoalmare #manarola #corniglia #vernazza #cinqueterre #laspezia #reels2023 #ristoranteilgabbiano #paanokumitasafacebookreels #facebookreelssahod #facebookreelsearnings #metaverified #metaverifiedaccount #facebookreelsmonitization #facebookreel #fbreels #facebookreelssettings #facebookreelsincome #facebookreelsplaybonusprogram #facebookreelsvideo #facebookreelseligibility #facebookreelsviral #facebookreelspayout #facebookverified #bonassola #levanto #adsonreelsfacebook #adsonfacebookreels #adsonreelsmonetization #monterossobeach #monterosso", "link": "facebook.com/groups/1373361046396315/permalink/2211772362555175/", "likes": 3, "comments": []}, {"id": "2211780702554341", "text": "I heard that tipping is an issue in Italy (on random services)\nWasn't sure if this is correct", "link": "facebook.com/groups/1373361046396315/permalink/2211780702554341/", "likes": 7, "comments": [{"username": "Joe Pisano", "comment_text": "Tipping in Italy is you. Maybe 5% in cash that’s it"}, {"username": "Rita Scotto Epifanio", "comment_text": "Most places if you sit down to eat they’ll charge you a coperto. Anywhere from 1-3 euros per person typically. That’s a charge just for sitting down. So when you get the check you don’t tip 20% as you would in America. Obviously it’s up to you how much you tip. They’re not going to not take the money. I usually just round up my bill when I pay the check. I’ll throw in 50 cents or 1 euro into tip jars at the bar."}, {"username": "Etschi Bruckner", "comment_text": "don´t spoil the Italian restaurants scene by tipping like in the US - just round up a bit when you´re happy with the service!"}, {"username": "Vivien Paulik", "comment_text": "You do not have to tip if you do not want. Service fee is already on the bill"}, {"username": "Wendy Spano Bracco", "comment_text": "The service fee/coperto is not a tip. I’m not sure if people are confused by this or say it to throw throw people off. It’s a fee for table, linens, bread. It does NOT go to the waiter. Tips are happily accepted. It’s up to you if you want to leave a tip or not. We leave tips for great service."}, {"username": "Leila Jane", "comment_text": "Can you tell us what you mean by \"issue\"?"}, {"username": "Patricia Portas", "comment_text": "It's not an issue. It's just not mandatory. It's the way it should be, you tip when you're happy with the service."}, {"username": "Lora de Vries", "comment_text": "I think she means that some restaurants in Italy are charging an extra charge (€2-3) for an extra plate, if you for e.g: share a sandwich, pizza or whatever etc. I read a report yesterday. The owner of the restaurant argues that they are justified for billing that extra amount due to having to clean an extra plate. However, it is not correct and they (some owners) will see how far they can take it and get away with it. This is in addition to the Coperto charge per person. Have the amount deducted if it is on the bill. Check this carefully!!"}, {"username": "Paolo Mittiga", "comment_text": "I am Italian .. tipping is always good and appreciated for the waiters .. I usually tip 5-10% , so if the bill is between 50–100 euros you tip 5 euros if it’s between 100-200 you tip between 5-10 euros. If the bill is less than 50 you tip 2 euros … they will send their blessing ..that’s what you want 😃"}, {"username": "Clarissa Rava", "comment_text": "Just the fact these things have been reported can make you answer yourself. Those are not normal situations in italy and are not accepted by us italians, and therefor that’s why its all over the news."}, {"username": "Charlie Charnigo", "comment_text": "Tipping is like feeding pigeons. The more you tip the more they expect. That is why they love American tourists. We over tip and tip everyone. So a cabby in Rome will demand a tip from an American but not a Roman."}, {"username": "Lynda Edmiston", "comment_text": "Watch out for service charges. They can be 3 or 4 euros per person. I don’t mind paying this at all if you’re having a meal but one place charged us 12 euros service charge just to have 4 soft drinks - I complained and they dropped it to 9 euros 😳 - a right rip off and needless to say we didn’t leave a tip and we didn’t return!"}, {"username": "Maria Antidormi Corica", "comment_text": "It’s such a pain! Also don’t get stooged if someone tries to help you at a station or airport. They then ask for a tip so they can eat some lunch or whatever. It makes me so cross!"}, {"username": "Shazeika Khan", "comment_text": "We tipped €50 on a big bill and they gave it back to us in Milan 🤷🏽‍♀️ … left us a little confused on how to tip as we didn't wanna offend anyone"}, {"username": "Crystal Waltz", "comment_text": "The way I understand it, servers in Italy get paid a monthly salary, unlike in America where servers get a very low hourly pay. The coperto in itself is not a tip, but does help insure that the proprietor is able to pay their servers a living salary. We encountered one restaurant that did not add a coperto and asked for tips in their signage in Venice. We tipped there. So, while the coperto is not a tip, it makes sense to me that if there's no coperto added, one would maybe tip at that establishment. And then, when you do tip, 10% is enough."}, {"username": "Valerie Collanton", "comment_text": "If you enjoyed your meal and waiter’s service why would you not show your appreciate with a tip. Give it directly to the waiter in cash. The coperta you see in your bill is not a tip and it doesn’t go to the waiter. If you don’t want to pay the coperta (which is a nominal charge) don’t go to a restaurant."}, {"username": "Cynthia Marie", "comment_text": "Tipping is not part of the European culture. I can speak from our experiences in England, Italy and Spain . Also, my husband is English, born and raised in London. It’s not culturally appropriate."}, {"username": "Cindy Neal Norvell", "comment_text": "The service fee does not go to your server......I ALWAYS tip as a common courtesy unless I've recvd horrible service (seldom has happened) They work hard and deserve the tip, at least I belive they do. I do leave 10% in Europe because that's more than standard and always 20% in the U.S. Hope this helps. They definitely appreciate it!"}, {"username": "Mike Laudick", "comment_text": "It is not an issue. You don’t tip!"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "There's nothing strange if you don't leave tip"}, {"username": "Colleen Schimmenti", "comment_text": "I found most places if you paid by credit card, were saying it doesn’t include the tip. Pretty much everywhere, we left a tip. One restaurant at Piazza del Popolo charged 19% service charge. 😯"}, {"username": "Laurie Francis Menk", "comment_text": "Good service. Tip"}, {"username": "Robert Brenner", "comment_text": "Tip tour guides!"}, {"username": "Ali Everson", "comment_text": "Only asked once for a tip and that was random. One guy presented us with the bill and asked for a tip and another guy completed the sale and did not. Yellow chairs band playing in the square Venice. Ridiculous prices. Our icecreams already cost 23 Euros for the pleasure!!! Of course that involved a coperto/ sitting down fee."}, {"username": "Frank Hunt", "comment_text": "Tipping only an issue if you worry about it, often it is included in the restaurant bill as service charge so never tip there. If not it’s up to you but I normally don’t for daily items coffee cake."}, {"username": "Selys Dewilde", "comment_text": "Are you serious? Of course tips are appreciated in Italy, as they are all over Europe! Of course, they're not obligatory like in the United States. But a minimum of respect for those who serve you is universal !"}, {"username": "Aurora Villegas Flores", "comment_text": "An issue, how?"}, {"username": "Jill Tingley", "comment_text": "I remember paying extra for tablecloth once. Thought it was very weird"}, {"username": "Judi Rinaldo", "comment_text": "we were asked to leave a tip if we liked the Service n Florence at a restaurant by Ponte viccio"}, {"username": "Valentina Bachi", "comment_text": "Tip is not mandatory nor expected here. Of course, it will be welcome."}, {"username": "Jessica Olivero", "comment_text": "I’m not sure I understand your question."}, {"username": "Peggy Fisher", "comment_text": "I tip everywhere. It's up to you. <3"}]}, {"id": "2211794839219594", "text": "Anyone use Apple AirTags? I just bought some to use on our trip in October. We’re going via train. Last trip to Europe, my luggage was lost!", "link": "facebook.com/groups/1373361046396315/permalink/2211794839219594/", "likes": 2, "comments": [{"username": "Victoria Jane", "comment_text": "Yes! I have one on my dog, one in luggage, and one in my purse"}, {"username": "Judi Tevere", "comment_text": "They work well. I use them."}, {"username": "Danielle Stauffer", "comment_text": "Yes , I used on my luggage and backpack in the vent it was lost or stolen !"}, {"username": "Laura Uribe", "comment_text": "Yes. We have them in my purse, the backpack, both luggage and our car. Worth it to know where everything is."}, {"username": "Sandy Radican Shikaly", "comment_text": "Love them!"}, {"username": "Nancy Elson Zacune", "comment_text": "Bought them from Amazon. Haven’t used them yet. 🤷🏼‍♀️"}, {"username": "Suzanne Charron-Greco", "comment_text": "Use it for my keys and in my dog"}, {"username": "Emily Kelley Arrowood", "comment_text": "We bought off Amazon and put in all our luggage."}, {"username": "Joyce Ulzheimer Rode", "comment_text": "Absolutely purchase. Amazon"}, {"username": "Patricia Trychta", "comment_text": "Yes great to put in luggage. Amazon or apple store"}, {"username": "Tara Roed", "comment_text": "Got one as a gift that I keep on my keys and it definitely works. I didn’t check my bags so didn’t use for travel. Sure it’s a great idea though"}, {"username": "Kathy Casey", "comment_text": "Yep, I use them and also put one in my 11 year old daughters backpack when we travel as she uses that as her carry on, just to be safe."}, {"username": "Yolanda Ann Stout", "comment_text": "Yes. We put them in our luggage. When we returned home we use them on our boat and shed keys. They’re great to have. The shed keys fell out of husbands pocket and we were able to find right away. We also have one on our escape artist yorkie, that’s been a lifesaver!"}, {"username": "Figen Dayan", "comment_text": "I have them in all my luggage and handbags. Perfect to find your stuff. Useful finding your dog or husband as well 🤣🤣🤣"}, {"username": "Noelene Cameron", "comment_text": "Yes and love them"}, {"username": "Ricki Smith Harvey", "comment_text": "Had one air tag in each of our bags when we checked in at airport. Got both our bags at destination - but air tag showed it was still in the airport in the states. Baggage handler must have removed. Hide the tags in your luggage!!!"}, {"username": "Jeremy Trumpey", "comment_text": "Yes, I always use them in every suitcase. I highly recommend it."}, {"username": "Julie DeRice", "comment_text": "Yes and I love them. My bag was lost at airport and they kept saying it wasn’t. Also use one when we ship our car."}, {"username": "Linda Pettit Profita", "comment_text": "Used them last summer on our trip to France. Worked great!"}, {"username": "Susan Trenear", "comment_text": "For every bag and passport wallet. They saved us recently when Air France lost our bags. The best invention ever!!!!"}, {"username": "Jenny Frank", "comment_text": "everyone is using them"}, {"username": "Edgar Power Stella Kyritsis", "comment_text": "We used them this summer and airport didn’t send our luggage along as they should have in Europe we knew exactly where our luggage was travelling they went to more Greek islands than we did lol"}, {"username": "Gail Ann", "comment_text": "Used them in Switzerland, worked perfectly. Won’t travel without them."}, {"username": "Georgeann Amelia Ardito", "comment_text": "Yes I travel from Fl to Ibiza Spain 🇪🇸 it was wonderful to know where my luggage was😀"}, {"username": "Barrie Maynor Vela", "comment_text": "Pack in a carry on and personal bag with trolley strap, I used a backpack that attached to carryon and had enough clothes for 2 weeks and did laundry once, game changer when traveling thru europe and no worry of losing luggage , I still used a tag just to be safe but highly recommend not checking your luggage and try to do/pay for laundry instead 😉"}, {"username": "Judy Galloway", "comment_text": "Just got some"}, {"username": "Irene Oda", "comment_text": "We use the android Tile- all work very nicely. I placed the tag/tile in a small ziplock ( smallest I could find was ziplock used for beads). Placed in a zippered compartment that's were it stayed for the whole journey."}, {"username": "Alicia Cox", "comment_text": "Yep! Game changer."}, {"username": "Noreen Hansen", "comment_text": "They’re wonderful"}, {"username": "Liane Sabina", "comment_text": "They work great!"}, {"username": "Christine Ann", "comment_text": "Yes. Our luggage was lost. We were able to see it had not put on our flight. We were able to track it the whole time until it reached us. Good idea to have them."}, {"username": "Maria Sadek", "comment_text": "For every bag"}, {"username": "Meredith Williams", "comment_text": "yep! i also put mine in my purse each day bc why not 😂🤷🏻‍♀️"}, {"username": "Teddie Backus Spano", "comment_text": "We used them last year. Love them."}, {"username": "Rhonda Hope", "comment_text": "Yes love them"}, {"username": "Bev Jean", "comment_text": "Where do you get them?"}, {"username": "Kathy Boyle", "comment_text": "Yes and they are fantastic."}, {"username": "Karen L Hutchinson", "comment_text": "Bev Jean Amazon. Pack of 4 was $88."}]}, {"id": "2211825949216483", "text": "Hello All, just curious, how widely accepted is the Wise card throughout Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2211825949216483/", "likes": 3, "comments": [{"username": "Giovanni Pianigiani", "comment_text": "Never heard about it"}, {"username": "Melanie Baffes", "comment_text": "I used it a few years times and it worked just like a credit card. But I had a lot of trouble transferring money to it and the customer service people were no help at all."}, {"username": "Mia Catalano", "comment_text": "Just got back and used it everywhere. Didn’t come across one place where we couldn’t use it."}, {"username": "Sam Cowie", "comment_text": "I have just come back from 2 weeks in Italy and there were only about 3 places that it did not work, I had a back up card so it was no issue. We travelled from Venice, down to the Amalfi coast."}, {"username": "Deb Deb", "comment_text": "I use it all over the world"}, {"username": "Frances McDonagh", "comment_text": "Probably only bank card or revolut"}, {"username": "Isabelle Truong", "comment_text": "I used it throughout Italy, Turkey and Greece without any problem."}, {"username": "Kate Laidlaw", "comment_text": "We’ve used it for 4 weeks across Europe, including pounds for London. Highly recommend it"}, {"username": "Leslie Idone", "comment_text": "Hi! I used my Wise card all throughout Italy with no issues"}, {"username": "Lori Hill", "comment_text": "I used it everywhere for 9 days with zero issues."}, {"username": "Katie Weera", "comment_text": "No issues in Milan, Venice, Assisi, Florence, Sorrento, Capri, Naples, Rome or Genoa. Easy."}, {"username": "Monica Grieger", "comment_text": "We are here now and haven’t had any issues\nOnly when they need to take a hold on the card I think sometimes that didn’t work -I think that was just car hire tho\nso we just used Amex but other than that it’s been fine"}, {"username": "Julie Koenig Cooper", "comment_text": "Wise Card?"}, {"username": "Jodi Gowler", "comment_text": "It’s all we used"}, {"username": "Erin Scott", "comment_text": "It’s worked everywhere for me so far!!!"}, {"username": "Rebecca Yeoh", "comment_text": "I used it everywhere! If you do a transaction and it gets declined it just means you need to insert the chip and enter your pin (rather than tap). This happened to me a handful of times. I looked it up and it’s a security thing to make sure it is the owner of the card making the transactions. Doing the pin every now and again will keep it working when you use tap 👍🏼"}, {"username": "Kejdi Okej", "comment_text": "Never heard about i t"}, {"username": "Sam Jones", "comment_text": "I’ve used it in 6 countries no problems as it’s used everywhere."}, {"username": "Dawn Richards", "comment_text": "It's great we here now and have had no issues"}, {"username": "Costero Home", "comment_text": "Widely accepted."}, {"username": "Atet GC", "comment_text": "Wise is accepted worldwide it is a prepaid Visa card. You put money in it, so as long as it has money in it you are good to go."}]}, {"id": "2211864915879253", "text": "Beautiful town Ostuni, Italy 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2211864915879253/", "likes": 3, "comments": []}, {"id": "2211956805870064", "text": "Matera , Italy 🇮🇹 Matera is an ancient city. It is the third oldest city in the world, after Aleppo and Jericho, with over 10,000 years of history. The rock caves. 🇮🇹💖❤️", "link": "facebook.com/groups/1373361046396315/permalink/2211956805870064/", "likes": 7, "comments": [{"username": "Ted Cabot", "comment_text": "Matera is amazing!"}]}, {"id": "2211969409202137", "text": "I went to Italy with my daughter in May and we had amazing time. She loved eating gelato all day every day and eat pizza and pasta for breakfast, lunch and dinner 😅", "link": "facebook.com/groups/1373361046396315/permalink/2211969409202137/", "likes": 480, "comments": [{"username": "Janina Rose", "comment_text": "Awesome"}, {"username": "Tina Martin", "comment_text": "What beautiful memories you made together."}, {"username": "Louise Faggioni", "comment_text": "Beautiful trip, what a great mom, making forever memories and travel is so educational!🥰"}, {"username": "Elisabetta Coppo", "comment_text": "Since I've been in this group I realized I never enjoyed our ice cream enough, I took it for granted! Your daughter is lovely! 🥰"}, {"username": "Laura Irmina", "comment_text": "You girls are gorgeous! May I ask what's your ethnicity?"}, {"username": "Mary Fornataro", "comment_text": "You're creating a little traveler! 💕"}, {"username": "Francesca Arena", "comment_text": "Thank for sharing your travels of Italy . Ice cream, my favorite food."}, {"username": "Anna Gradek", "comment_text": "May I ask how old is your daughter? I would love to travel with my 8 year old son but am dreading to hear constant “I’m tired.” But then, if I let him eat gelato and pizza all day everyday, maybe it transforms kids into amenable creatures. 😂"}, {"username": "Tamara Van Tassel", "comment_text": "Great pictures! Looks like you both had a ball!"}, {"username": "Liza Vega Santos", "comment_text": "Beautiful memories! Rephotograph the pictures after 10-15 years, same site, “then and now” kinda thing! That’ll be so nice."}, {"username": "Mary Lou Gillen", "comment_text": "What nice memories!"}, {"username": "Adris Razwan", "comment_text": "♥️♥️♥️"}, {"username": "Elaine Lee", "comment_text": "lol, we had the same meal plan when we were there"}, {"username": "Eva Sahmanian", "comment_text": "So sweet!💕 Thank you for sharing!"}, {"username": "Nicola Hilliard", "comment_text": "I'm going with my daughter in November, looks like you had a wonderful time."}, {"username": "Helen Provan Elliott", "comment_text": "Very lucky little girl, love this for you both, what a great mama you are ❤️"}, {"username": "Wilma Resta", "comment_text": "Best trips are Mother and daughter. We always have fun!"}, {"username": "Mary Ann Brown", "comment_text": "So cute"}, {"username": "Jeanie Nelson Lundquist", "comment_text": "Super cute! What time were you at Trevi Fountain? Looks like you had the place to yourselves!"}, {"username": "Donna Harrison", "comment_text": "Mother and Daughter Holidays are the Best 👩‍👧❤️"}, {"username": "Tanya Oke", "comment_text": "❤️💚"}, {"username": "Peony Nguyen", "comment_text": "Lovely 🥰"}, {"username": "Pam Villies Trikolas", "comment_text": "Looks like you had an amazing time"}, {"username": "Carine Brys", "comment_text": "Mother-daughter\ntrips are the best! I went to Sorrento with my (adult) daughter and it was my best trip ever!"}, {"username": "Evelyn Chia", "comment_text": "What a fun trip to take!"}, {"username": "Ann Perkins Elliott", "comment_text": "Very nice!!!"}, {"username": "Michelle Greenspan Tomberlin", "comment_text": "I took my daughter when she was 11 (she is 25 now). We still talk about that trip to this day. One of my best Mommy memories 🥰"}, {"username": "Beth Burns-Reyes", "comment_text": "We are planning a May vacation next year may i ask how was the weather temp wise?"}, {"username": "Jean Paulroc", "comment_text": "Jean Paulroc"}, {"username": "Mary Sama", "comment_text": "I love This so much 💝Absolutely beautiful time to always treasure ! My husband did this with our son when he was 10 they went to Italy for a month, he’s now 28 and has travelled so many places but to Italy he’s been back 10 times !! He’s definitely learned so much along the way and has so many friends in different countries. Has his Italian passport and is there now. One of the greatest pleasures in life is to travel, what a great experience for you both !"}, {"username": "Val Kilgallon", "comment_text": "Fabulous pics of you and your little one!"}, {"username": "Ly Phng", "comment_text": "Maggie Daicar you did it with your daughter!!!❤️❤️❤️ i hesitate to do same thing with my daughter…maybe I will think about it for next year"}, {"username": "Coreen McGuire", "comment_text": "My kinda vacation!!"}]}, {"id": "2211994119199666", "text": "Favorite hotel in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2211994119199666/", "likes": 30, "comments": [{"username": "Kathy Kattic McKee", "comment_text": "Hotel Bernini"}, {"username": "Cheryl Novis", "comment_text": "Alfieri Signature Suites - Alfieri Collezione great hotel"}, {"username": "Kate Gold", "comment_text": "FH55"}, {"username": "Candy Mattiello", "comment_text": "J and J"}, {"username": "Ricky Ellis", "comment_text": "Berchielli"}, {"username": "Josie Augustine-McAllister", "comment_text": "Hotel Berchielli"}, {"username": "Kristyn Kessler Lau", "comment_text": "Solo Experience"}, {"username": "Linda Angrisano Boos", "comment_text": "I believe it’s called the Frame Hotel. The suite has a hot tub on the terrace and a view of Florence."}, {"username": "Heather Held", "comment_text": "Westin Excelsior"}, {"username": "Barbara Britschgi", "comment_text": "Hotel Silla in Florence"}, {"username": "Susan Carney Ash", "comment_text": "We loved L’Orologio Firenze"}, {"username": "Luanne Carey", "comment_text": "We usually rent an apartment now, but Hotel Duomo was a great place to stay a few times. ￼"}, {"username": "Donna Hall Ortego", "comment_text": "I loved the Westin Excelsior. Fantastic location, service, rooms, and the view of the Arno river from the restaurant was spectacular"}, {"username": "Jules Jules", "comment_text": "Has anyone stayed at c-hotels Ambasciatori ?"}, {"username": "Jessica Krebs Boie", "comment_text": "Following ❤️"}, {"username": "Lisa Gelsomino Hennessy", "comment_text": "Hotel Kraft"}, {"username": "Jon Jagher", "comment_text": "St. Regis"}, {"username": "Eliza Hatzivassiliadou", "comment_text": "Hotel Renaissance"}, {"username": "Suzie Gibbs", "comment_text": "Rivoli Boutique hotel …It has so much charm and central enough to get about"}, {"username": "Lynne Sperry Kaesmann", "comment_text": "Hotel Savoy ❤️❤️"}, {"username": "Toni Marie", "comment_text": "Following"}, {"username": "Gina Scavetta", "comment_text": "Hotel Kraft - amazing views from rooftop restaurant and pool/ GREAT location!!"}, {"username": "Steve Watkins", "comment_text": "Alfieri"}, {"username": "Jodi Thomas", "comment_text": "Fantastic Airbnb overlooking Piazza di Santa Croce with a terrace looking at the Basilica Santa Croce. Highly recommend."}, {"username": "Karen Edl", "comment_text": "Anyone know how the Borgese Palace Art Hotel is?"}, {"username": "Graciela Vargas", "comment_text": "Emma hotel"}, {"username": "Christy Lee", "comment_text": "Another vote for hotel Cavour! We had a wonderful stay there and the location and roof top bar make it extra enjoyable!"}, {"username": "Tyson Cannon", "comment_text": "Hotel Goldoni - We loved it there. Huge rooms and amazing staff!"}, {"username": "Jeff McLellan", "comment_text": "Sina Villa Medici is a great spot."}, {"username": "Summer Wicker", "comment_text": "Pendini"}, {"username": "Nuno João Teixeira", "comment_text": "Bonifacio"}, {"username": "Kara Alise", "comment_text": "We have stayed at both Minerva & Hotel Santa Maria Novella. They are night & day! HSMN just gorgeous, very friendly staff & 1/2 the price of M!"}, {"username": "Stephen Slaughter", "comment_text": "Lungarno, Bernini"}, {"username": "Melanie Fuger-Dolan", "comment_text": "Grand Hôtel Cavour was beautiful with an amazing g rooftop bar right by the duomo. Plus it’s next door to an amazing pasta restaurant called yellow bar. Highly recommend"}, {"username": "Carolyn Schwab", "comment_text": "I absolutely loved Hotel Rosso 23 🥰"}, {"username": "Kim Geary Keidel", "comment_text": "We stayed at Hotel Santa Maria Novella and loved it. Great hotel. Great location. We would take our own wine to their rooftop area every night and have a drink and enjoy the view."}, {"username": "Cindy Hall", "comment_text": "We really like Hotel Cellai ❤️"}, {"username": "Kirsty Gardiner", "comment_text": "Eurostar boutique"}, {"username": "Eileen Scully Vita", "comment_text": "Plaza Luchessi"}, {"username": "Diana Odoroaba", "comment_text": "Hotel Alba Palace 🥰"}, {"username": "Anne Brawley", "comment_text": "Kraft hotel is lovely."}, {"username": "Renae Larcus", "comment_text": "Hotel Roma"}, {"username": "Kayleigh Bauer", "comment_text": "Hotel Calimala. PERFECT location and incredible breakfast"}, {"username": "Jack Partington", "comment_text": "Hotel PittI Palace. Right off the Ponte Vecchio."}, {"username": "Kelly Huntley Clark", "comment_text": "Hotel Cavour and Hotel Duomo are my favorite options near the city center! Palazzo Guadagni is also amazing in the Oltrarno area"}, {"username": "Lana Burovoy", "comment_text": "Calimala! Great location, clean, great breakfast and roof top restaurant!"}, {"username": "Kathy Holden Reams", "comment_text": "Hotel Spadai"}, {"username": "Michelle Bonadio Lundberg", "comment_text": "Hotel Glance, rooftop Bar and Pool.\nAcross the st from Mercato and the leather markets. Totally updated and modern."}, {"username": "Diane Fairgrieve", "comment_text": "Hotel David"}, {"username": "Kathy Ann Jones", "comment_text": "Brunelleschi. Location, location, location! Rooms are nice, too."}, {"username": "Joel Zimmer", "comment_text": "https://\nwww.sanfirenzesu\nites.com/"}, {"username": "Ashlea Griffin", "comment_text": "We thoroughly enjoyed our stay at Hotel Savoy. It was a beautiful hotel and the location is amazing."}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton"}, {"username": "Sue Whitney", "comment_text": "Hotel Berchielli. Great location. Very nice rooms."}, {"username": "Donna-Mae Kearns", "comment_text": "Hotel Gallery Art"}, {"username": "Amber Pena", "comment_text": "Four seasons inn Florence!"}, {"username": "Jerneja SB", "comment_text": "Palazzo D'Ambra Residenza d'Epoca\nIt is not a hotel, but it is 👌!"}, {"username": "Jackie Warner Berry", "comment_text": "Hotel Spadai!"}, {"username": "Phyllis Colley Tortorigi", "comment_text": "Hotel Bellini"}, {"username": "Colleen Donovan Quinn", "comment_text": "Loved where we stayed-Albergo Firenze. Small, cozy, free breakfast and could see Duomo from our window"}, {"username": "Sandy Radican Shikaly", "comment_text": "Hotel Brunelleschi❤️"}, {"username": "Fay Waterberg", "comment_text": "We are loving Hotel Hilda. Basically an apartment suite with a small kitchen, pull out bed and a regular king bed. Close to the Duomo and. 15 minute walk from the train station. We did the walk fine with one large suitcase and one small one both with wheels plus a back pack. Have walked everywhere so far and easy with Google maps."}, {"username": "Nancy Kirby", "comment_text": "Hotel Alessandra"}, {"username": "Emily Kelley Arrowood", "comment_text": "Hotel Santa Novella"}, {"username": "Gina Spyker Fairfield", "comment_text": "Hotel Santa Maria Novella. This was the view from our room."}, {"username": "Mil Myvegas", "comment_text": "Hotel Della Signoria"}, {"username": "Jen Marie", "comment_text": "Hotel Brunelleschi"}, {"username": "Stephanie Blair", "comment_text": "Grand Hotel Minerva"}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "Palazzo Belfiore"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "Il Tornabuoni"}, {"username": "Russell Weidner", "comment_text": "Hotel Torre Guelfa"}]}, {"id": "2212012472531164", "text": "Does anyone have anymore information about the train strike in Italy on 2nd October?", "link": "facebook.com/groups/1373361046396315/permalink/2212012472531164/", "likes": 1, "comments": [{"username": "Sam Monty Sigler", "comment_text": "Following"}, {"username": "Kelly Humerickhouse-Szyperski", "comment_text": "Where do I look to find info on the train strikes?"}, {"username": "Andrea Herbold K.", "comment_text": "I dont think its a train strike that day. The [all strikes] website says Sector: National Health Services (www.cgsse.it/\ncalendario-sciop\neri)\n\nI also dont see a strike listed on the Transit Strike page:\nhttp://\nscioperi.mit.gov\n.it/mit2/\npublic/\nscioperi?fbclid=\nIwAR1PR0rcsTPya\nIVog2u8Px1hu8Ip\ntNoRWEgrVsycxJc\nc2LLkNrdrNwGemh\nI_aem_th_ARrcwV\nRFf3jt7tq1NLBO3\nVH9gfmEUUeACOtW\nrSuz8VDqClzoYLv\nRfWaZzJMlU2XWao\n8"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2212022489196829", "text": "Hello! I am after recommendations for gluten free restaurants in Venice or restaurants with gluten free pasta or pizza. Thank you 🍝🍕", "link": "facebook.com/groups/1373361046396315/permalink/2212022489196829/", "likes": 0, "comments": [{"username": "Tara Cooper", "comment_text": "Have you got this app?"}, {"username": "Rhonda Smith", "comment_text": "The app is good, but I had no issues in May of this year. Most restaurants had gluten free options!"}, {"username": "Cindy Santa Ana", "comment_text": "The Brunch Cafe is amazing!"}, {"username": "Kejdi Okej", "comment_text": "The brunch cafe. Is smazing"}]}, {"id": "2212066849192393", "text": "How do you even get the colosseum tickets? I have been logged on to Coop Culture ready to buy and now they are all unavailable on our chosen date 🤷🏼‍♀️🤷🏼‍♀️", "link": "facebook.com/groups/1373361046396315/permalink/2212066849192393/", "likes": 7, "comments": [{"username": "Shelley Howard", "comment_text": "I got ours from the website .. just get entry ones all the others sell out .. we are going 5th.."}, {"username": "Lisamarie Bianco", "comment_text": "No try tiquets"}, {"username": "Dianne Novak Iadanza", "comment_text": "There are alot on there right now...multiple dates, large quantities."}, {"username": "Blanca Gil", "comment_text": "You can keep checking back on COOP. You can also get tickets from “Get Your Guide”, they offer free cancellation so if you get tickets just cancel the “GYG”tickets."}, {"username": "Lisa Alexander Blake", "comment_text": "We got ours through Get Your Guide. Was even an underground tour. I was worried that it was going to get canceled, but it didn’t. They did push our time back by 35 minutes the day we got there, though. It was all good until it started to rain! Honesty, the underground is cool, but if you can’t get it you can still see some of it from above. And it is only about 15 minutes of a 3 hour tour."}, {"username": "Joanne-Peter Hart", "comment_text": "I had the same trouble. I even found YouTube videos that explained why it was so difficult.\nI went to Trip Advisor and looked at reviews.\nI ended up with two tours, one that was with just the Colosseum on the second level. The other was the Arena and Ancient Rome.\nThe first was rushed. Spent most of the time racing to catch up with the guide as she sped through. Was more worried about making sure I didn’t trip over or loose the guide. Didn’t enjoy the experience at all.\nHowever can highly recommend the second by Show Me Italy. The tour lasted three hours, starting at the Roman Forum, finishing in the Colosseum by a very knowledgeable guide, with the option to stay inside the Colosseum longer if you wanted to linger at your own pace."}, {"username": "Lori Finamore", "comment_text": "Someone from this group recommended buying the Evening Italian speaking guided Colosseum tour on the Co-op Culture site -she said when she went they realized all the people on the tour spoke English so they did the tour in English. Worst case scenario if it is in Italian you can download Rick Steve’s audioguide of Rome The Collisseum and listen- I booked it and it was available- plus at night it is cooler and lit up. This includes Arena and underground but not upper tiers as they are closed in evening and it does not include Roman Forum Palantine Hill. I booked that separately for another day."}, {"username": "Amy So", "comment_text": "Keep on the page! It will turn green at some points. Tickets are released thruout the day. I even called coop culture before they closed and the guy gave me some info as to the timing of the release last year. Good luck!"}, {"username": "Joanne Parkes", "comment_text": "We booked with Tiqets in end as had this problem had to do bus tour with"}, {"username": "Jenny Frank", "comment_text": "What date???"}, {"username": "Jenny Frank", "comment_text": "Viator gets them\nGet your guide\nThe Roman guy"}, {"username": "Leslie Goodland", "comment_text": "I tried to get tickets on Get Your Guide. Because of an issue on their end of the computer it never worked out. My mom was there in the late 60's and told me that the inside wasn't that impressive. I felt better about not seeing inside.\nI ended up getting a tattoo that reads \"Wander for the wonder.\" instead and then it absolutely dumped. I got completely soaked taking pictures of the outside of the Colosseum and cool stuff next to it. Fun day!"}, {"username": "Angela Zavattieri", "comment_text": "We went to the colosseum and bought tickets from one of the company’s selling with a guide it was 45 - 50 euro each . More expensive but worth it ! You could probably haggle"}, {"username": "Christine Malota- Kendall", "comment_text": "I logged in and made it to payment. Twice two different cards were rejected for payment. Made me nervous so I gave up."}, {"username": "Sarah Bisceglia", "comment_text": "You have to get on the website the hour of the ticket you want, Italian time, 30 days before the date you want. For me that was 1 am my time. But I easily got 9:15 am tickets, non marked up!"}, {"username": "Marisa Torcasio Talarico", "comment_text": "Honestly, we had purchased tickets ahead of time, (we were there about 10 days ago) my husband overpaid bc they were cheaper “at the door”, then we arrived and there was an issue bc of how he’d purchased them, etc etc. In the end, we could’ve just purchased them same day at the coliseum, there was a very short line. 🤷🏻‍♀️"}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "Has anyone seen any tours from viator bring cancelled"}, {"username": "Bellafab Fabrizio", "comment_text": "Get your guide app is great or go through viatour thats how we got ours"}, {"username": "Joanne Nacson", "comment_text": "Not sure what dates you want but I was looking yesterday and there were probably 15 days that had availability in the next 30 days"}, {"username": "Luisa Mander", "comment_text": "I use get your guide and Viator."}, {"username": "Beth Scanlon Donnelly", "comment_text": "I bought the Roma pass and that gave me special access to buy through coop culture."}, {"username": "Maggie Torres", "comment_text": "I did it with ‘get your guide’ and I did it like a week prior and it was all good"}, {"username": "Kieu Van Moisan", "comment_text": "How far ahead should I purchase tickets?"}, {"username": "Alison de Lisle", "comment_text": "We booked on Viator and got a great tour which included the underground. Well worth it."}, {"username": "Lesley Stewart-D'Ortenzio", "comment_text": "Try Viator as well. Lots of sites to get tickets on"}, {"username": "Julie Calabrese", "comment_text": "I got a receipt for tickets 2 days ago but have not received an email with the tickets."}, {"username": "Barbara Gilbert Bianchi", "comment_text": "I used Viator, they have good reputation."}, {"username": "Margarita Lipkin", "comment_text": "We got our tickets through tiquets. No tour, just entry, couple of months in advance. Got the qr codes right away, went to Coliseum on Tuesday, no issues at all."}, {"username": "Katalina Loredo", "comment_text": "I booked exactly 30 days prior and knew exactly what I wanted to get when I got into the coop culture website. All the English tours were unavailable, so I booked an Italian tour. The nice thing was my family and I ditched the tour after we got through the gates and got to go through it all on our own pace. This meant we missed the underground tour but we don’t regret not going with our tour"}, {"username": "Helen Gardener", "comment_text": "Update…I have Colosseum by day and the underground by night….in Italian….but beggars can’t be choosers Viva Italia! 🇮🇹"}, {"username": "Silvia Arndt", "comment_text": "Are the dates 30 days out?"}, {"username": "Denielle Sutton", "comment_text": "We booked on get your guide, did our tour yesterday! It was great"}, {"username": "Melissa Fass", "comment_text": "Tiqets is great and affordable"}, {"username": "Logan Payne", "comment_text": "When we bought our I watched the page closely refreshing every 30 seconds until I found our ticket. The are released in batches and sell quickly especially the full experience tickets."}, {"username": "Catherine AleXandra", "comment_text": "Get Your Guide was great. When looking check the details.\n\nMake sure you get area floor\nOr\nTicket that gets you into forum as well.\n\nI highly recommend tour through get your guide. They really get you right in past the lines.\n\nI did colosseum at night tour. But it was 5pm. No big crowds."}, {"username": "Diana Lescinsky", "comment_text": "I’ve been watching certain days myself. The minute I close my eyes or stop looking the day is released and becomes red. My last day would be Sept 11 at 12:30 the day was still grey. Fell asleep woke up 2:20am —red🥺🥲. Afraid to book tour through tour company because I keep reading they are getting cancelled at last min."}, {"username": "Jenn Messina Babore", "comment_text": "Refresh every 10-15 minutes for new tickets to come available"}, {"username": "Kristína Polovková", "comment_text": "GetYourGuide ♥️"}, {"username": "Jared Colwell", "comment_text": "My wife Toni Colwell booked us underground tickets at night in Italian language. Was like €34 (don’t quote me on price). It was wonderful. I simply pulled out my phone and used Google translate and the transcribe feature. As she spoke it all texted it out in English."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "I logged in at 4am US eastern time and was able to get them, but they went quick"}, {"username": "Alejandra Monsalve", "comment_text": "They release them 30 days in advance"}, {"username": "Martine Laberge", "comment_text": "Get a Roma pass. Tickets for the coliseum are available (all available dates are still green)\n\nhttps://\necm.coopculture.\nit/\nindex.php?cartSe\nssionId=BBCBD2D\n2-95A6-D8FB-EC4\n1-FE90DAAE7A71&\ncatalogid=577EE\n60C-C16D-67DA-4\n942-017C7D6D0AE\nD&id=7D8772B8-1\nD4C-5766-0483-0\n16CAFC55142&opt\nion=com_snapp&v\niew=event&lang=\nen"}, {"username": "Roxanne Franquelli", "comment_text": "I used Expedia. No issues."}, {"username": "Michelle Anderson- Rowland", "comment_text": "We booked through Get Your Guide\nOur guide was awesome!!!!"}]}, {"id": "2212096665856078", "text": "Has anyone had experience of buying Colosseum tickets via third parties lately? Are tours still being cancelled regularly?\nI've read so much about the Coopculture website but I'm losing my nerve seeing all these red squares 🤣 (I'm looking for 12 or 13th Sept ideally)\nJust wondering if a third party is a viable back up plan", "link": "facebook.com/groups/1373361046396315/permalink/2212096665856078/", "likes": 3, "comments": [{"username": "Richelle Tye", "comment_text": "30 days prior they release. 9am Rome time so just keep refreshing. Is quite stressful but I did manage to get tickets."}, {"username": "Silvia Arndt", "comment_text": "Not available yet"}, {"username": "Andrew Vitaterna", "comment_text": "I was up from 3 am EST and finally got them at 11 am EST( 5 pm Rome time) - its random when they release them."}, {"username": "Jaime Wilson", "comment_text": "We did a colosseum tour with walks of Italy yesterday it was great 🙂 including the underground"}, {"username": "Melanie Fuger-Dolan", "comment_text": "Try « ITALY WITH FAMILY » it’s the second party seller. We purchased with get your guide who purchased from Italy with Family. Our tour was Not cancelled and they were really good."}, {"username": "Dianne Novak Iadanza", "comment_text": "Right now, Aug 18 has 15 English tickets available for night tour, 21:10pm. Was 17, going fast. Good luck"}, {"username": "Sarah Nichols Hogue", "comment_text": "We got the Parco Membership and they open up times for members only. It was very easy! It was not a tour, but it got us inside, and we added arena floor access on the day for no extra charge."}, {"username": "Sian James", "comment_text": "Thanks everyone ! Are tickets released at 9am or does it depend on the time of the tour? I'm reading conflicting comments re this & mainly what's confusing me 🥴\nI've been watching the site the past two days as hoping to purchase tickets tomorrow & today for instance it was sold out when I checked just after 9.30 Rome time but I've looked a few times throughout the day to get an idea of what's happening & there seems to be later slots appearing throughout the day?\nI'm hoping for a late afternoon tour so not sure if I should be checking tomorrow (30 days before) at 9am or 5pm which is the tour time I'd ideally like. I don't want to wait all day & miss tickets if it's the former but I can't find an exact answer anywhere......"}, {"username": "Ann Wall", "comment_text": "We booked via Tripadvisor- it was seamless :-)"}, {"username": "Jenny Heller Morehouse", "comment_text": "They are released 30 days out, but release them randomly after that as well. I was up at 3am to buy tickets, saw they were available, but were sold out within the time I clicked to buy. I checked later in the morning and they became available again. 🙄. Frustrating, but keep checking."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "We use GetYourGuide as well no problems"}, {"username": "Tanya Lee Knightly", "comment_text": "Get your guide is amazing! Never an issue"}, {"username": "Pia Reilley Loughin", "comment_text": "We booked with The Tour Guy. It cost more than directly with the Colosseum but we really wanted the underground tour and it was difficult to get Colosseum tickets for our time in Rome due to the Coop website experiencing issues late June.\nFor us, it was worth every penny. I highly recommend their tour of the underground. We had access to so much more."}, {"username": "Mil Myvegas", "comment_text": "If you are NOT looking for a guided tour then consider The PARCO Membership from CoopCulture. €80 for two adults and up to three children under 18 years of age. You still need to reserve your free admission to the Colosseum by choosing your preferred date and time, but there is a special link for members to do this and there is currently availability (9:30 am - 5:30 pm) everyday through the first week of September. I purchased the membership and used it two weeks ago. You will need to redeem the voucher at the ticket booth, but there is a designated window for members and there’s no need to stand in the long line for same day tickets. If you purchase the membership you will need to present your passport/s. This is how I secured my entrance tickets. You do get access to the Forum, Palatine Hill, and Super Sites if you want to visit. No underground access and NO tour guide. You explore on your own. This worked for my family. https://\nwww.coopculture.\nit/en/products/\nparco-membership\n/"}, {"username": "Dawn Marie", "comment_text": "We were is Rome this week, had tix for Colosseum and tour canceled."}, {"username": "Brenda Marie", "comment_text": "I have 4 tickets available for sale message me if anyone interested in buying them"}, {"username": "Kejdi Okej", "comment_text": "We were is rome this week had tix for colosseum and tour canceled"}, {"username": "Kelsey Robinson", "comment_text": "Looks like these tickets are available for the 12th https://\necm.coopculture.\nit/\nindex.php?option\n=com_snapp&view\n=event&id=3C38A\nB77-8D5A-5394-0\n5B2-0172EB8E7D4\n6&catalogid=F3C\nB77BD-6A43-108B\n-6723-0174490EB\n610&lang=en"}]}, {"id": "2212111202521291", "text": "Rome in november ok?", "link": "facebook.com/groups/1373361046396315/permalink/2212111202521291/", "likes": 19, "comments": [{"username": "Андрій Пляцко", "comment_text": "Second half of September is the best time to visit 👍"}, {"username": "Diane Plott Miller", "comment_text": "We went in Rome before and booked again for this Rome."}, {"username": "Paolo Mittiga", "comment_text": "The best time to visit Rome is known to be October .. as matter of fact they are called the famous “Ottobrate” .. however if in luck November it’s good time too .. but it’s more like rolling the dices …"}, {"username": "Marlene Bertino Randolph", "comment_text": "Yes"}, {"username": "Paolo Mittiga", "comment_text": "Going north of Rome from\nend of October on , its not the best choice .. November and first half of December is known to be very rainy in Italy especially the northern part"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Absolutely!! Was there last year November. Fantastic!"}, {"username": "Roger Pajo", "comment_text": "Anytime in Rome is a good time! Cheers!"}, {"username": "Dominika Varga", "comment_text": "We got the rain of our lives 5 years ago in November🤣 we were absolutely soaking wet, we still bring it up sometimes, because the rain was that intense. But Rome was worth it."}, {"username": "Fabio Clemente", "comment_text": "Yes. Wonderful weather and still pretty warm"}, {"username": "निनावी सहभागी", "comment_text": "🥰"}, {"username": "Francisca Lis", "comment_text": "Always Roma"}, {"username": "Romana Svítková", "comment_text": "People live there all year long, you know."}, {"username": "Noelle Harris", "comment_text": "Yes. I went in November. It was great."}, {"username": "Allan Olexa", "comment_text": "Yes!"}, {"username": "Ashley Morris Podraza", "comment_text": "Yes"}, {"username": "Niki Sewell", "comment_text": "We went over Thanksgiving a few years ago. We thought it was perfect. It was cool in the evening & a little warmer during the day."}, {"username": "Jack Partington", "comment_text": "Ok."}, {"username": "Keith Piccirello", "comment_text": "Are you paying"}, {"username": "Rick Calabro", "comment_text": "Yes 65 degrees"}, {"username": "Murielle Medina", "comment_text": "Cold at night but perfect"}, {"username": "Lovetta Jackson", "comment_text": "anytime is fine"}, {"username": "Giulia Novalinne Nota", "comment_text": "In November it always rains a lot in Rome!!"}, {"username": "John Bruckman", "comment_text": "Fantastic!!"}, {"username": "Dyann Kopp", "comment_text": "Perfect !"}, {"username": "Shawn Kopp", "comment_text": "Ok me too… see you there 🥸"}, {"username": "Julie Dunleavy-Corcoran", "comment_text": "We’ll be there 30/10 till 7/11 can’t wait!"}, {"username": "Liz Hicks", "comment_text": "We went last November and it was beautiful and perfect for strolling the city streets. Just take a light puffer jacket for the evenings"}, {"username": "Victoria Williams", "comment_text": "Rome anytime"}, {"username": "Al-agouri Amal", "comment_text": "anytime is soooo ok 🥹"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Nope, Rome is closed from Oct. 15th to March 15th\n\n(Yes, of course)"}, {"username": "Diane Hamilton", "comment_text": "That’s when we’re going November 15\nFirst time."}, {"username": "Chiara Normanno", "comment_text": "Sure, chill weather if you're lucky and no crowds"}, {"username": "Sue Gaughan", "comment_text": "Love Roma in November. Less crowded, great temps!"}, {"username": "Lisa DeLeo", "comment_text": "The best time!!! It’s perfect in November!!!"}, {"username": "Donna Mauerhan", "comment_text": "Yes.....no crowds!! :)"}, {"username": "Dorothy Bush", "comment_text": "Yes not to crowded and we had great weather."}, {"username": "Robert Bélair", "comment_text": "Much of it is dependent on how many ships are docked on any specific day. There are websites that track these numbers on a day by day basis. Worth checking out."}, {"username": "Carol H Miller Jerrell", "comment_text": "We are going first time Nov 15 also for 10 days. Is flying into Rome or Venice which is better?"}, {"username": "David Perillo", "comment_text": "Perfect 👍"}, {"username": "Martin Sten Elkjær", "comment_text": "We had 16-19 celsius last November. Still crowded."}]}, {"id": "2212125872519824", "text": "Looking for a nice restaurant in Naples to celebrate our wedding anniversary", "link": "facebook.com/groups/1373361046396315/permalink/2212125872519824/", "likes": 4, "comments": [{"username": "Chiara Normanno", "comment_text": "If you can afford to move out of the town with a car, look for places in Bacoli area, I could recommend Il Gabbiano"}, {"username": "Bill Gillespie", "comment_text": "After living in Naples for 4 years I'd have to say I've never had anything but great food, but for an experience we would go to a small town right before Sorrento call Vico Equense. In this small town is the restaurant \"Pizza A Metro.\" They have 6 big pizza ovens and make pizza up to 2 meters long. They have anything you want in Italian food. On weekends they use to put one, sometimes two pigs on the BBQ pit. It is a huge restaurant with great food!."}, {"username": "Raymond Capkin", "comment_text": "Archi D'oro"}, {"username": "Paolo Mittiga", "comment_text": "Rosiello in Posillipo"}, {"username": "Kathrin Wirth", "comment_text": "Il Comandante, very nice view!"}, {"username": "Romina DL Hermanson", "comment_text": "There are so many to list but a nice restaurant with valet parking, gorgeous view, great food and amazing ambiance is Cuevo"}]}, {"id": "2212167912515620", "text": "The Vatican City this morning.\nWe booked through the Vatican website and got the early morning tour, before it opens up to the public, 7:30am start and included breakfast.\nWe had it all to ourselves 🤩", "link": "facebook.com/groups/1373361046396315/permalink/2212167912515620/", "likes": 1072, "comments": [{"username": "Kylie Lovejoy", "comment_text": "Kim Dudin 14th April?"}, {"username": "Rebekah Krieger", "comment_text": "So blessed! A memory for you to cherish"}, {"username": "Nai La", "comment_text": "Lucky you"}, {"username": "Elissa Jans", "comment_text": "Tina Chaloner do you know about this site? It's full of awesome tips for Italy. Hope you are having the best time :)"}, {"username": "Sonia Dunstan", "comment_text": "The early morning tours are definitely worth the extra $ - you realise that when you leave and see the long lineup!"}, {"username": "Michelle Cross", "comment_text": "Apple Cross"}, {"username": "Brian O Connell", "comment_text": "Thank what is the cost for 2 people please"}, {"username": "Shera Lee", "comment_text": "Grahame N Katrina Stephens-Rolsto\nn"}, {"username": "Ashleigh Nicole", "comment_text": "Phoebe Gascoigne"}, {"username": "Marina Trainor", "comment_text": "Peter"}, {"username": "Rachael Richardson", "comment_text": "I liked the crowds ! But each to their own , it’s just as good anytime if the day"}, {"username": "Carmine Napolitano", "comment_text": "we did that they let my wife unlock the sisteen chapel"}, {"username": "Kristy Redmond", "comment_text": "Jack Lenffer"}, {"username": "Deb Ollier", "comment_text": "Dawn Marie I would love to do it like this at early morning"}, {"username": "Stef Gen", "comment_text": "Wow the sunrise over the basilica is beautiful 😍"}, {"username": "Alex Franco", "comment_text": "That’s amazing!"}, {"username": "Katie Elkin", "comment_text": "Sue Elkin Corrie Rydberg 😍😍😍 SO EXCITED"}, {"username": "Karen Mariano", "comment_text": "Teresa Mariano"}, {"username": "Paul WJ Fiume", "comment_text": "How much was the early tour ?"}, {"username": "Rebecca Loughron", "comment_text": "Bernie Loughron"}, {"username": "Khanhly Luong", "comment_text": "Absolutely gorgeous!!! We also booked this for September! Excited and thanks for sharing"}, {"username": "Tina Louisa Tomassetti", "comment_text": "Luca, Marco Antonio, Justin,"}, {"username": "Kristine Walker", "comment_text": "How far in advance do the tickets open?"}, {"username": "Vesna Komat", "comment_text": "Man…! The early bird really does catch the worm! 😮"}, {"username": "Elena Campo", "comment_text": "Elena Spektor"}, {"username": "Melanie Law Costanza", "comment_text": "Spectacular!"}, {"username": "Jacky Lomas", "comment_text": "Thelma Laverty we need to book asp"}, {"username": "Dina Garrett", "comment_text": "Julie Franco Mellow, Linda Williams, BillandAngala Verley"}, {"username": "Susan Bouchon", "comment_text": "The Early Bird gets the worm, but since I'm not a Morning Person, I'll take mine with a few more people."}, {"username": "Catherine Lammers", "comment_text": "That’s amazing it’s so quiet! I just might do this too! 👌🏻⭐️"}, {"username": "Yvette Mendez", "comment_text": "Is it better to purchase tickets directly through the museum with your specific designated time; or is a 3rd party better with the skip the line. Seems doing it 3rd party is more expensive. However, with a designated time do you still have to wait on a long line to get in? If anyone can give feedback it’s greatly appreciated."}, {"username": "Vaishnavi Pattabiraman", "comment_text": "Wonderful, which tour was this?"}, {"username": "Gail Grande", "comment_text": "Everything is breathtaking, pictures can’t do it justice.\nWhat an amazing time to be there"}, {"username": "Anna Saloranta", "comment_text": "That’s awesome!"}, {"username": "Bea Kuckens", "comment_text": "Rob-Laura Lytle"}, {"username": "Silvana Tahiraj", "comment_text": "Great tips thank you Danielle Sutton"}, {"username": "Helen Nagalewska", "comment_text": "Andy Nagalewski this is the tour I will book, early start but no crowds 👍"}, {"username": "Christina Buffolin", "comment_text": "Matt Buffolin"}, {"username": "Ilana Brongiel", "comment_text": "I was just looking at this for next June - not open for booking yet! Did you book with a guide or the audio tour or just walked through?"}, {"username": "Michelle Campbell", "comment_text": "Nicola Cattle"}, {"username": "Lizzi Denisse", "comment_text": "Vatican city or Vatican Museums?"}, {"username": "Dawn Turner-Crockett", "comment_text": "Beautiful"}, {"username": "Nathan Earl Stellenberg", "comment_text": "How much did the tour cost?"}, {"username": "Marie Lamberth", "comment_text": "Thank you great post .. sorted out what toyr we will do."}, {"username": "Kelly Reid", "comment_text": "Danielle Denielle Sutton thanks for sharing!\nWas the breakfast done before you went through the museums or after? If after did you then go back through museum and Sistine chapel for the corridor through to Saint Peters basilica? TIA"}, {"username": "Karen Flavel", "comment_text": "Wow😍"}, {"username": "Kellee Fullerton", "comment_text": "Neil Fullerton"}, {"username": "Rosemarie Walker", "comment_text": "That is a great idea, thanks for sharing, I will look into that"}, {"username": "Phyllis Snyder", "comment_text": "Perfecto!"}, {"username": "Gay Robertson", "comment_text": "Cheryl Debenham"}, {"username": "Philip Halladay", "comment_text": "Awesome"}, {"username": "Jeri Olson Huston", "comment_text": "Oh wow!!"}, {"username": "Sandi K-Zarka", "comment_text": "That’s lovely."}, {"username": "Marg Ryan", "comment_text": "Amazing photos .... so good to be there without the crowds"}, {"username": "Helena McInnes", "comment_text": "Not long now beautiful! 😘"}, {"username": "Robert Baumann", "comment_text": "Very cool…"}, {"username": "Colleen Effler", "comment_text": "Karen Bowman"}, {"username": "Tara Lee", "comment_text": "Kyla McBurney"}, {"username": "Suzy Palmer", "comment_text": "Soo cool. We’re doing the same tour in October! So excited!"}, {"username": "Beverley Milson", "comment_text": "Early morning breakfast tour appears to be best choice!"}, {"username": "Linda McNelis", "comment_text": "Autumn Mcnelis"}, {"username": "Julie Hahn", "comment_text": "Emilee Hahn"}, {"username": "Mona Sidhu Samrari", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Jacqui Hodge", "comment_text": "We have the same your booked in September. Cannot wait!"}, {"username": "Nikki Nicholson", "comment_text": "We booked this tour for late September. It’ll be early but worth it to avoid crowds."}, {"username": "Carolyn Danielson Sanchez", "comment_text": "I hope my 8:30 tour won’t be too crowded!"}, {"username": "Atet GC", "comment_text": "Is this only for Vatican? Or does the package include St-Peter’s and Sistine Chapel?"}, {"username": "Angie Johnson", "comment_text": "We have this same tour in a couple weeks, I’m glad to see how empty it is."}, {"username": "Laurel Nation", "comment_text": "How did you get there so early in morning. Was your hotel within walking distance? Or did you take bus, or taxi?"}, {"username": "Carmen Folgueiras Weisz", "comment_text": "That’s the only way I would do that again. I almost had an anxiety attack when we went with so many people!"}, {"username": "Demi Quinn", "comment_text": "Alex Bowman"}, {"username": "Cari Chenier Winsor", "comment_text": "Smart"}, {"username": "Colleen Ann Maria", "comment_text": "Diane Graves"}, {"username": "Mychelle Hinkle Holly", "comment_text": "I can’t wait—we booked that your also"}, {"username": "Amanda Monique Bartz", "comment_text": "Tammy Turalitsch"}, {"username": "Mark Austin", "comment_text": "Wow that’s so cool to get to see it empty like that, I’m super jealous. It was packed when we went"}, {"username": "Lana Le Stevens", "comment_text": "Susan Remmert Gardner"}, {"username": "Andrea D'Aleo Knipfel", "comment_text": "Does the tour take you into Sistine chapel and museum before breakfast also? The description on website makes it seem like you can do those on your own after breakfast. Or is that if you want more time to explore?"}, {"username": "Christine Malota- Kendall", "comment_text": "We booked the same tour but there were many who booked too. We had a couple hundred spread out. Maybe it was the day we booked it too. I’m not complaining at all, was well worth the money spent to not have to deal with 20,000+ people"}, {"username": "Roxanne Franquelli", "comment_text": "Good idea! We went at 9:30 and it was was too packed and the guide was like this is actually empty."}, {"username": "Paweł Falkowski", "comment_text": "Five years ago 👌🇻🇦🇵🇱"}, {"username": "Sara Braun", "comment_text": "Jealous! We were there last night with a million of our friends. Lol 😆"}, {"username": "Ddebbie Burnett", "comment_text": "Denise Watson for us 👍"}, {"username": "Nikki Badger Graff", "comment_text": "Mayra Ríos"}, {"username": "Lisa Hartert", "comment_text": "Next time I go I’m doing this! Beautiful photos. ❤️"}, {"username": "Tera Prim", "comment_text": "Gerri Duran-Wolfe - we need to do this!"}, {"username": "Lisa Westrope", "comment_text": "That's the only way to go <3 And our tour guide was the BEST!!!! She knew all the cool tricks about beating the other tours to get to the Sistine Chapel before anyone else and made our visit the experience of a lifetime 🙂 Looks like you had an amazing time too <3"}, {"username": "Christina TouTou", "comment_text": "Just tried to book for Oct 4 directly through the website but it’s all sold out already 🥴"}, {"username": "Karen Marie", "comment_text": "Theresa Heald Blaisdell Sarah White Rotcavich"}, {"username": "Gabby Miller", "comment_text": "Ian Schuster"}, {"username": "Annamarie Di Maio", "comment_text": "Do you book directly through the Vatican and is the tour available on Saturdays?"}, {"username": "Caterina Liquori-Culhane", "comment_text": "What was the cost?"}, {"username": "Sarah Allen", "comment_text": "Wow! Could you post which tour this was? Not finding the website very easy to navigate…"}, {"username": "Christina Ulewicz", "comment_text": "How far in advance did you book it"}, {"username": "Sonia Morales-Powderly", "comment_text": "Mary Ann"}, {"username": "Andisuari Dewi Sucahya", "comment_text": "How many people were doing the tour together may I know? Do they limit the total number of people for this tour? Thank you."}, {"username": "Kelly Tancini Walther", "comment_text": "We did the same tour. It was awesome!"}, {"username": "Debra Therese", "comment_text": "We were there at 9.30 with thousands of others so well played 👏"}, {"username": "Kirsty Brown", "comment_text": "Karen Meech 👍🏻"}, {"username": "Steve Rankin", "comment_text": "Fantastic. Always best to ride early and beat the crowds!"}, {"username": "Karen Anders", "comment_text": "Wow! Amazing!"}, {"username": "Julie Lindahl Luzod", "comment_text": "We did that last year and it was wonderful!"}, {"username": "Nancy Bonacchi Fritcher", "comment_text": "Maurina De Lorio Kalin\nCarmey Evans\nHana DeLorio Cafarelli"}, {"username": "Alyson Alai", "comment_text": "Can you post the link here? When looking online here in the states the only thing that looks like the official site doesn’t offer yours"}, {"username": "Minnie West", "comment_text": "Debra Kim Chris Gruber Early morning is best!"}, {"username": "Elizabeth Hartzell", "comment_text": "Wow! We have an upcoming 8am tour. Do you think it’ll still be pretty empty?🤞🏼"}, {"username": "Ben Poupard", "comment_text": "We did the same, tour booked direct from the Vatican museum!"}, {"username": "Hammache Souméya", "comment_text": "🥺"}, {"username": "Melanie Shoemake Eason", "comment_text": "I am doing this in October!!! I can’t wait. I booked through Viator."}, {"username": "Sony Ucciferri", "comment_text": "nice"}, {"username": "Doreen Patel", "comment_text": "Did your knees and shoulders have to see covered? If yes are they strict about it for the kids as well?"}, {"username": "Lynn Kennedy", "comment_text": "So glad I booked this tour! 53 more moons to go!!"}, {"username": "Michelle Plakosh", "comment_text": "Smart!!!!!! This is what you deal with, going later in the day…….."}, {"username": "Genevieve Ozoa Warshaw", "comment_text": "Smart move!"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Christine Pelosi", "comment_text": "That's wonderful 🤗 When we were there in April it as shoulder to shoulder and not at all an enjoyable experience. Will remember the early tour next time😇 Thanks for posting😉"}, {"username": "Marshia Gibson", "comment_text": "Hi!\nWhat’s the website ?"}, {"username": "Elaine Velazquez Disbrow", "comment_text": "How far in advance can you book this particular tour?"}, {"username": "Kerrie Ascoli", "comment_text": "Amy Jones!"}, {"username": "Carlee Wilkinson", "comment_text": "Grace Wilkinson"}]}, {"id": "2212208415844903", "text": "Anyone ever stayed in Palazzetto Trevi Hotel in Rome? Honest Opinions please", "link": "facebook.com/groups/1373361046396315/permalink/2212208415844903/", "likes": 0, "comments": [{"username": "Don Bentivoglio", "comment_text": "Not an inviting way to ask for assistance."}]}, {"id": "2212217549177323", "text": "🍋🍋🍋 Sicilian Dresses must buy in Italy. #sicily #italy #reelsviralvideo #reelsinstagram #reelsvideo #reelsfacebook #reelstrending #forreels #reelsfb #facebookpost #travelgram #traveltheworld #travellife #आणखीtraveling #worlddestination #instatravel #instagram #travelforlife #traveladdict #travelguide #travelgram #traveltheworld #travellife #traveling #worlddestination #instatravel #instagram #travelforlife #traveladdict #travelguide", "link": "facebook.com/groups/1373361046396315/permalink/2212217549177323/", "likes": 2, "comments": [{"username": "Amy Yonto", "comment_text": "Thank you admin❤️"}, {"username": "Maxine Fenton", "comment_text": "Are these found anywhere else in Italy?"}]}, {"id": "2212219425843802", "text": "On the Frecciarossa train, are the circled areas tables or luggage storage spaces? Or are the luggage storage spaces at the beginning and end of each carriage?\n\nIf I book 3a, 3B, 4a and 4b, will we be sharing a table?\n\nThanks 😉", "link": "facebook.com/groups/1373361046396315/permalink/2212219425843802/", "likes": 40, "comments": [{"username": "Kimberly Coury", "comment_text": "Tables. I’m on the train right now. 😁"}, {"username": "Vero N Ferny", "comment_text": "And no you won’t be sharing a table if you reserve all 4 seats"}, {"username": "Corina Cristea", "comment_text": "In each carriage there is storage above the seats, at the end of the carriage there is a space for large luggage; the specified seats share the table;"}, {"username": "Marisa Gazzotti", "comment_text": "Yes, you will be sharing the table. It's pleasant but not much leg space"}, {"username": "Courtney Brown", "comment_text": "Tables for 4 people"}, {"username": "Sandy Radican Shikaly", "comment_text": "Tables"}, {"username": "Nadia Giangrande", "comment_text": "Tables and luggage space above."}, {"username": "Cheryl Novis", "comment_text": "Luggage between seats - there’s a gap which no one seems to notice"}, {"username": "Dunia Aldyni", "comment_text": "This is table but the black line this is space between the chairs u can put you luggage\nYes I share table with other"}, {"username": "Michelle Woodruff Marlin", "comment_text": "Tables"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Yes. When you have four people it’s nice to face each other, so you can talk, eat, or play cards together. If one of your group can’t handle riding backwards it a good way to insure you can put them in a seat traveling forward."}, {"username": "Noelene Cameron", "comment_text": "These are tables. It is a booth for 4. It is not my preference for seating because of difficulty stretching legs and not kicking the person opposite. In between the seats where they back onto each other (as in seats 4b 4a and 5b 5a is usually space for luggage.\nSeats 1a, 2b and 2a would have a fold down table like in a plane.\nThe grey shaded area on the top of each seat in the picture indicates that this is the back of the seat"}, {"username": "Sandy Radican Shikaly", "comment_text": "Sandy Radican Shikaly"}, {"username": "Pearl Lucero", "comment_text": "These are tables"}, {"username": "Pearl Lucero", "comment_text": "Sharing only with your party of 4"}, {"username": "Linda Lloyd Bowles", "comment_text": "Yes sharing a table."}, {"username": "Jenn Smith", "comment_text": "Here are photos of what it looks like, you can see there is a space for luggage about the seats there are also areas for larger suitcases by the entrances."}, {"username": "Jenn Smith", "comment_text": "Jenn Smith"}, {"username": "Marcia Grayson", "comment_text": "If your luggage isn’t enormous, but more like a medium size to slightly large, it should be able to be slid in between the seats so you can see it the whole time."}, {"username": "Melissa Cortez", "comment_text": "Those are tables for 3a,4a and 3b, 4b"}, {"username": "Janice Koekebakker", "comment_text": "They are tables"}, {"username": "Kelly Kummer Moss", "comment_text": "What I found on both Italo Tren and Trenitalia is that there is space for large suitcases between the cars. Generally you won’t be able to see your bags because the door to the cars close."}, {"username": "Nadia Bartolini Santo", "comment_text": "Unless you book business class or higher , your luggage goes over head which is tight. But business class was great luggage had storage at the front of the cart much better if your Luggage is larger"}, {"username": "Cindi Knight Seng", "comment_text": "As others have replied, it's a table, but between rows (as in between rows 4 & 5) there is a space where a small carry-on can fit. Nice not to have to lift it to the over the seats rack!"}, {"username": "Rita Scicluna", "comment_text": "We thought we were booking these seats too for me hubby and our kids in June 2023 but when we got on the train the seats were back to back. Also our x2 large luggage’s didn’t fit in the top storage, nor in between the seats, nor under the table. They only had storage’s to fit our luggage’s at the entrance storage and yet again wasn’t enough room to fit them so hubby stayed standing in the isle with one luggage and our other luggage was kept on my hubbys allocated seat. Next time we’ll be travelling with smaller luggage’s not to have this problem again. Hope this helps."}, {"username": "Liz Gaglioti", "comment_text": "Large suitcases fit at the end of each carriage, there’s a rack.\nNo one will steal it, everyone has their own suitcase to lug around and look after.\nSmall suitcases fit above the rack from your seat and medium suitcases may fit in between the seats, there’s a space large enough.\nMine was quite heavy so I had no problems with someone wanting to steal it!"}, {"username": "Vicki McEvoy", "comment_text": "They are tables"}, {"username": "Chris McLaughlin", "comment_text": "Tables with 4 seats facing other. Avoid unless you have 4 then great"}, {"username": "Nadia Nadia", "comment_text": "Too late for me, i thought the tables were luggage storage 😫🤦🏻‍♀️"}, {"username": "Julia Muller", "comment_text": "Luggage in the racks by the doors, unless you only have small baggage, which can go overhead. I wouldn’t attempt putting a suitcase up there - it would either break your back getting it up/down or it could fall! The o/head racks aren’t exactly meant for full sized luggage."}, {"username": "Glenn Todd Webb", "comment_text": "Tables"}, {"username": "Vero N Ferny", "comment_text": "Tables and spaces for luggage are right above your seats like in the airplanes"}]}, {"id": "2211705815895163", "text": "Headed to Florence. was wondering where the best leather shops are?", "link": "facebook.com/groups/1373361046396315/permalink/2211705815895163/", "likes": 64, "comments": [{"username": "Verity Daughtrey", "comment_text": "My mother bought a beautiful Italian leather handbag from the Market in Florence. It’s genuine leather and so soft and not as expensive as the shops on the Ponte Vecchio. The leather school recommended the stall to us."}, {"username": "Gretchen Gray Ciaccia", "comment_text": "Check out the Florence School of Leather. Love it there! https://\nscuoladelcuoio.i\nt/en/"}, {"username": "Melissa Vocke", "comment_text": "Gabi"}, {"username": "Michelle Bonadio Lundberg", "comment_text": "Please do your research, buy only from the Italian leather stores, stay away from the shops with Indian sales people those are your red flags for fake goods. Just because it says “made in Italy “ doesn’t mean it real leather or Italian leather."}, {"username": "Maureen McCall Bradley", "comment_text": "via de' ginori, 23 R\nBought a beautiful coat, a few purses and wallets.\nTheir leather shop is on site."}, {"username": "Sharon Smith", "comment_text": "F"}, {"username": "Patricia Vlaun Kempton", "comment_text": "I bought a beautiful leather jacket from Massimo Leather."}, {"username": "Phyllis Waring", "comment_text": "Piazza Santa Croce leather factory and surrounding vendor stalls and leather\nstores!! Great quality excellent prices."}, {"username": "Judi Rinaldo", "comment_text": "the leather school"}, {"username": "Allison Morton", "comment_text": "Annabelle Morton 😃"}, {"username": "Sherene Pipkorn", "comment_text": "Lots of great leather shops in the Santa Croce region"}, {"username": "Yvonne Donnellan", "comment_text": "Everywhere."}, {"username": "Lou Bru", "comment_text": "Santa Croce- piazza"}, {"username": "Melissa Moore Goebel", "comment_text": "https://\nscuoladelcuoio.i\nt/en/"}, {"username": "Laurel Buchanan Layton", "comment_text": "Adam Leather Factory near the Duomo! Beautiful leather quality and styles. He customized the sleeve length of the jacket for me in about an hour while we wandered."}, {"username": "Denise L. Beale", "comment_text": "David le"}, {"username": "Dawn Muscarnera", "comment_text": "Massimo"}, {"username": "Stephanie Butler Morris", "comment_text": "The Leather School behind Santa Croce"}, {"username": "Marti Krauss", "comment_text": "Anna Jennifer tattinelli next to anna"}, {"username": "Nicole Wang", "comment_text": "Santa Croce leather school for purses, wallets, etc."}, {"username": "Christine Brookbank-Swider", "comment_text": "The Leather School & they do free engraving on any leather you purchase"}, {"username": "Meg Johnson Ignacio", "comment_text": "Bottega Giotti by the Westin excelsior had the most unique products. All hand crafted right upstairs."}, {"username": "Susan Vogel", "comment_text": "Do they ship"}, {"username": "Sherry Somers Willome", "comment_text": "A great one in the piazza of Santa Croce https://\nwww.yelp.com/\nsearch?cflt=leat\nher&find_loc=Sa\nnta+Croce%2C+Fl\norence%2C+Infinity Firenze"}, {"username": "Melody D ST", "comment_text": "https://\njennifertattanel\nli.it/\n\nBest one in Florence!!"}, {"username": "Sarah Lynn", "comment_text": "This greatly depends on what you're looking for. I found a belt, and the type of bag I was looking for at a very small shop open since 1979, Kara Van Petrol. Its on a little side street, but close to The Ponte Vecchio. Made personally by the owner Alberto Alberti, who was the kindest man ever."}, {"username": "Vanessa Marino", "comment_text": "Barone"}, {"username": "Tracie Ninedorf", "comment_text": "The open markets products are not as nice. I bought a bag at an open market for $100 and then a purse in a small store it was $450 you can visiablly tell the difference. The purse is amazing and has a warranty. It turns into a small back pack. The leather is soft."}, {"username": "Holly Nebot Mouch", "comment_text": "Peruzzi"}, {"username": "Coral Allorto", "comment_text": "F"}, {"username": "Lisa Williams", "comment_text": "Go find out."}, {"username": "Bill Elias", "comment_text": "There are good leather shops all over the place - also don't overlook the street vendors for belts and bags.\n\nAnd keep your eyes peeled for glove shops."}, {"username": "Donna Gebig Kotronis", "comment_text": "In amalfi or positano actually"}, {"username": "Sheyla Enrich", "comment_text": "I heard that some places sale fake leather that look as authentic leather."}, {"username": "Wolfgang Nitsch", "comment_text": "Texas"}, {"username": "Beth Marcinko", "comment_text": "Leather school"}, {"username": "Carol Scotton", "comment_text": "Yes"}, {"username": "Mary Amann Destro", "comment_text": "Most are wonderful, and they are literally all over Firenze."}, {"username": "Gaye Watkins", "comment_text": "David II Leather Franco Fonati. Tell him HI from TX, AND ask him where to have dinner, I LOVE my full-length custom leather coat with hood….the best part????? It’s reversible"}, {"username": "Franca Raimondi", "comment_text": "Benheart"}, {"username": "Nancy Kirby", "comment_text": "Leather school- connected to Santa Croce which you should also see!"}, {"username": "Renee Rosolino", "comment_text": "F"}, {"username": "Caryn Goode", "comment_text": "Near Santa Croce"}, {"username": "Jessica Petyo", "comment_text": "I was extremely underwhelmed at every place we went to in Florence. We looked at A LOT from many of the places recommended in this group, but it just wasn’t what I was expecting. Maybe I’m missing something or just have different taste, so I’ll stick to my Gucci and LV."}, {"username": "Debra Indorato", "comment_text": "Jimmy’s Leather Collection. Amazing selection of true Italian leather. Great customer service. Not far from the Central Market. If he doesn’t have what you want he’ll make it."}, {"username": "Mari Falcone", "comment_text": "For high end I love Parri. Every bag is unique."}, {"username": "Frank Scar", "comment_text": "Been making steady profits even during the bear season just by copying and following Davis Harrison Strategies.. He's a market genius and highly recommended🚀"}, {"username": "Robin Burkholz Shaham", "comment_text": "Check out Il Perseo Leather Firenze. Ask for Sam. He’s great and very helpful.\n\nBorgo dei Greci, 24R, 50122 Firenze FI, Italy"}, {"username": "Mandy Jonas", "comment_text": "Leather markets are the best place to shop"}, {"username": "Scoun Drell", "comment_text": "Look for one"}, {"username": "Hudd Cass", "comment_text": "The markets!"}, {"username": "Kimberly Coury", "comment_text": "I loved Il Perseo. Sam is amazing and will give you incredible attention and help. One of my other travel groups recommended him and I wasn’t disappointed. 😁"}, {"username": "Melanie Moyle", "comment_text": "We have just come back from Florence and the leather school is amazing.. beautiful hand crafter authentic leather items from book markers, purses, bracelets to amazing hand bags and jackets. You can watch them at their craft. They also emboss your purchased items with your name/ initials free of charge as you wait.. bought some amazing pieces there… I would stay away from the markets, I’m sure there are some authentic leather items but I found it was difficult to differentiate… stick to the smaller more boutique shops and visit the leather school. Xx"}, {"username": "Denise Bellagamba", "comment_text": "Be careful. A lot of places are tourist traps and fake."}, {"username": "Jeannette Doornbos", "comment_text": "Market"}, {"username": "Wasyahul Afrah", "comment_text": "F"}, {"username": "Isabella Myrah", "comment_text": "Market"}, {"username": "Kristie Huff", "comment_text": "Go to Desi Vintage for purses, belts, shoes and clothing. Very high end . We spent hours at the shop. I regret paying full price for Fendi purse before I went to Desi. They had gorgeous vintage bags I preferred better."}, {"username": "Pia Reilley Loughin", "comment_text": "The Leather School.\nSo amazing!"}, {"username": "Nan DiNardo MacKenzie", "comment_text": "NOI.... Best ever"}, {"username": "Glenn Todd Webb", "comment_text": "Benheart down by river"}, {"username": "Veronica Solimando-Lynch", "comment_text": "Perruzzi"}, {"username": "Kenneth T Williams", "comment_text": "Hahaha\nAll over town. You will see what I mean when you get there\nHigh end to low you will have your pick. Believe me\nCheck the big market in square not far from Ponte veccio bridge\nLiterally, shops are everywhere"}, {"username": "Sandra Miller", "comment_text": "sorry, I don't know how that pic got sent!!"}, {"username": "Jill Halleman Timmermann", "comment_text": "The Leather school"}, {"username": "Sandra Miller", "comment_text": "Go to Leonardo da Vinci Leather Factory."}, {"username": "Colleen Jennings", "comment_text": "there’s a fantastic glove shop on the street leading off the Ponte Vecchio. we’ve bought many pairs of gloves there for ourselves & as presents. sorry can’t remember the shop name."}, {"username": "Stuart Kennedy", "comment_text": "Everywhere. Shop around. Prices vary by quality is good."}, {"username": "Jed Eldredge", "comment_text": "There must be 1,000 to choose from - no exaggeration."}, {"username": "Russell Weidner", "comment_text": "Pointe Vecchio Florence by the bridge. Ask for Gerardo. The owner. Hand crafted authentic Italian leather items!! Multiple generations"}, {"username": "Kevin Kappel", "comment_text": "Just walk down the street, they are everywhere"}, {"username": "Gail Suddath", "comment_text": "David Suddath?"}, {"username": "Ken Vecchia", "comment_text": "They’re aren’t any"}, {"username": "Nicholas Amigoni", "comment_text": "Bisonte"}, {"username": "Macky Ninety-six", "comment_text": "Gucci! Lol"}, {"username": "Robert Johnson", "comment_text": "Dionne Miller-Williams can you answer this? Welcome to the community"}, {"username": "Lauren Velleno", "comment_text": "Il Perseo Leather\n\nI was just there last month and Sam was great! He helped me find a great purse. I went there after seeing lots of recommendations\n. I can see why people like it so much!"}, {"username": "Tony Indorato", "comment_text": "Jimmy’s."}, {"username": "Albert Campagna", "comment_text": "The open air leather market at the city Square"}, {"username": "Melissa White", "comment_text": "Florence"}, {"username": "Suzanne Mills", "comment_text": "Open markets under the Ponte Viccio bridge. Make sure they don’t have made in China tags…. It happens. Says Gucci, but Chinese imposters"}, {"username": "Geraldo Prioriello", "comment_text": "Paponi"}, {"username": "Krystal Apolinaro", "comment_text": "I’ve heard about Sam. Unfortunately I found out about him AFTER my trip. But a lot of people swear he is the best.\n\nhttps://\nwww.ilperseoleat\nher.com/about"}, {"username": "Heather Sturgill", "comment_text": "Sarah Reed"}]}, {"id": "2211724415893303", "text": "Sorrento", "link": "facebook.com/groups/1373361046396315/permalink/2211724415893303/", "likes": 39, "comments": []}, {"id": "2211538202578591", "text": "Looking for 4 bedroom Airbnb or villa in toscany near grocery shopping and transportation", "link": "facebook.com/groups/1373361046396315/permalink/2211538202578591/", "likes": 5, "comments": []}, {"id": "2211545669244511", "text": "Hey everyone!\nI have a few questions about transportation, thanks in advance for your help!\n\nWhat is the best (and cheapest) way to get from Venice airport to Venice? Do I need to book bus tickets in advance?\n\nHow do I get from Verona to lake garda?\n\nI’m looking at trains from Garda to como, and it’s with a train change in Milan. Would 20 min be enough to change trains? I’m not sure what’s the walking distance between platforms", "link": "facebook.com/groups/1373361046396315/permalink/2211545669244511/", "likes": 5, "comments": [{"username": "Chris N Lynn", "comment_text": "1. https://\nactv.avmspa.it/\nen/content/\nvaporetto\n\n2. Trenitalia website will do wonders for you.\n\n3. 20 minutes is sufficient time to transfer."}, {"username": "Pietro Adami", "comment_text": "1) best, but not cheapest, is water taxi\n\n2) bus o car rental (I would recommend the car, so you can drive around in various villages)\n\n3) Milan, 20 minutes could be ok if your train is not late"}, {"username": "James-Kathy Dickerson", "comment_text": "We r taking the bus when we go in Oct to venice about $10 just show up takes about 20 minutes"}, {"username": "Janis Nunez", "comment_text": "We took a Vaporetto from the airport to Venice. This is probably your cheapest option. From the Venice airport (or rental car drop off), follow the blue signs for water transportation.\nWe purchased a round trip ticket (€27/person). We took the orange line to the San Stae drop off. The Alilaguna Vaporetto website will give all of the information you need to plan your transport to the island. It takes about an hour to get to Venice from the airport. Then it was a short walk to our hotel. You can also take a private water taxi. Just keep in mind that it will be more expensive."}, {"username": "Frank Scar", "comment_text": "Been making steady profits even during the bear season just by copying and following Davis Harrison Strategies.. He's a market genius and highly recommended🚀"}, {"username": "Robin Burkholz Shaham", "comment_text": "I took the water bus or the Vaperreto from the train station. It cost me 9 euros to the Grand Canal."}, {"username": "Kejdi Okej", "comment_text": "Been making steady profits even during the bear season just copyin and fllowing davis harrison strategies he s a market genius and highly recommended ✈️"}, {"username": "Federico Permutti", "comment_text": "As regards transportation from Venice airport to Venice:\n\nThe cheapest option is ACTV urban bus line 5 at 10€ one way, 18€ return. There is a ticket office in the arrivals area, and a ticket machine at the bus stop right outside the terminal. Buses run every 15 minutes and the ride to the Piazzale Roma bus terminal takes about 25 minutes.\n\nThere are also coaches operated by another company (ATVO), which run every 30 minutes and are marginally faster. The tickets cost the same, but they are not interchangeable\nwith the urban bus tickets. I’m pointing this out because I’ve frequently seen tourists get on the wrong bus and get fined for not having a valid ticket. It’s easy to tell them apart, however: ACTV operates white urban buses, ATVO operates blue long-distance coaches.\n\nFor a more scenic ride into town, take the Alilaguna waterbus. Tickets are 15€ one way, 27€ return, and are sold at the ticket office in the arrivals hall. Take the moving walkway on the first floor to reach the docks. It’s a slower ride, but arguably quite unique, and it has the advantage of stopping at various points of the city including St. Mark’s.\n\nThe fastest and most expensive option is the water taxi, which typically costs 135€ for up to four people (with an additional 10€ for every additional person, up to a maximum of 10 people). Depending on where your accommodation is, it’ll take anywhere between 20 and 30 minutes. You can book one at one of the booths in the arrivals hall."}, {"username": "Denielle Sutton", "comment_text": "Get the Rome to Rio app, it will answer all your questions 😊 we used it to plan all our travels"}, {"username": "Deborah Schroeder", "comment_text": "A lot depends on where you are staying. If you have a hotel on a canal that a water taxi can stop at, that might be convenient. If you are away from the canals, then you will have to walk from a water bus stop to your hotel so take the Alilaguna and save yourself some money. I didn't pre-order but had to wait in line to get on one. Now, the Alilaguna only has a few stops on the canal so you might have to get passes for the vaporetto to get to the water bus stop closest to your hotel. If you go to the train station from the airport, you can get the vaporetto there."}, {"username": "Maria Piccolo Stern", "comment_text": "Well, the best way to get from Verona to Lake Garda is my car. It’s the only way I personally have ever done it."}, {"username": "Claire Dowson", "comment_text": "20 minutes in Milan station is enough time. Just done Como to Garda via Milan in July. Was pretty straightforward\n."}]}, {"id": "2211547732577638", "text": "Can i do day trip of amalfi coast from rome? Dont suggest planned tours as they leave very small time to explore. I want to arrange on my own so suggest local transport/ ferry route.", "link": "facebook.com/groups/1373361046396315/permalink/2211547732577638/", "likes": 4, "comments": [{"username": "Richard Staarkeson", "comment_text": "Not unless you had a helicopter to get there. The Amalfi coast is just south of Naples, which is a very long way from Rome."}, {"username": "David Ockman", "comment_text": "No"}, {"username": "Pooja Patel", "comment_text": "If you’re getting a private driver, you probably can. It’s about a 3 hour drive each way. Depending on how early you leave and how late you’re willing to come home, you could do lunch in amalfi and stop in positano or sorrento on your way up."}, {"username": "Ibbu Mohd", "comment_text": "Take train to naples and hire private driver. We hired him, good n reliable for day trip.\nMake sure take last train from naples back to rome.\nUse italo trains"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Take the high speed train to salerno. Hire a driver from there. I would suggest an overnight stay would be preferable than a day trip."}, {"username": "Patty Cesner", "comment_text": "Jill Simone Libretti"}, {"username": "Dunia Aldyni", "comment_text": "We do with tour we start 7.30 am we back 9.30 pm"}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "We are doing a day trip with get your guide. Hopefully all goes well."}, {"username": "Yolie Marroquin", "comment_text": "Sure you can do a DIY day trip, but it’s still going to give you very little time to explore. We took a high speed train from Rome to Salerno, and it was quite easy, but we were staying for a week on the AC, I cannot imagine doing that RT for the day because your basically spending so much time on just getting there and returning 👎🏼 even if you opted for a private 🚙transfer. IMO, you really need an overnight stay to make the most of a visit to the area if your planning a return to Rome."}, {"username": "Virginia Lane", "comment_text": "Yes, years ago I did a tour. It was amazing. I’ve read they have opened a fast train from Rome to Pompeii. We stopped in Sorrento, as well."}, {"username": "Janine Emma Lucas", "comment_text": "It really depends. What towns are you wanting to get to?"}, {"username": "Janine Emma Lucas", "comment_text": "Look into Rome 2 Rio dot com. It’s quite far. I’d recommend staying 1-2 nights in the Amalfi cost if you can. It’s not an easy day to get there/back, that’s why the tours are short visits in each town. Renting a car is not feasible either through Amalfi and no parking.\nI’d think high speed train into Salerno, ferry from there but you can’t predict water conditions and ferries could be docked for the day."}]}, {"id": "2211491959249882", "text": "Anyone in Rome lately and visited Vatican Basilica? How are the queues? We are here now and trying to work out if we need to get up super early to beat them.", "link": "facebook.com/groups/1373361046396315/permalink/2211491959249882/", "likes": 6, "comments": [{"username": "Kally Trahearn", "comment_text": "Depends on the time of year. In the summer, the crowds are intense, but you can book breakfast tours at 7.15am. I went in early December one year and it was busy but not hectic."}, {"username": "Mary LoFrumento", "comment_text": "Was there yesterday, arrived about 9:15 am and did not wait to get through security. We were with a tour guide and already had prepaid tickets.\nIt was crowded but we didn’t wait anywhere"}, {"username": "Wendi Maher", "comment_text": "If you can find someone who offers early access. The lines yesterday were wrapped around the block at 7:45am. We had early access through city lights and it still took an hour for us to get in"}, {"username": "Venette Macalinao", "comment_text": "Got tickets from Musei Vaticani (official site) a few months ago. Booked 830am time slot. Went today and walked straight in. Line up was around the street, Viale Vaticano and this was at 8am."}, {"username": "Sandy Radican Shikaly", "comment_text": "People line up without tickets and wait hours to get inside.. the last time as I was going in with a tour I heard them say no one without tickets would be entering for hours as they were at capacity with tours"}, {"username": "Jaime Cleek", "comment_text": "We had an early morning Vatican tour and the regular line when we got there at 630 already was more than 100 deep"}, {"username": "Stephanie Condon", "comment_text": "Thank you everyone - I was under the impression you couldn't buy tickets for the basilica and just walk in only? And the tickets are for the museums and Sistine Chapel...I guess will just have to find out :-)"}, {"username": "Mackinzie Rekers", "comment_text": "The Vatican and St Peters Basilica are two different queues. We are here now and the lines to get into the Vatican are wrapped around the building by 9:30. To get into St Peters Basilica wasn't quite so bad, yesterday we were in line by about 9:30 and it took us about 20-30 minutes to get to the front, however the line was significantly longer by 10:00."}, {"username": "Nicole Condemi", "comment_text": "I was there 1230 last week and waited about 15 min to get through security, line moved pretty quickly. We only went in to see the basilica, not the museum or anything else"}, {"username": "Toby Levy", "comment_text": "Basilica had a very long queue and there was a heatwave when we were there 3 weeks ago but the line moved very quickly and we were inside within 10 minutes. No tickets or tours. Also climbed onto the roof - was brilliant"}, {"username": "Kasey Jackson", "comment_text": "Yes. Super early. Buy skip the line tickets"}, {"username": "Liz Donaghy", "comment_text": "When I went (a number of years ago) I opted for the final hour of opening, there was hardly any queues at that time of day. Enjoy!"}, {"username": "Kelly Kummer Moss", "comment_text": "Booked “skip the line” tickets through Viator and walked right in. Saw the Vatican museums, Sistine Chapel and St. Peter’s Basilica. Reasonably priced and our guide was amazing."}, {"username": "Diane Hamilton", "comment_text": "Going November 15\nWant to see all of above sites.\nCan you pre-order tickets for Vatican, St. Peter’s Basilica and Sistine Chapel ?"}, {"username": "Marcus Hiesler", "comment_text": "Get your tickets through viator or something."}, {"username": "Leah Rose", "comment_text": "We were there Thursday- we waited in line maybe 5 minutes max!"}, {"username": "Stephanie Condon", "comment_text": "So we went at 5pm, and were inside St Peter's within 20mins - security being the main wait as only 2 screeners open. If you wanted to include the cupola, I would either get there 30 mins earlier or else do it first and then come back to the basilica. Thanks for your help! Also, no tickets requited."}, {"username": "Margarita Lipkin", "comment_text": "You have to buy tickets in advance. Don’t wait in hours long lines in the heat. We bought ours through tiquets, super easy and went right in."}]}, {"id": "2211588905906854", "text": "Hello all you lovely Italy lovers.\nCould anyone recommend a place to go for beach swims in Italy that is not the Amalfi coast/Sorrento/Positano. (I know it’s impossible to avoid the crowds but hoping for slightly thinner crowds :-))\n\nSadly we have to be able to get there by train and bus as my partners wallet was stolen. While we were easily reissued new cards on our phones , we now don’t have a ‘physical credit card’ necessary to hire a car! (If anyone knows how to get around that problem we’d be very grateful!)", "link": "facebook.com/groups/1373361046396315/permalink/2211588905906854/", "likes": 8, "comments": [{"username": "Robin Burrell", "comment_text": "Try the Italian Riviera. Santa Margarita"}, {"username": "Maria NoBa", "comment_text": "Rimini is also very nice."}, {"username": "Maria NoBa", "comment_text": "As for your cards, the bank should be able to issue you new ones….."}, {"username": "Carmela Noble", "comment_text": "Vieste Puglia"}, {"username": "Cindy Sguazzin", "comment_text": "I heartily recommend the several fantastic sandy beaches and turquoise waters of the Adriatic coast near Venice (north), the Lido, Lignano Sabbiadoro, Bibione, Grado. I’m Canadian, took my kids there many summers.! Glorious! Lots of b&b’ s in private homes, hotels etc. Restaurants and shopping!"}, {"username": "Kejdi Okej", "comment_text": "As for your cards the bank should be able to issue you"}, {"username": "Diane Janovas", "comment_text": "Viareggio...tra\nin from Florence"}, {"username": "Amelia Bonannella", "comment_text": "Head to Puglia, less crowded and beautiful beaches"}, {"username": "Rose Turdo", "comment_text": "Spiaggia di Vignanotica"}, {"username": "JoAnn Bobier", "comment_text": "Elba Island"}, {"username": "Sue Cornish", "comment_text": "Santa margarita"}, {"username": "Lynne Fricke", "comment_text": "We are in Polignano a mere now and it’s much more crowded than Sorento was last week. We don’t have a car so have gone to the beaches here and in Monopoli and they are very crowded and the water is really murky and rough. Personally enjoyed our beach club days in Sorento a lot more."}, {"username": "Laura Uribe", "comment_text": "Rimini has a nice beach area."}, {"username": "Alma Klarich", "comment_text": "Research Sperlonga. It was lovely and not crowded at all when we went in July."}, {"username": "Kasey Jackson", "comment_text": "Cinque Terre"}, {"username": "Lisa Gillis", "comment_text": "My daughter and I spent all day yesterday in Viareggio. The beach is amazing, and so are the little shops and restaurants. It’s about an hour and 40 minutes by train from Florence. We highly recommend renting your beach chairs and umbrella from Bagno Maurizio… Stefano was very welcoming and helpful!"}, {"username": "Nancy Cicinelli", "comment_text": "Nancy Cicinelli"}, {"username": "Nancy Cicinelli", "comment_text": "Loved Tropea"}]}, {"id": "2211605569238521", "text": "Has anyone ever rented a car from acarent before?\nContacted us before we arrive Monday to confirm. We’ve already paid for full insurance yet they’re saying the insurance we’ve taken out is between us and the broker not the actual company aka Acarent now telling us we have to pay €900 deposit when we’ve already paid fo full insurance.\nHas anyone rented with these before?", "link": "facebook.com/groups/1373361046396315/permalink/2211605569238521/", "likes": 0, "comments": []}, {"id": "2211616749237403", "text": "Italy Sept. 2024 - Any recommendations for a base in Tuscany ? We have a total of 3 1/2 days with one of those days spent in Florence. Thought is to rent a car outside of Rome with stops in Monteplciano and Barone Ricasoli Winery tour before reaching our base.", "link": "facebook.com/groups/1373361046396315/permalink/2211616749237403/", "likes": 1, "comments": [{"username": "Chris Landry", "comment_text": "I stayed a week in Pienza at Piccolo La Valle. Nothing fancy but it has its own parking which is hard to find in these hill towns. Lovely small town within easy drive of all those great hill towns."}, {"username": "Diane NM", "comment_text": "Kmzero KM Zero Tours - Slow Travel Tuscany\nNo car necessary, they arrange all transportation,\naccommodations,\nexcursions! You’ll love every minute!"}, {"username": "Rose Turdo", "comment_text": "Bolsena Lake"}, {"username": "Debora Mazzierli", "comment_text": "I do truffle hunting or visit a cheese farm?"}]}, {"id": "2211542349244843", "text": "Best/ clean hotels in Rome next to the cruise port ? TYI 😁", "link": "facebook.com/groups/1373361046396315/permalink/2211542349244843/", "likes": 2, "comments": [{"username": "Tsungani Clemons-Black", "comment_text": "We stayed at the Dharma hotel 2yrs ago in Rome to be able to see the city the day before. Then our hotel set us up with a transfer to drive us the next morning to the cruise port. It was just over an hr drive the next day. We plan of doing the same this October."}, {"username": "Kristi Duncan Isaacs", "comment_text": "Remember the cruise port is not in Rome. It’s about an hour away."}, {"username": "Colleen Dawson", "comment_text": "You should be asking for recommendations\nfor a hotel in Civitavecchia, not Rome which is 45-60 mins away."}, {"username": "निनावी सहभागी", "comment_text": "My apologies- I didn’t realize it was that far from Rome itself. Thanks"}, {"username": "Luis Camacho", "comment_text": "NH Collection near to Rome Termini"}, {"username": "Kejdi Okej", "comment_text": "Near to rome termini"}, {"username": "Sara Regimenti", "comment_text": "You should book in Civitavecchia or Santa Marinella that Is very near and maybe cheapest"}, {"username": "Sara Regimenti", "comment_text": "Cheaper"}]}, {"id": "2211540105911734", "text": "I made a mistake and booked our Airbnb in Venice on Via Giuseppe Garbaldi in the Arsenale area thinking it was a different area. I have read both good and bad posts on this area - any thoughts out there from the experts? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2211540105911734/", "likes": 1, "comments": [{"username": "Marianna Mazzuccato", "comment_text": "It is very Venetian, lots of local live there. What are the bad reviews about?"}, {"username": "Melanie Matthews Stuprich", "comment_text": "Honestly from the post above, I would rather stay where the locals live vs highly tourist areas but maybe that’s just my background of living overseas most of the last 20 years. I would rather explore local neighborhoods than stalls set up for tourists and especially restaurants in local areas vs overpriced BS for tourists. But Venice is one of the few major Italian cities I have not visited over the last 20 years (first living in Naples and taking guests all over mainland Italy 20 years ago and now living in Sicily for 1.5 years) so I can’t speak directly to your dilemma but I know I have always loved to immerse myself in local culture (that isn’t so tourist!). Either cancel and go more for tourist areas or embrace it and see how the locals live. But please don’t give your Airbnb or vrbo bad scores because it’s not like it is in your country unless it’s a real emergency! 😃)"}, {"username": "Brent Colosky", "comment_text": "There's not a bad part of Venice that I've ever discovered."}, {"username": "Jo Dal Santo", "comment_text": "My only thought is you may want to catch a water taxi from the train station depot, because you are a loooong walk with luggage, away from the entrance to Venice."}, {"username": "Etschi Bruckner", "comment_text": "oh - good for you! the area is a bit more authentic and has got some really good restaurants as well - and it´s not far to walk to the major sights"}, {"username": "Carolyn Adams Brown", "comment_text": "It is a lovely area. We had some excursions leaving from that area and we enjoyed exploring it. When we return we intend to stay in that area. A Vaporatto or a water taxi will get you there and wherever you want to go. We bought a Vaporatto pass for the days we were there!"}, {"username": "Jennifer Gustafson", "comment_text": "Wonderful area!"}, {"username": "Deborah Schroeder", "comment_text": "You are at the end of Venice proper so a bit of a walk to get around. Just get the vaporetto pass and you will be fine. It is a lovely area and I never saw a street peddler, but I was there last fall. With summer as crazy as it has been-I couldn't say now."}, {"username": "Val Kilgallon", "comment_text": "That is not a bad area at all! I walked past that neighborhood several times from our hotel near San Zaccaria on the way to Giardini Della Biennale. You are maybe a 20 minute stroll along the Venice lagoon to get to St. Mark's. It was a really pleasant walk along the waterfront. It gets much more crowded and touristy as you get close to San Marco, so you may appreciate being in a pretty and quieter neighborhood!"}, {"username": "Paul N Marietta Dodson", "comment_text": "We stayed in the Sant Elena area of Venice in a converted convent. It was wonderful to walk back from the water taxi dock through the park where kids were playing soccer and local families were having picnics and strolling. The whole \"gotta stay in the touristy area\" is not for us. We even ate at a trattoria in a locals neighborhood. At that time , 6 yrs ago, cruise ships were overtaking Venice. Sort of made it a city I would never go back to. Glad to know they are regulating them."}, {"username": "David King", "comment_text": "It’s a far walk, all things considered. We walked there one night, and it’s quiet but VERY dark at night (but frankly most of Venice is).\nWe had great luck in getting an Airbnb just behind Basilica di Santa Maria della Salute, and that spoiled us to always seek close-in to St. Mark’s Square or at least near a vaporetto stop."}, {"username": "Jenny Godfrey", "comment_text": "Spent an hour and half walking around this area to find the hands sculptor, never felt unsafe or worried at all. Plus it’s a short walk to san marco, great parks near by and sea views. So I wouldn’t worry most things are in walking distance."}, {"username": "Paola Barbetti", "comment_text": "It’s a nice and a little less touristy area and just a 10/\n15 minute walk from San Marco sq. - don’t miss to have dinner at “Ai Nevodi” restaurant, which is just along via Garibaldi…absolutel\ny great!! ☺️"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211550139244064", "text": "Wow thought Milan would be boring as our stop over as not the prettiest city but wow the district near the Duomo Cathedral was superb.", "link": "facebook.com/groups/1373361046396315/permalink/2211550139244064/", "likes": 16, "comments": [{"username": "Robyn Cane", "comment_text": "Gill Liston"}, {"username": "Annie Annie", "comment_text": "It's beautiful here"}, {"username": "Chiara Normanno", "comment_text": "Yep that's one of the few prettiest part, Milan isn’t boring at all but I don’t think it's for first time travellers to Italy as it has less things to offer. It is suitable for a day trip or a base for the lakes"}]}, {"id": "2211552422577169", "text": "We fly into Milan at 7am - looking to spend the day and one night. Can anyone give info on the Navigli area to spend the night? Is it walkable to Duomo, Galleria etc?! (We like to walk and would enjoy it if it’s doable.) also, what’s the best way to get from the airport - MXP- to the city center? Thanks for any input for anyone who can help! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2211552422577169/", "likes": 5, "comments": [{"username": "Ted Cabot", "comment_text": "Take the malpensa express train from the airport to Milano centrale, the train station in the center. Takes about an hour, super easy though. From there you can walk or metro or tram to Navigli, would be a pretty long walk. Navigli is walkable to the duomo, tram is faster but walking is possible. Try downloading city mapper, fantastic app for getting around major cities all over the world and shows multiple transit and walk options. PM me if you need help with an itinerary or food and drink recommendations\n! I live about two hours from there!"}, {"username": "Karen Blackmore", "comment_text": "We got the tram from the centre to Navigli, which was lovely. Can use card to tap and pay."}, {"username": "Grazia Maria Giordano", "comment_text": "Walking from Navigli to duomo is feasible but quite a long walk. You might want to try the tram or the metro. Google maps will give you which line to take. Taking public transportation in Milan is very easy as you just need to tap a credit card in the special machines on the tram or at the entrance of the metro. Malpensa express connects the airport with the city center."}, {"username": "Renae Larcus", "comment_text": "It is NOT walkable to the Duomo. I like to walk a lot but it was a long taxi ride from our hotel. From the airport just take the train to Milano Centrale"}, {"username": "Mohor Chakraborty", "comment_text": "Malpensa express."}, {"username": "Beth Ann", "comment_text": "The metro system in Milan is wonderful so you could stay in Navigli and use public transportation to Duomo but in terms of walking it would be quite a long walk. Navigli is a fun area though"}]}, {"id": "2211554345910310", "text": "What are some of the best non-touristy restaurants you've eaten in in Sorrento.", "link": "facebook.com/groups/1373361046396315/permalink/2211554345910310/", "likes": 9, "comments": [{"username": "Geoff Roush", "comment_text": "Zi Ntonio"}, {"username": "Sasha Childs", "comment_text": "The foreigners club"}, {"username": "Cindy Gallen Barton", "comment_text": "Cindy Gallen Barton"}, {"username": "Andrew Mircovich", "comment_text": "Zi Ntonio and Taverna Allegra"}, {"username": "Karen Lavoie", "comment_text": "Di Gigino on via degli archi"}, {"username": "Ralph Squire Martuscello", "comment_text": "Near Sorrento, best pizza ever! Go to their site and watch the video. Home to the “ wallet pizza”"}, {"username": "Debbie M Kelaher", "comment_text": "Thank you for the information"}, {"username": "Sheral Gillman Rowe", "comment_text": "Lorelei"}, {"username": "Linda Snyder Shandle", "comment_text": "Ristorante Donna Sophia"}, {"username": "Shelly Seifert Lettieri", "comment_text": "Tavern Allegra"}, {"username": "Beth Murray Reeves", "comment_text": "SO good"}, {"username": "Wolfgang Nitsch", "comment_text": "McDonald’s"}, {"username": "Daniel Taylor", "comment_text": "Lara Jupp"}, {"username": "Michelle Hannah", "comment_text": "The best sandwich I had was in sorrento: A’Marenna"}, {"username": "Lisset Berdeal Sassi", "comment_text": "Da Giginos great food and Donna Sophia for a nice evening out"}, {"username": "Lynne Fricke", "comment_text": "Il Pozzo - still craving their Carbonara."}, {"username": "Maddisen Paewai-Ratten", "comment_text": "Restorante verdemare!"}, {"username": "Chris Love", "comment_text": "F"}, {"username": "Jane Lilibet", "comment_text": "Like anywhere, if locals are eating there it has to be good, and they're normally down a little side street."}, {"username": "Rachel Rouchard Gribbin", "comment_text": "F"}, {"username": "Karen Lenthe Redett", "comment_text": "Ninos rooftop"}]}, {"id": "2211558732576538", "text": "Hello all,\n\nGoing on a Med cruise next July out of Rome for the first time. We’re flying into Rome a day or two early to explore.\n\nQuestion 1: do you recommend staying in hotel near port ( Cititavecchia) or staying near the airport to explore and drive to port ?\n\nQuestion 2: best hotels / restaurants/ attractions in Rome? I don’t care about price we are splurging on this trip.\n\nThank you 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2211558732576538/", "likes": 0, "comments": [{"username": "Betsy Duran", "comment_text": "We are cruising out of Cititavecchia in November, flying in 3 days before to do a little in Rome & a day trip to Florence by high speed train. We have a hotel for 3 nights in Rome, using taxi from FCO into city (flat rate to city center is reasonable) and will be taking the train from Termini Station on day of departure as it’s simple & straightforward\n."}, {"username": "Kejdi Okej", "comment_text": "We are cruisnig out of cititavecchi in november flying in 3 days before to. Do a little in rome & a day trip to florence by high center is reasonable and will be taking the train from termini station on day of straightforwad"}, {"username": "Lauran Cantwell", "comment_text": "Definitely stay in Rome. So much to do. A 3 hour golf cart tour is an amazing way to get a great overview of city. Public taxi from airport to Rome hotel is super easy and readily available at airport without having to worry about glight delays and what time to book. It's about 30 minutes from FCO to city center.\nTo get from hotel to port, use a private car service. Plenty to choose from on Viator or have your hotel book one for you. Takes about 60-75 minutes so allow appropriate time.\nEnjoy."}]}, {"id": "2211560555909689", "text": "Hi, I am wondering how is the best way to get from the Venice airport to the city of Venice?\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2211560555909689/", "likes": 4, "comments": [{"username": "Ryan Monahan", "comment_text": "Alilaguna water bus. It’s around $15 and it’ll take you right into the grand canal. Just find the stop nearest your hotel. Otherwise private boat taxi but you’re looking at $100-200."}, {"username": "Rhona OConnor", "comment_text": "Check with Google maps."}, {"username": "Kit Nader", "comment_text": "At the airport you can go to the jetty ...5 min walk. There you will find the water bus about 20 euros pp .....or if you want to arrive quickly and very happily you can jump in a water taxi ( u will love it it'll be a highlight of your trip) no need to book. Its 130 to 150 euro for the trip and if your hotel has a jetty it can take you to the door ...if not it will drop you very close. You'll never regret it!! If you'd rather spend less for 10 euros you can catch the road bus. Takes 20 minutes and comes every half hour. You can buy your ticket inside the airport from a desk or from a machine. Its a good service. It drops you at venice bus station and you just walk over the bridge in front of you and you're there."}, {"username": "Sonia Smith", "comment_text": "The ATVO bus from the airport. 8.00€ one way. Buy ticket at the baggage claim area."}, {"username": "Rosemary Dailey", "comment_text": "Depends on where you are staying"}, {"username": "Renae Larcus", "comment_text": "Vaporetto or bus. ATVO bus you can book online in advance. Cheap and fast"}, {"username": "Carole Tarlap", "comment_text": "BOAT 💯"}, {"username": "Ari Sun", "comment_text": "Private water taxi. The other way is miserable."}, {"username": "Gillian O'Callaghan", "comment_text": "The city is on mainland plus islands. Perhaps edit with the area of your hotel."}, {"username": "Kate Farrell", "comment_text": "Book a water taxi in advance, this was the advice we were given, and will take us from airport to hotel’s dock area…"}, {"username": "Susan Marten", "comment_text": "Alilaguna was easy and reasonable. What area are you staying in?"}, {"username": "Beverley Fitt", "comment_text": "Water taxi"}, {"username": "Jennifer McDonnell", "comment_text": "Water taxi - one of the most magical trips of my life. Cost about €90 but it was better than a weekend in Disneyland. Just skipped across the lagoon snd felt like I hand landed in a movie, I’ve been to Venice a few times but never took the taxi before - 100% recommend."}, {"username": "Lisa Valdovinos", "comment_text": "Private boat. It’s so much fun!"}, {"username": "Diane Pieri Adiliano", "comment_text": "We are Taking a water taxi to our hotel on grand canal"}, {"username": "Virgz Van Møøre", "comment_text": "Bus"}, {"username": "Carole Gucozumian Roche", "comment_text": "WE take aliguna boat, around 45 minutes to rialto"}, {"username": "Kathleen Roll", "comment_text": "We did bus and vaporetto- you can get an all inclusive pass for a few days - was well worth it"}, {"username": "Clare Pritchard", "comment_text": "I’m just back from Venice €15 got me the late night Alilaguna from the airport to San Marco (orange line) on the grand canal. Tickets are from the office just by where you get the boats - don’t buy them from the machines as these are for the vaparetto. Really clearly signposted from the airport"}]}, {"id": "2211580829240995", "text": "Looking for some insight into Florence. We will be there for full days followed by two days in Cinque Terre. ￼. I am absolutely excited about doing wine tasting and I’m looking at the Chianti wine safari for that which is a full day tour.\n\nI also would like to spend a day touring some of the surrounding cities, but it looks like almost all of thoseआणखी include wine tasting.\n\nWe are traveling with my newly 18-year-old daughter and although she’s excited to do the wine tasting day, having it included in other tours in those few days might be too much. ￼\n\nAny suggestions of tours you have experienced to see surrounding towns, without including a wine tasting experience? ￼", "link": "facebook.com/groups/1373361046396315/permalink/2211580829240995/", "likes": 3, "comments": [{"username": "Rocio Urbina-Litle", "comment_text": "We loved grape tours. They were great and the highlight of our trip"}, {"username": "Kejdi Okej", "comment_text": "We loved grape tours , they were great and the highlight of our trip"}, {"username": "Debora Mazzierli", "comment_text": "I do tours without wine:\nvisit a cheese farm? Or truffle hunting with lunch and then visiting a small medieval towns in Valdorcia?"}, {"username": "Susan Sharon Shakked", "comment_text": "Any resources for more cheese oriented tours than wine? Florence/ Bologna area ?"}, {"username": "Rebecca Yeoh", "comment_text": "I did a tour of Tuscany with Walkabout Tours. There was an optional lunch at a Chianti vineyard which everyone did. Whilst there was wine it wasn’t so much a tasting, it was about the food too which was organic and from the farm. The tour also went to San Gimignano, Siena and Pisa. It was one of my fav days of the whole trip! https://\nwalkaboutflorenc\ne.com/tours/\nthe-best-of-tusc\nany-in-one-day-\ntrip-from-flore\nnce?gclid=CjwKC\nAjw_uGmBhBREiwA\neOfsdw22ldN9brP\nwf2bhBsg7y6HRl-\nkhxXZuQMmRkjcEy\nMg7cbPd4ZAcxxoC\nXiMQAvD_BwE"}, {"username": "Ana Ka", "comment_text": "We did a tour with appyguide and it took us to San Gimignano, lucca, siena, monteriggioni, arezzo, val dorcia, and chianti. Was really insightful and fun. https://\nwww.getyourguide\n.com/\nsiena-l435/\ntuscany-discover\n-hidden-gems-wi\nth-world-s-top-\nexperts-t484689\n/ and then we went to do wine tasting in Montalcino and absolutely loved it. Too many wineries there, but the top ones out of my head were podere le ripi, san polino and argiano (for its gorgeous cellars)."}]}, {"id": "2211566185909126", "text": "Has anyone gone ishia ?", "link": "facebook.com/groups/1373361046396315/permalink/2211566185909126/", "likes": 1, "comments": [{"username": "Tami Whittlesey", "comment_text": "Not yet, but I have 5 days planned there next spring. I am excited to stomp around in the Castel di Aragonese In Ischia Ponte and then go to Sant Angelo, a pedestrian town near the Fumarole beach."}, {"username": "Mike Ball", "comment_text": "Yes , spent a week there last year,\n\nBeautiful island, very lively and colourful, easy to get around on the local buses,\n\nIt’s definitely worth visiting."}, {"username": "Kejdi Okej", "comment_text": "Yes , spent a week there last year , beautiful island , very lively and colourful , easy to get around on the local buses, it ,s definitely worth visiting."}]}, {"id": "2211586049240473", "text": "I’m not asking for a weather prediction, but I am considering moving our trip from May 2024 to January or February 2024 for less crowds. Will this have any impact on views, scenery, etc. if our trip is Rome, to Florence, to Venice. ￼", "link": "facebook.com/groups/1373361046396315/permalink/2211586049240473/", "likes": 11, "comments": [{"username": "Leslie Goodland", "comment_text": "The flowers are on the Spanish Steps in May. Absolutely beautiful! That's when I was there. There were crowds, but they were tolerable. I would recommend May."}, {"username": "Stacey Miller", "comment_text": "We visited Rome before Christmas and it was wonderful!"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "We are doing the same, but March. I would rather have cooler weather and less crowds."}, {"username": "Mary Anderson Jenkins", "comment_text": "We spent the first 3 weeks of May this year in Germany and Austria. I would absolutely do it again. No crowds. Great temps."}, {"username": "Jenny Frank", "comment_text": "Venice is scrumptious in winter!!"}, {"username": "Christine Sanci-Gentile", "comment_text": "I went in February and May and it was beautiful both times!"}, {"username": "Kerry Smart", "comment_text": "I’ve been twice In January/\nFebruary and it’s awesome!\nThe day we left it drizzled but otherwise clear and sunny every day. Yes it was cold but not ridiculously cold. A puffer coat over a long sleeved top was all I needed with gloves some mornings.\nWay less crowds too which is a massive bonus"}, {"username": "Lucrezia Folger", "comment_text": "I love the winter months and always go for a couple of months anywhere from Nov, Dec, Jan and Feb. I don't know what the change in season do to impact views, or scenery. They are all still magnificent. And there are drastically fewer tourists. Often I go days without hearing anyone speak English, it's amazing!"}, {"username": "Carmela Noble", "comment_text": "May is actually perfect time to travel for weather and crowds!"}, {"username": "Summer Wicker", "comment_text": "We traveled in late February 2018 we had snow it was honestly magical hardly any crowds we had an amazing time I’d do it again"}, {"username": "Rosa Zordan", "comment_text": "Yes it's a lot colder"}, {"username": "Anne van der Werff", "comment_text": "We went to Rome, Florence, and Venice in February this year, and the weather was surprisingly great the entire time: I was expecting rain at least 50% of the time, but apart from one ten-minute burst of rain our final night in Rome, every day was very pleasant weather-wise: it was sunny and/or cloudy and 50-ish during the day, although quite cool in the evenings. It wasn't too crowded and it was perfect walking around weather."}, {"username": "Cecilia Christine Costantini", "comment_text": "Daylight saving time starts on March 31st. Before that days will be \"shorter\", less light."}, {"username": "Emily LeaTh", "comment_text": "My family went in early April. It was chilly for us and rainy a bit. Still wonderful overall and I’d go any time of year. Next year we’re planning for June because we want to really enjoy the beaches. The good thing about colder weather is you’ll already be completely covered for any churches you want to visit!"}, {"username": "Erica Senes Tombesi", "comment_text": "Be careful to not go to Venezia during the Carnevale : to much crowd"}, {"username": "Jennifer McDonnell", "comment_text": "Went to Florence in early April - very pleasant weather with still a touch of winter to it. Not a single heat induced family row which is a standard in our summer trips as two of us are downright allergic to heat and get cranky!!"}, {"username": "Manuela Bonazzi", "comment_text": "Gennaio e febbraio sono proprio brutti mesi..se devi viaggiare e spendere soldi almeno che sia una vacanza piacevole.. da marzo in poi andrebbe meglio.."}, {"username": "Claire Dowson", "comment_text": "Rome in February this year was fab. Friend of mine went December and had good weather too."}, {"username": "Kate Vincent", "comment_text": "We loved our May trip this year. Depends on what you want with the weather Steve. The crowds were moderate but not over the top."}, {"username": "Jo Dal Santo", "comment_text": "If you like snow."}, {"username": "Bill Gillespie", "comment_text": "How about April???"}, {"username": "Fiona Cameron", "comment_text": "Probably less crowds in Jan Feb, Ive been in May and although not as bad as high summer there were still crowds in major cities you listed"}, {"username": "James Carr", "comment_text": "I think May is fine, June is when tourists begin ramping up."}, {"username": "Terri Young", "comment_text": "I’m going in November to avoid crowds, but hoping the weather is still not too cold."}, {"username": "Marcia Weidner", "comment_text": "What about mid to late September?"}, {"username": "Alexandra A Welker", "comment_text": "It could rain a lot in Venice and it'll get flooded and foggy on other days."}, {"username": "Jennifer Pace Kirby", "comment_text": "We went this past February and it was great. The Vatican was still very busy. ( we didn’t have an early tour). We loved being in Venice for Carnevale. We had lots of sunshine and only a drizzle one day in Florence. We were not terribly cold. We dressed in layers and I bought a scarf . We thought it was perfect plus it was a lot cheaper hotel wise. We did stay in Sorrento one night and it was great but a lot of stores were closed for the season. We still loved it and are glad we went. It was our first time to Italy so I can’t compare it to other seasons."}, {"username": "Hollis H McGuire", "comment_text": "These cities are NEVER not crowded. That’s just the way it is! But I happen to love being there in cold wet windy Winter - there’s a festive feeling and they aren’t quite as crowded.\nA down puffer coat and warm boots will help too. 😘"}, {"username": "Lisa Marchionda", "comment_text": "Too cold"}, {"username": "Patty Ham", "comment_text": "Could be pretty cold and rainy in Jan or Feb. I went once in March and it was pretty bitter and wet."}, {"username": "Steve Grossman", "comment_text": "May is fine don't change to the winter"}, {"username": "Rhona OConnor", "comment_text": "There will be less crowds..... But the weather might stop you going out a bit..... April or May won't be too crowded."}, {"username": "Lisa Normington Vitalo", "comment_text": "You can attend the Battle if the oranges if you go in Feb!!"}, {"username": "Lisa Normington Vitalo", "comment_text": "https://\nen.m.wikipedia.o\nrg/wiki/\nCarnival_of_Ivre\na"}, {"username": "Frank Dragna", "comment_text": "We went 5/27-6/9. Loved the weather and we didn’t think twice about the crowds. Only difference is it will probably be cheaper. We did Rome, Florence(day trip), Puglia, Taormina, and Palermo."}, {"username": "Liz Russo", "comment_text": "I was in Venice lats March 22. Unseasonably warm and much less crowds. Very glad I chose that time to go. And a bit cheaper for hotel and flight."}, {"username": "Leina Desaulniers Bond", "comment_text": "We've only visited in January, February, and March. The weather is perfect for us. We prefer cooler weather for walking and sightseeing. Crowds are low. At least they used to be. We just went in February this year and the major sites were more packed than in previous visits. I can't imagine what it's like in the summer."}, {"username": "Jaime Cleek", "comment_text": "Nearly everywhere you’re going to have crowds at all times of years. Some places will be less busy than others but overall with post COVID travel and many people working remote everyone has way more flexibility when they can travel. I would think Italy in the winter would be lovely but you would run into issues with stuff closed etc."}, {"username": "Angela Mcnamara", "comment_text": "Went to Rome in February, Venice in March and Florence in November, all three trips were perfect, one hour of rain in Florence, no crowds, did everything hassle free, highly recommend it, I hate queuing!"}, {"username": "Tina Bellitto", "comment_text": "It will be cold."}, {"username": "Steve Wolfrom", "comment_text": "Btw, I have average temp charts. The information that I was looking for does have to do with how enjoyable experience will be if the weather doesn’t bother me. ￼No flowers? Bare trees etc."}, {"username": "D'Anna Hohe", "comment_text": "I think in all three places, there might be more chance of rain and/or fog, but it’s just a different vibe. If you aren’t going to the coast, I don’t think closed restaurants are a big factor.\nI’ve been to Venice twice in February. Once it was 40degrees. The second time it was 70 and sunny. Just be careful not to move to March/ April when you might hit Easter and Spring break travelers."}, {"username": "Karen Schmidt", "comment_text": "I loved Venice in January. Cold…yes, but clear skies and sunny ( after the fog lifted each day). Way less crowds, cheaper accommodation and I found everything to be open. That said…heading in Spring this year to Tuscany. My husband isn’t a crowd person so trying to pick places a little off the beaten path"}, {"username": "Valerie Nicole", "comment_text": "We went at the end of March beginning of April this past year and it was perfect! Weather in the 50’s 60s in Venice and high 60’s 70s in Rome. Didn’t seem too crowded either"}, {"username": "Diane Plott Miller", "comment_text": "We went in November, and going back this time in November. It was perfect the first time, praying it’ll be this time too."}, {"username": "Ilaria Giorgulli", "comment_text": "I would not change.. expecially for Venice.. I assume you will have few days in each city.. in Venice the risk is to have 3 foggy days. And sun goes down around 4:30pm.. incomparable with 7:30pm in May!"}, {"username": "Jan Buess", "comment_text": "My cousin has gone 3 times to Rome in January. I am thinking since you are not going there to sit on the beach, what difference does it make really. She loves it then as you can explore without a ton of tourists. What I don't know is if any of the places that you tour will be closed that time of year? And what everyone has been reporting about this past summer with the pretty intense heat, I think you might even get cheaper pricing??"}, {"username": "Cassandra Crowley", "comment_text": "https://\nwww.dropbox.com/\nscl/fi/\n0g2kar9s3lrmz1vp\njpea0/\n8.3-San-Marco-in\n-winter-1974.jp\ng?rlkey=h9zxy5e\n8i8e7c26hpxs4w7\njnc&dl=0\n\nIt’s chilly in Jan/Feb."}, {"username": "Kevin Robison", "comment_text": "May is fantastic. Go as early in the month as possible and enjoy!"}]}, {"id": "2211586439240434", "text": "Hello everyone, hope you are all well.\nI'm planning on visiting Rome in November with a female friend and I wanted to ask you about hostel recommendations for female travellers and about the safest parts of town.\nThank you so much in advance 😀", "link": "facebook.com/groups/1373361046396315/permalink/2211586439240434/", "likes": 1, "comments": []}, {"id": "2211589715906773", "text": "We are traveling to Italy once again next month. Throughout our previous trip we always had AT&T as our phone carrier. About two years ago we switched to Consumer Cellular and while we truly like their domestic service, they do not offer good international plans. We do not want to change carriers so we have looked into purchasing SIM cardआणखी replacements for either strictly Italy or International. It seems both have pros and cons (not to mention much confusion for me).\nWe have already put WhatsApp on our phones, but too has limitations. We want to be able to stay in touch with family without having to sell one of our kids to do so (joking).\nPlease my dear fellow travelers, provide me with some insites and suggestions as to what you may have used. Remember, I don’t want to change our current carrier.\nThank you in advance for your kind responses.", "link": "facebook.com/groups/1373361046396315/permalink/2211589715906773/", "likes": 0, "comments": []}, {"id": "2211600195905725", "text": "To anyone with kids over 10 especially teenagers who have a spare couple of hours I highly recommend a place called CUBE - Ultimate Challenges in Rome . It was great fun . We went at 2pm to get out of the heat . Lots of laughs and something different", "link": "facebook.com/groups/1373361046396315/permalink/2211600195905725/", "likes": 2, "comments": []}, {"id": "2211601715905573", "text": "We are in Italy towards the end of September until mid October. Do I have to prebook train tickets or can I just book when I am there ?", "link": "facebook.com/groups/1373361046396315/permalink/2211601715905573/", "likes": 1, "comments": [{"username": "Nikki Wright", "comment_text": "You can book them there, but it can be more expensive. You save money when you book ahead of time."}, {"username": "Kejdi Okej", "comment_text": "You can book them there , but it can be more when you book ahead of time ."}]}, {"id": "2211607902571621", "text": "Going to Rome, Florence and Venice with my two daughters. We were thinking about getting tats while there. Any recommendations of places?", "link": "facebook.com/groups/1373361046396315/permalink/2211607902571621/", "likes": 2, "comments": []}, {"id": "2211609562571455", "text": "Coffee question again... Any chance coffeemakers are typically in hotel rooms? TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2211609562571455/", "likes": 3, "comments": [{"username": "Paula Brink", "comment_text": "Most hotels I have stayed in there have had Nespresso machines or similar. Most hotels include breakfast so you can have one there or step outside and find a coffee bar easily."}, {"username": "Sandra Maldonado", "comment_text": "No need, you’re not going to be in your room. From breakfast in the restaurant, with very good coffee to the streets - with very good coffee ☕️"}, {"username": "S.P. Espy", "comment_text": "If you can, please don’t skimp on coffee in Italy! Find a great local bar/cafe. Order an espresso at the bar - “Buon giorno. Un caffè, per favore.” - and drink it while standing right at the bar. Listen to the locals speak even if you can’t understand what they’re saying. Soak in the best coffee culture there is. You have all the time in the world to have not-so-great hotel coffee when you’re not in Italy."}, {"username": "Elena Innocenti", "comment_text": "Depends of your hotel rating. 5 stars hotel have, 4 stars sometimes, 3 stars you must be lucky.\nB&B check with your host. Maybe you can find a Moka!"}, {"username": "Sara R. Anderson", "comment_text": "No... rarely"}, {"username": "Kay Davis", "comment_text": "Most are equipped for hot tea."}, {"username": "Angie Hoff-Hess", "comment_text": "Always travel with Nescafe. Always❤️❤️🇸🇮🇸🇮"}, {"username": "Alexis Brajtman Aruch", "comment_text": "Not typically but there are endless espresso bars to grab a quick coffee all over Italy"}, {"username": "Camille Wittenhagen", "comment_text": "Yes in higher end hotels."}, {"username": "Cess Kearns", "comment_text": "Nope"}, {"username": "Lisa Valdovinos", "comment_text": "Blow dryers, no coffee makers but amazing hotel continental breakfasts. No irons"}, {"username": "Toni Quatrini Bannister", "comment_text": "All of our hotels had coffee makers and blow dryers no irons in any of them. I brought clothes that didn’t wrinkle! We never used the coffee pot but treated ourselves to a special bakery treat and a good cup of coffee while we were out exploring!"}, {"username": "Rebecca Day Tucker", "comment_text": "I've had a nespresso machine in a hotel room. In other places no coffee machine but I've been able to get one in the lobby or at the bar sometimes a little earlier than breakfast."}, {"username": "Carmine Napolitano", "comment_text": "Almost every other place you can jump in with a Euro coin and get a shot of expresso in less than 2 minutes the places we stayed had hot pots with instant coffee Ironically in Italia"}, {"username": "Alice Dzimiera", "comment_text": "Our hotel...Artemid\ne had a coffee maker a free minibar & a hairdryer. Breakfast was included so I didn't make coffee in our room"}, {"username": "Sigrid Cormier", "comment_text": "You can do I of 2 things. Contact the hotel and ask if they have a kettle you can borrow. If not an it’s important to you. Do to one Ofer discount cheap shops and buy a kettle. Bring it back with you, you’ll travel again and you can bring with you."}, {"username": "Vladimir Boskovic Serrudo", "comment_text": "Why would you drink that abomination when you can actually get decent coffee everywhere?"}, {"username": "David Horgen", "comment_text": "I am in Italy right now. We have stayed in the airbnbs the whole time. They either have moka pots or espresso machines. If you don't want to do that, there are little coffee shops everywhere. It's fun to just get dressed and go down to get coffee in the morning"}, {"username": "Melissa Cortez", "comment_text": "Coffee maker in 2/3 hotel we stayed in, yes for blow dryers, no iron, no conditioner at 2/3"}, {"username": "Joe Guzzi", "comment_text": "No."}, {"username": "Færøy Kristin", "comment_text": "Nespresso"}, {"username": "Bob Deahl", "comment_text": "Not really"}, {"username": "Rosa Zordan", "comment_text": "Yes"}, {"username": "Christopher Walsh", "comment_text": "Live one's or machines?"}, {"username": "Beverly Kerr", "comment_text": "Our hotels all had free coffee in the breakfast area."}, {"username": "Jen Marie", "comment_text": "Yes! But not near as good as getting coffee/\nespresso at a local shop! ☕️"}, {"username": "Pop Cha", "comment_text": "Come onnnnnnn"}, {"username": "Phyllis Snyder", "comment_text": "All my arbnb stays I made sure that a coffee maker was available- one important thing to know is to throughly wash inside of all hotel and bnbs room coffee makers- prior use could be questionable."}, {"username": "Claudia Ziegenbein-Harris", "comment_text": "No"}, {"username": "Costero Home", "comment_text": "Depends on the hotel, some do, some don't. Typically, you can ask for a kettle."}, {"username": "Ryan Monahan", "comment_text": "Not typical. But great cafes and even amazing espressos at gas stations. And cheap compared to North America."}, {"username": "Maria Y Alexieva", "comment_text": "Sometimes. Last time in Milan I had mine in the room. But it is not a must. Airbnbs usually have moka pots"}, {"username": "Colleen Dawson", "comment_text": "Some do, some don’t. Best to contact the hotel and ask."}, {"username": "Tony Chow", "comment_text": "Most hotels have a tea kettle to boil water and provide instant coffee paks and tea bags with sugar and creamers. It is even better to book the hotel with breakfast buffet."}, {"username": "Rhona OConnor", "comment_text": "Depends on the hotel....."}, {"username": "Arlene Fischer", "comment_text": "What about irons and blow dryers?"}, {"username": "Bill Shafer", "comment_text": "Go to a ￼Café and get a cappuccino. You can drink coffee in your hotel room any time.\nYou’re in Italy 😃\n￼"}, {"username": "Marie Cuzzi", "comment_text": "I’ve never had one in my room … go experience coffee in Italy go to a cafe !"}, {"username": "Sarit Rolnik", "comment_text": "You can send an email to the Hotel and ask 😊"}, {"username": "Brian Osman", "comment_text": "No, it was 50/50 in the hotels"}, {"username": "Lora de Vries", "comment_text": "Our hotels had coffee machines, plus a kettle, but these were 4* and 5* hotels. It would be best if you could ask your hotel for specific details. Never had bad coffee in Italy!!"}, {"username": "Don Bentivoglio", "comment_text": "Best bet would to be to ask the hotels you'll be staying at."}, {"username": "Lois Ann Layman", "comment_text": "You can drink a cappuccino up until 11 am. After that espresso only. If not they know you are a tourist. There is a coffee bar at every corner in Italy."}, {"username": "Lisa Pro", "comment_text": "Capp on every lock. I called room service for mine and got ready and another 3 on the streets. I was in my glory. After mid morning it’s expresso"}, {"username": "Brittany Armstrong", "comment_text": "Of our 4 hotels, we didn’t have one in any room. Had a kettle for tea in one. We just walked to a cafe in the morning to enjoy the day and start off with a cappuccino"}, {"username": "Gillian O'Callaghan", "comment_text": "If a coffee maker is a jug and a sachet of instant coffee.......ha\nppened twice out of 13 accommodations.\n....time to go out for coffee ☕️ 🇮🇹"}, {"username": "Debi Howe Altomare", "comment_text": "Our hotel in Rome, Starhotel Metropole had coffee maker & frig in it."}, {"username": "H Raymond Fasano", "comment_text": "I never saw a coffee maker in the room in Italy. Usually hotels provide coffee in the lobby or dining area in the morning."}, {"username": "Mark Arsenault", "comment_text": "When you book your room, you can see what is in the room you are booking."}, {"username": "Michaela Hlaváčková", "comment_text": "Why coffeemaker? I think that coffee in Italy Is the best coffee, you can drink it in all bar and Cafeteria. If it s too small for you ask for doppio or americano"}, {"username": "Bill Elias", "comment_text": "Nescafé."}, {"username": "Janet Bell", "comment_text": "I travel with these get some local coffee pour hot water. Most hotels have hot pots. Makes great coffee.\nhttps://\nwww.amazon.com/\nAttsky-Collapsib\nle-Dripper-Reus\nable-Silicone/\ndp/B09FHPRCDW/\nref=mp_s_a_1_30?\ncrid=HPPMKRDAOE\nX5&keywords=cof\nfee+pour+over+f\nilter&qid=16917\n93514&sprefix=c\noffee+pour%2Cap\ns%2C275&sr=8-30"}]}, {"id": "2211610725904672", "text": "I’ll be in Ischia in October can you tell me what the weather would be like at that time? Can you also recommend any great restaurants in Ischia? ￼", "link": "facebook.com/groups/1373361046396315/permalink/2211610725904672/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Weather is unpredictable as of late. October it's usually pretty"}]}, {"id": "2211695975896147", "text": "If I’m buying designer pieces ie LV do I have to declare at customs? After I go through the VAT process can I just use the purse?", "link": "facebook.com/groups/1373361046396315/permalink/2211695975896147/", "likes": 13, "comments": [{"username": "Shelly Stowell", "comment_text": "Yes you declare if it is over $700? I think. No you can't use it."}, {"username": "Janine Emma Lucas", "comment_text": "After VAT in airport, yes"}, {"username": "Michael Widjaja", "comment_text": "Yes,bought a Panerai in Florence and it went directly on my wrist"}, {"username": "Krystal Apolinaro", "comment_text": "They just asked if we had food, meat or cheese. I said no, they said ok goodbye. We were at Dullas at midnight so maybe that’s why, lol"}, {"username": "Debby Finn Martino", "comment_text": "After customs stamps VAT form in Italy you can wear it. In US you can bring back $800 of goods. Lately no one has asked me when returning to US"}, {"username": "Patricia Condon Goldberg", "comment_text": "There are no longer forms to fill out so use the purse"}, {"username": "Lee Rew", "comment_text": "I kept mine in the carryon and when back in the US and asked if we made any major purchases I said no. Fore warned my daughter not to say anything! Lol"}, {"username": "Danielle Encheff Blunt", "comment_text": "You will most likely need to show it at customs VAT in Italy. Our guy in Venice airport was asking to see purses and jewelry to get your tax refund. There is a VAT before checkin. On the US side they don’t seem to care unless it’s meats cheese or animals."}, {"username": "Sh Kaplan", "comment_text": "You can wear it after you go thru VAT in airport."}, {"username": "Risa Berlin Ziman", "comment_text": "Do not wear it before or when in at vat tax line at airport. Show it as new if you want vat tax refund."}, {"username": "Mari Falcone", "comment_text": "When we returned last month they don't even ask for those custom cards anymore. All they asked was about was food. We presented the card to the customs person and he said that it wasn't necessary."}, {"username": "Tracey Fairbrother", "comment_text": "You can't use or wear items if you are going to claim tax back"}, {"username": "Rhonda Allen", "comment_text": "In Houston, LAX, and Phoenix no customs declarations. They just ask about specific things like meat, cheese, alcohol and cigarettes."}, {"username": "Pia Reilley Loughin", "comment_text": "At Newark on Wednesday we were specifically asked if we purchased any handbags, shoes, wallets, jewelry."}, {"username": "Andrea Curry Brown", "comment_text": "So there you go. Lie or don’t lie. Sounds just about right. Hope you enjoyed your trip."}, {"username": "Colita Ellis Wittenkeller", "comment_text": "We had to declare a LV bag when arriving in SF from Paris. They seemed to know already because at first we said no and they asked specifically about the bag. Assume the VAT refund is all connected!"}, {"username": "Gina Winterstein", "comment_text": "If it’s tax free and you don’t claim it they will reverse the credit and charge you the tax. It’s very simple and took me less than 2 minutes. VAT is right inside the entrance of the airport."}, {"username": "Shari Hollander Baron", "comment_text": "Why would you not declare it and get VAT back? Am I missing something here?"}, {"username": "Eva Salas", "comment_text": "Just answer the question don’t start telling a story."}, {"username": "Lisa Alexander Blake", "comment_text": "We bought LV in Florence and went to the Global Blue office right after the purchase to fill out the VAT paperwork and get our refund. Now all we have to do at the airport is scan our passport at the airport at the VAT kiosk and we can be on our way. This can only be done if you are leaving within 10 days and directly from an Italian airport."}, {"username": "Charlene Noll", "comment_text": "If u use it, wear it or eat it u don’t have to claim it."}, {"username": "Sheraleigh Sapphire Pope", "comment_text": "I feel like tagging Larry David in some of these comments.\nI feel like he'd get a whole episode of absolute comedy gold out of them 👌🏾⭐️\n\nReminds me of one episode where he takes the micky out of a kid for not asking for homework \"Miss! Miss! You forgot to give us homework!\" 🤣\n\nJust live & let live ☺️💕\n\nHas really tickled me 😆 xXx"}, {"username": "Annette Mayer", "comment_text": "If you are going to wear it, wear it. But if you intend to get back the VAT tax, you need to claim it. You can't have it both ways"}, {"username": "Annette Mayer", "comment_text": "So you got back your VAT tax and didn't declare an item well over the duty free limit. And you are so proud of it, you put it up here? OK then!"}, {"username": "Kimberly Trutnau Zitek", "comment_text": "At the Rome Airport do you do the VAT before or after checking luggage? I would like to put my very large LV box in my checked luggage."}, {"username": "Mel Phan", "comment_text": "Whaaaat?! You have to declare regular things you buy? I thought it was just food and alcohol."}, {"username": "Alexandra A Welker", "comment_text": "Yes! And you can tell them it's for personal use. It's better safe than sorry."}, {"username": "Tatiana Dorf", "comment_text": "The VAT that we pay in hotels, can we get that refunded too? Or only major purchases?"}]}, {"id": "2211610729238005", "text": "Castel Sant'Angelo in Rome\nI have last minute decided on visiting this Castle Saturday morning as my son and hubby will be staying in the hotel room watching the Matilda’s play soccer 9am match (and hopefullyआणखी win).\nWhen I am in Rome I am not staying inside a hotel room on a beautiful day, and as much as the Italians love soccer and may understand, there are no castles in Australia!!\nCan I get tickets at the door, or do I need to pre purchase them.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2211610729238005/", "likes": 1217, "comments": [{"username": "Deb Porter", "comment_text": "Deb Porter"}, {"username": "Sigrid Cormier", "comment_text": "enjoy your visit and spectacular view.\nA lovely 20 minute walk from/to the Vatican. You will see all the embassies from various countries, by their country flags.\nCastel Sant d’Angelo Has a very interesting history. Take a few minutes to google it.\nHave a marvellous holiday."}, {"username": "Jennifer Lynn Davis", "comment_text": "Prebook is better to avoid the line but you can get them at the door. It's amazing!"}, {"username": "Mary Stinnett Boggs", "comment_text": "I want to visit it too! Surprised to not see it mentioned in Rick Steves travel book on Italy (2019 edition). He also doesnt mention Tivoli or Hadrians Villa there! I'm making my itinerary for April, both on my list!"}, {"username": "Elena Innocenti", "comment_text": "One hint: walking distance from Castel Sant’Angelo there is Piazza Cavour and “Palazzaccio” (local people call in this way this building), the Palace of Justice and home of the Supreme Court of Justice built in the beginning of XX century.\nThe palace is massive and well decorated and the small garden with palm tree in front of piazza cavour is nice.\nSomething less tourist to see."}, {"username": "Lynn Mcconnell", "comment_text": "Donna Spencer Jennifer McConnell Benge read the comments if you get the chance, we may have to at least walk on the bridge"}, {"username": "Eva McLean", "comment_text": "https://\nwww.castel-sant-\nangelo-ticket.c\nom/\n?gclid=Cj0KCQjwu\nNemBhCBARIsADp7\n4QSXhK-7BCdU_Tk\noNiBQFq_Mu9yxLn\no6Yo5UnDJilhoPN\nFd63-E57M8aAuA5\nEALw_wcB\n\nTheir website - if you want to pre- purchase tickets ….."}, {"username": "Maria Giordano", "comment_text": "Thank you for this. I’ve been to Rome 4x & have never heard of or visited this monument"}, {"username": "Melissa Ann", "comment_text": "One of our favorite spots!!!"}, {"username": "Connie Gibbs", "comment_text": "Yes you can buy tickets at the entry. Make sure you have an aperitivo for yourself at the bar while there. Great view from there. Go Matilda’s 🇦🇺"}, {"username": "Robert Linklater", "comment_text": "Vicki Linklater"}, {"username": "Gail Grande", "comment_text": "It’s beautiful inside, you’ll love it. We got tickets at the door"}, {"username": "Denise Bibby", "comment_text": "Teena Leuba"}, {"username": "Paulina Nowak", "comment_text": "We bought tickets in side without waiting. Had a great time here!"}, {"username": "Wilma Resta", "comment_text": "Have a wonderful time!"}, {"username": "Amanda Ross", "comment_text": "We were there in June and bought tickets at the door, the view at the top is amazing! Go Matilda’s 🇦🇺"}, {"username": "Nancy Kirby", "comment_text": "So worth visiting!"}, {"username": "Jerry Lyubelsky", "comment_text": "You can get tickets at the door. It’s a cool place and lots of great photo ops. Make sure to go to the roof"}, {"username": "Jay Duke", "comment_text": "Stangle Shepard Tracy Hedrick O'Brien Lorrie Hedrick Ackerman Marcella Parkhurst Laura Lucchesi would this be of any interest? I wanna see the view at the top and the bridge."}, {"username": "Eva Salas", "comment_text": "We purchased a tour and it was well worth it, knowledgeable guide"}, {"username": "Kim Geary Keidel", "comment_text": "We bought them at the door. We loved it!!"}, {"username": "Adele Mazoudier", "comment_text": "Well worth a visit, great little restaurant for a vino! (Go the Matildas!)"}, {"username": "Elle Beckman", "comment_text": "At the door easy peezy"}, {"username": "Martim Monteiro", "comment_text": "Hudge Build fortress and so on ..but it was the only place i Rome that to me doesn't worth the interior visit.A waist of time.🤷🙆🤦"}, {"username": "Nancy Flaherty", "comment_text": "This is Rome's perfect little secret! I Loved this Castel Sant'Angelo! This is a Must See sight when visiting Rome! I was there in November and none of the cafes were open but it did not matter - still worth the visit and the view from the top is indescribable!!\n! I want to go back!"}, {"username": "Craig Young", "comment_text": "In January this year whilst on holiday in Rome, I decided to get my daughter in a pram in an attempt to go and explore the Castel. It was to be a 15 min walk as we stayed close to Piazza Navona. Upon approach she noticed a play park in the Castel garden.. well there was no letting up and we spent a solid hour and half there outside. We never got to enter the Castel due to time constraint and im sure it must be awesome. One thing for sure, thats the best play park she has visited yet."}, {"username": "Kerry Aldred", "comment_text": "Beasy?"}, {"username": "Linda Tibbles", "comment_text": "Pre purchase ?"}, {"username": "Toula Vasileiou Evageliadou", "comment_text": "You can get tickets at the door . We did the same thing. Make a stop to have a Cappuccino in the lovely restaurant at the terrace with an amazing view. ♥️♥️♥️"}, {"username": "Helga Truter", "comment_text": "Special place. Buy tickets at door. Beautiful views from Rome at the top! My son met his exchange student buddy from Germany inside the Castle!"}, {"username": "Cinzia Berletti", "comment_text": "You can buy tickets 🎟 inside the castle"}, {"username": "Mike Ball", "comment_text": "We paid at the entrance, if you get there early you should get straight inside and it will be quiet , it’s definitely worth it for the views from the battlements."}, {"username": "Elena Innocenti", "comment_text": "You can take the ticket at the door or if you want avoid the queue (not big but sometime there is) buy before.\n\nit is not among the most visited monuments, but it is very particular. it has been used for so many different things over the years.\n\nand don't forget to walk the bridge in front of the castle. the most beautiful bridge in Rome."}, {"username": "Jacqueline Corry Cicione", "comment_text": "Got tickets at the door. This place was great. I loved all of the history and winding path up to the top. Where there is a little restaurant with an amazing view as well"}, {"username": "Paul Dyke", "comment_text": "We went beautiful castle, just got tickets on door. Had a little cafe at the top with some great views"}, {"username": "Beth Beattie", "comment_text": "Go Matildas! Brisbane, Australia. BTW really loving this travel group!"}, {"username": "Jennifer Grazian", "comment_text": "You can buy tickets ahead of time and not have to stand in line. The ticket is good for entry at any time the day you purchase it for."}, {"username": "Julie Norris", "comment_text": "Paid at the door at opening time, spent hours wandering up to the cafe at the top. One of my fave places in Rome 😀"}, {"username": "Stacey Miller", "comment_text": "You will LOVE it!"}, {"username": "Donna Harrison", "comment_text": "Free first Sunday every month!\nOr just purchase at gate but my advice is to go early as queues grow quickly 🤗"}, {"username": "Donna Harrison", "comment_text": "Donna Harrison"}, {"username": "John Calabrese", "comment_text": "I love this castle. To get the best of history take a tour. I was there in September."}, {"username": "Terri Sievers", "comment_text": "We bought them at the door in May!"}, {"username": "Luanne Carey", "comment_text": "They have great cappuccino at the top!"}, {"username": "Caterina Liquori-Culhane", "comment_text": "At the door"}, {"username": "Maurice Bastarache", "comment_text": "Maurice Bastarache"}, {"username": "Janis Nunez", "comment_text": "You can buy a ticket at the door."}, {"username": "Luisa Grant", "comment_text": "I bought tickets yesterday online, they let you in any time on the day. I thought once we finished the Vatican we just walk over there at our own leisure. We paid $47 AUD for 2 tickets"}, {"username": "David King", "comment_text": "I was shocked at how much I enjoyed touring inside of this massive mausoleum/\ncastle/papal palace.\n\nInside, there is a carved bust that is missing its nose, and therefore looks like Voldemort 😱 I hope you find it! As I recall it was near the outside courtyard area.\n\nHave fun!!"}, {"username": "Rebecca Gransden", "comment_text": "We were there 4 weeks ago and got there at 9am and walked straight in.\nGo Matilda’s 🇦🇺🇦🇺🇦🇺"}, {"username": "Karoline Bakker", "comment_text": "Go straight over the bridge into that small street and enjoy the happy hour in that little bar there ! (On the left side) after that walk to Piazza Navona and have some truffle icecream"}, {"username": "Jill Medrano Casey", "comment_text": "You can do either. Well worth the visit!"}, {"username": "Nicole Tucker", "comment_text": "We bought tickets at the door, hardly a crowd. Definitely a Do Not Miss site when you are in Roma!"}, {"username": "Terry Pisano", "comment_text": "Thanks for this post! I have planned for our walking tour to start here, but more just for the bridge. Now we'll have to go inside too!"}, {"username": "Jenny McDannell", "comment_text": "This was one of our favorite surprises of Rome! We got tickets at the door and loved eating at the top with the view."}]}, {"id": "2211634992568912", "text": "Ok I will be staying in Taormina in September and thinking about heading to alcantara gorge. Anyone been there where they can recommend the best trails or things to do there? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2211634992568912/", "likes": 1, "comments": []}, {"id": "2211634872568924", "text": "Hi All, we arrived in Mestre (outside of Venice) yesterday. Going to head across to Venice tomorrow. Can you tell me if a small travel pram would be ok or if the cobble stones and crowds will make it a nightmare? Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2211634872568924/", "likes": 0, "comments": [{"username": "Jen Mon", "comment_text": "The bridges in Venice are the hard part! Many bridges near the train station have ramps alongside the stairs that make it much easier. You can take the water transportation,\ninstead of walking but you might be required to fold up the pram to get on the boat 🛥️ in the crowds."}]}, {"id": "2211611182571293", "text": "I’m planning a trip next year to Sicily. Can anyone recommend areas to stay in see thank you ￼", "link": "facebook.com/groups/1373361046396315/permalink/2211611182571293/", "likes": 0, "comments": [{"username": "Elisabeth HA", "comment_text": "Do not miss Taormina"}, {"username": "Melanie Matthews Stuprich", "comment_text": "I know it’s a smaller island but that’s quite a wide range. Might help if you specify what you like to do when traveling, what are you interested in, what gets you excited? What time of year are you traveling? (Beaches? Shopping? History? Ruins? Museums? Downtown/small town walking around? Castles? Etc,) even though it’s smaller than a lot of places elsewhere, there is still a lot of varied things to see and do on this island."}, {"username": "Maria Grazia Rizza Costanzo", "comment_text": "Depends on the time of year you’re there. Look out for festivals held in small towns.\nIn my family Town in the province of Siracusa they have two amazing festas for their patron Saint in June and August. In the town of Bronte (Catania) they have the pistacchio festival in October I think. Happy to let you know more."}, {"username": "Karoline Seniowska", "comment_text": "Mondello 😍😍"}, {"username": "Dawn Etkin", "comment_text": "Taormina , Siracusa /Ortigia , Palermo !"}, {"username": "Ike Simoncini", "comment_text": "I placed a link to a thread where i gave someone a nice roundtrip plan"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211617882570623", "text": "For anyone going to Cinque Terre 8/11-9/30 the newly renovated Via dell'Amore trail has finally re-opened after 10+ years for a trial period. Tickets are 5 euros for a half hour tour of the first section andआणखी include entrance to the Riomaggiore castle. I think you can also go back at night if you purchased the ticket but website not totally clear. Heres the ticket link- lots of spots left!", "link": "facebook.com/groups/1373361046396315/permalink/2211617882570623/", "likes": 4, "comments": []}, {"id": "2211611272571284", "text": "Hi, I hope you can help, 3 people arriving in Genoa Sat Sept 23rd what is the best way to travel to Milan, on Saturday? Is there a central point in Milan we should aim to travel to?", "link": "facebook.com/groups/1373361046396315/permalink/2211611272571284/", "likes": 1, "comments": [{"username": "Colleen Dawson", "comment_text": "Milan Central is a good place if you travel by train which I would recommend."}, {"username": "Isabelle Truong", "comment_text": "Travel by train is very easy and quick from Genoa to Milan central"}, {"username": "Francesca Giovanelli", "comment_text": "Train trenitalia.it"}, {"username": "Kejdi Okej", "comment_text": "Train trenitalia .it"}]}, {"id": "2211628415902903", "text": "How /where do we pre-purchase ferry tickets from Sorrento to Poisitano?", "link": "facebook.com/groups/1373361046396315/permalink/2211628415902903/", "likes": 1, "comments": [{"username": "Paul Anderson", "comment_text": "We buy on line but it is easier at the port. The ships never fill up"}, {"username": "Cara Russell", "comment_text": "I am in Sorrento now. Download the app 'ferryhopper'. It's brilliant. Once you have purchased your tickets, you need to collect them from the kiosk at the port. We collected ours the day before we travelled to avoid the queues."}, {"username": "Suzanne Sanderson", "comment_text": "Office at port, we just called the day before as it can be busy"}, {"username": "Jeff Davis", "comment_text": "You can purchase online at Ferryhopper.com\n."}, {"username": "Neville Spargo", "comment_text": "We brought ours a few months in advance direct from Alilauro website , all work our very well"}, {"username": "Virginia Speedy", "comment_text": "We bought ours at the wee ticket kiosk down on the esplanade...by the beach."}]}, {"id": "2210616429337435", "text": "A few days in Florence...\n... breath officially taken!\n\nThe Duomo is just absolutely mind bogglingly beautiful, just incredible, the highlight of the trip for sure!\n\nUffizi Gallery needs a day dedicating to it really, it has a vast collection.\n\nBoboli Gardens is lovely, I'd recommend picnicking there (very family friendly spot☺️, lots of space for children to play)\n\nHead over to Babae to order a glass of delicious vino from one of the famous wine Windows 🍷\n\nIf you're a history/art buff (as I am) you'll be in your absolute element- every turn & every corner of the city is truly magnificent.\n\nI don't mind admiting I cried at parts as it was just more than I ever imagined it could be, it's been on my Italian bucket list for years and I had a little wobble on the plane over worrying if I'd built it up in my head too much and got worried I'd be disappointed but it was all amazing!\n\nI'd recommend pre-booking tickets for all the things you really want to see as we overheard that the tour of the dome was booked up for 10 days!\n\nLuckily we hadn't planned on doing that this trip, we were lucky and got some last minute tickets for the tower.\n\nI pre-booked Uffizi a week in advance and even then it was quite tight on time slots.\n\nThere's lots and lots to do that doesn't require tickets but be prepared for long queues and large crowds for the \"free\" attractions.\n\nAs with any tourist areas keep your belongings safe and gentlemen keep your hands in your front pockets on your phone/wallet and ladies wear a cross shoulder bag that does up securely ☺️\n\nOn a whole I felt extremely safe in Florence and there was a large police presence near all the main attractions.\n\nAs it was just me & my husband this trip I'm already planning another trip back with our little girls later this summer, it was just wonderful.\n\nEnjoy it all when you go ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2210616429337435/", "likes": 260, "comments": [{"username": "Julie Harris", "comment_text": "Can’t wait to see the art. I will be on a bus tour. We have a free day in Tuscany and I want to plan that day for visiting the Uffizi. God willing it will happen. Your pics are great!"}, {"username": "Mugette Matos-Barber", "comment_text": "Love this post because I also cried while in Florence. We had seen it at a distance but walking towards the majestic Duomo was so overwhelming that I couldn’t stop the tears! Then again I also cried a few days later when I visited the Colosseum in Rome 😅 I get emotional thinking about the history of the site and how it is still there. And a few years ago in France the bells where ringing as we approached Notre Dame (before the burning interior fire) and again tears behind sunglasses😉🥹. My inner child thought about Frodo yelling Sanctuary😅"}, {"username": "Kim Hudson", "comment_text": "I loved it all too. But my favorite was Basilica of Santa Croce. It was magnificent."}, {"username": "Linda Chase", "comment_text": "If you haven’t seen it, go to the Bargello museum next trip. Wonderful!"}, {"username": "Stacy Derouin", "comment_text": "Florence is one of my favorite places in the world. So magical. My husband had trouble convincing me to leave!"}, {"username": "Tammy Blackburn", "comment_text": "Amazing! 🤩 Don't feel badly about crying. I know for a fact I will likely sob bc I am also an art buff. I walked into an old cathedral in the US and immediately started crying 😅."}, {"username": "Stacey Miller", "comment_text": "Loved it there so much!"}, {"username": "Valerie Collanton", "comment_text": "Florence is truly a magical and magnificent place. I was lucky to spend my last year of undergraduate studying art history there. An experience that changed my life."}, {"username": "Cathy Tyndall Goodrich Drake", "comment_text": "Beautiful! We will be there in a month! Can’t wait to find the wine windows"}, {"username": "Angie Hoff-Hess", "comment_text": "Going next March to delete the heat and crowds. Staying a few days as my husband and I want to soak up the history. Coming from my sons home in Slovenia by train. Would love some recommendations\nbt big train station on Air BNBS"}, {"username": "Claudine Auclair", "comment_text": "Thank you for the great info."}, {"username": "Colleen Rodney", "comment_text": "I love the architecture, history and looking forward to seeing this soon. Also on a tour. When are you going Julie?"}, {"username": "Chris Bold", "comment_text": "Lindy Mitchell"}, {"username": "Hagar Mohsen", "comment_text": "It is the city of the art , fantastic"}, {"username": "Kylie Denny", "comment_text": "Can you recommend a place to stay in Florence please."}, {"username": "Cody Tucker", "comment_text": "Andrew Tucker"}, {"username": "Al Baudendistel", "comment_text": "The most amazing city in Italy 🇮🇹."}, {"username": "Paola Barbetti", "comment_text": "Boboli is a\nMonumental Garden…No picnic allowed in there 😵‍💫"}, {"username": "Sandy McCullum", "comment_text": "Russ McCullum"}, {"username": "Julie Payne", "comment_text": "F"}, {"username": "Marilyn Spector", "comment_text": "I’m surprised to see the lack of tourists. We were there in May and it was packed."}, {"username": "Jenny Ang", "comment_text": "Jenny Ang"}, {"username": "Julia Zimmerman Vulcan", "comment_text": "Anyone else willing to share their lodging recommendations\nfor Florence or Oltrarno?"}]}, {"id": "2211637182568693", "text": "Hi I'm hoping for some help from knowledgeable Italy travelers, we have a plan it's not set in stone and I'd love recommendations, sorry it's long winded but here goes flights are booked it's the in-between bit :)\ntraveling 6 adults 3 children( 2 of the 3 kids like history but one is a young for her age 11 year old )\n\nFly into Naples 22nd march\nNaples to availno\nAvalino 22nd-25th see family 26th day trip to Pompeii\n\nTravel pompei to Rome 26th\n\nRome 26th-29th\n27th coliseum on a night, Vatican museum, Trevi fountain,\n\nRome to Florence 29th\nThis is were I'm needing more help and ideas do we stay in one place now or keep traveling like original plan below and what things is there to do, to keep our youngest In The holiday spirit, personal opinions would be appreciated\n\nFlorence 29th-1st\ntour bus round Florence 30th\nPisa-1st day trip\n\nPisa to Verona 1st\n\nVerona 1st-6th\nVerona bus tour 2nd\nLake garda 3rd\nVenice 4th\nLast day with Enzo 5th\nfly home on 6th April Venice airport\n\nWe are a family that like to go go go, routine and planning, (you could probably put us all on the spectrum somewhere) would you recommend staying elsewere, staying somewhere longer/shorter etc", "link": "facebook.com/groups/1373361046396315/permalink/2211637182568693/", "likes": 0, "comments": []}, {"id": "2211638045901940", "text": "Which hotel is better to stay in Florence?\nVilla La Massa\nBrunelleschi Hotel – in Florence", "link": "facebook.com/groups/1373361046396315/permalink/2211638045901940/", "likes": 1, "comments": []}, {"id": "2211644745901270", "text": "I have a coliseum night tour booked for an hours time. I’ve just checked and I never reciver any tickets on my email but have payment information. Had this happened for anyone else ? 😅", "link": "facebook.com/groups/1373361046396315/permalink/2211644745901270/", "likes": 3, "comments": [{"username": "Karen Blackmore", "comment_text": "I'd get straight there and see if you can sort it out! My tickets were attached as a PDF to the email confirming the order."}, {"username": "Karen Blackmore", "comment_text": "And check your junk email. Email title \"etickets\""}, {"username": "Jaime Cleek", "comment_text": "It says on there if you didn’t get pdf to email an email"}, {"username": "Melissa Hunt", "comment_text": "Yep. I never got mine and I’ve sent them 2 emails and filled out their online form with no responses. Tell me what you had to do please!"}, {"username": "Abi Farmery", "comment_text": "Thanks everyone. For some reason I couldn’t find the email at all! I got there early and showed them the confirmation email for payment. I was passed around a few different people in security and the ticket office - a very intense interrogation 😅 But they decided to let me through, though I’m not sure they were pleased about it. Just FYI for anyone else in the same situation."}, {"username": "Natalie Carter", "comment_text": "What tour company did you use for the Coliseum Night Tour?"}, {"username": "Janet Canter", "comment_text": "Who did you book the tickets through?"}]}, {"id": "2211645402567871", "text": "Hi going to Italy with the whole family end of September. There are 13 of us 7 adults and 6 children and wondering if I should book all our train travel in advance from Milan to Venice, Venice to Florence , Florence to Rome, Rome to Naples . Want to do the fast train and not sure if they will be booked and if we do book in advance does it cost more than if you just bought the tickets at the train station ?\nThank You for any help\nKathy", "link": "facebook.com/groups/1373361046396315/permalink/2211645402567871/", "likes": 2, "comments": [{"username": "Steve Grossman", "comment_text": "Book today because the fast trains will be sold out"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Bea Kuckens", "comment_text": "To make sure you get that many people anywhere at the same time, book ASAP."}, {"username": "Colleen Jennings", "comment_text": "book now to ensure you can get seats close to each other."}, {"username": "Kathleen DiCesare", "comment_text": "Ok great to know thank you !"}, {"username": "Sandy Radican Shikaly", "comment_text": "Prices increase closer to day of travel"}, {"username": "Ibbu Mohd", "comment_text": "Book 'italo' trains, private with less to no strikes, book seats as well. Check their site for discount codes (current code AGOSTO)"}, {"username": "Jenny Payne", "comment_text": "I wouldn’t, it’s not a problem if u book at the station , I go every year and do that + if something goes wrong it is a problem as u have to go and sort it out🌻"}, {"username": "Rachael Richardson", "comment_text": "Cheaper to book early especially with that amount of people !"}, {"username": "Wade Bailey", "comment_text": "Jenny Payne Double the price for 13 ppl with trains busy they will be scattered throughout the train."}, {"username": "Maria O'Callaghan", "comment_text": "Look up “Seat 61” you will get all the train info on there."}]}, {"id": "2211651919233886", "text": "Hello,\nNeed some suggestions please, planning following cities, can you advise which area should I look at booking a hotel please? Somewhere in close reach to central with food option, we have two boys 14 & 12.\nRome\nFlorence\nVenice\nAmalfi coast\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2211651919233886/", "likes": 1, "comments": [{"username": "Bill Gillespie", "comment_text": "When?"}, {"username": "Marianna Ganci Farkas", "comment_text": "Following"}, {"username": "Rebecca Yeoh", "comment_text": "For Rome, stay in the Pantheon / Piazza Navona / Campo de’ Fiori areas. You can walk to everything and there are restaurants everywhere. It’s the best part of Rome, esp for first time visitors. For Florence stay near the Duomo, or between the main train station and Duomo. Very good area to access major sites."}]}, {"id": "2211665839232494", "text": "Hey all…flying to Milan and visiting Lake Como..is it best to stay in Milan first then Lake Como then back to Milan and home to NYC or the other way around??", "link": "facebook.com/groups/1373361046396315/permalink/2211665839232494/", "likes": 1, "comments": [{"username": "Glenn Todd Webb", "comment_text": "I go ahead and complete my travel to my destination on day one and end my stay near the airport."}, {"username": "Annette Brin", "comment_text": "no difference really - it only a 2 hr or less train ride from Malpensa to Varenna."}, {"username": "Francesca Giovanelli", "comment_text": "Lake Como is a quite big area, if you book an accommodation in Como city or Varenna is quite easy the travel from Milano, if your accommodation is around the lake check the transportation before. Can be stressful after a long flight"}]}, {"id": "2211672479231830", "text": "Will arrive in positano around 5pm in April …what time do the stores and restaurants close ?", "link": "facebook.com/groups/1373361046396315/permalink/2211672479231830/", "likes": 2, "comments": [{"username": "Tara Roed", "comment_text": "When we went in June everything was open late but not sure about April. It’s my understanding it’s not the same that time of year."}, {"username": "Kejdi Okej", "comment_text": "When we went in june evrything was open late but not sure about aprill . I t s my unferstanding i t s not the same that time. Of year"}, {"username": "Lorraine Marie Zalepa", "comment_text": "Restaurants never close 👌"}, {"username": "Linda Zacco McCafferty", "comment_text": "Where is the best place to buy leather purse & where they will be your initials on it for you?"}]}]