[{"id": "2201970423535369", "text": "Hello! Planning on traveling to Italy sometime end of August early stepember with my boyfriend. Any recommendations on where to go, what places we have to see and places to skip, restaurants and etc. would love to hear everyone’s recommendations! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201970423535369/", "likes": 1, "comments": [{"username": "Sheila D'Anna", "comment_text": "I’ve traveled Italy for the past 20 years- coming here from CO 15 times. My recommendations\nmay vary from others but here they are as far as cities— because you are coming in one of the hottest months make sure you go coastal for a part of your trip. I’ve done both coasts but not the furthest south, ￼which I hear Sicily is amazing!!! Off the beaten path but accessible via train- Sperlonga, Gaeta, Pescara and am currently in Lido di Jesolo near Venice. Venice should not be missed in my opinion. Rome is best enjoyed very early morning or hit sites late at night for some great pictures. Traveling south you should hit Pompeii. Amalfi. Sorrento and the islands Procida or Capri. Naples has my heart but many￼ don’t like its chaos. You will get the best seafood and pizza there (ricotta, mozzarella di buffala and salami). Just between Naples and Rome there are places to enjoy fresh cheese like never before on your way to Sperlonga."}, {"username": "Sheila D'Anna", "comment_text": "Bologna is really nice and the people are beyond friendly- huge college town there and Padua."}, {"username": "Sheila D'Anna", "comment_text": "M"}, {"username": "Sheila D'Anna", "comment_text": "Sheila D'Anna"}, {"username": "Sheila D'Anna", "comment_text": "Sheila D'Anna"}, {"username": "Rebecca Knox Housley", "comment_text": "I recommend Breakfast at the Vatican which you can book directly from their website. If you’re in to museums The Villa Borghese and Capitaline Museums are a must and I recommend you eat at Sorpasso which is a wonderful restaurant. Have a great time!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201971643535247", "text": "Will be staying in Florence for three days and Radda for three days. Our Florence itinerary is set. We would appreciate recommendations for the surrounding area of Radda. We already have scheduled a cooking class, but definitely want to do a wine tour. Any good wineries in Montepulciano? What shouldn’t we miss? Thanks in advance for your suggestions.", "link": "facebook.com/groups/1373361046396315/permalink/2201971643535247/", "likes": 0, "comments": []}, {"id": "2201979686867776", "text": "Any recommendations on which town and where to stay in Cinque Terre? Thank you all 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2201979686867776/", "likes": 0, "comments": []}, {"id": "2201990026866742", "text": "Any recommendation for a good restaurant with sea view in Amalfi and positno?", "link": "facebook.com/groups/1373361046396315/permalink/2201990026866742/", "likes": 0, "comments": [{"username": "Maria Milioto", "comment_text": "Da Ciccio cielo mare terra is delish and beautiful views!"}]}, {"id": "2201988193533592", "text": "I looked on the Rail Strike list and see that Trenitalia will be on strike the day we are to travel. It says the strike is in the Foggia region. Will this affect trains between Rome and Naples? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2201988193533592/", "likes": 0, "comments": []}, {"id": "2201991820199896", "text": "Travel agent has us staying at the Rome airport Hilton inn hotel the day before we head back home instead of Rome city center . Any thoughts about this hotel ?\nAlso , I would appreciate\nAny tips on how to find reliable transportation to and from the hotel to city center as we have all day free and I don’t want it wasted by the airport?\nIt’s for six people please.\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2201991820199896/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "The Leonardo Express runs from the airport to Roma termini every 15 mins"}, {"username": "Giulia Cardamone", "comment_text": "Your hotel or other accommodation would have transport services they use regularly. In my experience, if they're booked thru the accommodation provider, they're 100% reliable."}, {"username": "Giulia Cardamone", "comment_text": "By the way, I wouldn't be spending my last at an airport hotel. I'd be fully living my last night in one of the most glorious cities on the planet. It's a 25 minute cab trip."}, {"username": "Rick Lozano", "comment_text": "Depends on what time your flight is. If early, stay by the airport, either Hilton. We are staying at the Hilton Garden the night when we arrive. We arrive in Rome at 8 pm. We will stay at the Hilton and cab into the city the next day."}, {"username": "Pamela Heldenbrand", "comment_text": "The Hilton at Rome Airport is so convenient - you can walk on a covered walkway to the terminal in a few minutes. And, once you check in, you can take their shuttle back and forth into Rome for your final evening. I highly recommend it."}, {"username": "Jenny Payne", "comment_text": "Can you not cancel hotel out near airport? You normally can and if so stay the Roma termini🌻"}]}, {"id": "2201993823533029", "text": "I’m trying to plan a trip to Italy in May. I’ve never been before and plan to go for 10 days. Thinking of going to Rome for 4 days, Florence for 4, and Venice for 2.\n\nWhere do you recommend staying in each place? I heard there’s bid difference between low end and higher end hotels. Is this true?", "link": "facebook.com/groups/1373361046396315/permalink/2201993823533029/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "Check Booking.com.... The reviews are accurate, you can see all price ranges."}, {"username": "Gary W Anderson", "comment_text": "Good plan"}]}, {"id": "2201994186866326", "text": "Looking for recommendations for winery tours from Siena. Also, what is the best way to see the Tuscan countryside from Siena? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201994186866326/", "likes": 0, "comments": [{"username": "Charlotte Paul", "comment_text": "Rent a car!"}, {"username": "Alice Francesca", "comment_text": "Rent a car in Siena and drive South to the Val d'Orcia region (about 1 hr 1/2).\nStay at Chiostro di Pienza hotel (on booking dot com) and explore the nearby villages (Bagno Vignoni, Montalcino etc)"}]}, {"id": "2201995260199552", "text": "I'm looking for a 4 person x 2 night Airbnb recommendation for Rome in September. Close to Trevi, Vatican, Colloseum preferred. 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2201995260199552/", "likes": 0, "comments": []}, {"id": "2201995113532900", "text": "If you only had time to visit one of these villages which would you choose- Montepulciano or Orvieto?", "link": "facebook.com/groups/1373361046396315/permalink/2201995113532900/", "likes": 1, "comments": [{"username": "Desislava Plachkinova", "comment_text": "Orvieto 😊"}, {"username": "Kathy Tully Sexton", "comment_text": "We were just in both yesterday and the day before. Very different vibes. Montepluciano is hilly and is more spread out and is quieter in the evening when the day trippers leave. Orvieto had a more vibrant nightlife. Passed two bands playing last night. Today we went to the lake and are winding our way to the coast. I will say, the duomo is Orvieto is a sight to behold. The sunset and sunrise in Montepluciano are equally as breathtaking. Comes down to personal choice"}]}, {"id": "2201999753532436", "text": "The advice from this group has been so helpful so I’m back!\nWe are staying in Praiano for 10 days next year mid May. My husband is an experienced motorcycle (large touring bike) driver. Will it be too crowded during that time to safely rent and ride a Vespa? We have been planning on using the buses, but they seem to stop running early and we wouldआणखी have to take an expensive taxi back to our accommodations if we have dinner in another town. We have also considered a private driver 1-2 days, but also expensive. I’m trying to determine our budget and if we need a driver, to plan accordingly.\nThanks !", "link": "facebook.com/groups/1373361046396315/permalink/2201999753532436/", "likes": 0, "comments": []}, {"id": "2202001263532285", "text": "I definitely recommend this Airbnb experience. It is a Murano workshop class but in Venice. I did it for my daughters birthday (she turned 11) Fabio the instructor was so nice. He allowed her to be creative andआणखी free but also made sure she knew to be safe. He also worked with helping her learn the technique. Small group class and very individualized. I have attached some things she made during the class.\n\nhttps://abnb.me/uAYOyxrEOBb", "link": "facebook.com/groups/1373361046396315/permalink/2202001263532285/", "likes": 6, "comments": [{"username": "Maya Tsirulnik", "comment_text": "Tim Giardina let’s do it"}]}, {"id": "2202003916865353", "text": "Looking for recommendations\nfor a cooking class or similar experience in Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2202003916865353/", "likes": 0, "comments": []}, {"id": "2202004100198668", "text": "Has anyone done paragliding around Bologna? If so, who did you go with and was it worth it? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2202004100198668/", "likes": 0, "comments": []}, {"id": "2202008250198253", "text": "Will be in Rome from 12/19 to 12/29. Planning Rome & Florence. Any day trips to recommend either from Rome or Florence?\n\nThinking of doing Pompeii when in Rome, Venice when in Florence. Thank you so much for your advice.", "link": "facebook.com/groups/1373361046396315/permalink/2202008250198253/", "likes": 0, "comments": [{"username": "Bronwyn O", "comment_text": "Pompeii is amazing! I’ve also done Assisi as a day trip from Rome, and Cerveteri (had a car so also did Tarquina, but between the Etruscan necropolis, museum, and hiking, could have made Cerveteri a full day)."}]}, {"id": "2202010116864733", "text": "What is the consensus on renting a car in Italy - specifically to get around in Puglia?", "link": "facebook.com/groups/1373361046396315/permalink/2202010116864733/", "likes": 1, "comments": [{"username": "Evie Gee", "comment_text": "Car is the way to go in Puglia"}, {"username": "Laura DeCicco", "comment_text": "We rented a car in Calabria and drove to and dropped off after travelling Puglia. I wouldn’t do it another way, self driving is the way to go"}, {"username": "Shari Oliva Brand", "comment_text": "It honestly depends on our base point as to if it's needed. As well as the length of your stay."}, {"username": "Carole Tarlap", "comment_text": "Last year I rented a car at the Naples airport and drove to Lecce. Drove all through the heel and did a tour of Le ce. Than to Martina Franca for the next stay. Drove all over ❤️❤️ and did 2 tours. The last day drove to Bari and on to Rome to go home. Get an International Drivers license at AAA if your from the USA. AND full coverage on the car💥 HAVE FUN 🤷🤷"}, {"username": "Doug Burke", "comment_text": "For that part of Italy, there's really no other way to experience the countryside which was part of our trip. We rented a car and had no problems and at times we were out in the \"boonies\"."}, {"username": "Sally Warren", "comment_text": "Rented in Rome, returned at Bari airport.\nPuglia is best by car."}, {"username": "Karise Pagano", "comment_text": "Definitely rent a car. I’ve lived in Italy for years and rented often for hosting visiting Americans. My one recommendation is to pay for the full insurance because it’s less hassle and your time in country is limited so you won’t have time to fight the system if you have less coverage. Also, southern Italy has smaller streets and crazier driving, so there’s a greater likelihood the vehicle will get scratched. Lean into southern driving and enjoy the adventure!"}, {"username": "Doredi Beltrame", "comment_text": "Best decision we made. We saw so many things off the beaten path that we would have not if we didn’t have a car."}, {"username": "John Selvaggio", "comment_text": "I just rented a Tesla from hertz at Rome FCO airport. Cheapest way to go and you get a large American car and trunk space in the Model 3. No issue finding chargers. You can find them in a Supercharger map before you arrive. Drove throughout Tuscany for a week. Best way to go! Check Hertz website"}, {"username": "Deborah Coram", "comment_text": "100% get a car. Otherwise you can’t get to the less touristy places. Plus you travel at a time that suits you. Driving was easy, as was parking. There was nothing negative about driving other than knowing that fuel and hire and road tolls are pretty expensive. (But so is buying transport tickets for a family of four). Just budget accordingly."}]}, {"id": "2202016336864111", "text": "Best hotels in Rome with a balcony view of the Colesseum?", "link": "facebook.com/groups/1373361046396315/permalink/2202016336864111/", "likes": 10, "comments": [{"username": "Sherri Workman-Miller", "comment_text": "I would love some feed back on that question also."}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton Cavalieri Best Hotel Period"}, {"username": "Annette Leech", "comment_text": "Me too"}, {"username": "Jaime Wilson", "comment_text": "We are staying at Palazzo Manfredi next week for a view of the colosseum 🙂 also has the Aroma restaurant"}, {"username": "Colin Ribble", "comment_text": "Colosseum Corner… roof top view… only 4 units in the “hotel” super nice and great location!"}, {"username": "Andrew Mircovich", "comment_text": "Hotel Lancelot"}, {"username": "Donna Roth Colletti", "comment_text": "I stayed in the Manfredi ￼across the street from the Colosseum we actually had a beautiful view from our window but no balcony￼"}, {"username": "Tom Taylor", "comment_text": "We did Airbnb and got a great view"}, {"username": "Keith Al-Dijaili", "comment_text": "."}, {"username": "Roberto Calderon", "comment_text": "Tammy Harper"}, {"username": "Valentina Saltarelli", "comment_text": "Palazzo Manfredi"}, {"username": "Donna Saylor Simms", "comment_text": "🤠"}, {"username": "Debbie Potter", "comment_text": "Following"}, {"username": "Sophia Jade", "comment_text": "F"}]}, {"id": "2202025106863234", "text": "We plan on visiting Florence next October for 4 nights. What are the must sees?", "link": "facebook.com/groups/1373361046396315/permalink/2202025106863234/", "likes": 24, "comments": [{"username": "Toni Marie", "comment_text": "Leather stores, piazza michangelo"}, {"username": "Sherri Workman-Miller", "comment_text": "Has anyone done the Tuscany wine and food tour?"}, {"username": "Bob Plourde", "comment_text": "Next October as well, can't wait!"}, {"username": "Bill Casper", "comment_text": "Sienna day trip"}, {"username": "Raphael Joson", "comment_text": "Half day trip to Pisa and you can do a day trip to Cinqueterre too by train\nFlorence is one of our favorites\n\nEnjoy!!!"}, {"username": "Sara Anderson Boyer", "comment_text": "David!!"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Day bus tour to San German yeah, I know"}, {"username": "Sonya Rogers", "comment_text": "Four days isn't that long so I would stay local. Use the hop on hop off bus. There's a really short journey to Fiesole, just up the hill, that will blow your mind with the view over Florence. Go up to Piazzale Michelangelo for another great view. All the usual sites, the uffizi, Duomo, Campanale and Baptistry. The Boboli Gardens.\nThen all the Piazzas, so much to take in. If you like museums go see David at the Academia. The markets are great too. Eating out is so good, lots of places. If you want to get out for a day, Pisa is really easy and only an hour by train. Don't rush, take it all in. Sometimes squeezing lots in one visit is too much. Relax into your stay eat gelato, people watch and enjoy every moment. 🇮🇹"}, {"username": "Marc Chomel", "comment_text": "The Uffizi;"}, {"username": "Kristie Storie Winston", "comment_text": "We did 24 hours in Florence. We did a food and wine walking sunset tour which exposed us to wines from the Tuscany Region and gave us an overview of the history of the city, saw David at The Accademia, had dinner at Piazza Signoria, walked across the Ponte Vecchio bridge and sampled lots of pizza and gelato."}, {"username": "Nicole Leounes", "comment_text": "Following- October trip coming up! ❤️🇮🇹"}, {"username": "Trudy Gove Tronco", "comment_text": "Quad Tour ATV Adventure in Chianti - Happy in Tuscany\nWe booked it on Viator\nTotally worth the cost."}, {"username": "Raymond Mantovani", "comment_text": "Fiesole at sunset overlooking Florence"}, {"username": "Eileen Muro", "comment_text": "We took a day trip to Pisa....stayed for a few hours to walk and see the leaning tower. Then went to Viareggio and stayed at the beach fir for few hours"}, {"username": "Holly Monks", "comment_text": "If you’re fit do the e-bike tour. Goes for a few hours. You ride through main centre then up to two amazing views over the whole city, touring a duomo. We had Kevin as our tour guide. We’ve never had history explained and brought to life as well as he did!! Amazing! And he recommended the davinci exhibition as the best one in the world in Florence. Enjoy 😊"}, {"username": "Valda McMullen", "comment_text": "Duomo, wine windows, statue of David and the 3 fake David statues, famous sandwich shop, bridge of gold."}, {"username": "Doris Luksic", "comment_text": "Dinner at Zazas across from the centrale market"}, {"username": "Kim Kasparek Fetko", "comment_text": "Follow"}, {"username": "Dominique Tarplin", "comment_text": "The must sees:\n\n1. Ufizzi Gallery\n2. The David at museum Accademia\n3. Chianti Hills wine tour\n4. Ponte Vecchio\n5. The Duomo\n6. Leather market\n7. Sunset at Piazzale Michelangelo"}, {"username": "Leigh-Ann Ohren Jones", "comment_text": "We did a food tour one of the first days we were there. If was fun but also a good way to get a lay of the city."}, {"username": "Rebecca Smith", "comment_text": "F"}, {"username": "AL Lewis", "comment_text": "Grape Tours, we loved it we went on one in April 2023. Wine and cheese tour. We even shipped wine back. It was that good!🍇🍷"}, {"username": "Nicola Enright", "comment_text": "Still my favourite city"}, {"username": "Alix de Dreuille", "comment_text": "I have reserved a Brunelleschi Pass (which include the visite of the Dome, the Bell Tower, the Battistero, Santa Répara and the Museum of the Cathedral).\nhttps://\noperaduomofirenz\ne.skiperformanc\ne.com/en/\nstore#/en/buy\nIf you want to visit the Medici Chapel, you have to make a reservation."}, {"username": "Meg Johnson Ignacio", "comment_text": "Walk About Florence tour was awesome! Long day but amazing. The Best of Tuscany in One Day Trip from Florence - Pisa, Siena, San Gimignano plus lunch and wine tasting at a Chianti winery\n\nhttps://\nwww.walkaboutflo\nrence.com/\n\nGreat jewelry at the Gold corner. Gorgeous handbags made right above the store at Bottega Giotti (across from\nWestin Excelsior)."}, {"username": "Deanne Antle", "comment_text": "Has anyone done this one or been to this winery??\n\nhttps://\nwww.romeinlimo.c\nom/\nexclusive-shore-\nexcursions-from\n-port-of-livorn\no/\npasta-cooking-cl\nass-with-wine-t\nasting.htm"}, {"username": "Sandra Piacenza", "comment_text": "Thank you for sharing ❤️"}, {"username": "Michele Giroir", "comment_text": "Tuscany farmhouse stay"}, {"username": "Karen Busch", "comment_text": "I did lots. But two not mentioned much, was renting electrical bikes , ride outside of Florence, on a mapped route. Then went rafting down the river there in town, under all the great bridges. We were like the only ones. It was the best. I can’t believe others don’t do this. Both were great prices."}, {"username": "Susan Argall", "comment_text": "I did a wine tour at a castle in Tuscany."}, {"username": "Marcus Hiesler", "comment_text": "Be there in two weeks. So looking forward to it."}, {"username": "Dana Green", "comment_text": "Duomo, Uffizi, Accademia, Ponte Vecchio, Boboli Gardens"}, {"username": "Chiara Normanno", "comment_text": "Piazzale Michelangelo at sunset"}, {"username": "Gail Nelson", "comment_text": "The Rose Garden. For the views."}, {"username": "Marilyn Baron", "comment_text": "The Uffizi Gallery (Birth of Venus), The David, the Doumo, Baptistry Doors, Bell Tower (all in the same area), gelato at Vivoli’s, Ponte Vecchio, Piazza Signoria, to name a few."}, {"username": "Robert Suarez", "comment_text": "I’ll be there next October as well. Interested in the responses."}, {"username": "Nancy Kirby", "comment_text": "Uffizi, Santa Croce, ponte veccio and area around (piazza signoria), wander the piazzas and eat gelato, take riposas (siestas), on other side, see San Miniato and Boboli Gardens (pitti palace), go to central market and eat"}, {"username": "Jill Tingley", "comment_text": "David and leather stores"}, {"username": "John LaSalle", "comment_text": "Us as well 😎"}, {"username": "Alix de Dreuille", "comment_text": "Be there in 10 days. I am also interested by your recommendation."}, {"username": "Iman Nazaran", "comment_text": "Follow"}]}, {"id": "2202010246864720", "text": "Recommendations needed!\n\nBest local guides in Rome?\nWhere to stay in Rome in Monti area?\nBest restaurants (local preferred) Rome Monti area?\n\nBest way to get from Rome to Naples that isn’t the train?\nBest local guides for Pompeii?\nBest area to stay in Naples if all we plan to do is Ischia, Archaelogical museum/underground, Pompeii/Herculaneum?\n\nAlso, are we crazy for wanting to rent a Vespa to see the farther-out sites of Rome- Coppedè Quarter / Appian Way?", "link": "facebook.com/groups/1373361046396315/permalink/2202010246864720/", "likes": 0, "comments": []}, {"id": "2202010590198019", "text": "What is the best way to get from Marco Polo Airport, Venice to our hotel in St. Mark’s Square. Should we expect to walk a lot with our bags?", "link": "facebook.com/groups/1373361046396315/permalink/2202010590198019/", "likes": 1, "comments": [{"username": "Linda Boyle", "comment_text": "Shared water taxi book on Get your Guide is brilliant only way to travel into Venice"}, {"username": "Meredith Williams", "comment_text": "we took a private water taxi, was stunning!"}]}, {"id": "2202026920196386", "text": "Hi! Planning to go to Italy in March. Im planning a eurotrip and we might be coming from Prague.. which route should we go?\nPlaces we want to visit would be Venice, Pisa, Florence, Rome and Milan. Then we will be flying to Paris. Any tips?", "link": "facebook.com/groups/1373361046396315/permalink/2202026920196386/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Look for cheapest plane fares and plan accordingly. Start from the south and move up north or do the opposite. I would allot no more than one full day in Milan, it's not worth it compared to the other places you want to see. You can move around Italy with planes or with fast trains (recommended)"}, {"username": "Alice Francesca", "comment_text": "Pisa, just for a couple of hours.Stay in Lucca instead, or Siena"}, {"username": "Meghan Tan", "comment_text": "If you are coming from Prague, I suggest Prague, Vienna, Innsbruck, Verona, Venice, Florence, Rome. Each city is a 4 hour (or less) train ride to the next."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2202033310195747", "text": "Would it be better to spend more time in Venice or Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2202033310195747/", "likes": 21, "comments": [{"username": "Rachel Carson", "comment_text": "Definitely Florence!"}, {"username": "Lina Janssen", "comment_text": "Florance"}, {"username": "Jono Roland", "comment_text": "Two-three nights in Venice and 4-10 nights Florence/\nTuscany etc"}, {"username": "Michela Zanni", "comment_text": "Florence"}, {"username": "Anta Chassioti", "comment_text": "Florence"}, {"username": "Fan Chee Graetzer", "comment_text": "More to do in Florence!"}, {"username": "Haley Rose Conley", "comment_text": "Venice. And see all the islands. Florence is very city like. If you want to get away from cars and traffic, venice 100%"}, {"username": "Tina Giebelhausen", "comment_text": "Florence!"}, {"username": "Mona El Sawy", "comment_text": "Venice"}, {"username": "Mike Ara", "comment_text": "Florence"}, {"username": "Tiffany Bari", "comment_text": "Florence 100%"}, {"username": "Geraldine Conway", "comment_text": "Florence!"}, {"username": "Rebecca Ovadia", "comment_text": "Florence.....\nBut neither in the summer"}, {"username": "Maria Da Luz", "comment_text": "Definitely Venice!!"}, {"username": "Gloria Conlan", "comment_text": "Florence"}, {"username": "Karen Eagal", "comment_text": "Florence hands down"}, {"username": "Mar Yam", "comment_text": "Florence"}, {"username": "Alexandra A Welker", "comment_text": "Definitely Florence!"}, {"username": "Juliana Kovatch Smith", "comment_text": "Hello everyone, this is going to be our first time going to Italy and I have a number of places that people tell me about going and we’d like to see them all if we could but would you please comment on how feasible it is for all of these parts that I list Rome, Isle of Capri Sorrento Florence Tuscany Cinq terre..Venice lake Como we will have about 10 days to 14 days"}, {"username": "Lori Ann", "comment_text": "We spent three nights (2 full and 1 half day) in Venice with a half day exploring Murano/Burano. It felt like the right amount of time. We spent four nights in Florence and included a day trip to Tuscany and Sienna. This also felt like the right amount of time. Any less in either town would have been too few, and more would have been unnecessary. I thought it was perfect."}, {"username": "Rick Weingart", "comment_text": "Florence!"}, {"username": "Dana Talusani", "comment_text": "If you have any interest in art and history, I'd pick Florence, hands down."}, {"username": "Melissa Pearson Dingler", "comment_text": "Venice!!!"}, {"username": "Gerry Baf", "comment_text": "Florence for me more culture and you can do a day trip to Tuscany for a nice meal/ wine/views"}, {"username": "Ellen Berg Maravilla", "comment_text": "Florence"}, {"username": "Helen Pottle", "comment_text": "My second visit to Florence - 4 nights and I did different things to last time."}, {"username": "Phyllis Snyder", "comment_text": "I’d divide them evenly- both are fabulous!"}, {"username": "Margaret Saigling", "comment_text": "Florence"}, {"username": "Robin Miller", "comment_text": "Florence/\nTuscany"}, {"username": "Stephanie Lubin", "comment_text": "Florence"}, {"username": "Robert Wood", "comment_text": "Florence"}, {"username": "Debbie Potter", "comment_text": "Venice"}, {"username": "Racolta Sonia", "comment_text": "Both😅"}, {"username": "Cara Bergmann", "comment_text": "Florence,San Gimignano and Siena. Tuscany wine farm (the last three with Pisa comes as a day tour- it’s a long day but worth it)"}, {"username": "Shruti Shah", "comment_text": "Is 7 days good to drive from Venice to cortina and Bolzano and lake garda"}, {"username": "Diane Crawford", "comment_text": "Florence!"}, {"username": "Kari Leigh", "comment_text": "Florence was my fave city 😍"}, {"username": "Marc Rosenfeld", "comment_text": "I would do 4 days in Florence (doing a couple of day trips) and 3 days in Venice. Both are amazing and very different"}, {"username": "Donna Dougherty", "comment_text": "Florence!!!"}, {"username": "Donna Dougherty", "comment_text": "Just got back!! 10 days in Florence ( my daughter had a dance class). Three days in Venice. They was 2 days too long!!"}, {"username": "Frances Scannapieco", "comment_text": "Venice is my favorite"}, {"username": "Mike Raio", "comment_text": "Florence"}, {"username": "Mary Lou Gillen", "comment_text": "Florence!"}, {"username": "Natalie J DeRasmi Saeger", "comment_text": "Florence for sure."}, {"username": "Pao Magnoler", "comment_text": "Florence! You can explore Tuscany!"}, {"username": "Sarah Rogers Zakala", "comment_text": "I think it’s so personal you just need to look at what you want to do? The opinions here will vary depending on all of us. For example, Venice was #1 on my bucket list so I did 2nights 3 days and it was perfect and I did a day trip to Florence and that was perfect (I’m not big into museums) Florence was lovely but y ratio of time spent in each location was spot on. I just love meandering taking pictures, people watching and not being on a schedule with museum tour times etc. to each our own. You really can’t go wrong though if you find that you have more time in one vs the other they are both spectacular!!"}, {"username": "Patty Chimenti Quick", "comment_text": "Venice! My favorite city in Italy❤️🇮🇹❤️🇮🇹"}, {"username": "Daneen David Riley", "comment_text": "Florence!"}, {"username": "Stephen Rouse", "comment_text": "Florence!!!!"}, {"username": "Sandra Timi", "comment_text": "Venice"}, {"username": "Roland Trego", "comment_text": "What time of year? I ask because for me much of the pleasure of Venice is strolling and enjoying the canals and views. If you go in the winter, it can be bitter cold there. In Florence, there is plenty to do inside (though, of course, it is a pretty city as well). They both need a minimum of two full days and nights. And you can easily do two or three days of excursions from Florence, e.g., Siena, Lucca, San Gimignano. If you rent a car, you can really see a lot more."}, {"username": "Tracy Tirey", "comment_text": "Hands down- Firenze!"}, {"username": "Monica Wall Otto", "comment_text": "Florence definitely"}, {"username": "Robin Lee Simmons", "comment_text": "I would say Florence but they are both my top 2!!"}, {"username": "Kate Chi", "comment_text": "Firenze for sure"}, {"username": "Tracey Chadbourne Mooder", "comment_text": "Venice"}, {"username": "Yolanda Jackovics Langley", "comment_text": "So much to see on day trips around Florence! Venice is a 2 full day trip TOPS"}, {"username": "Daniela Parhar", "comment_text": "Florence, hands down!"}, {"username": "Sarah Hadjinian Kirakossian", "comment_text": "Florence"}, {"username": "Valda McMullen", "comment_text": "Florence - more to do lots of places to go to from - Pissa, Tuscany vineyards, Siena, San Giamano, Vinci, Cincaterra.\n3 days in Venice is enough"}, {"username": "Irene Del Rosario", "comment_text": "Florence"}, {"username": "Colleen Dee", "comment_text": "Absolutely loved Venice but I would have to say Florence (amazing in its own right) because there’s so many other locations you can easily go to on a day trip with Florence as your home base."}, {"username": "Louise Coertze", "comment_text": "Venice"}, {"username": "Katherine Fonicello", "comment_text": "Florence"}, {"username": "Marcia Kellogg", "comment_text": "Tough decision"}, {"username": "Rasha Za", "comment_text": "Florence smells like 💩💩 beautiful city but the smell was awful. I am really weirded out by ppl not mentioning the sewage smell that fills up the best part of Florence. I loved the art but the heat and the horrible smell made me happy to leave. (I was there a month ago)."}, {"username": "Kathy Brophy", "comment_text": "Florence"}, {"username": "Martin L. Epperly", "comment_text": "Florence of Claire’s then spent time in Pisa"}, {"username": "Gillian O'Callaghan", "comment_text": "Florence 👍"}, {"username": "Laurel Finlinson", "comment_text": "Florence"}, {"username": "Chantal Loir", "comment_text": "Both are beautifull!"}, {"username": "Victoria Moorhead Murrow", "comment_text": "Florence"}, {"username": "Carol Crawn", "comment_text": "Florence"}, {"username": "Brad Seid", "comment_text": "Florence"}, {"username": "Theresa Simon Wallace", "comment_text": "Florence!!"}, {"username": "Kerrie Hewitt", "comment_text": "Florence"}, {"username": "Sara Anderson Boyer", "comment_text": "I would definitely choose Florence."}, {"username": "Lisa DeLeo Ireland", "comment_text": "Florence"}, {"username": "Ken Vecchia", "comment_text": "Both very different and beautiful for us it was Venice. Florence if you want to shop. A gondola ride a must in Venice"}, {"username": "Keri Dawn", "comment_text": "Venice for sure"}, {"username": "Kimberly Fiori", "comment_text": "Bologna"}, {"username": "Lamiaa Bahaa", "comment_text": "Venezia.. and visit all the islands"}, {"username": "Maria V. Carroll", "comment_text": "Florence"}, {"username": "Delana LaHue", "comment_text": "Florence w day trips"}, {"username": "Jeane Rovillo", "comment_text": "Florence has"}, {"username": "Stacy Prestigiacomo", "comment_text": "Venice"}, {"username": "Cindy Sguazzin", "comment_text": "Venice for the visual beauty of the city itself, Florence for the historic ambiance, the world-renowned works of art (Florence is the birthplace of the Renaissance!). Do not choose! You must experience both!!!"}, {"username": "Marlene Bertino Randolph", "comment_text": "Florence."}, {"username": "Claudia Kosiol", "comment_text": "Venice 🤩"}, {"username": "Jerry Rice", "comment_text": "Florence"}, {"username": "Terri Estright", "comment_text": "Florence"}, {"username": "Marie Cole", "comment_text": "Both over Rome and Naples."}, {"username": "Kelly Riordan", "comment_text": "Florence."}, {"username": "Mary Gregory", "comment_text": "Venice ♥️"}, {"username": "Deborah Lancaster", "comment_text": "Florence! …close to Tuscany."}, {"username": "Jan Linke Rickmers", "comment_text": "Both!! Split your time. We did a 2 hour golf cart tour in Florence to get a feel for city and it’s really a short train ride away"}, {"username": "Rebecca A. Baer", "comment_text": "Florence"}, {"username": "Pong Ac Ai", "comment_text": "Same"}, {"username": "Awilda Martinez", "comment_text": "Florence"}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "I think Florence and you can plan many day trips."}, {"username": "Joyce E. Tieman", "comment_text": "Definitely Florence!"}, {"username": "Patricia Savage", "comment_text": "Florence"}, {"username": "Kenneth T Williams", "comment_text": "I prefer Florence"}, {"username": "Michael Galan", "comment_text": "Not a fair question....but\nFlorence for me"}, {"username": "Laura Uribe", "comment_text": "We just got back from both places this last October. We have been both places at least three times. Venice was very crowded and St Marks Square was totally packed. Cruise ships now stop there. Once ships leave, the town is all yours. Florence was so much better as far as attractions. We were there for five days and never got bored. The flea market area was so much fun. Shopping, food everywhere. Both places are awesome. Good luck."}, {"username": "Rosanna Hardeman", "comment_text": "I spent 3 weeks in Venice and have been to Florence twice. Both are amazing."}, {"username": "Gena Diaco Penland", "comment_text": "Florence! I’d go back in a minute!"}, {"username": "Kathy Damaren Ingram", "comment_text": "Without a doubt, Florence."}, {"username": "Andy Hunn", "comment_text": "That's like asking 'would you prefer to lose an arm or a leg'. Impossible."}, {"username": "Dallas Leigh", "comment_text": "Florence if you’re into Art. If you’re not, Venice all the way."}, {"username": "Bunny Westfall", "comment_text": "Florence"}, {"username": "Nancy Kirby", "comment_text": "Florence"}, {"username": "Susan Templeton Banker", "comment_text": "Florence definitely"}, {"username": "Chenise Ryan", "comment_text": "I loved both equally, but Venice stuck with me. ❤️"}, {"username": "Kim Hunter Groop", "comment_text": "I spent a day in Florence and a couple of days in Venice several years ago. I am planning a trip to Florence later this year, so excited to explore this beautiful city for a longer visit. I don’t plan to go back to Venice, didn’t feel the magic that many do."}, {"username": "Suryakant Desai", "comment_text": "Florence"}, {"username": "Marilene Sagaz Lanza", "comment_text": "Florence"}, {"username": "Sea Shore", "comment_text": "Florence 100%"}, {"username": "Lynn Francisco Casella", "comment_text": "Both"}, {"username": "Ryan Mills", "comment_text": "Florence, Italy"}]}, {"id": "2202036640195414", "text": "Flying from OZ. Whats the best option for duty free. Buy in OZ or at stopover in Dubai or on arrival in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2202036640195414/", "likes": 0, "comments": [{"username": "Edmond Nolan", "comment_text": "Dubai"}]}, {"id": "2202041766861568", "text": "Leaving from Venice and want to drive and stay somewhere to view the dolomites. Then onto lake Garda onto cinque Terre as we make our way down. Looking for accommodation recommendations $200 a night rough budget", "link": "facebook.com/groups/1373361046396315/permalink/2202041766861568/", "likes": 1, "comments": [{"username": "Michael Rudder", "comment_text": "Anyone?"}]}, {"id": "2202055023526909", "text": "Any suggestions where to stay in Alberobello?", "link": "facebook.com/groups/1373361046396315/permalink/2202055023526909/", "likes": 0, "comments": []}, {"id": "2202057546859990", "text": "Heading to Milan in early September and looking for a clean, affordable apartment with kitchen for 2 people in a safe, convenient location near the metro etc. Can anyone recommend a place they have stayed at and enjoyed? The hotels all look expensive for a 10-day stay.", "link": "facebook.com/groups/1373361046396315/permalink/2202057546859990/", "likes": 0, "comments": [{"username": "Meghan Tan", "comment_text": "All the really good properties on AirBnb are probably already booked for early September. At this stage in the game, you are not going to find everything that is on your list."}]}, {"id": "2202060980192980", "text": "This is where I purchased our tickets in Rome. I purchased online before I left home.", "link": "facebook.com/groups/1373361046396315/permalink/2202060980192980/", "likes": 0, "comments": []}, {"id": "2202062340192844", "text": "Hello, I was wondering if there are any long table(outside in street) meals during Feb throughout Italy if so where would I look for them? We have them in Aus so thought I would see. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2202062340192844/", "likes": 2, "comments": [{"username": "Deborah Larsen", "comment_text": "I’m this part of Tuscany it is full on winter. So no events like that due to weather."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "In Feb in Italy is winter, and with Jan it’s probably the coldest month. I don’t know why somebody would eat outside."}, {"username": "Silvia Urbinelli", "comment_text": "No. Not in winter ."}, {"username": "Peach Panfili", "comment_text": "February is freezing."}, {"username": "Fetchin Gretchen", "comment_text": "Caveat is that covid may have upset the availability of these celebrations so check beforehand!\nThere are long table meals (called **tavole imbandite**) in Italy during February. They are often held in small villages or towns, and are a great way to experience local culture and cuisine.\n\nHere are a few places where you can find tavola imbandite in Italy in February:\n\n* **Tuscany:** The town of **Montepulciano\n** in Tuscany is known for its tavola imbandite, which are held in the Piazza Grande on the first Sunday of February.\n\n* **Abruzzo:** The town of **Sulmona** in Abruzzo is another popular spot for tavola imbandite, which are held in the Piazza del Popolo on the second Sunday of February.\n\n* **Campania:** The town of **Ischia** in Campania is known for its tavola imbandite, which are held in the Piazza dei Pini on the third Sunday of February.\n\nTo find tavola imbandite in other parts of Italy, you can search online or ask at your local tourist office.\n\nThe weather in Italy in February can be unpredictable, so it's a good idea to dress in layers. The average temperature in February is around 50 degrees Fahrenheit (10 degrees Celsius), but it can be colder in the north and warmer in the south.\n\nI hope this helps!"}]}, {"id": "2202063243526087", "text": "Hi there visiting Italy in early September .. just trying to work out how to get to Praiano from Rome …. Drive myself ? Train ? Bus ? Was thinking maybe train to Naples then a private car ? Any recommendations on private car or should I just hire one from Rome thank you", "link": "facebook.com/groups/1373361046396315/permalink/2202063243526087/", "likes": 0, "comments": []}, {"id": "2202067860192292", "text": "Planning on going to Italy next spring but where can I find a schedule for the strikes for the trains? Much appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2202067860192292/", "likes": 0, "comments": [{"username": "Stefano Bressanelli", "comment_text": "Just tipe scioperi.mit.go\nverno.it\nYou can find all National strikes"}, {"username": "Cat Furness", "comment_text": "Get the Trenìt! App it shows the upcoming strikes"}, {"username": "Jenn Messina Babore", "comment_text": "Avoid Fridays that’s the usual day they strike."}]}, {"id": "2202070393525372", "text": "Anyone have experience travelling from Tuscany to Tropea?\nPlease share any advice! TIA", "link": "facebook.com/groups/1373361046396315/permalink/2202070393525372/", "likes": 0, "comments": []}, {"id": "2202070720192006", "text": "I hope u get my humor! Ughhh trying to make my itinerary and the Vatican is not on our list! We are Catholic and my husband is gonna guilt me! He says u can't go to Italy and not go to the Vatican! This will be our first time to Italy but I don't plan on this being our only trip to Italy. This is a shorter trip and was planning on doing the Vatican when I go for 10+ days! Now I guess we gotta go or I'm gonna be sleeping with one eye open bc I'm a sinner! Lol🤣", "link": "facebook.com/groups/1373361046396315/permalink/2202070720192006/", "likes": 29, "comments": [{"username": "Michele Vitale Drews", "comment_text": "I don’t want to either! (Also raised Catholic) but found a way around -7:30 Vatican/8:45 Sistine Chapel and done!! Zero want for over a 3 hour tour -not when my time is limited! Too much I want to do and see!!"}, {"username": "Tracy Etzkorn Olivas", "comment_text": "I would just do St. Peter's Basilica and skip the Vatican museum. We were fortunate to have a priest say mass for us in one of the chapels inside the Basilica. Once in a lifetime experience. We also did the Vatican museum. It was lovely seeing all the art, but I would definitely choose the Basilica over the museum if I had to pick one."}, {"username": "Eva Salas", "comment_text": "Lol. When we went to Spain my husband said no churches - were both cat lick. Guess what we went to two: Montserrat and familia Sagrada. Who knew?\nBtw don’t do the lunch tour at the Vatican- the food is cafeteria food."}, {"username": "JoLynn Waters", "comment_text": "The Vatican and St. Peters is amazing"}, {"username": "Sylvie Hogg Murphy", "comment_text": "If your time is limited I’d skip it! Doing the Sistine Chapel and Vatican Museums (they are the same ticket / contiguous sites) is a big time-eater, and you’re indoors, dealing with crowds, most of the time. But you can also just do St Peter’s Basilica, which is incredible every time, and I’m not Catholic! It’s free to enter and it’s open daily 7am-7pm, so it’s relatively easy to squeeze in."}, {"username": "Angela Genduso", "comment_text": "Next year may never come. Suck it up. It's a must"}, {"username": "Susan Griffith Powell", "comment_text": "We go every time we are in Rome!"}, {"username": "Dennis Jones", "comment_text": "The Vatican was incredible…not to be missed! …and I’m not Catholic! 😁"}, {"username": "Patti Porter", "comment_text": "I didn’t tour the Vatican, but lucked out that when went to that area I got to attend an outdoor mass and I was surprised how excited I was to see the Pope ….I’m not a catholic"}, {"username": "Felicia LoCascio Whitney", "comment_text": "That's hilarious 😂no worries. God will continue to watch over you regardless!"}, {"username": "Connie Dennis", "comment_text": "You don't have to be Catholic to see the Vatican! I'm so looking forward to seeing it...it's the only thing in Rome that I'm really interested in seeing as a tour"}, {"username": "Jim Kelleher", "comment_text": "Super smart. If you plan on going more than once (as everyone who can, should) them there is absolutely no need to hit the Vatican on trip #1. There are thousands of beautiful churches in Italy, including 900 (no joke) in Rome alone."}, {"username": "Darlene Reed", "comment_text": "Be sure to take a lot of water to drink! I found the Vatican very crowded and was so thirsty (all on me for not being prepared)."}, {"username": "Julie Espinoza", "comment_text": "omg🤣🤣🤣 If you’re not able to fit the Vatican visit tour in to your schedule go to the other beautiful churches in Rome. There’s so much history, every where you go."}, {"username": "Marjie De Villa Lorica", "comment_text": "We were in Rome last October for 3.5 days (pre- a Med cruise). We went to St Peter’s Basilica about 7:45 am— and it was so grand for me— being a Catholic. People were already in line- but moved fast.\nWe saw the “Pieta” by Michelangelo, heard mass in one of the chapels, viewed the dome and the amazing artworks- and by about 10:30/ 11:00 am we were on our way out— just as the throng of people were coming in.\n\nThen we went to Castel d Angelo for a sight- see, and onward to Trasvetere for the afternoon.\n\nIt is doable even with limited time😍"}, {"username": "Michela Zanni", "comment_text": "I think that Vatican (Museum) and Saint Peter must be seen not because you are catholic but because they are the History"}, {"username": "Annelie Herrera", "comment_text": "Only go if you can do a tour. This Catholic regrets not doing a tour. Been twice and couldn’t get into St. Peter’s Basilica. The lines were insanely long! I did get to see the Sistine Chapel. Beautiful!"}, {"username": "Lucrezia Folger", "comment_text": "I went to the Vatican after 5 trips to Italy. It's not going anywhere."}, {"username": "Matthew Gramitt", "comment_text": "On the one hand, we’ve been to Italy 4 times and haven’t yet been to the Vatican (or Rome!). Then again, I was raised Protestant and my wife, who was raised Catholic, hasn’t practiced since she was confirmed as a teen. So..definitely not a priority.\n\nWhen we do finally go to Rome, only if we have more than 2-3 days there will we probably also go to the Vatican. We see churches and such in all kinds of cities and towns in Italy and mostly enjoy spending a bit of time checking them out. It’s a real part of the past!\n\nBut on the other hand, it’s not just your vacation but also your husband’s. It sounds like that is the most important place for him to visit. And you’ll be right there. Maybe on a future trip to Italy you won’t be so close.\n\nYou both deserve to do some of what you each want to do, even if the other person isn’t so much into it. Do you not have kids?! Haha! Because when you do, this way of thinking gets fully normalized!"}, {"username": "Jaime Cleek", "comment_text": "Show him all the pictures of the sardines lol"}, {"username": "Marlene Bertino Randolph", "comment_text": "Honestly it’s quite amazing and St Peter’s is the stunning. I highly recommend and you can do a tour that will hit the highlights."}, {"username": "Maleha Khan", "comment_text": "I actually really appreciated the preservation of art and history in the Vatican museums. I’m not religious but it was really cool to see. Try to get into the Vatican on the early tours. It gets very crowded"}, {"username": "Desiree Bello", "comment_text": "The Vatican is a work of art.I cried because of the emotion and beauty."}, {"username": "Joyce Parisi Hall", "comment_text": "Definitely go.And then go again.You won't be disappointed."}, {"username": "Jun Cee", "comment_text": "He who pays for the trip gets to make the call and is also responsible for planning the itinerary. if it does not include the Vatican, I believe there is a catholic church nearby you right now where you can attend to pray for forgiveness."}, {"username": "Jean Zirbel", "comment_text": "Life is short, go to The Vatican. You never know what life will throw at you. My husband had cancer and at the tail end of his treatment I had diagnosed with cancer as well. 😲 Just go and make your husband happy!💞"}, {"username": "Sarah Döhl", "comment_text": "I would at least vistit st. Peter. I was very impressed and I am not even catholic. It is definitly a highlight and not a waste of time."}, {"username": "Tracey Paolacci", "comment_text": "I mean it is breath taking though. Religious or not"}, {"username": "Karen Kerr", "comment_text": "My husband is not religious at all and I am Catholic. We went to Rome for my 40th birthday and visited the Vatican. I personally felt like I was back at school....my husband he loved it. The history and the museum was very interesting to him. My mother didn't believe me when I told her he liked ot more than I did. Go to the Vatican you'll maybe enjoy it as much as my atheist husband did"}, {"username": "Jane Anderson", "comment_text": "St. Peter’s offers early confession at 7:30 am, maybe you can suggest to your husband this especially authentic experience, that can be just for him! No tickets, I don’t think?"}, {"username": "Tsveta Docheva", "comment_text": "You should go"}, {"username": "Veronica Teixeira Borrageiro", "comment_text": "A must see, The Vatican, and lots of beautiful souvenirs for us Catholics 🙏🏻"}, {"username": "Laura DeCicco", "comment_text": "Nope, we had no interest in the Vatican. My time is MY time and I won’t waste it doing something I don’t want to do"}, {"username": "Sandra Zamora Guerrero", "comment_text": "I went to the Vatican in June. It was so crowded and it was impressive. St Pete’s Basilia was beautiful but super crowded. I’m Catholic and I got it off my “need to see list” but I will tell you what, I cried, literally cried tears of awe and felt the spirit in Assisi. That was truly where I felt the Holy Spirit."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "It’s not so much about religion…. It’s the art that’s amazing. Catholic or not , it’s a must see… history is history ."}, {"username": "Lisa Martinson", "comment_text": "The Vatican is beautiful & you can do the main areas in 1/2 day. Get a guide to move you through promptly."}, {"username": "Martha Tuzson Stockton", "comment_text": "Just go to the basilica. Free. An hour or two. Check!"}, {"username": "Amalia Cristina", "comment_text": "It’s not even about being catholic, it’s about seeing a very important historical area. Don’t you go to Rome anyway? it’s basically in Rome…"}, {"username": "Maria Al", "comment_text": "Go."}, {"username": "David King", "comment_text": "It’s a great place to visit. I’m not Catholic, but I strongly recommend it. Plan for a day of it if you can. My tip is to avoid the entry lines at St. Peter’s.\n\nWe have toured St. Peter more than a few times, but it is a crowd pleaser and it is CROWDED.\n\nSO… our best tour was done in the scavi tour under the basilica, to see Peter’s tomb and the necropolis. It’s fascinating down there!! And best of all, of you buy tickets online, you just walk up to the office on the left side of the Square for your scheduled tour time; once your scavi tour is concluded, you’re released into the lower level crypt of St. Peter’s and you get to tour the basilica without having had to wait in the massive line outside!!"}, {"username": "Steve Grossman", "comment_text": "There's no question that the vatican is the premier thing to see in italy. Whether you are a catholic or not, you will want to go There more than once. Whenever you do go, make sure to get no waiting line tickets. You can order them on the internet from your home before you leave for italy.\nOtherwise it is possible to stand online for 3 hours in the hot sun."}, {"username": "Charleen Siegler Schuss", "comment_text": "You don't need to see the Vatican Museum this trip but don't miss St Peter's Basciilca."}, {"username": "Wendy Spano Bracco", "comment_text": "I don’t really want to go but we are going. I’m not into museums and all of that but I feel it’s important. I don’t think Rome will be on my list again. I have other places in Italy I much prefer to spend time. So it’s a once and done."}, {"username": "Leila Jane", "comment_text": "Here's the thing to consider since you say you plan to go back to Italy again in the future ~ the Vatican is PACKED in the summer months. I have been there in the summer when it was so extremely crowded, it was like moving through it with such a horde of people, you could NOT pause to take a picture or pause to look at something with quiet appreciation. I have also been there in October and November when the crowds were BY FAR LESS and you COULD stop for pictures and look around with appreciation. I would recommend NOT going in the summer and saving it for a less crowded season in the future."}, {"username": "Pam Kimak", "comment_text": "I recently went with my daughter and my two grandsons 20 and 23. Although I'm not sure if they would have done the tour if I hadn't booked it, they kept an open mind and we all enjoyed it. Our guide was wonderful and realistic.I'm a practicing Catholic, and they have all received their Sacraments when they were young.It's amazing to see..art work is a must to see."}, {"username": "Marilyce Arbelo", "comment_text": "If you’re going to be in Rome anyway at any point during your trip, they do have early access VIP tours and that way it wouldn’t take up much of your day. They start them around 7:30 and you can beat the rush, but still get the experience! That’s what we did and we saw St.Peter’s Basilica, Sistine Chapel, and the Vatican museum (all before 10a!). We’re not into art / architecture / and are not catholic, but actually had a fabulous experience. Better than expected."}, {"username": "Valerie Barbeau", "comment_text": "How can you not go??!!"}, {"username": "Gabriella Villasenor", "comment_text": "Recommend doing a tour which will take you to highlights- We did an early morning tour\nwe were out by 1 - it was beautiful had so much art and sculptures -Sistine chapel too- have rest of the day to do other things"}, {"username": "Sue Sherwood", "comment_text": "We skipped the Vatican but went to Cornaro Chapel of the church of Santa Maria della Vittoria in Rome. This is where Bernini's sculpture Saint Teresa in Ecstasy is located. Just happened to catch mass at the same time. It was a great experience."}, {"username": "Diane L. Martin", "comment_text": "Same here with hubby insisting on going. He is catholic and a must see. I am into art and architecture so no complaints here but since we are only in Rome 2 days post cruise I probably would have skipped it this time."}, {"username": "Amanda Pollitt", "comment_text": "Everyone has their own opinion, it was nice to walk round the Vatican City and St Peter’s square and Basillica but I wouldn’t do the museum again , Cistine Chapel etc . It is too busy , just one long moving queue, you aren’t allowed to stop . The Cistine chapel at the very end is very overcrowded."}, {"username": "Renee Rundle Stoneham", "comment_text": "Compromise with him. Save the Vatican museums for another visit and see just St Peters Basilica.\n(I’ve done Vatican but we didn’t get in St Peters, line was looong and it was raining )\nFor me I couldn’t go to Rome and not see the Sistine Chapel.\n\nAlso, go into Basilica di Santa Maria Maggiore, it’s absolutely beautiful!"}, {"username": "Katie White-Meade", "comment_text": "Do what you want to do!! Not what someone else wants to do…\nSo many places I am not going just because it’s a tourist hotspot. Make it count. Buy the shoes, Eat the Cake, life is short, do what makes you happy."}, {"username": "Paula Bennett", "comment_text": "Go now and scratch it off. When you come back you have more free time!!"}, {"username": "Helen Lott Wanke", "comment_text": "Rome is art & architecture and the Vatican holds some of the most beautiful pieces in the world. I would not skip it."}, {"username": "Emily LeaTh", "comment_text": "We were in Italy for 2 weeks and did go to the Vatican. We did a tour. It was insanely crowded. Like I thought the Uffizi was crowded and Venice streets were crowded, but the Vatican was next level. I didn’t hate it, but it was so stressful and I’ll never do it again. There are so many churches and cathedrals to get a heavy amount of Catholicism without the Vatican IMHO. I did see someone suggest the more private tours in another comment and if I had it to do over again, I’d do that. On the plus side, my 15 year old son loved it and especially the Sistine Chapel and underground crypts in St. Peter’s."}, {"username": "Kim Geary Keidel", "comment_text": "If you are already in Rome, definitely go. We loved it. My husband is Catholic so it was a must do for him."}, {"username": "Debbie Morton", "comment_text": "Your husband is right. You would regret not going."}, {"username": "Chris Aman Florian", "comment_text": "I was happy just going to the outside. Didn’t want to spend time waiting and the crowds.\n\nThere are two gorgeous churches on the south part of Piazza del Poppolo, one is Santa Maria Maggiori. It’s right across from the other one. The street is called Via del Corso. Worth going into and it was free!"}, {"username": "Roland Trego", "comment_text": "I never had any particular desire to see the Vatican, but I assure you, it wows. I've been three times now on small-group tours. The artwork and opulence are something to behold."}, {"username": "Denise Bellagamba", "comment_text": "Why don't you propose a 2nd trip next year and focus on the Vatican you could easily do a week there"}, {"username": "Jenny Payne", "comment_text": "Sorr your husband is right , u need to make time and go🌻"}, {"username": "Maria Vega", "comment_text": "I just think you should go because tomorrow isn't promised. God forbid something were to happen and you don't get that second trip. My husband i are going in September and I have alot planned for a month. Im thinking of it as a once in a life time trip. But if next year we are healthy and everything is good maybe we will go back. Just a thought."}, {"username": "Rhona OConnor", "comment_text": "There are so many amazing churches you could visit that would not have massive crowds....... Offer him that option!"}, {"username": "Anna Gambino", "comment_text": "I’m going to Rome in October and in April next year. Planning to do Vatican twice only because I’ll be with different people each time. Honestly, even growing up Catholic and now more evangelical, I could probably skip it if it weren’t for the art."}, {"username": "Paul Vincent", "comment_text": "Just keep repeating Luke 15.7 to him....."}, {"username": "Sally Warren", "comment_text": "Art. Go for the art.\nThat said, in my visits to Rome I’ve never been to the Vatican.\nI’ve seen Pope JPII do a New Year mass and address at St Peter’s by accident.\nThere is plenty of ancient Roman stuff to see. In Florence, more important art than you can poke a stick at.\nAssisi has better religious art imo."}, {"username": "Chiara Normanno", "comment_text": "I think you can make time to pay a short visit to Saint Peter, even from the outside, at night..."}, {"username": "Amy Kaye", "comment_text": "There are so many churches to see and even go in and pray. The Vatican was not even on my list bc too many people, and I have mobility issues. My doctor in the states said skip Rome! We just visited a 15th century church in Vicenza, doors were open, no one there, sat down, kneeled, and prayed. The church was amazing, it was a bit surreal."}, {"username": "Dixie Kotylak", "comment_text": "If possible, book with a tour. It’s a zoo inside, and you skip\nLines with prebooked tours. Totally worth the time and money. 👌🏻👌🏻👌🏻"}, {"username": "Rhonda Hope", "comment_text": "I’m not even catholic and have been to the Vatican once it’s a must see I’ve been to rome many times but only did Vatican first time I went"}, {"username": "Carolyn Lewis", "comment_text": "If in Rome, go to the Vatican!!!!!"}, {"username": "Jeanne Bissell", "comment_text": "I didn’t like the Vatican. My least favorite site in Rome. Very crowded, history of misogyny and abuse. So many more beautiful places."}, {"username": "Jen Larkin", "comment_text": "We didn’t do the Vatican on any of our trips to Italy. We’re catholic and couldn’t give a toss."}, {"username": "Mo Dee", "comment_text": "I am in the same boat as your husband. First time in Italy…Vatican City was top three must see. And I had to buy lots of souvenirs for all of my Catholic family members who have never been and may never get the chance to. Had to!"}, {"username": "Jocelyn Blanke Sia", "comment_text": "Haha I totally get your humor! We are Catholic and will be visiting the Vatican tomorrow or Monday for the 3rd time/3rd visit to Italy. 🤣 You gotta stop in if you’re there, If ya know what I mean!"}, {"username": "Michelle Mayer Fulfer", "comment_text": "You should go to St Peter's. It is stunning. We got there at 7am and walked in quickly."}, {"username": "Ewa Żołądek", "comment_text": "And what's exactly the purpose of this post? 🤔"}, {"username": "Gianna Onesi", "comment_text": "If you have never seen it then I agree it is a must assuming you have the time. It is something to see!"}, {"username": "Cathy McDonald", "comment_text": "I chose not to go and I’m okay with that"}]}, {"id": "2202078536857891", "text": "Hello! Is this the correct power adapter plug for Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2202078536857891/", "likes": 0, "comments": [{"username": "Bronwyn O", "comment_text": "There are multiple plug types in Italy, you'd be better off looking for a type C adaptor that can fit into any of them."}]}, {"id": "2202080433524368", "text": "Just in the planning stages. In Venice, would it better to book a gondola ride thru say viator or find some random one when we get there. 6 of us.", "link": "facebook.com/groups/1373361046396315/permalink/2202080433524368/", "likes": 8, "comments": [{"username": "Victoria Laverty", "comment_text": "Dont book"}, {"username": "Jennifer Sadutto McKay", "comment_text": "Don’t book ahead, can walk right up. Much cheaper than booking through 3rd party. Not an issue getting one. Just got home Thursday from our trip. Just HOT!"}, {"username": "Kathy Flood", "comment_text": "Book an evening with rowvenice.com. They have one that involves wine and appetizers !"}, {"username": "Marie Cuzzi", "comment_text": "There are plenty of gondolas don’t book ahead"}, {"username": "Giovanni Pianigiani", "comment_text": "I thought they only accommodate maximum 4 people now?"}, {"username": "Mia Catalano", "comment_text": "Don’t book, we were just there the other day. Best time to go is early, about 9am, no waiting 😀"}, {"username": "Laura DeCicco", "comment_text": "No need to book ahead, they’re everywhere. 80€ flat rate but you’ll need 2 I believe"}, {"username": "Sharyn Wright", "comment_text": "Definitely when you get there. We booked before. It was a big mistake. Awful.\nGet there and look around. There are plenty to choose from"}, {"username": "Ryan Monahan", "comment_text": "There are tons of them around and the price is regulated so you won’t get a better price elsewhere."}, {"username": "Patty Maffei", "comment_text": "Thanks everyone!"}, {"username": "Carolyn Hassarati", "comment_text": "Don't book ahead"}, {"username": "Renae Larcus", "comment_text": "Just find a gondolier when you get there. They are everywhere"}, {"username": "Stacey Esposito", "comment_text": "Tons of gondolas all over the island. 80 euros for 30 mins 100 euros after 7 pm. Very bust during the day. We waited by the Rialto Bridge and got on within 5 minutes"}, {"username": "Veronica Solimando-Lynch", "comment_text": "No need to book. They are all over the island."}, {"username": "Debbie Potter", "comment_text": "Following"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Gondolas have a five person maximum. You will need two for six people."}, {"username": "Stacy Prestigiacomo", "comment_text": "They are all over 80 e , 100 after 7 pm"}, {"username": "Anthony Martini Jr.", "comment_text": "Walk up, why pay extra fees?"}, {"username": "Terina Kwiatkowski", "comment_text": "There everywhere no need to book!"}, {"username": "Vivien Paulik", "comment_text": "No need to book. And one gondola is max 5 people"}, {"username": "Joshua Pickles", "comment_text": "We booked through Chase travel portal and it was cheap, included tips and we have a guaranteed time at sunset"}, {"username": "Lisa Valdovinos", "comment_text": "You can just walk right up to it."}, {"username": "Carm Wilson", "comment_text": "Lisa Scharmann"}, {"username": "Melissa Elliott", "comment_text": "Find one when you get there or ask your hotel concierge or travel advisor for a recommendation."}, {"username": "Kristen Rozansky", "comment_text": "Random one. And not right along the waterfront, where the lines are huge. Turn down any side street and walk around, away from crowds, and find an available gondola. Very easy. There are many."}, {"username": "Beatriz Davalos Moreno", "comment_text": "its more expensive through viator or get your guide. When you are there you will see spots where it says gondola rides. It is usually 80 euros per gondola ride. It was 4 of us, not sure if you can fit 6 people in one ride!"}]}, {"id": "2202082223524189", "text": "I have 2 days in Rome then sail from Civitavecchia. Any tips for Air bnb type places to stay in Rome, and then the best way to get to the port? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2202082223524189/", "likes": 0, "comments": []}, {"id": "2202089270190151", "text": "Have 12 nights. 3 nights in each Venice, cinque terre, Florence area, Rome. Or take a night away and add to another?", "link": "facebook.com/groups/1373361046396315/permalink/2202089270190151/", "likes": 0, "comments": [{"username": "Chris Tine", "comment_text": "Hi Patty! Just recently joined this group."}]}, {"id": "2202091253523286", "text": "About 6:30pm on 6/28.", "link": "facebook.com/groups/1373361046396315/permalink/2202091253523286/", "likes": 290, "comments": [{"username": "Larry Reinier", "comment_text": "Go like 6am or super late hardly anyone there"}, {"username": "Jason Hobel", "comment_text": "First week in May at 6am, a lot less crowded 😁"}, {"username": "Cynthia Marie", "comment_text": "Looks perfect! Enjoy"}, {"username": "Nicole Von Ahn Naturopath", "comment_text": "Holy shit!"}, {"username": "Ronald Clement", "comment_text": "How long ago was that built."}, {"username": "Sephora Cutajar", "comment_text": "Honestly not that busy, remember it worse you can barely pass"}, {"username": "Yara Kubaitary", "comment_text": "Khaled Shaban 👀"}, {"username": "Shazza Kataya", "comment_text": "Alex Boyd look how busy it is! We were lucky."}, {"username": "Bill Gustave", "comment_text": "\"Nice shoes\""}, {"username": "Đỗ Khánh Huyền", "comment_text": "Tố Uyên dậy sớm nhưng nhiều người khác cũng nghĩ vậy này"}, {"username": "Vickeisy Gonzalez", "comment_text": "I rather see it in pictures at that point 😆"}, {"username": "Simon Stiff", "comment_text": "Jacky Stiff"}, {"username": "Shannon Capocci", "comment_text": "we just returned from 2.5 weeks in europe, this was the only spot i felt uncomfortable with the crowds."}, {"username": "Paola Iampietro", "comment_text": "It seems worse than it is. Go there sneak in, take your photos and move on!!"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Was just there! Crazy packed!"}, {"username": "Jess Galasso", "comment_text": "Beautiful to see everyone out and about ❤️"}, {"username": "Pat MacKinnon", "comment_text": "all the pick pocketers love these days!!"}, {"username": "Beatriz Davalos Moreno", "comment_text": "Yeah, I was about staying about a 1/2 block last week. Got there at 6 am and was already packed"}, {"username": "Beatriz Davalos Moreno", "comment_text": "Beatriz Davalos Moreno"}, {"username": "Linda Yahn", "comment_text": "Somewhat like Universal or Disney at Disneyworld."}, {"username": "Valerie Rose", "comment_text": "About 3 pm 6/28"}, {"username": "Michelle LaMantea Talbot", "comment_text": "When we were there a lot of the people were locals just sitting around and we had some fun conversations with them."}, {"username": "Connie Dennis", "comment_text": "Good Lord! So many people 😪"}, {"username": "Sarah Alex", "comment_text": "Lianna Saad Blanton was it this crowded when we went??"}, {"username": "Debbie Horton Rough", "comment_text": "Crazy!!! Lol"}, {"username": "Nicola Wallis", "comment_text": "7.30am"}, {"username": "Kaylia Mone' Quenga", "comment_text": "If you go at 6:30am or 7 am it wont be that crowded and most likely cooler"}, {"username": "Lorena Scopelliti", "comment_text": "Un incubo"}, {"username": "Maria Taliotou", "comment_text": "We was there 😀😃"}, {"username": "Maria Taliotou", "comment_text": "Maria Taliotou"}, {"username": "Raquel Pickering", "comment_text": "Tracey Moody this is trevi in rome at night. Go early morning."}, {"username": "Allister Gardiner", "comment_text": "I was there at that time😎"}, {"username": "Jan Armstrong", "comment_text": "I don’t consider this to be terribly busy. No different to London tourist spots. You can still get your photo"}, {"username": "Laura Walker", "comment_text": "This was 7.30am on Thursday 🩵"}, {"username": "Dawn Leitch", "comment_text": "Jason Leitch"}, {"username": "Heather Gazzola", "comment_text": "Lina Luppino…we will be here soon ❤️"}, {"username": "Mila Mione", "comment_text": "So many people"}, {"username": "Susan Doran", "comment_text": "What tour group has the best tours for Italy @ a decent price looking to visit Amalfi Coast & Rome combo"}, {"username": "Tommo Thomson", "comment_text": "That would be my hotel lol"}, {"username": "James Carr", "comment_text": "I think it wasn’t too bad today."}, {"username": "James Hannan", "comment_text": "Too many People"}, {"username": "Cindy Lu", "comment_text": "Julian Gomez Moheno 👀"}, {"username": "Mai Ka Moua", "comment_text": "Wow! That is a lot of people."}, {"username": "Stuart Flinn", "comment_text": "We were there Thursday at 06:30. It was not terribly crowded."}, {"username": "Yasmine Marie", "comment_text": "Why I never travel to Europe during summer/peak times Noreli Lau"}, {"username": "Marina Chester", "comment_text": "Crowds are a part of summer in Italy and the fountain is still clearly visible. There are millions of Trevi fountain photos already taken - just enjoy the experience:)"}, {"username": "Tracy Crouch", "comment_text": "Tracy Crouch"}, {"username": "Shelley Duffett", "comment_text": "😬"}, {"username": "Christie James", "comment_text": "Tropi genti"}, {"username": "Kate Laidlaw", "comment_text": "6:30am today. Honestly Rome has not been as busy as this group threatens it to be.. London was busier"}, {"username": "Elaine M Woodward", "comment_text": "6/28?"}, {"username": "Rach Harmon", "comment_text": "Yes it was busy today but took minutes to get a photo x"}, {"username": "Rach Harmon", "comment_text": "Rach Harmon"}, {"username": "Slava Simankov", "comment_text": "It’s not that bad , I feel like you can make your way through and take a picture"}, {"username": "Helen Brazeau", "comment_text": "It’s busy because it a marvel ❤️"}, {"username": "Anthony Martini Jr.", "comment_text": "Jessica K Barrows"}, {"username": "Jenn Messina Babore", "comment_text": "That’s more busy than when we were there 2 weeks ago. Wow"}, {"username": "Carole Tarlap", "comment_text": "CRAZY...💥💥"}]}, {"id": "2202091560189922", "text": "If there is a rail strike in the Foggia region, would that affect a train going from Rome to Naples? Thanks for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2202091560189922/", "likes": 0, "comments": [{"username": "Luca Tocci", "comment_text": "Foggia is a city in the Puglia region.\n\nAnd no, I don't see how a local strike in Foggia could affect a train from Roma to Napoli.\nAnyway, in case of strike always re-check the availability of your train multiple times. If it doesn't get cancelled, there's no problem."}, {"username": "Paul Vincent", "comment_text": "Only if the driver is completely lost 😀"}, {"username": "Simon Perry", "comment_text": "No, it could not... The lines you mentioned are not dependent."}, {"username": "Romina Lauretig Toscano", "comment_text": "Well if you take a train Rome Naples, no. If you take a long distance one (from Torino to Foggia) and you step In Rome, yes. But I am not sure they stop in Naples. So just take short distance one (rome-naples: frecciarossa [or regional if you need to save money])."}]}, {"id": "2202110366854708", "text": "Has anyone hiked Ravello to Minori? We have hiked the Path of Lemons from Miaori to Minori and was wondering if there was the same sort of hike from Ravello to Minori. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2202110366854708/", "likes": 0, "comments": []}, {"id": "2202124450186633", "text": "Is Rome for 3-4 days a good option for a couple without kids in Christmas coming from Egypt? Which other city is a must for 3 days?", "link": "facebook.com/groups/1373361046396315/permalink/2202124450186633/", "likes": 0, "comments": []}, {"id": "2202133203519091", "text": "Travelling to Sorrento, Rome, Florence and Milan in a few weeks\nAny suggestions for restaurants will be greatly appreciated\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2202133203519091/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2202140133518398", "text": "Hello everyone. We are in Puglia this weekend and staying in Casamassima next to Bari. Would like to visit a nice olive oil farm in the area. Thanks for your suggestions 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2202140133518398/", "likes": 1, "comments": [{"username": "Elena Marchese", "comment_text": "Intini Alberobello"}, {"username": "Rossella Montanaro", "comment_text": "Ciaoo.. Io abito a Casamassima, 😉"}, {"username": "Rossella Montanaro", "comment_text": "Potresti vedere,\nFrantoio oleario Benedetto Iacovelli a Casamassima"}, {"username": "Evie Gee", "comment_text": "Masseria Brancati - they have olive trees that thousands of years old."}]}, {"id": "2202141210184957", "text": "Does anyone have experience with using car subscriptions in Italy? Looking at hiring for about 24 days. Thanks all!!", "link": "facebook.com/groups/1373361046396315/permalink/2202141210184957/", "likes": 0, "comments": []}, {"id": "2202160860182992", "text": "Hi I’m wondering if anyone knows how to pre purchase tickets to a seria a soccer match? We’re going in October and thinking of the Lazio vs Fiorentina game on October 29. Many thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2202160860182992/", "likes": 1, "comments": [{"username": "Clelia Minucci", "comment_text": "You can buy it on the home-team website"}, {"username": "Rita Levi Montalbano", "comment_text": "U cant prepurchase them, u have to wait till they come out"}]}, {"id": "2202169906848754", "text": "I am in Italy now. I've spent the last week visiting family in the Campania region. Monday I am going to Naples for a couple days before our flight on Thursday out of Naples. The flight is not direct to JFK, it stops in AMS (Amsterdam), then, I connect to another flight to go to JFK ( NY).\nI've never had a layover in another country. How does itआणखी work? Is Amsterdam a pretty easy airport to navigate? Does my luggage automatically get loaded onto the connecting flight? Or do I have to retrieve the luggage and check it in again?\nThanks for the info.", "link": "facebook.com/groups/1373361046396315/permalink/2202169906848754/", "likes": 1, "comments": [{"username": "Simon Howell", "comment_text": "Amsterdam is a big airport but connections are well signposted. You’re bag will be checked thru to your final destination. Hopefully you’ll land and take off in the same terminal. You’re boarding passes should have your gate for both flights. If not there are plenty of screens. Used to fly thru there a lot on the way to US. Good luck…safe travels 😎"}, {"username": "Tsolaye Tonwe", "comment_text": "Hope everything goes well"}, {"username": "Tracy Foss", "comment_text": "Just ask if you need directions often there will be ground support staff to point you in the right direction and follow the signs for connecting flights rather than exit . Good luck have a great trip !"}, {"username": "Kathryn Mckenna", "comment_text": "I love layovers\nHow long is yours?\nSafe travels home"}]}, {"id": "2202178520181226", "text": "I am posting this text taken from yesterday's Italian newspaper \"La Stampa\" to confirm that this group is very useful and much needed for any overseas tourist. Please beware influencers on social media and always get informed and plan your trip before flying to Italy, it's your money and time, don't get them to waste! ❤️\n\nThe text on the image says:\n#LakeComo is drowning in tourists. The lake overwhelmed by the reviews of influencers on the trail of Clooney and Ferragnez. Restaurants are full and the transports are haywire.\n\nHere the article (the intro, there is more on this topic on the newspaper)\n\n\"Two Colombian tourists stroll bored in Piazza San Fedele, among the medieval houses and the Romanesque basilica of the historic center of Como. Their guide, at the umpteenth sign of disinterest, tries to get to the bottom of the matter. “They kept huffing and I asked what they expected to see – says Alessandra Fasola of the Mondo Turistico association -. They thought they had booked a tour to a place called #LakeComo, written precisely with the hashtag incorporated, and they showed me the Instagram profile of a South American influencer who had taken photos in various parts of the lake, without however specifying that they were places distant from each other. It happens more and more often now: many arrive attracted by social media, without information, with unrealistic expectations and confused ideas about what they really want to do. Someone asks to go around the lake on foot, it's 160 km, it's impossible! They show up confused, they leave disappointed: managing them and offering them a quality experience is becoming difficult».\n\nFrancesco Moscatelli from La Stampa\"", "link": "facebook.com/groups/1373361046396315/permalink/2202178520181226/", "likes": 628, "comments": [{"username": "Annette Gonzalez", "comment_text": "That’s why I try to travel in October,I don’t like that anymore crowds everywhere 😉"}, {"username": "JeriLynne Clifford", "comment_text": "I think seeing the big cities are cool but we love to try other places and the country. We are doing Turin, staying in La Morra at a agritismo. Then Montalcino for 3 days, a week at the Tuscan Cooking School before 4 days in Florence and 2 in Milan.\nLast year we stayed in Rimini and Modena.\nWe love to live like Italians vs the crowds of the typical vacation."}, {"username": "Bonnie Qn", "comment_text": "We did Rome, Florence and Venice in July and it was crowded but not unmanageable. Go and enjoy!!"}, {"username": "Tara Dix", "comment_text": "Everywhere is busy this year, it's really the first full year of travel for people with no restrictions after the Pandemic. We were in Barcelona right at the beginning of May and it was a zoo already, I can't imagine what it's like now! And then of course, yes, there are sadly lots of people who don't do any research, and just turn up completely unprepared and uneducated about the location. Sadly a lot of the quiet little beautiful spots are being found by influencer's and then ruined by the hordes of people who then decide to go!"}, {"username": "Omar Chaaraoui", "comment_text": "Haha, I have no sympathy for those who follow social media blindly like sheep. You can get your inspiration from social media, but do your own extensive research, and customize your trip to YOUR liking. Don't waste your money and time, be smart about it. Thos social media people are looks for followers and likes to make money, NOT to do you any favors."}, {"username": "Kay Karg Boehnke", "comment_text": "We were just in bellagio & Varenna 7/19 & 7/20, neither were overly crowded! We did stay in Cernobbio which may have improved our experience but we visited both towns above for 2+hrs and never saw crowds like the photo."}, {"username": "Mary Iuor", "comment_text": "This year Italy is dealing with the largest number of tourists. Unfortunately, they predict the same next year. 😞"}, {"username": "Monica Sucato", "comment_text": "Siamo allá frutta!"}, {"username": "Renee Rundle Stoneham", "comment_text": "We stayed in Varenna in mid June and while it was busy it was not insane. Bellagio was wayyy more crowded, Bellano was nice and quiet.\nDo your research July-August are high season so yes, it’s going to be packed.\nSo is the Jersey Shore, the Hamptons etc…\nThis is the first full summer post covid for European travel etc reports had shown it was going to be record breaking.\n\nHere a picture late afternoon in Bellagio on June 17 on the same street."}, {"username": "Cindy Lu", "comment_text": "I'll be going there but in November 💕"}, {"username": "Patty Harrison", "comment_text": "Probably better when schools/\nuniversities are back in session."}, {"username": "Lorenzo Cremonini", "comment_text": "Travelling knowing nothing about where they're going to, no planning, no historical info about monuments and buildings.. how is it possible ?"}, {"username": "Joanna Ruvolo", "comment_text": "Social media has ruined some little towns/areas like Bellagio and Cinque Terre. They simply were not made to handle this many people."}, {"username": "Mary Ellen Gilbert", "comment_text": "This is what we experienced in May, while in Spain, Italy and especially France. I would not go back for that very reason."}, {"username": "Mike Obayashi", "comment_text": "I was in Varenna and Como last year (June). The taxi driver was telling me that Lake Como was now the number one destination for Italy. We did not see crowds anything like what is pictured. In fact, it was quite comfortable."}, {"username": "Christin V. McClatchie", "comment_text": "I am headed there in 2 weeks and am a little nervous it’s going to be insane! We are staying in Como for 4 days. Any tips/places that may not be as crazy around the lake?"}, {"username": "Marissa McLean", "comment_text": "I’m sorry but how do you go on a vacation across the world not knowing anything about the destination? That seems like something that could’ve been google maps-ed in two seconds"}, {"username": "Vận Chuyển Milan- Hanoi", "comment_text": "The ferry station is always busy, but It doesn't mean It's crazy crowded. The photo which I took last week in Bellagio. It was quite peaceful :)"}, {"username": "Laurie Ann", "comment_text": "Ingrid Plourde"}, {"username": "Laurie Ann", "comment_text": "We are going next July. On a cruise. :-(. No other choice because of school and work commitments. We know it’s going to be bonkers. :-("}, {"username": "Tania Lebron", "comment_text": "Victor Manuel Ramos"}, {"username": "Liz Matthews", "comment_text": "Yep it was just like that when we were there in June"}, {"username": "Eva Salas", "comment_text": "lol. good luck."}, {"username": "Jane Impecoven", "comment_text": "OMG! No thank you!"}, {"username": "Ana Belle", "comment_text": "Horrendous. What. They. Do. To. These. Little. Villages.\nI'm glad I've done my traveling just before Corona. Tourist pages on Facebook, Instagram and tourists promoting and romanticizing quiet spots same as this , are destroying places like this😭🥴😭"}, {"username": "Ali Moore", "comment_text": "Natalie Smith"}, {"username": "Ali Moore", "comment_text": "Natalie Smith"}, {"username": "Cynthia Talone", "comment_text": "Go out of season! Simple"}, {"username": "Georgina Kiedrowski", "comment_text": "Emma McKinney"}, {"username": "Samantha R. Howlett", "comment_text": "I believe it."}, {"username": "Jana Lysáčková", "comment_text": "wow this is insane, do you think it will be better at the end of September? me and my sister gifted our dad a trip to Lake Como, so I wish it’s more peaceful than it’s in the picture 🥹"}, {"username": "Linda Johnson", "comment_text": "Thank goodness we're not going in the height of tourism and summer holidays"}, {"username": "Pui Quing", "comment_text": "you got to plan ahead, i went before summer on Lated May just right with less crowd. Don’t go Italy on July-August 😱"}, {"username": "Jerry Cowper", "comment_text": "Quite a long queue for the toilet….. then. 😳"}, {"username": "Nathália Strack", "comment_text": "Dafydd Nicholson"}, {"username": "Lauren Vassallo Beattie", "comment_text": "So over social media, it's a virus. Yes I know the irony as I'm typing this."}, {"username": "Luisa Ravenna", "comment_text": "I've recently joined this group and I always see the same destinations: Rome, Florence, Amalfi, Positano, Venice, 5 Terre, Lake Garda or Como. But there are many beautiful places in Italy that are less crowded"}, {"username": "Frances McDonagh", "comment_text": "I think with crowds and the crazy climate in July August this year I will be rethinking my 2024 plans and go on holidays in May September"}, {"username": "Ilaria Verda", "comment_text": "Come to Lugano lake! Campione, monte San Giorgio ( UNESCO heritage) Lugano, monte generoso, Porlezza with villa fogazzaro are beautiful"}, {"username": "Caterina Liquori-Culhane", "comment_text": "That's why some people are better off with a tour. Fir your first time over I think their great"}, {"username": "Sa Ra", "comment_text": "Ruby!\nthis group has been good"}, {"username": "Silvia Urbinelli", "comment_text": "Please, I beg you... please, Siena . Only 1 n. Please."}, {"username": "Alcide Wever", "comment_text": "Amberly Lejuez 🫢"}, {"username": "Louis Des Forges", "comment_text": "I have been to Lake Como twice do love it but next time will go to Lake Maggiore. Hopefully the Instagram followers are not looking at Lake Maggiore."}, {"username": "Angharad Kirkpatrick", "comment_text": "Dave Kirkpatrick"}, {"username": "Nicolle Picciuto", "comment_text": "Bianca Picciuto"}, {"username": "Goran Gogic", "comment_text": "People are like sheep 🐑 nowadays"}, {"username": "Colleen Dawson", "comment_text": "Expectations vs reality."}, {"username": "Debbi Mayfield", "comment_text": "Kayte Duffield"}, {"username": "Yasmine Marie", "comment_text": "Another reason why I refuse to go to Europe in the summer"}, {"username": "Phyllis Cawthorne Miller", "comment_text": "My daughter and I went this past April and it was lovely. We wore a light jacket or sweater and were fine. I’d go back in a minute! No crowds."}, {"username": "Kerry Laux", "comment_text": "Jo MacLean"}, {"username": "Marie Malone", "comment_text": "Celebrity worship is a mental illness."}, {"username": "Taran Whitburn-Cassin", "comment_text": "I left there a few days ago. It was busy in belagio but no where near as busy as the picture displays. We stayed in Tremezzo. It wasn't busy and it's one ferry stop away from Belagio. Lake Como is a place for views and rest and potentially a romantic holiday. Not an exciting holiday. Great food and great views."}, {"username": "Tom Walsh", "comment_text": "Get off the beaten path. Stayed in Bellagio for 12 days in June. Ferry hopped to the towns around the lake, rented a boat and cruised the lake, did a bike tour, and lots of walking and exploring away from the busy areas, and relaxing and enjoying the views from our rental. Visited Castello di Vezio in Varenna. What a surprise when we got to the top and saw the flag of our province, Nova Scotia, Canada 🇨🇦 hanging in the castle. It was a great hike to the castle with great views."}, {"username": "Mary Lou Gillen", "comment_text": "No way would I call that a vacation! I’m like a broken record. I must have said a thousand times OCTOBER AND November the best months for Italy. June July and August the absolute WORST. We have been three times all mid October. Reason why? Vacation season is over, kids back in school, colleges are back in session and people like teachers who have summers off are back to work.\nTo me a vacation is not fighting the crowds, waiting on lines, the unbearable heat and packed restaurants and hotels."}, {"username": "Ted Niescier", "comment_text": "This is not just a problem with Italy or travel in general. People are increasingly unwilling to do the work needed to research a travel destination (or ANYTHING). A simple internet search would have solved this. Ignorance abounds. Travel (and travel research) takes effort, but is absolutely worth it, especially for those who have (often unrealistic) bucket-list expectations. Pre-internet you could travel and arrive at an unexpected location (which often happened when cycling, for instance) and savour what it had to offer. Now it gets trashed if it's not exactly what was seen (at a specific time of day, from an unusual angle, with that drink in hand) on social media. People put so much effort into getting the Instagram shot in just the right dress that they don't even appreciate where they are. Sorry for the rant, but blind entitlement and privilege have consequences. Imagine traveling all the way to Italy and harumphing around mad because it's not like it was in the pic. These are just places where people live that just happen to be beautiful with often amazing culture and food and history. Research if you are expecting very specific experiences, otherwise enjoy the ride and you will come home with amazing stories no matter where you end up."}, {"username": "Lisa Woodall Langley", "comment_text": "Wow! That’s crazy busy! I have researched my trip for a year, so should know what to expect. Not to mention the twenty years before that!! 😂"}, {"username": "Cheryl Tomkinson-Hunter", "comment_text": "Yes the “Influencers” are ruining a lot of places just to keep their postings up. Beware…"}, {"username": "Shirley Lewis", "comment_text": "I've spent months at a time in Florence, thank goodness, because I'm not sure if I'll ever return. I hated fighting the crowds then but now it's total madness! this year we will base ourselves in Bologna (any hotel/\napartment suggestions? 🙂 ) and take day trips to the wonderful small villages near by ... and hope no one discovers this area!"}, {"username": "Rhona OConnor", "comment_text": "Just look at the crowds!!! 🙄 There is so much more to see in Italy than the Instagramable places!"}, {"username": "Rhonda Hope", "comment_text": "Omg glad I went last May wasn’t crowded like this"}, {"username": "Dave Conroy", "comment_text": "So many are followers. You see it with the questions asked here. Research and discover for yourself. Experience your own side tracks not just the same routes as everyone ..."}, {"username": "Tiffany McConnell", "comment_text": "They should due homework 1st, than book guide..have an idea of each area"}, {"username": "Martin-John Rubio", "comment_text": "I went this ( Varenna ) past Winter-..on purpose 😁 for the serenity ..sure 80%of things are closed but I had an adventure 😁..it was easily awesome to jet all over the lake on near empty ferries any given day in December..I understand Winter’s not for everyone…👍🏽👍🏽…we all roll differently 🤩"}, {"username": "Mónica Vares", "comment_text": "I’ve been in lake como in april of this year and it was amazing! People cant expect visit a touristic place in summer and be empty."}, {"username": "Tracy Silva Samarjian", "comment_text": "It was crowded I was there yesterday. It did not look like that. I was there for 2 days. Yes, the boat lines are crowded just be prepared & be patient. Also great idea to go to the information center when you arrive."}, {"username": "Julia Haggerston", "comment_text": "That’s where I’d turn around and walk the other way x"}, {"username": "Sylvia Jenkins", "comment_text": "In my opinion these people need to learn the hard way 🤣"}, {"username": "Franca Macerola-Mendoza", "comment_text": "Don’t go anywhere in Italy in July and August !!!"}, {"username": "Sally Warren", "comment_text": "Figuriamoci Positano!\nPositano was worse last year in late September. My personal idea of hell."}, {"username": "Patrizia D'Arcangelo", "comment_text": "Come to Bergamo Alta. It's not overly crowded and it's a true jewel of history and architecture."}]}, {"id": "2201767303555681", "text": "We are traveling to Italy this fall and would like to stay the night in Capri or anacapri. Any suggestions on places to stay?? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2201767303555681/", "likes": 6, "comments": [{"username": "Jill Wolder", "comment_text": "Grand Hotel Quisisana without a doubt"}, {"username": "Tami Whittlesey", "comment_text": "Anacapri is quieter for sure. I suggest Hotel Bellevista if your not working with an emperors budget 😉 Enjoy!"}, {"username": "Dumitru Aurel", "comment_text": "Get your vaccination status fixed, he also provides ivermectin. Message Dr. Brad‬\n‪https://t.me/\nDoctorsagainstma\nndatoryvaccines"}]}, {"id": "2201769826888762", "text": "Hi! I am staying in Salerno from August 24th until August 28th… anyone stayed there and did day trip to Amalfi coast?", "link": "facebook.com/groups/1373361046396315/permalink/2201769826888762/", "likes": 1, "comments": [{"username": "Scott Heran", "comment_text": "We stayed in Salerno. It is a good home base for ferries to the AC although I liked Minori. It would be a good base and much smaller and quieter."}, {"username": "Skye Kennedy", "comment_text": "Do not eat at a place called Madegra coffee on the water. They don’t advertise prices dvd just give you a receipt for the total. Total rip off. The place has poor reviews. Learnt the hard way today."}, {"username": "Pam Howell", "comment_text": "Melissa 'Howell' Wehner"}, {"username": "Chiara Normanno", "comment_text": "Take accommodation near the touristic port, you'll find Salerno perfect for your trips to Amalfi coast"}, {"username": "Scott Heran", "comment_text": "Do not stay at the Grand Hotel. Terrible."}]}, {"id": "2201776240221454", "text": "Hotel / Pensionne recommendations for Taormina appreciated!!!", "link": "facebook.com/groups/1373361046396315/permalink/2201776240221454/", "likes": 1, "comments": [{"username": "Karise Pagano", "comment_text": "I lived for several years about an hour from Taormina and have been dozens of times. I stayed 3 days at this place with visiting relatives and it was spectacular!\n\nhttps://\nwww.booking.com/\nShare-9lhrmUw\n\nIve also stayed 2 nights here, which was quaint and the elderly couple host were super sweet.\n\nhttps://\nwww.booking.com/\nShare-DYrlkw\n\nBoth places have parking and both are a short walk to the city! ENJOY!"}, {"username": "Paula Lazeski", "comment_text": "Paula Lazeski"}, {"username": "Koen Loeven", "comment_text": "Thanks, Paula was asking for me. Now I'm part of this group. Sadly Apartments not available for our dates. Have tentatively booked Hotel Lido Mediterranee, any feedback?"}]}, {"id": "2201776766888068", "text": "We are planning a three week trip in March or April 2024. Want to start in the Rome area and work our way down the Amalfi Coast to Reggio di Calabria then take the ferry to Siracusa, Sicily. Traveling by rail. Any tips?", "link": "facebook.com/groups/1373361046396315/permalink/2201776766888068/", "likes": 2, "comments": []}, {"id": "2201780090221069", "text": "Italy’s Best Kept Secret", "link": "facebook.com/groups/1373361046396315/permalink/2201780090221069/", "likes": 11, "comments": []}, {"id": "2201780953554316", "text": "Does anyone know if theres any airport or railroad protests scheduled for August?", "link": "facebook.com/groups/1373361046396315/permalink/2201780953554316/", "likes": 15, "comments": [{"username": "Barbara McGuire", "comment_text": "There is an Italian law you can’t strike between July 27th and Sept. 5th."}, {"username": "Linda Miller", "comment_text": "https://\nwww.commissioneg\naranziasciopero\n.it/\ncalendario-sciop\neri"}, {"username": "Paula Richardson Frazier", "comment_text": "My daughters are going to Italy late September, but will be back stateside October 3 so hopefully they don’t have to worry about the strike. ￼"}, {"username": "Scott Heran", "comment_text": "Everyone is on holiday in August."}, {"username": "Eleanor Marie Marschall-La Rosa", "comment_text": "Airport will be fine.\nThey are not allowed to strike from July 27 until September 5th.\nRailroad I’m unsure but I’m pretty sure there is a website that has all strikes listed"}, {"username": "Francis DeAndrea", "comment_text": "Airports aren’t bad. Railroads are a different animal. They strike over nothing; then settle next day. There are no guarantees with Italian rail service. Rent a car."}, {"username": "Eliza Russo", "comment_text": "Does that mean all bets are off for after Sept 5th?☹️"}, {"username": "Bonnie Koniikawai Morgan Russell", "comment_text": "Will the October strike affect the Cinque Terre trains and ferries?"}, {"username": "Joseph Ferragina", "comment_text": "next time they go on strike…… just fire them. That will correct the problem."}, {"username": "Georgeann Farinacci Greene", "comment_text": "Most of the country is on holiday in August, plan accordingly"}]}, {"id": "2201793633553048", "text": "Traveling to Italy for 8 days in October. Is this too busy of a schedule? Rome to Sorrento first day via private driver. Stop in Naples for pizza. 3 nights in Sorrento-visit Capri and Positano while there. Train to Florence for 2 nights, then back to Rome for 3 nights/2 full days. 2nd time to Rome and Florence. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2201793633553048/", "likes": 3, "comments": [{"username": "Scott Perry", "comment_text": "Too busy for me, at any rate."}, {"username": "Ann Marie", "comment_text": "I would do 1 more night in Sorrento and 1 less night in Rome (since you've been there). IMO."}, {"username": "Maria Taliotou", "comment_text": "Maria Taliotou"}, {"username": "Pao Magnoler", "comment_text": "Yes it is! Way to busy. In Florence you need a minimum of 3 days, Rome, 4 days."}, {"username": "Maria Taliotou", "comment_text": "We are in Rome for 5 days and our schedule is full"}, {"username": "Meghan Tan", "comment_text": "That is an extremely jam packed schedule. I would do either Rome and Sorrento or Rome and Florence."}, {"username": "Michele Teehan", "comment_text": "Thank you for your responses! I am going to cut Florence out of our trip. It was just a case of FOMO😊"}, {"username": "Bronwyn O", "comment_text": "I would do it. But I've found I'm much more okay with moving from place to place than many others in this group. It really depends on what makes for a fun vs stressful trip for you."}, {"username": "Glenn Todd Webb", "comment_text": "Yes. You’re in the area stick to Rome, Naples, Pompeii, Amalfi. I suggest Ravello and Amalfi over Positano."}]}, {"id": "2201795973552814", "text": "Planning to visit Rome next spring. We have an apartment reserved in Trastevere. Have any of you gone on the food tours in Trastevere? The reviews are great and I’d love to hear about your experiences.", "link": "facebook.com/groups/1373361046396315/permalink/2201795973552814/", "likes": 5, "comments": [{"username": "Stefano Follador", "comment_text": "Trastevere it’s a great neighbourhood to enjoy Roman cusine.\nI suggest you to download this app. It’s really helpful in order to enjoy Roma as a Roman.\n\nhttps://\napps.apple.com/\nit/app/\nmino-gira-magna-\ne-bevi/\nid6443740257"}, {"username": "Brian Marcus", "comment_text": "We did a walking street food tour with Airbnb experiences with Lulia pronounced 'Julia' and she and the tour were so much fun! She was extremely knowledgeable."}, {"username": "Dana Talusani", "comment_text": "We did a walking food tour in Trastevere and it was awesome!"}, {"username": "Eileen Steiniger", "comment_text": "We did one through Eating Europe. It was my favorite tour. 4 hours went by super fast."}, {"username": "Audrey Bauer", "comment_text": "We did this one in June! Amazing food and guide. https://\nfoodtourrome.com\n/\ntrastevere-food-\ntour-rome/"}]}, {"id": "2201806483551763", "text": "Does anyone know how to purchase tickets for the section of the Via Dell’Amore mentioned in this article? There are many sites saying to buy online but we can’t find a link.\nNote: it is not part of the Cinque Terre\nCard which is why I’m asking. Please only respond if you happen to know the link.\nThanks in advance!\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2201806483551763/", "likes": 1, "comments": [{"username": "Esther Steinbok Sustersich", "comment_text": "Pretty sure I did the tiny section is re-opened it is near the Riomaggiore train station￼. At this point they reopened part is super short."}, {"username": "Esther Steinbok Sustersich", "comment_text": "New: Reopening via dell'amore 2023/2024\n\nAfter a storm on October 25, 2011, the coastal path had to be closed because the heavy rain caused some mudslides. A lot of time passed, then the extensive renovation work began to secure the steep and up to 150 m high rock faces with steel nets.\n\nAfter 11 years, a first section of via dell'amore was reopened on June 8th, 2023. The first 170 m can thus be walked on again, and the complete opening of the tourist pearl is planned for July 2024. However, the number of visitors is limited and reservations are required.\n\nA few interesting numbers:\n\n170 m length of the first renovated section"}, {"username": "Bill Ulrich", "comment_text": "Since the link is in the article, I'd probably just use that:"}, {"username": "Sheila Cabano", "comment_text": "https://\nwww.viadellamore\n.info/\n?gclid=CjwKCAjwz\no2mBhAUEiwAf7wj\nkvbX8WZVU3sxWcQ\nVOxIsPQ6XtsqqxK\ng6AUYhUShNGQRsI\nW8b8Am0oRoCA8MQ\nAvD_BwE"}, {"username": "Sopra la Roccia", "comment_text": "https://\nwww.viadellamore\n.info/"}]}, {"id": "2191587501240328", "text": "Expect views to die for, a stunning beach area and a gorgeous pool. Located right in front of Capri and Positano, Grand Hotel Tritone is the quintessence of the Amalfi Coast😍\nHave a look here: आणखीhttps://www.kqzyfj.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g194867-d274456-Reviews-Grand_Hotel_Tritone-Praiano_Amalfi_Coast_Province_of_Salerno_Campania.html%23%2Fmedia%2F274456%2F594097123%3Ap%2F%3Falbumid%3D101%26type%3D2%26category%3D101", "link": "facebook.com/groups/1373361046396315/permalink/2191587501240328/", "likes": 66, "comments": [{"username": "Farrah Sweetiepie", "comment_text": "Beautiful! Thanks for sharing!\n\nRobert Corpuz\nWoah… we have to see this when we are there…"}, {"username": "Map Zeugirdor", "comment_text": "Wow beautiful!\nBing Tan let’s go here!"}]}, {"id": "2201787356887009", "text": "Stay comfortably seated on your sofa and embark on a journey into the heart of Naples, one of the world’s most vibrant cities and marvel at the splendours of the Royal Palace of Caserta!\nJoin our virtualआणखी experience: https://nextstop-italy.com/virtual-tours/naples-royal-palace-caserta/\n\n#italyiloveyou #art #italytravel #italytrip #italygram #history #virtualworld #VirtualTour #vacationmood #naples #naplesitaly #naplesinsider #caserta #casertaitaly #casertapalace #amalfi #amalficoast #amalficoastitaly #napoli #royalpalaceofcaserta #royalpalace #royalpalace", "link": "facebook.com/groups/1373361046396315/permalink/2201787356887009/", "likes": 15, "comments": [{"username": "Candis Morgan", "comment_text": "Bernie Morgan"}]}, {"id": "2200431890355889", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2200431890355889/", "likes": 6, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Wonderful hotel and room view In Sardinia, Isola Rossa https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g635632-d4868\n81-Reviews-Hote\nl_Relax_Torreru\nja_Thalasso_Spa\n-Isola_Rossa_Tr\ninita_d_Agultu_\ne_Vignola_Provi\nnce_of_O.html"}]}, {"id": "2201655516900193", "text": "Come explore Spello! Join our local guide Patrizia in the exploration of this hidden gem as she walks through Spello’s crooked streets, ancient city gates and pink stone houses. Strolling through the heart ofआणखी the village, you will be enchanted by the traces of its past: the Roman walls with their well-preserved gates, the remains of the ancient Roman amphitheatre and the thermal baths. You will breath in the art and history of this charming village.\nJoin us: https://nextstop-italy.com/virtual-tours/spello-flower-town/\n\n#italytrip #italytravel #vacationmood #virtualworld #medievalart #italyiloveyou #rollinghills #medieval #virtualtour #hilltopviews #umbriagram #umbria #hiddenparadise #umbriatourism #Spello #virtual #flowers #flowerstagram #flowersoftheday #gardenlove #gardenlife #gardeninspiration #hamlet #hiddenplaces #hiddengems #hiddentreasures #hiddenbeauty", "link": "facebook.com/groups/1373361046396315/permalink/2201655516900193/", "likes": 30, "comments": [{"username": "Marybeth Ball- Innamorati", "comment_text": "Spelli is beautiful!!"}]}, {"id": "2201510180248060", "text": "I love Italy and hope to get in one last trip. I have never been in November, which I know is the wettest month. But I don't have a lot of choice. Is traveling throughout Italy still good in November?", "link": "facebook.com/groups/1373361046396315/permalink/2201510180248060/", "likes": 10, "comments": [{"username": "Graham Sherlock", "comment_text": "Yes it's absolutely fine"}, {"username": "Vanessa O'Donnell", "comment_text": "I’ve been to Venice and Florence twice in November, and Rome once.\nI would definitely go back at that time of year, we did get some rain but it wasn’t heavy or constant.\nThe benefit was that it was cheaper, less crowded, much shorter lines."}, {"username": "Giada Todaro", "comment_text": "Till ten years ago I would have said that novembers is not the best month to Travel in italy, but now weather is crazy. I have spent last novembers in short pants lol. Of course it depends where you want to Travel. South italy, center and north have different climate. Warmer in south/center, colder in north"}, {"username": "Jenny Payne", "comment_text": "I’m going this October till early November. Anytime is good in Italy even winter I go a lot in February 🌻🌻"}, {"username": "Romina Lauretig Toscano", "comment_text": "Yes!"}, {"username": "Stefano Bressanelli", "comment_text": "Yes..days are shorter and temperature Is more freshly . But autumn Is a great season"}, {"username": "Alessandro Iannelli", "comment_text": "In my opinion, it's so much better in November than it is right now. It may rain, so what? That's what umbrellas are for. It will be much less crowded, much fresher but not uncomfortably cold."}, {"username": "Bonnie Loftspring", "comment_text": "I was recently in Italy in end May. It was disheartening to follow the weather for packing, there was going to be lots of rain. I have a long but lightweight rain coat from LL Bean. It was great! Hood, no need for clumsy umbrella, long, my pants didn’t get trenched, fit over everything & could smash into my shoulder bag."}, {"username": "Valerie Collanton", "comment_text": "I have gone to Tuscany and Rome in November. We did get some rain but still it was great. Cooler weather. No crowds. And the new olive oil is available !"}, {"username": "Pom-Eric Doland", "comment_text": "We are also going in November! Hoping for good weather!"}, {"username": "JeriLynne Clifford", "comment_text": "I was in Emilia-Romagna in November and found it very pleasant. I brought a leather moto jacket, denim jacket and sweater. Was warm and sat outside for lunches and apertivo"}, {"username": "Steve Grossman", "comment_text": "Absolutely"}, {"username": "Theresa Salerno Adams", "comment_text": "Of course"}, {"username": "Miriam McNally", "comment_text": "I've been to Rome twice at end of November and it was fab! And no crowds!"}, {"username": "Marilyn Caladine", "comment_text": "If you travel south, Sorrento, Amalfi, etc you may find hotels cafes closed for the winter."}, {"username": "Francoise Coupal", "comment_text": "You should be fine. With global boiling 🥵, you will be in global cool 😎"}, {"username": "Brenda Posey Simon", "comment_text": "love October and November!"}, {"username": "Rita Sanza", "comment_text": "It's better then going in summer!I just left and the heat was umberable\nI normally go between September and December and love it."}, {"username": "LC Willis", "comment_text": "We went in dec and going again this dec - so nov is warmer - much nicer w less crowds and no heat"}, {"username": "Chiara Normanno", "comment_text": "Weather is unpredictable as of now, you may go in May and still get showered it's a matter of luck. Some years November offers the best days and you don't get crowds. Sure, places like Como Lake and Amalfi coast will have a totally different vibe as it will be low season and they may have closures"}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "Yes. We never go between May and October It’s far too hot and busy. November is fine as is any winter month. I remember having a coffee on Mt Etna on Christmas morning. Magic"}]}, {"id": "2201551473577264", "text": "Pompeii and Herculaneum?\nWords of advice needed.\nRecommended places to stay???\nHeading there February/March next year. Train from Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2201551473577264/", "likes": 5, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "I would stay in either Napoli or Sorrento. It’s less than an hour on a train to and from both sites"}, {"username": "Harris Dee", "comment_text": "Loved this driver in Pompeii … enjoyed our stay at hotel Mauiri"}, {"username": "Phyllis Snyder", "comment_text": "Stay in Sorrento if possible- easy train to Pompeii."}, {"username": "Cindy Sguazzin", "comment_text": "I’ve travelled often in Italy, starting many years ago, but I can never forget my visit to Pompei! I’ve since learned that Herculaneum is even better, so it’s now on my bucket list."}, {"username": "Ed Lamb", "comment_text": "We stayed in Naples. Great tour!"}, {"username": "Kathy Flood", "comment_text": "I went to Pompeii 30 years ago. And two weeks ago I went to Pompeii and Herculaneum. Herculaneum is so much better! Try to go to both! Then go to cantina del vesuvio for a wonderful meal and wine tasting."}, {"username": "Mike Crawford", "comment_text": "Last year our family went to Pompeii, just over night. Too short of a visit!\nWe stayed at the Hotel del Sole, short walk to the entrance, purchased tickets and got a wonderful guide for 2 hours.\nFor me, I could spend 2 weeks in the area."}, {"username": "Mary Anna Machi", "comment_text": "Add Naples archeological museum to the two sites to get the real picture - they moved the important artifacts there and it is fantastic."}, {"username": "Nicole Heaney", "comment_text": "We hired a personal tour guide through Herculaneum. She was a PhD archaeologist, and it was worth every single penny."}, {"username": "Nicole Heaney", "comment_text": "Resort & Winery Bosco De Medici"}, {"username": "Gayle Moores", "comment_text": "We saw Pompeii and Herculaneum on our first trip to Italy. They are both very good archaeological sites.Herculane\num is a the smaller of the two sites. Pompeii is a large place and I recommend getting a guided tour of it if you can. There is much to see and learn about it and both sites are very interesting.A must see!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201553943577017", "text": "We are planning a 10 day trip with kids to Northern Italy we will fly to Milan and want to visit lakes Como and Garda. Verona and Venice. We are hiring a car. Is there a central place thats best to stay or should we move hotels or apartments each time? Also is there a chain of aparthotels that we should consider? We were thinking self-catering accommodation might be easier.", "link": "facebook.com/groups/1373361046396315/permalink/2201553943577017/", "likes": 3, "comments": [{"username": "Michelle Read", "comment_text": "We did a similar trip and stayed at different places for 3-4 days. There are many beautiful towns along the lakes to stay, look for ones with ferry terminals and you can cross the lakes and visit lots of places. We also drove, sometimes parking was interesting but all part of the experience! We stayed at a mixture of hotels, agriturismos and Airbnb’s. Enjoy!\n\nhttps://\napps.apple.com/\nau/app/\nagriturismo-farm\n/id1557644648"}, {"username": "Alice Francesca", "comment_text": "I would just use trains.Parking or driving is forbidden in many central areas of towns, unless you have a permit. I am Italian and I just use trains if I want to go to Garda, Venice, Verona etc."}, {"username": "Alice Francesca", "comment_text": "Ps.to see the towns of Lake Garda use the ferries."}, {"username": "Pietro Adami", "comment_text": "Verona is in the middle of your travelling plans. To Milano and Venezia, easy connections by train. To Garda lake, maybe better by car for freedom to visit different areas / villages"}, {"username": "Robin Burrell", "comment_text": "Lake Garda is probably better with kids. Lots of aparthotels and BnB”s and apartments there. Lots of hiking, biking, boating, swimming, kayaking."}, {"username": "Alice Francesca", "comment_text": "This is what Lake Como looks like in these days\n\nJust warning you"}, {"username": "Sally Warren", "comment_text": "Go for AirBnBs. Self cater, do washing, stay in amazing places!"}]}, {"id": "2201529296912815", "text": "Dolomite, Tre Cime, Faloria", "link": "facebook.com/groups/1373361046396315/permalink/2201529296912815/", "likes": 10, "comments": []}, {"id": "2201541436911601", "text": "Any recommendations for great restaurants in Florence? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2201541436911601/", "likes": 6, "comments": [{"username": "Louise Jeanne", "comment_text": "ZaZa for sure"}, {"username": "Donna Arbec", "comment_text": "Every restaurant is good"}, {"username": "Arianna Reel Cook", "comment_text": "I might be the odd man out but I hated ZaZa.\nLoved this place though 🥰\n\nhttps://\ncinghialebianco.\ncom/\nhome-english/"}, {"username": "Amy Maselli", "comment_text": "Osteria Santo Spirito"}, {"username": "Lana Watson Famiano", "comment_text": "Definitely Ristorante 'O Parrucchiano La Favorita"}, {"username": "Georgia Brown", "comment_text": "Ristorante Cammillo!!"}, {"username": "Christine Ruest", "comment_text": "https://\nacquaal2.it/"}, {"username": "Debra Indorato", "comment_text": "Palazzo Tempi near the Oltrarno area"}, {"username": "Michele Freund Canino", "comment_text": "aqua al duo"}, {"username": "Keith Piccirello", "comment_text": "All of them"}, {"username": "Keith Piccirello", "comment_text": "Corte de Pazzi"}, {"username": "Barbara Hoerle Zuhowski", "comment_text": "Make sure to go to Vestri chocolate for a dessert- best gelato in Florence for"}, {"username": "Judy Peirce Basiliere", "comment_text": "La Giostra\nAcquapazza\nAcqua Al 2\n13 gobbi"}, {"username": "Jocelyn Tyree", "comment_text": "Garga!"}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Heidi McLean", "comment_text": "Il Vizzo. Get the bolognese. Trattoria dall Oste and get a Florentine steak"}, {"username": "Franco De Luca", "comment_text": "Za Za"}, {"username": "Robert Fonte", "comment_text": "Giostra was very good"}, {"username": "Cindy Neilson", "comment_text": "Drogheria Bar & Grill\n(my daughter and I ate there a month ago) ... very nice"}, {"username": "Helen Gardener", "comment_text": "Il Vivandiere"}, {"username": "Laura Natalini", "comment_text": "Latini"}, {"username": "Pamela Holifield", "comment_text": "I am so curious what everyone posting ZaZa are there. It was just so terrible, but obviously I missed something yummy since many of you are posting. Do tell!"}, {"username": "Yanely Cruz", "comment_text": "We had one of our best meals at Ciro and Sons!!"}, {"username": "Yanely Cruz", "comment_text": "https://\nwww.ciroandsons.\ncom/"}, {"username": "Jo Ann Black Jones", "comment_text": "Bucca Mario"}, {"username": "Viviann Cardenas", "comment_text": "https://\nwww.lortone.it/\nMichelin, Delicious. 4,7 on reviews."}, {"username": "Lisa LaBracio Volpe", "comment_text": "Vini e Vecchi and Trattoria 13 Gobbi-both are excellent!!"}, {"username": "Gretchen Gray Ciaccia", "comment_text": "Osteria Vecchio Vicolo"}, {"username": "Pam Armenia O'Brien", "comment_text": "La Giostra and Aqua Al 2. Had fantastic meal at both."}, {"username": "David Garfinkel", "comment_text": "LaGiostra. Amazing"}, {"username": "Jessica Chiu", "comment_text": "This was by far our favorite in Florence Trattoria Zà Zà\n+39 055 215411\nhttps://goo.gl/\nmaps/\njoJYw5bWsPyjix8c\nA"}, {"username": "Ivonne Rodriguez", "comment_text": "Trattoria Vasari"}, {"username": "Dan Pieri", "comment_text": "Ristorante Dante"}, {"username": "Elizabeth Kendall Nguyen", "comment_text": "Sabatini"}, {"username": "Brittany Peterre", "comment_text": "I' Tuscani"}, {"username": "Nancy Kirby", "comment_text": "Trattoria Anita"}, {"username": "Juliette Sastrowitomo", "comment_text": "https://\nwww.trattoriazaz\na.it/"}, {"username": "Mary Sandor White", "comment_text": "Francesco Vini. Excellent veal chop. Great atmosphere"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Really great try Enoteca Pinchiorri"}, {"username": "Robyn Braverman Dolington", "comment_text": "Buca Mario!"}, {"username": "Patricia Diebold-mccarthy", "comment_text": "Depends where you are. We loved borderline"}, {"username": "Laura DeCicco", "comment_text": "Buca Mario, Trattoria ZAZa, Cinghiale Bianco, Trattoria Boboli"}, {"username": "Glorimar Escudero", "comment_text": "Trattoria ZaZa"}, {"username": "Daniel Taylor", "comment_text": "F"}, {"username": "Carol Taylor Tisdale", "comment_text": "ZaZa's and Baldovino."}]}, {"id": "2201498900249188", "text": "Cities to visit in Tuscany? 🌸\n\nWe have been in Florence, Siena, Volterra.\n\nAny recommendations🤩", "link": "facebook.com/groups/1373361046396315/permalink/2201498900249188/", "likes": 18, "comments": [{"username": "Pao Magnoler", "comment_text": "San Donato, you can eat in La Toppa, a Michelin Star restaurant. Amazing!"}, {"username": "Daniela Benzoni", "comment_text": "Lucca!"}, {"username": "Karin Baumann", "comment_text": "San Gimignano and Montepulciano"}, {"username": "Lyndsey Ryan", "comment_text": "San Gimignano, volterra"}, {"username": "Megan Knight", "comment_text": "Lucca!"}, {"username": "Michele Naftal", "comment_text": "Montepulciano was amazing! We stayed at an Agrotourism hotel in Pienza. Pienza was adorable too."}, {"username": "Jud Luli", "comment_text": "Montepulciano, Montalccino, bagno vignoni, pienza, san quirico d'orcia, agriturismo Baccoleno, montichielo, volpaia Arrezzo"}, {"username": "Elena Eckley", "comment_text": "Montecatini a spa town west of Firenze"}, {"username": "Theresa Salerno Adams", "comment_text": "Lucca"}, {"username": "Chris McLaughlin", "comment_text": "Lucca"}, {"username": "Lara Grom", "comment_text": "Bagno Vignoni the dream"}, {"username": "Andrea Jane Whittington", "comment_text": "LUCCA walled city!!!!! 😍😍😍"}, {"username": "Becca Leah", "comment_text": "Definitely 100% San Gimignano!!! It's only a small town but 2 days wasn't enough for us!"}, {"username": "Nina Niner", "comment_text": "Anghiari"}, {"username": "Rita Levi Montalbano", "comment_text": "Isola d'elba, arezzo, pisa, san gimignano, chianti, massa carrara, suvereto"}, {"username": "Giulia Rossi", "comment_text": "Montepulciano"}, {"username": "Brad Nelsen", "comment_text": "Cortona"}, {"username": "Sally Jean", "comment_text": "Montefiorelle, Greve, Castellina"}, {"username": "Lynn Macri", "comment_text": "San Gimiano"}, {"username": "Theodore Meyer", "comment_text": "Absolutely Lucca. We spent two weeks there. Loved it and took day trips some days."}, {"username": "Beth Pickett", "comment_text": "Cortona"}, {"username": "Isabel Salcedo Patterson", "comment_text": "Lucca!! So pretty"}, {"username": "Isabel Salcedo Patterson", "comment_text": "Anghiari too!"}, {"username": "Karen Michelle Lucero", "comment_text": "Following with Kristin Huff"}, {"username": "Bethany Rudy", "comment_text": "We loved Lucca!"}, {"username": "Michelle Mayer Fulfer", "comment_text": "Lucca!"}, {"username": "Tamie L Godbold", "comment_text": "Montepulciano 😍"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Lucca, Pisa, San Gimignano"}, {"username": "Max Sorber", "comment_text": "Lucca rent bikes and bike on top of wall\n\nSan Gimignano"}, {"username": "Barbara Bastianini", "comment_text": "Pitligliano. Massa Marittima. Plus Sovana, if you’re interested in a tiny beautiful village."}, {"username": "Alice Francesca", "comment_text": "Tuscany is better explored in the countryside.Fro\nm Siena rent a car and drive south for about 1 hr 1/2 to Val d'Orcia (check it online).\nPienza as a homebase (Chiostro di Pienza is the best) then Bagno Vignoni (hot natural spa water, Posta Marcucci hotel for a day in the pools), San Quirico d'Orcia, Montalcino and Monticchiello."}, {"username": "Massimiliano Massi Mori", "comment_text": "Lucca, Volterra"}, {"username": "Jason Hobel", "comment_text": "Lucca and San Gimignano"}, {"username": "Courtney Brown", "comment_text": "Montepulciano, Pienza, & Cortona, Orvieto"}, {"username": "Scott Taylor", "comment_text": "Lucca"}, {"username": "Jenny Clough", "comment_text": "We loved Siena!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Pisa, Lucca, Arezzo, on the small side Pietrasanta, Montalcino, Pienza, Bagno Vignoni, San Gimignano, Certaldo"}, {"username": "Pam Armenia O'Brien", "comment_text": "San Gimignano, Montapulciano, Montalcino"}, {"username": "Gianna Onesi", "comment_text": "Chianti, Bologna"}, {"username": "Angela Benini", "comment_text": "Monteriggioni"}, {"username": "Ralph D'Antonio", "comment_text": "Pisa and San Gimignano"}, {"username": "Chantal Campeau", "comment_text": "I ❤️ Pienza and Montepulciano"}, {"username": "Anne Brawley", "comment_text": "Lucca."}, {"username": "Wendie Rice Bonini", "comment_text": "San Giovanni &\nMontecarlo"}, {"username": "Jeanne Hendrickson", "comment_text": "San Gimignano and Orvieto"}, {"username": "Robin Burrell", "comment_text": "Lucca, Cortona,"}, {"username": "Mary Lynn Austin Mang", "comment_text": "Montepulciano, Pienza , Cortona, Arezzo"}, {"username": "Nicole Cervantes Hollywood", "comment_text": "I really like Civita. Only did a very short stop because we ran out of time but that is the one place I’d go back to for lunch and a walk around. It wasn’t very big but very quaint and I enjoyed the walk in crossing the bridge. I felt like some of the other towns were similar to each other."}, {"username": "Jan Linke Rickmers", "comment_text": "Loved Pienza"}, {"username": "Francesco Ronchi", "comment_text": "Scansano, terme di Saturnia, Santa Fiora, Arcidosso, Montegiovi, Pitigliano"}, {"username": "Nancy Koehler Barboni", "comment_text": "Drive the Chianti Road!!!"}, {"username": "Antonella Pinna", "comment_text": "Arezzo, San Gimignano"}, {"username": "Pao Magnoler", "comment_text": "San Geminiano, Fiesole, Pisa, Lucca."}, {"username": "Candy Mattiello", "comment_text": "San Gimignano, Montipulciano"}]}, {"id": "2201519683580443", "text": "Planning a European trip with our son for his high school graduation!! We are traveling by train.... we have freebie days between major stops such as Milano, Venice, Florence and Rome... Are there any places that are must stops for a night??", "link": "facebook.com/groups/1373361046396315/permalink/2201519683580443/", "likes": 1, "comments": [{"username": "Thomas Ziolkowski", "comment_text": "I just posted pictures and videos of my trip this week with my daughter. All by train. We are into day 6. And feeling it for sure. Post is pending approval.\nWe been to several countries. From south to north itlay. Now in Vianna, going tk Prague, Paris, Brussles, Germany, Spain. Best vaca ever. Just me and my daughter"}, {"username": "Alice Francesca", "comment_text": "From Milan to Venice, Verona for sure"}]}, {"id": "2201528303579581", "text": "You must visit peschiera del garda very nice and relaxing ♥️15 min free shuttle away from gardaland and movieland loved it", "link": "facebook.com/groups/1373361046396315/permalink/2201528303579581/", "likes": 7, "comments": [{"username": "Bart Utley", "comment_text": "Caroline Lowry"}]}, {"id": "2201528686912876", "text": "What is the best site to get tickets to get into colosseum-is night tour or day tour better? Or can I just purchase when I get there?", "link": "facebook.com/groups/1373361046396315/permalink/2201528686912876/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Coopculture.it is the official site. You will want to book in advance. Tickets open up 30 days ahead starting at 9am local time and approximately every 15 minutes thereafter. Both day and night are great. We did both."}, {"username": "Jay Parekh", "comment_text": "I got ours via coop culture direct. Took hours of refresh but finally had the avail. We just got to Rome and our tour starts in few hours. We were able to get the underground tour too."}, {"username": "Jeff McLellan", "comment_text": "The only way to guarantee that you are not disappointed is to get the tickets through Coopculture it is a pain but worth it."}, {"username": "Jane Lisa", "comment_text": "Don’t use Viator! They sell tickets that they haven’t even secured yet and reservations get canceled, even at the last minute."}, {"username": "Lisa Martinson", "comment_text": "Day tour in my opinion I’ve done both."}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Leanda Wall", "comment_text": "Leanda Wall"}]}, {"id": "2201514346914310", "text": "Any thoughts on a day trip from Florence to Lucca? Is it too much in a day? Would it be best to do by train or drive.", "link": "facebook.com/groups/1373361046396315/permalink/2201514346914310/", "likes": 3, "comments": [{"username": "Suzanne Mills", "comment_text": "100% train and worth it!"}, {"username": "Wendy Wallin", "comment_text": "Go for it & when you get there rent a bike & ride around the wall of the city if you have time. We went there once on a day time cruise & loved it so went back a few years later for several days to see the rest of it."}, {"username": "Laura Cardinale", "comment_text": "It depends on when you have to go. In this period the train line between Florence and Lucca is interrupted until August 30 and you have to take a bus from Pistoia to Montecatini. I suggest the bus (https://\nwww.at-bus.it/\nit/\nlinee-e-orari/\nregionali-dd ).\nLucca is a small city and in these days there is Lucca Summer Festival, is really really busy."}, {"username": "Glenn Todd Webb", "comment_text": "It’s perfect for a day trip. We rented a car so we were on our own time table. Drove to Pisa, saw Baptistry, cathedral, leaning tower then drove to Lucca and spent rest of day. It wasn’t too pressed for time."}, {"username": "Connie Wilson", "comment_text": "Very easy by 2 hour train via Pisa (you could see both), or faster if you had a car."}, {"username": "Chris McLaughlin", "comment_text": "Train is so easy and relaxing. No problem doing a one day trip though you will want to go back."}, {"username": "Lisa Abrams Argento", "comment_text": "We did it in June, had a wonderful day. Took the train."}, {"username": "Trish Ellis", "comment_text": "We put that trip off for several trips to Florence. Finally we got to Lucca and discovered the train station is just outside the wall!!! Easy 45 min trip from Florence and so worth it!"}, {"username": "Theodore Meyer", "comment_text": "Train. Go early and stay late. Lucca is fabulous. We spent 2 weeks there."}, {"username": "Penny Cato", "comment_text": "We went a few years ago took the local train. Florence to Lucca. Not a very long trip A very enjoyable day 🇦🇺🇮🇹🥂🥂"}, {"username": "Daisy Yoo", "comment_text": "We are doing a Pisa/Lucca day trip"}]}, {"id": "2201517040247374", "text": "Fly virtually to Sicily! Our expert guide will lead you on a virtual journey through this beautiful island, to explore the most beautiful places of Sicily.\n\nJoin our virtual experience: आणखीhttps://nextstop-italy.com/virtual-tours/best-of-sicily/\n\n#medievalart #italytravel #italyiloveyou #virtualworld #italytrip #vacationmood #sicily #sicilylove #sicilyitaly #sicilytravel #sicilyessence #sicilytourism #sicilypictures #TAORMINA #taorminasicily #cefalù #cefalusicily #ValleyoftheTemples #syracuse #ortigia #ortigiaisland #palermo #palermo #archaeology", "link": "facebook.com/groups/1373361046396315/permalink/2201517040247374/", "likes": 16, "comments": []}, {"id": "2201126683619743", "text": "Planning a +-17day family trip to Italy from Cape Town in june/july 2024- mom, dad, kids 12,16,18.\nIs it too soon to book stuff? Plan to do alot!\nPlan to book air tickets in next month. Have my towns/cities mapped out, I think. I LOVE every comment and all the suggestions, and LOVE doing homework re spots and daytrips etc.\nI also think staysआणखी (airbnb/booking.com) will have cheaper options the sooner I book (remember our Rand is almost 20 to the euro, so planning on the budget is crucial!\nMight spam all the Italy groups soon for tips and advice! Never been to Italy... But 3y ago Germany.", "link": "facebook.com/groups/1373361046396315/permalink/2201126683619743/", "likes": 0, "comments": [{"username": "Melanie Matthews Stuprich", "comment_text": "You can try booking stuff but a lot might not be open yet for booking. Especially rentals."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "I’m going next July and I have half of the accommodations already booked. I’ll book my flight as soon as it opens (11 months ahead). I use frequent flyer miles for air, so those cheap seat sell out very quickly. There are so many train tickets and museum tickets that don’t open up until right before you go, so I love to get hotels etc booked early (with free cancellation of course). It relieves a little stress for me and sometimes early bookings get a discount."}, {"username": "Alessandro Iannelli", "comment_text": "Generally speaking, the earlier the better, you will save money for both airfare and also (to a minor extent) for accommodation. But for many things (museum tickets, train tickets, and other stuff) you will have to wait one or two months before the trip. You didn't say where in Italy you want to go though. :)"}]}, {"id": "2201496743582737", "text": "Looking for Vatican tour in Spanish and English. Any suggestions? I’m American and my wife and her daughter are Colombian. We live in Colombia and my Spanish is high intermediate, but not enough to listen to a detailed tour and understand it all. Grazie! 👊🇨🇴🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2201496743582737/", "likes": 0, "comments": [{"username": "Gianna Onesi", "comment_text": "Try Get your guide"}]}, {"id": "2193978441001234", "text": "Siracusa", "link": "facebook.com/groups/1373361046396315/permalink/2193978441001234/", "likes": 4, "comments": []}, {"id": "2200286827037062", "text": "Calamari, limoncillo spritz with a view. Bellevista Hotel Menaggio.", "link": "facebook.com/groups/1373361046396315/permalink/2200286827037062/", "likes": 821, "comments": [{"username": "Mardi Lee", "comment_text": "Perfect"}, {"username": "Alecia Hampton Serrano", "comment_text": "Yes please"}, {"username": "Rachel Hart Hagler", "comment_text": "Shana Rüegg yes please"}, {"username": "Cindy Breneman Hattrich", "comment_text": "Yummmm. I don’t like calamari much but I would eat some of this"}, {"username": "Steve Griggs", "comment_text": "Si per favore!"}, {"username": "Dawn Farrell", "comment_text": "Is it against the rules to mention the name of a restaurant on this site?"}, {"username": "Gabby Tye", "comment_text": "Jacqui Larsson this looks amazing 🤤"}, {"username": "Suzy Shaw", "comment_text": "Amelia Bonannella I’m ready !!!"}, {"username": "Caroline Dombey", "comment_text": "Yum"}, {"username": "Virginia Speedy", "comment_text": "Was this in Cinque Terra?"}, {"username": "Lisa Hry", "comment_text": "Salivating"}, {"username": "Babet Vosdingh Bessem", "comment_text": "Babet Vosdingh Bessem"}, {"username": "Denise Colls", "comment_text": "Lorenzo Fazzini, waiting waiting waiting"}, {"username": "Brigitte Van de Kimmenade", "comment_text": "Brigitte Van de Kimmenade"}, {"username": "Lynne Roe", "comment_text": "Guessing I don't learn ?\nOrdered twice in Portugal , both times came from a frozen box .\nSoooo , looking forward to Greece in September !"}, {"username": "Goran Gogic", "comment_text": "Mmm"}, {"username": "Sandra Kelly", "comment_text": "Respectfully- it’s called Limoncello.\nLooks great 😊"}, {"username": "Jo Bourke", "comment_text": "Scarlett Mcinnes this is us"}, {"username": "Kara Tathem", "comment_text": "Michelle Power - Italy 2025 !"}, {"username": "Michelle Forbes", "comment_text": "Mick Forbes Dee Bee seriously,this is what im talking about 🥂"}, {"username": "Linda Lloyd Bowles", "comment_text": "Yummmm"}, {"username": "Joanna Sotiropoulos", "comment_text": "Yummy 😋 views not bad too 😆"}, {"username": "Jennifer Cutts", "comment_text": "That looks delicious 😋Jessica Woodford"}, {"username": "Goran Gogic", "comment_text": "Goran Gogic"}, {"username": "Marie La Rocca Oppy", "comment_text": "Love limoncello"}, {"username": "Nicolas Jbn", "comment_text": "Pauline Archer"}, {"username": "Linda Miller", "comment_text": "Love limoncello spritz 🍋🍋🍋"}, {"username": "Joanne Sue Leach", "comment_text": "I’ll take what she’s having 🤤"}, {"username": "Rhona Veisfeld Modugno", "comment_text": "Can't go wrong!!"}, {"username": "Gino Stumpo", "comment_text": "Yummmmmmmm!"}, {"username": "Mariposa Mariposa", "comment_text": "Beautiful cheers 🥂 🇮🇹"}, {"username": "Dorothy Bush", "comment_text": "Chloë Bush calamari looks great. ❤️"}, {"username": "Julie Hinge", "comment_text": "Looks wonderful! Where is it?"}, {"username": "Shelley Wertz", "comment_text": "Amy Currie - me and you gf! One month away! ♥️🍋"}, {"username": "Lisa R Royster", "comment_text": "Heaven!!"}, {"username": "Linda Miller Ball", "comment_text": "It doesn’t get any better than that!! Enjoy !"}, {"username": "Agneta Danielsson", "comment_text": "Looks delicious 😋"}, {"username": "Angela Humbles Searcy", "comment_text": "Your calamari looks better than ours did when we ordered it. We got the whole squid and it was NOT good!"}, {"username": "Beth O'Riley Weaver", "comment_text": "Love this post!!!!"}, {"username": "Nicole Webb", "comment_text": "Where is this?!"}, {"username": "Linda Yahn", "comment_text": "The spritz sounds delish"}, {"username": "Valerie Barbeau", "comment_text": "I like mine a little thinner 🤷🏻‍♀️"}, {"username": "Gabrielle Condon", "comment_text": "Caitlin LOOK AT THAT CALAMAD"}, {"username": "Simone Pfenninger", "comment_text": "Simone Pfenninger"}, {"username": "Margarita Nechaeva", "comment_text": "🙈😍😍😍😍😍😍😍"}, {"username": "Laura Rehberg", "comment_text": "Charlotte, what restaurant is this from? Looks delicious!"}, {"username": "Gayle Puiia McDevitt", "comment_text": "Gayle Puiia McDevitt"}, {"username": "Sara Kyle Hargett", "comment_text": "Best calamari"}, {"username": "Lorraine Baker", "comment_text": "Lorraine Baker"}, {"username": "Aneta Małyszko", "comment_text": "Moje ulubione 🥰"}, {"username": "Donna Winters Samford", "comment_text": "Yum!"}, {"username": "Maggie Baker", "comment_text": "Fab!"}, {"username": "Louise Faggioni", "comment_text": "Where is this??"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Limoncello i guess"}, {"username": "John Selvaggio", "comment_text": "Reminds me of lunch on our hotel balcony in Lake Como (less the calamari)!"}, {"username": "Denise Incandela Boccio", "comment_text": "Looks delicious 😋🇮🇹"}, {"username": "Brenda Manalan Strong", "comment_text": "Yum"}, {"username": "Krysti Birch", "comment_text": "Maddy Miller"}, {"username": "Karen Ackerly", "comment_text": "😋"}, {"username": "Margaret Sleep", "comment_text": "Margaret Sleep"}, {"username": "Mary Heller", "comment_text": "Jenny Heller Morehouse\nShow Addison!"}, {"username": "Diane Hamilton", "comment_text": "Looks delicious 😋\nView stunning 🇮🇹"}, {"username": "Fanie Bekker", "comment_text": "I can taste it 😋"}]}, {"id": "2200494810349597", "text": "**Edit-Sarcasm coming in hot! **Saldi is my favorite store in Italy! Great markdowns, and you can find them everywhere.", "link": "facebook.com/groups/1373361046396315/permalink/2200494810349597/", "likes": 23, "comments": [{"username": "Simone Pfenninger", "comment_text": "SALE"}, {"username": "Cecilia Christine Costantini", "comment_text": "My great-aunt (Italian) married an American soldier in the 50s and moved to the US, Minnesota, with very little knowledge of English. She sent a letter home to her mom saying there were so many shops selling SALT (sale means salt in Italian) and it was because it was snowing a lot! 🤣🤣🤣🤣"}, {"username": "Lisa Hartert", "comment_text": "😂"}, {"username": "Lisa Howard", "comment_text": "Where are their stores please? I've googled SALDI and all I get is its the Italian word for SALE 😂"}, {"username": "Marg Ryan", "comment_text": "🤣🤣🤣"}, {"username": "Sally Warren", "comment_text": "Laughing because Saldi means Sale. It’s not the name of a shop."}, {"username": "Alessandra Pasteris", "comment_text": "Saldi isn’t a store name but it indicates that the store is having a sale."}, {"username": "Oriana Delle Cave", "comment_text": "Oriana Delle Cave"}, {"username": "Sigrid Cormier", "comment_text": "The sign by the shoes is Mori & Bozzi."}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}]}, {"id": "2200736030325475", "text": "Another question … on our trip we are taking the royal Caribbean cruise out of Citivecchia Rome.. I have found that the train can be taken there but leaves you 1 1/2 mile from the port …any knowledge of shuttles? Don’t think with thousands of people getting off that train for the ship not much chance of a taxi ride !! Anyone done this before ?", "link": "facebook.com/groups/1373361046396315/permalink/2200736030325475/", "likes": 1, "comments": [{"username": "Leslie BC", "comment_text": "There's a port bus that should take you to there"}, {"username": "Flavia Coughlan", "comment_text": "The port provided shuttle bus costs 6 euros per person and takes you from the train station to the cruise ship terminal check in point. At times there are very long lines to board this shuttle bus. You should also know that trains in Italy are frequently delayed or canceled due to strikes.\n\nAlternatively you can book a bus from Rome to the Cruise ship terminal through Get Your Guide for 15 euros per person and from the drop off spot you take the free port shuttle (no wait time) to the terminal checkin point."}, {"username": "Ken Lerch", "comment_text": "We walked from our apartment in the campo dei Fiori over to the taxi stand on vittorio Emmanuel, found an amendable taxi driver, a woman , negotiated for her to come to our apartment in two days at a specific time to drive to the cruise port. With two people and luggage it worked perfectly. If it had failed we thought we could walk over to the stand and negotiate a ride on the spot."}, {"username": "Nadia Filice", "comment_text": "There are no taxis in Civitavecchia! I learned that the hard way. Most cone down from Rome area and drop off."}, {"username": "Mandie Cowan", "comment_text": "We walked from the train to the port. It’s not terribly far or complicated."}]}, {"id": "2200836503648761", "text": "I see lots of posts on here relating to mainland Italy but need some ideas for Scilily please. We are 4 OAP's staying in Palermo for a week in August. What are the best day trips & as we'd like to spend one day at the beach where's a good one to go to.", "link": "facebook.com/groups/1373361046396315/permalink/2200836503648761/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Palermo?"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Beach go to Mondello, make sure to visit Palazzo dei Normanni, Cattedrale di Monreale, the markets of the city center.\nYou can do many one day trip: Erice, Segesta, Zingaro, Trapani, Agrigento, Piazza Armerina, or even a boat tour to Egadi islands.\nSome of them are a full day trip in many different places (all great), so it really depends on your interests."}, {"username": "Sigrid Cormier", "comment_text": "If you have an interest in ancient history. Book a day tour to Valley of the Temples AND Villa Romana del Casale (renowned for its mosaics). If interested look for tour that picks and drops off either at your hotel or very close. It’s a long day about 10 hrs"}]}, {"id": "2200840073648404", "text": "So I’m turning 40 in end April and always wanted to see spring in Switzerland. Looking at Flying into Zurich then heading to Italy Looking at bernina express, and how to incorporate it when commuting from Zurich towards Milan. Notice most posts talks to going from Italy direction, if you have gone from Switzerland direction please share your experience.\nChecking if it will be too much as we traveling with a 5 year old.", "link": "facebook.com/groups/1373361046396315/permalink/2200840073648404/", "likes": 2, "comments": [{"username": "Neaţă Maria", "comment_text": "Check the train connections from Tilo https://\nwww.tilo.ch/en/\ncollegamenti/\ntilo-pigiama.htm\nl"}, {"username": "Katia Macri-Roberts", "comment_text": "I’ve travelled from Lausanne to Milano on the train. Took about 2 hours. I flew in to Geneva from Heathrow and took a private car to Picturesque Lausanne. Absolutely beautiful."}, {"username": "Christine Martin Ross", "comment_text": "We are currently in Tuscany - we flew direct into Zurich from Boston. We took the train to Milan then switched lines and our first stop was Florence. Fairly seamless - we had bought our tickets ahead of time online , it made the time in the train stations a little more relaxed"}, {"username": "Andrea Bainbridge", "comment_text": "We did the reverse. Train to Torino, pick up Bernini Express. We got off in Chur and spent the night. Easy train to Zurich"}, {"username": "Sigrid Cormier", "comment_text": "We took a tour from Zurich to Zermatt, it truly was the most memorable trip I’ve ever taken. You won’t be disappoint. And the trains going through the alps is breathtaking."}]}, {"id": "2200973806968364", "text": "We have arrived in Milan. Room with a view. Antica Locanda Dei Mercanti Hotel", "link": "facebook.com/groups/1373361046396315/permalink/2200973806968364/", "likes": 38, "comments": [{"username": "Tracy Foss", "comment_text": "This looks amazing where are you staying ?"}, {"username": "Melissa Rego", "comment_text": "Which restaurant is the first photo from?"}, {"username": "Shula Hurvitz", "comment_text": "🇮🇱🎯🇮🇹"}, {"username": "Anne Murphy", "comment_text": "Hi ..where is your accommodation please.."}, {"username": "Ptt Hotay", "comment_text": "Ptt Hotay"}]}, {"id": "2201025116963233", "text": "Best walking shoes lol keep reading there's alot of walking and everyone gets blisters. looking for sneakers for men and women brand thank you", "link": "facebook.com/groups/1373361046396315/permalink/2201025116963233/", "likes": 5, "comments": [{"username": "Andrea Karina Niazi", "comment_text": "Brooks"}, {"username": "Monique Swanner", "comment_text": "My husband has some Skechers airwalks that he loves and they look really nice. I wore my af1s and the only day I got blisters was when I put my wet feet after swimming into them without socks (so totally my fault)"}, {"username": "Heidi Hutson", "comment_text": "On Cloud Surfer"}, {"username": "Pauline Richardson", "comment_text": "Loewe.\nSale on at Great outdoors."}, {"username": "Marilyn Mercier", "comment_text": "On shoes 👌👌👌"}, {"username": "Lisa McCusker Sherer", "comment_text": "Dankos -- broken in!! I have 2 pairs of canvas sneaker style- I wore black for dress up and had different for day--- they have great styles- but must be broken in"}, {"username": "Sylvia Martens", "comment_text": "Skechers"}, {"username": "Kim Grace", "comment_text": "Skechers or Nike all day"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Taos walking sandals"}, {"username": "Jaime Cleek", "comment_text": "Wear what are comfortable for you now"}, {"username": "Tammy Brende", "comment_text": "HEY DUDES!!! Most comfortable shoes I have ever owned!!!!!"}, {"username": "Nicole Beaumont", "comment_text": "I wore Adidas Stan Smiths for 3 weeks, brought sandals but didn’t end up wearing them."}, {"username": "Mary Heim", "comment_text": "I wore my Chacos sandals, great arch support, adjustable, good traction. Great for sun and rain."}, {"username": "Bonnie Loftspring", "comment_text": "I’m wearing SAS Sandals, FULL support, 3 straps, cushiony, no rotation of foot or movement in ankle, very important & I alternated w ARA sneakers. My feet get hot so that’s burning, I need options. All the men we wearing OnCloud. I mean All the men. Many women too."}, {"username": "Vanessa Durkin", "comment_text": "Love my toms just like gloves on your feet so comfortable i have to be very careful that shoes dont rub as have diabetes and these shoes are fabulous I currently gave three pairs one sirt of animal vibe one ice blue and a black pair"}, {"username": "Mimi Mary", "comment_text": "I wore sketches sneakers past 12 days,my feet never bothered me,I had sandals with me but didn't use walking on the streets was better with sneakers."}, {"username": "Sandy Michelle Duggan", "comment_text": "I had comfortable saddles but heat made them rub, bought scetchers in venice, changed my life, I know it's great to match and look great, nothing wrong with sneakers and a dress, every 2nd person wearing this, comfort is so important, so hot, so much walking, so many stairs, so worth it."}, {"username": "Julia Muller", "comment_text": "On Cloud - both my husband and I took some to Europe for our 4wk trip (been home two weeks😭) and absolutely loved them. Super light and comfortable, took no wearing in time. I had lower back surgery last March and a reoccurrence of my injury in Sept, so had to be really careful with my footwear this trip, and these were brilliant. Couldn’t recommend highly enough!"}, {"username": "Kathy Damaren Ingram", "comment_text": "Sketchers have never done me wrong( just like a country and western song! Lol)"}, {"username": "Bridget Gieseke", "comment_text": "You’re socks are just as important as your shoes… when it comes to preventing blisters"}, {"username": "Sande Ricci", "comment_text": "I have bad bunions and shoes are really hard for me. I bought some cheap Puma's at Costco. They were great. Shoes are personal. Everyone's feet are different"}, {"username": "Lexington Niteli", "comment_text": "100% Brooks. My life changed when i started wearing their Ghost line, no more pain, can't imagine walking more than a mile in anything else."}, {"username": "Sharon Roberts Crossley", "comment_text": "Brooks"}, {"username": "Anthony Sperduti", "comment_text": "Sketchers are the best"}, {"username": "Cindy Corrigan", "comment_text": "On Cloud!! Literally like walking on a cloud - most comfortable shoes I’ve ever owned - I have 4 pairs now in different colors!!"}, {"username": "Yvette Zavatero", "comment_text": "No matter what shoe you choose wear them for a few weeks before your trip to break them in."}, {"username": "Gillian Miller", "comment_text": "Arcopedico. I walked Petra approx 28kms no problem. Can throw in the washing machine and have arch support also. They are made in Portugal I think"}, {"username": "Yhele Apidga", "comment_text": "VESSI, the best. It’s also waterproof. I can’t recommend it enough."}, {"username": "Sam Mah", "comment_text": "Make sure if you buy sneaker type shoes that they are not overly flexible (you shouldn't be able to twist them easily) as you need support so you don't have foot problems. We had to get new ones due to very bad heel pain and the guy at the shoe store was super helpful and the new sneakers help a lot."}, {"username": "Carol Hayes", "comment_text": "Merrell are so comfortable"}, {"username": "Shelley Phillips", "comment_text": "I’ve used Saysh brand a couple of years now. I walk hundreds of miles every year. Never a blister. If you don’t know the brand check them out. Designed and marketed by Allyson Felix, Olympian."}, {"username": "Diane L. Martin", "comment_text": "Brooks"}, {"username": "Kristen Taylor", "comment_text": "Hokas all the way!"}, {"username": "Paraone Gloyne", "comment_text": "Shoes are a personal preference due to size style type of foot etc. You can answer this question yourself. Try some shoes on."}, {"username": "Christine Martin Ross", "comment_text": "Danskos"}, {"username": "Jane Coutts", "comment_text": "Hoka -"}, {"username": "Hollie Barcheck Juersivich", "comment_text": "Hoka"}, {"username": "Teresa Zagari", "comment_text": "Go to a running store and get fitted for a good pair. It will be different for everyone"}]}, {"id": "2201034146962330", "text": "If I only had 8 days in Italy what would be an absolute must see and do? It will be our first time going to Italy. It will likely be next summer as that’s when I’m off work.\nHow long is enough in each place? Where should we stay? Thinking 2-3 places and day trip from there. Rome is a must. It’s my husbands only input.\n\nRome\nVenice\nFlorence\nAlmafi Coast\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2201034146962330/", "likes": 14, "comments": [{"username": "Laura Torres Palomino", "comment_text": "Well, you have to see Rome…the ruins, the Vatican…are an absolute must. And take a day trip to Tuscany. Don’t waste your precious time traveling to far off places, trying to cram them all in to 8 days, it will be so hectic you won’t even remember them! Save those cities for another trip. Enjoy Rome!"}, {"username": "Grace Sulsenti", "comment_text": "Sorrento!!"}, {"username": "Abe Michelson", "comment_text": "8 days. Two places. Tops. Anything more you are spreading yourself to thin. Honestly Rome & Florence or Rome & Venice. Florence & Venice. Rome & go to Sorrento-you coujd do day trips to the Amalfi coast, Naples & Pompeii. If you did 4 days there."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Best to visit as soon as you can in Summer. It’s especially hot n crowded into July and August.\n\n8 days…I’d stick to either North (Venice, Florence, Cinque Terre or Tuscany). I’d fly into Venice do 3 nights…5 nights in Florence with day trips to Tuscany and Cinque Terre. Or 3 in Florence and 2 in CT. Fly out of Florence.\n\nOr South\n(Rome, Amalfi Coast). 3 in Rome, 4 in Amalfi. Hub yourself out of Sorrento in Amalfi Coast for best logistics to day trip to other villages/\nCapri.\n\nSpreading oneself too thin with long travel in between won’t give the best experience."}, {"username": "Bill Casper", "comment_text": "We are doing the following:\nVenice- 2 days\nFlorence- 2.5 days\nRome - 4 days\n8.5 days. Perfect for us. Easy two hour train from Venice to Florence and 1:35 from Florence to Rome. We fly into Venice from paris at 8:45 am and fly out of Rome to Madrid at 8:25pm to maximize our days."}, {"username": "Phyllis Snyder", "comment_text": "It would depend on time of year- if it was during Christmas time- definitely Rome! They go all out! In warmer months lake commo."}, {"username": "Sandy Michelle Duggan", "comment_text": "venice, Florence, sorrento"}, {"username": "Enas Mourad", "comment_text": "I’ve stayed in Milan for 3 nights 4 days and made a wonderful days trips, day trip to Venice, lake como, Lugano and st’ Moritz Bernina express in 2 days and full day in Milan and took the train to Florence spent one day which is not enough at all but at least I’ve seen that beautiful city then 4 days in Rome doing major sight seeing with day trip to Naples and capri and day trip to amalfi and positano you may not have the chance to get the full flavor of each place but you will still enjoy it"}, {"username": "Kate Carberry Ansart", "comment_text": "With 8 days, I would do 4 in Rome and 4 in Florence! There is so much to see and do in those cities! You could do a day trip to the Chianti region of Tuscany from Florence to experience the hills, vineyards, little villages and wineries. Otherwise, stay in the cities and really experience them."}, {"username": "Debbie Jones Schilling", "comment_text": "Thanks for all the help."}, {"username": "Linda Devin", "comment_text": "Venice has become so congested with tourists. If that is a turnoff. Florence is wonderful but the heat is awful in the summer. Do your homework. Rick Steve Italy a great start."}, {"username": "Hollie Barcheck Juersivich", "comment_text": "Sorrento, Napoli, Almafi Coast"}, {"username": "Laurie Frainetti", "comment_text": "With 8 days, I would stick to Rome & Amalfi! You get get history and beach town! You could fly into Venice and do a day there before training in but it’s tight."}, {"username": "Eugene Klein", "comment_text": "Debbie for 8 days you should not change locations and hotels more than once, if at all. My personal view shared by many is that Venice is overrated and it is also far compared to other places. So, best is to either stay in Rome or spend 4-5 days in Rome and rest in Florence"}, {"username": "Margi Haberli Kvitek", "comment_text": "Pisa for The Tower. Always been a high light for me."}, {"username": "Meredith Williams", "comment_text": "save amalfi coast for your next trip! we had 3 full days on rome! wish we’d spent more time in florence w more day trips! venice was magical but 2 days is plenty there imo! enjoy!"}, {"username": "Lisa Martinson", "comment_text": "Cut out one or two areas go to Rome, Amalfi coast & maybe Florence. There’s too much to see in only 8 days."}, {"username": "Marc Chomel", "comment_text": "Just do Rome. And maybe go down to Sorrento for two days."}, {"username": "Angie Stanard", "comment_text": "We go in September and are doing 3 nights in Florence, 2 nights in Rome, and 4 nights in Sorrento. Booked high spots trains and private transfers to cut down on commute time. I’m hoping it’s a good mix. We fly into Florence and out of Naples."}, {"username": "Mahalia Agustines", "comment_text": "Jaime Agustines"}, {"username": "Anne Lonergan", "comment_text": "I would recommend 3 days in Rome and the rest in Florence. From Florence u can explore Tuscany in day trips eg Sienna and San Gimenano maybe also Lucca and Pisa. All fabulousa d close to each other. Do Amalfi coast, Sorrento, Pompeii and even Sicily etc on another trip to the south. All wonderful"}, {"username": "Mj Gianninoto D'Agata", "comment_text": "Has anyone ever used a tour company to visit Italy?"}, {"username": "Alexandra A Welker", "comment_text": "Rome (3 nights), Florence (3 nights) and Venice (1 night): they are all so different and charming in their own way."}, {"username": "Colleen Lee", "comment_text": "Trying to cover the Big 4 during peak season is going to be exhausting in the extreme, taking into account you're planning all those travel days, taxis, railway stations, hefting luggage about, checking out before 10-10.30 am checking in @ 2pm, day trips from the place you are staying, all in 8 days, does that mean arrival on day one departure on day 8? Can you see where I am coming from? Fly into Rome enjoy Rome, there is so much to see and do in beautiful Rome (stay in the city centre if you can't walk to Trevi fountain, piazza Novona, Colosseum you're too far away. Do one day trip if you must. Take the fast train (you will get a quick look at Umbria and Tuscan countryside and hilltop towns on the way) to Florence, repeat what you did in Rome, fast train back to Rome the night before departure. I am still to understand why so many people go to Rome or any other destination and spend their time running away every day, relax and enjoy where you are. I have been to Italy many times for 3 to 4 weeks at a time, trust me you do not want to be an expert on taxis, trains or even worse driving in Italy . Slow down, literally smell the roses🌹, taste the wine🍷, enjoy your food 🍝, take in the atmosphere, look around you, feel Italy. Personal opinion. Whatever you do, enjoy your trip and travel light. 😁"}, {"username": "Claire Drolet", "comment_text": "We did a 14 day bus tour the first 2 weeks in June and got to see so many places. Began and ended in Rome seeing everything in between, north towards Lake Maggiore then down to Amalfi and Capris. We experienced so much culture and beauty, met wonderful people. We’ll definitely be going back, also at a much slower pace to enjoy areas such as Tuscany, CT, Amalfi and Capris, too many to name and not all at once."}, {"username": "Kristy Hanks Strickland", "comment_text": "Do Rome and Amalfi only or Rome and Florence only. We did 2 weeks with 5 nights in Rome then the next 8-9 days down in Sorrento to do Capri, Pompeii, Amalfi, some beaches etc. then 2 years later we flew into Venice 3 nights, Italian Riviera and Cinque Terre 3 nights, Florence 5 nights, on to Rome to stay 2 nights and fly home. This trip we are flying into Venice for 5 nights in lake Garda, then 2 weeks in a villa in Tuscany with day trips all over central Italy, then 3 nights in Florence (we love returning to our fave restaurants shops and sights) on to Venice for 2 nights and home. Our next trip will be Sicily, Puglia and over to Croatia or Greece."}, {"username": "Elena Eckley", "comment_text": "Is that 8 full days not including travel days? If so Rome, Venice Florence in this order"}, {"username": "Shelly Kentner Lehman", "comment_text": "If Rome is a must then I’d do Rome and Florence. If I could only do 2 places I’d do Sorrento and Florence or just stay on Almafi coast. And Sorrento. Sorrento my favorite. I did like Florence too. I didn’t get to see Venice but would love to some day"}, {"username": "Margo Williams", "comment_text": "Amalfi for sure…..beautifu\nl!!! 👍🏻"}, {"username": "Margo Williams", "comment_text": "Amalfi for sure. 👍🏻😊 possibly take the train or a coach bus…driving is crazy there. Sorento is also lovely for an overnight on the way to Amalfi. 💜"}, {"username": "Carine Brys", "comment_text": "wow, difficult question. Those are far apart and almost each worth a trip. I've visited them all, over several trips, except for Florence, so I cannot judge about that. Based on my experiences: Venice for a day or 2 and then Rome for a day or 4. If you are going off-season: I loved Sorrento/Capri/\nPompeii and the Amalfi coast. Reason being that the temps are nicer spring and fall, and fewer tourists then. The first 2 are more cultural, the later more focused on natural beauty. That, only you can answer. Beware of crowds!!!"}, {"username": "Donna Austin Jones", "comment_text": "That’s an ambitious schedule. You will lose most of a day traveling between locations. If you only have 8 days, consider two locations. Rome and the Amalfi Coast or Florence and Venice for their proximity to each other."}, {"username": "Meghan Tan", "comment_text": "8 days is not enough for all of the locations you listed. I would pick two that way you have enough time and don’t feel rushed."}, {"username": "Gelinda De Grandi", "comment_text": "Too much destination. In my opinion, you should choose between Rome-Florence (and maybe Pisa) or Rome-Naples-Ama\nlfi coast or Florence-Venice\nand maybe garda lake or Padua/Bologna… In summer you have also to consider high temperature, for example last week there were 38-40 C degrees in Rome, I would prefer to be near the sea with these temperatures instead to around building"}, {"username": "Fetchin Gretchen", "comment_text": "Rome and Florence and a day trip from each...maybe Pompei frim Rome and Tuscany wine and food tour frim Florence."}, {"username": "Elisa Bernstein Wolfe", "comment_text": "We just went for 8 nights and saw the Amalfi Coast (3 nights in a hotel in Sorrento), Florence (2 nights there) and Rome (3 nights). It was very doable but we would have loved another day in Florence. I’m glad we didn’t try to squeeze in another city."}, {"username": "Lisa McCusker Sherer", "comment_text": "Capri wish I had 3 days\n( sat at top of the cage and just loved it)) I felt so rushed. We were there for 5 hours\n\nVenice- same We had 1 day (( take private tours)) I could of added another-\nIt's just so lovely to sit in st.msrks square listen to music, lunch, people watch and enjoy-- there is NO rush I'm italy-- lunch can be 2 hours-- dinner starts at 8pm\nWe ate at 630- place was empty- didn't leave til 9 and owner told me why was I rushing??"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Just do Rome and Florence, maybe add Venice. Not much time for day trips unless you really want just a glimpse of what you are seeing."}, {"username": "Steve Wolfrom", "comment_text": "Are you looking for a beach experience? Are you interested in history or art or religion? Tell us what you hope to gain from the trip, and people can tell you the best places for what you’re interested in. No two people are alike."}, {"username": "Steve Wolfrom", "comment_text": "Please people, read carefully. She is not suggesting that she visit all four places. ￼"}, {"username": "Daisy Yoo", "comment_text": "8 days is not enough, we stay in rome for 5 and I wish I could have do 7. so for me I will do at least 4 in rome and 4 in florence and use florence as ur second base and u can do lucca/pisa one day trip, san G/siena as one day trip, and venice as one and that is if u also leave from florence. but that is just me."}, {"username": "Christy Balding Holden", "comment_text": "Bologna is a great “hub” because you can take day trips to Venice, Florence, etc, plus it’s a fantastic city with amazing food markets. I took a cooking class. Amalfi coast was my favorite. Sorrento, positano, ravello are so gorgeous and great shopping. Rome is stunning from a historical and architectural perspective. You can’t go wrong no matter what you decide but don’t cram in too much and enjoy."}, {"username": "Anne Brooks Easter", "comment_text": "I would say 3-Florence, then 3-Sorrento and finish in Rome-2. Fly into Florence and out of Rome."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201070533625358", "text": "while since I posted pic from our trip. Here's stained glass window from duomo in Siena", "link": "facebook.com/groups/1373361046396315/permalink/2201070533625358/", "likes": 68, "comments": [{"username": "Keryl Lesley Edwards", "comment_text": "Wow!"}, {"username": "Andrea Romano", "comment_text": "Hope I get to see this in person!"}, {"username": "Gaye Watkins", "comment_text": "I think Sienna was my favorite city…..right up there with Florence. We walked all over Sienna. We had a short time there one day, but liked it so much we went back and spent a day. It’s just unique. AND, it wasn’t raining, and there was no one there, End of February. I’d go again at that time."}, {"username": "Renae Larcus", "comment_text": "This Duomo is our favorite! Amazing!!"}, {"username": "Norma Kalberer", "comment_text": "Amazing Siena. Siena is divided into 17 \"contrade\" - neighborhoods, each w/their own church, museum, songs, symbols, mottoes, and govt.bldgs, leader, and patron saint."}, {"username": "Robert Bélair", "comment_text": "Robert Bélair"}, {"username": "Shirley Lewis", "comment_text": "I believe this is in the Opera del Duomo in Siena, not the church itself ... beautiful!"}, {"username": "Luanne Carey", "comment_text": "We loved Siena. Climb the tower for the best view!"}, {"username": "Tari Lawson", "comment_text": "Beautiful."}, {"username": "Bec Billy Dodds", "comment_text": "Ronnie Bowkett we should look here"}, {"username": "Liz Anne", "comment_text": "Such a beautiful city!"}, {"username": "Phyllis Snyder", "comment_text": "I’m spend 2 days in Siena- can’t wait!beautiful photo!"}]}, {"id": "2201071546958590", "text": "Hi, I am from India and shall visit Italy from 27th Sept'23 to 9th Oct'23 with my friend. Both of us are 63 yrs old and it'll be our first visit to any country in Europe. We are scared of pickpocketing there, although it's common in our country too. Can you pl tell me whether we have to deposit our mobile and other belongings before entering any museum there? If so, we have to leave our valuables in hotel for that day. Thanks a lot!", "link": "facebook.com/groups/1373361046396315/permalink/2201071546958590/", "likes": 1, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "You don't have to deposit anything, unless you carry huge backpacks. A few museums might not let you carry big bags or have you carry your backpack in the front (not on your back). Anyway, I always carry a small totebag in my backpack, so if I don't want to carry my backpack / if it is not permitted, I will put my wallet and mobile in the totebag, even better to walk around museums without heavy bags"}, {"username": "Rhona OConnor", "comment_text": "Don't bring valuables in holidays, then you can't be robbed. Pickpockets look for easy targets, so just keep your stuff safe and don't make it easy for thieves. Jackets with zip pockets make it difficult for them if you don't want a backpack pack. Enjoy your trip."}, {"username": "Alice Francesca", "comment_text": "Careful on the street or in the metro.Pickpocke\nting is not that common, but it can happen"}, {"username": "Alessandro Iannelli", "comment_text": "Keep your bags zipped, don't leave them unattended even if for just a minute. Open your eyes in the metro or crowded trains. Be wary of people getting too close to you. If you follow these basic security rules, you will almost certainly be fine. Also, remember that this is a HUGE group, with half a million members, so it's statistically almost inevitable to read every once in a while about someone being pickpocketed."}, {"username": "Roland Trego", "comment_text": "Sometimes they scan your possessions in security. Often they tell you you must wear your backpack in front."}, {"username": "Vanessa Durkin", "comment_text": "Its the main thing I'm worried about tbh especially when vulnerable and elderly too you feel.like a walking target"}, {"username": "Sigrid Cormier", "comment_text": "Bring a light jacket with a zippered inside pocket for your cash/CC and if your carrying your passport. Or buy a waist money best and wear it under your clothes.\nHave fun!"}, {"username": "Phyllis Snyder", "comment_text": "Pickpocket crimes are due to unaware distracted tourists- simple anti theft tactics are easy to do. Keep your belongings in a secure place- in a zipped front body bags worn across your chest, keep cc & cash in a money belt under your clothing. Don’t accept random strangers help- don’t engage in unsolicited conversation or sales people on the street. Remember that the thieves are professionals and know how to pick out vulnerable people- and these thieves could look totally innocent- elderly, teens, children, mothers, well dressed, even looks like a fellow tourist! Crowded places are most often where thieves operate- especially public transportation and top sites. Just be prepared and you’ll be just fine."}, {"username": "Glenn Todd Webb", "comment_text": "You might have to take a large backpack off, but museum will provider a locker. Small backpacks may need to turn around to front. You can keep all your valuables with you."}, {"username": "Lisa Valdovinos", "comment_text": "We kept all our belongings with us while we were in the museums. We had been warned there would be pick pockets but never had a problem. Just be keen to your surroundings."}]}, {"id": "2201073763625035", "text": "Curious, are there blow dryers in the hotel rooms in Venice and Rome or do we need to purchase a dual voltage one?", "link": "facebook.com/groups/1373361046396315/permalink/2201073763625035/", "likes": 3, "comments": [{"username": "Sandy Michelle Duggan", "comment_text": "Yes there are"}, {"username": "Pam Neary", "comment_text": "Check your hotels description because it can vary vary from hotel to hotel but most decent hotels have them."}, {"username": "Janette YesPlease", "comment_text": "Every room or apartment we booked for three weeks of travel earlier this year had one. Although, some were not anything fancy more of a wall-mounted dryer without any attachments."}, {"username": "Hollie Barcheck Juersivich", "comment_text": "All the hotel room I stayed in provided blow dryers"}, {"username": "Yvonne Ormson", "comment_text": "Check with your hotel (s). Just like anywhere else—some do and some don’t."}, {"username": "Meredith Williams", "comment_text": "all hotels we stayed at had them but i emailed prior to confirm"}, {"username": "Stacey Esposito", "comment_text": "All the hotels we stayed at had hair dryers"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Every hotel we've been in so far this trip has had a hairdryer in the room."}, {"username": "Patti Porter", "comment_text": "Maybe…probably…\n.but, you need to contact your hotel and verify it with them that they have them"}, {"username": "Joshua Pickles", "comment_text": "Women in Italy are naturally beautiful and don’t use blow dryers. They just drive fast in an Alfa Romeo convertible."}, {"username": "Tara Roed", "comment_text": "The hotels in Sorrento and positano had really good ones! Better than expected. They also had usb outlets. My hotel in Positano even had an outlet I could use. The Airbnb in Rome had a decent dryer. It was hot and we mostly did headbands with ponytails and buns."}, {"username": "Vasthi Cheddar", "comment_text": "All the hotels we stayed at had them"}, {"username": "Lisa Martinson", "comment_text": "Yes ask at desk if not in room."}, {"username": "Phyllis Snyder", "comment_text": "Usually- but when looking at booking options be sure that’s an amenity."}]}, {"id": "2201073996958345", "text": "Do you recommend guided tours in Rome, Venice, Florence or navigating yourself with downloaded Rick Steves’ audio guides. I have already booked a guided evening tour directly through the Colliseum site and the Vatican early morning breakfast tour. Not sure if the other tours will be worth it. Travelling with my husband, 20 year old and teenager.", "link": "facebook.com/groups/1373361046396315/permalink/2201073996958345/", "likes": 37, "comments": [{"username": "Christine Carbone", "comment_text": "We are heading to Italy sept 15 and we do have some tours done in each city- more for front of the line- we did through viator"}, {"username": "Lisa Jones", "comment_text": "We loved the guided tour at Galleria Borghese, it was more like an art history lesson!"}, {"username": "Liz Anne", "comment_text": "Glad we booked tours. There was so much that we learned and stories that were shared. Also, with a guide you can ask questions, etc. We found them all very knowledgeable and happy to share their knowledge."}, {"username": "Janice Orebaugh Hannah", "comment_text": "I am doing guided tours. Just don't have time to research the particulars. Kudos to those who do! 🍻 👏 ✌️ 🥂"}, {"username": "Kelly Tabor", "comment_text": "We really enjoyed the golf cart tour of Rome. My 15 yr old and I. Chiara with Liv tours was amazing! Highly recommend."}, {"username": "Tammy Boarman", "comment_text": "Walks of Italy is amazing"}, {"username": "Lisa Martinson", "comment_text": "Tours. Always."}, {"username": "Alexandra A Welker", "comment_text": "It depends. We did a guided tour of the major attraction and we just wandered around the rest of the time."}, {"username": "Lynn Conklin Olson", "comment_text": "We did a golf cart tour and loved it! You can see a lot and they will show you the hidden places."}, {"username": "Jamie Bly", "comment_text": "For sure get a local tour guide. Then know the ins and outs and get you where you want quickly and seamlessly. We used walls tour for colosseum, Roman forum, palatine hill. And yourlocaltour guide for Florence (Maria) she was phenomenal. We use guide through Vatican."}, {"username": "Katharine McCoy", "comment_text": "Loved our golf cart tour in Rome and the electric bike tour in Florence"}, {"username": "Martha Hughes", "comment_text": "I LOVED LOVED LOVED walking all through Rome on my own, turning left when I saw something interesting, turning right when I wanted .. using Rick Steves audio guide, I missed nothing (Rome historic walk) .. but was able to go and do what I wanted .. esp. since I had Googlemaps! Saw so many places, neighborhoods, & parks, and went to so many restaurants, cafes, churches, etc. that I would never have seen \"on a tour\". Oooooh and gelateri!!"}, {"username": "Sandra Howard", "comment_text": "We did a few guided tours, Vatican and colosseum and they were great! Walking tour in Venice was horrible. We did Rick Steves tours in Florence and enjoyed those as well as the pantheon and a few others in Rome. The Rick Steves tour for Pompeii was horrible, do not recommend that at all!"}, {"username": "Elizabeth Dancy", "comment_text": "I booked tours every day but still left time to explore.\nEvery tour was amazing and depending on the activity- early entry to some of the most popular attractions is especially nice.\nFor example in Florence getting into the Duomo and to see David before anyone was so peaceful. You’ll spend less time waiting in line too.\nI took a small group Vespa tour to Tuscany with lunch and wine tasting. That was incredible!"}, {"username": "Joanne Nacson", "comment_text": "There’s lots of free walking tours too"}, {"username": "Michelle Mayer Fulfer", "comment_text": "We did an evening golf cart tour with Rolling Rome. Amazing!!!"}, {"username": "Sanjay Bhavnani", "comment_text": "It depends on the kind of traveller you are. If you like reading Rick Steve’s travel books which I think are great and you like figuring out the area yourself you can easily do it yourself for most of the important sights except may be the Vatican where a guided tour would be preferable . If you are the type of traveller who finds it very tedious to have a book in hand and read over whilst seeing the sight and explain it to all your family members then a guide is an absolute must. I personally prefer the former option because I love reading and explaining to people travelling with me. So it depends on each person individually."}, {"username": "Lori Crouch", "comment_text": "When we came to Rome 10+ years ago we splurged on 2 tours with Context Travel. They employ grad students and scholars. We did an orientation walking tour and an evening Vatican museum tour. The 2nd was especially worth it - the crowds were less, you got to cut the line and the museum can be overwhelming. The Sistine Chapel was breathtaking by candlelight. It was a bit amusing too. Our guide was a young attractive American who did research in the bowels of the Vatican Library by day so the guards knew her. My mother had mobility issues and our guide flirted with the guards to get her access to elevators and benches they didn’t usually let tourists use. She was also a font of knowledge about the art and artifacts. The tour was pricy but worth it. I wish we had taken their tour when we went to the Roman forum and to Ostia Antica (a worthwhile day trip from Rome, by the way - easily accessible by train)."}, {"username": "Stuart Flinn", "comment_text": "Our Colloseum, Palestine Hill, Forum tour was led by a PhD from a local college. We got a depth of info and stories that made the 3.5 hour tour fun and informative."}, {"username": "Kiana Cathy-Ann Strong", "comment_text": "I did the early morninf Vatican breakfast tour a few days ago and it was 100% worth it. Walked straight in, got photos in front of everything I wanted. There was not a lot of people. Breakfast was nice. When I finished the lines of people were crazy"}, {"username": "Michelle Mugge", "comment_text": "I’m hoping to take a moped tour of Rome during our next visit"}, {"username": "Jess Galasso", "comment_text": "I like to book a tour for a place I want to see more in depth and I do it on my own if I only need the Cliff’s Notes.\n\nAsk your family what is most important to them and book from there."}, {"username": "Becky Robertson", "comment_text": "When we visited we booked a free walking tour in each city we visited gave us a better idea where places were and showed us places we would never have found, for the vatican and colosseum we just used the audio guides and went at our own pace 😊"}, {"username": "Mary Palazzolo", "comment_text": "I did Rick Steve tour in Florence"}, {"username": "Laura DeCicco", "comment_text": "We’ve visited all of these places and chose to self tour, my time my way. We love wandering exploring our way. Rome and Florence are super easy walking towns, Venice is the perfect place to just get lost in."}, {"username": "Debra Indorato", "comment_text": "Chiara Antonelli Tourist guide is amazing if you want a guide who can relate to all ages and does amazing tours."}, {"username": "Ilana Brongiel", "comment_text": "Planning to do the colosseum night and also Vatican with breakfast! How far in advance did you book?"}, {"username": "Catherine Nichols", "comment_text": "Hello, we just did an evening golf cart tour with Rolling Rome, it was fantastic, our guide was so knowledgable, such a fun way to see the city highlights, our teenager loved it."}, {"username": "Rick Miller", "comment_text": "Sonya Reese Miller. Gina McCurdy. Amy Longenecker. Eric Longenecker"}, {"username": "Sabiha Syed Shaikh", "comment_text": "Pompeii with a guide is very informative."}, {"username": "Ann Applegarth Veith", "comment_text": "Absolutely make sure you have skip the line tickets, especially if you go to Vatican City"}, {"username": "Raquel Pickering", "comment_text": "Do the early morning one hour long David tour in florence def don't need longer. We wished we'd done a walking tour in florence as we feel we missed a lot with the beautiful twisty tiny streets. Also anything in venice that's not st marks square. Get skip the line for the church thete. We were incredibly dissapointed in the domes palace and wished we'd done a walking tour of venice. It rained the day we had booked in for the island tour (murano, burano) so can't say what they'd be like. Do trevi fountain at 7am - it's amazing! Skip pantheon if you don't have the time. It's great but no Vatican or st peters!!"}, {"username": "Lisa Kelly", "comment_text": "We did a fun food tour in Rome and a nighttime e-bike tour of Rome. The bike tour was a little scary at times, but overall really fun. Friends say the golf cart tour is great."}, {"username": "Frannie Kaplan", "comment_text": "I don't think you need a tour to see the colosseum, it's easy to see. There's a group called intineroma that does tons of off the beaten path tours, and roma sotteranea which are night time under ground tours, you need to book in advance though, I'm sure they do some in English"}, {"username": "Terry Pisano", "comment_text": "I've been planning our upcoming trip for the last 4 months, and I originally booked mostly guided tours. But when I actually started looking at maps, I found that a walking tour (just hubby and me) was easily doable.in most places (especially Rome) and I cancelled most of them. I used GPSmyCity to map out our walking routes in Rome and Florence. On GPSmyCity, you see lots of attractions you might want see, choose the ones you want, and it maps your walking tour for you. Lots more flexibility ro stop and see what WE want to see (and alot cheaper!)"}, {"username": "Linda Flynn", "comment_text": "Following"}, {"username": "Pamela Holifield", "comment_text": "We just finished the Florencetown Vespa tour and it was incredible. We also had a 20 year old with us.\n\nWe also did the Pompeii and Venice Food with Viator and they were both excellent."}, {"username": "Mary Ann Mills", "comment_text": "Does the Pope make an appearance everyday? Is there a certain time?"}, {"username": "Phyllis Snyder", "comment_text": "I’m going to use Rick Steve’s audio for my trip."}, {"username": "Paola Zirpola", "comment_text": "We just got back and I am glad I did the tours. They told us amazing stories and littles things we would of missed if we did things on our own! One tour guide said it best to us we were there to enjoy and she was there to take care of the rest. (Information wise)"}, {"username": "Rita Ryan", "comment_text": "Do a walking tour in each of the cities, they are inexpensive, you learn a lot. Then you can tour on your own!!!🚶‍♀️🚶‍♂️"}, {"username": "Jen Alexitch Rachow", "comment_text": "I did Rick Steves audio guides and they worked great plus they are flexible🤣🤣 on my schedule with myself! - In Florence and Venice. Haven’t been to Rome so cant speak to that."}, {"username": "Alexis McNamara", "comment_text": "I highly rec a golf cart tour. We got to see so many more things in just a few hours and they tailor it to what you want. Took my parents and teen kids and all loved it. She took us to great photo spots like the orange tree garden (near keyhole but no line) and the overlook in the Borghese and talked a lot about the city while driving. You will be so happy you did it."}, {"username": "Wendy Dillon", "comment_text": "We returned from our trip this month and highly recommend e-bike tours especially with teenagers"}, {"username": "Gabriella Villasenor", "comment_text": "I did a tour in those 2 places and it was worth it-"}, {"username": "Tari Lawson", "comment_text": "I prefer to do them on my own. I made lists of what i wanted to see, pre purchased any necessary tickets and mapped out my routes on Google maps. Worked great."}, {"username": "Megan Tarleck Jensen", "comment_text": "I would do a private guided tour in Rome especially if you are doing the Vatican!!"}, {"username": "Mahalia Agustines", "comment_text": "Jaime Agustines"}, {"username": "Lisa Schleich Cannella", "comment_text": "Just did a Walks With Italy tour today for our first day in Florence. Loved it! We saw the Accademia, Uffizi, and a highlights walk. Worth every penny. Now we know what else we want to explore in our next 3 days."}, {"username": "Eleana Flores", "comment_text": "We did the Doges Palace in Venice “Secret Itineraries” tour today at 10am and it was amazing!! (Assuming you can do stairs and aren’t claustrophobic)\n. It’s about 1.5 hours.\nDefinitely recommend! Then grab lunch at the cafe (table service) then do the rest of the Palace after you eat. I think we were there for over 3 hours.\nI did see a bunch of people listening to audio guides but our tour went to places you can’t see with general admission."}, {"username": "Fleur de Liz", "comment_text": "Mark Mojica"}, {"username": "Sonita Sandhu", "comment_text": "You have a couple of good ones booked and as others suggested do a walking tour in Florence and Venice. Maybe even one of those golf cart tours which I just read about on here. Didn’t know about them."}, {"username": "Mark Deebel", "comment_text": "Sue Shurow Deebel"}]}, {"id": "2201077113624700", "text": "Has anyone done the chairlift at Anacapri over the last few weeks? I'm wondering what the wait time was like, and how you got there from Capri town. We are doing a boat tour to Capri from Sorrento and want to see if it's possible to fit this in. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201077113624700/", "likes": 5, "comments": [{"username": "Antonella Piccolo", "comment_text": "We did it with Connie boat tour\nWe skipped the line because we were on a boat tour\nYes its possible\nAsk your boat tour if they can make you skip the line"}, {"username": "Yvonne Hainey Williams", "comment_text": "We were there in June and the line was not that bad from Capri harbour we got a bus up to the little town then straight up .\nOr taxis all there too , lovely views it’s a must x"}, {"username": "Angie Davidson", "comment_text": "We just did it yesterday and we walked right on. No line. We went at about 2 in the afternoon, we took gelato in hand for the ride up. Toilets aren’t working at the top so plan accordingly."}, {"username": "Robin Burrell", "comment_text": "It’s fast, Capri is a madhouse and we didn’t wait long. We walked back down and I enjoyed that more"}, {"username": "Evelyn Trager Jose", "comment_text": "We saw mountain goats on the rock formations - very cool. And ditto above, line was minimal. Easy to get on and off. Used public transportation to Anacapri. Worth it."}, {"username": "Candice Silver", "comment_text": "We did it last week. We arrived and were told by our tour operator to go get “unlimited” blue bus ticket and go right to bus to get to chairlift line to anacapri. There was no line when we went up around 10:30/11 by time we came back down around 11:30/12 it was longer."}, {"username": "Uma Atia Saeed", "comment_text": "Katie Wu Mssmi wow chair lift"}, {"username": "Jennifer Avrett", "comment_text": "No line in June"}, {"username": "Uma Atia Saeed", "comment_text": "Katie Wu Mssmi"}, {"username": "Dawn Handrahan-Lauchlan", "comment_text": "We were there in Oct 2022… took a cab to Anacapri… no wait for chairlift… loved it… fantastic views on the lift and from the top of Mount Salerno … highly advise it!!"}, {"username": "Judy Veltri-Viani", "comment_text": "Did it yesterday. No line up at all, either way. The bus line up to/from Anacapri was longer though."}, {"username": "Iman Nazaran", "comment_text": "Interested"}, {"username": "Hookie Stephanie Trotter Walker", "comment_text": "Did it two days ago. No wait at all… and it was on a Saturday . Grab the private blue taxi vans to go up… a bit more expensive than public transport, but they run more frequently and you won’t have to change shuttles."}]}, {"id": "2201078023624609", "text": "Como, Italy", "link": "facebook.com/groups/1373361046396315/permalink/2201078023624609/", "likes": 23, "comments": [{"username": "Ruth Akutu Maccarthy", "comment_text": "Simply fantastic"}, {"username": "Denise Incandela Boccio", "comment_text": "Thanks for sharing! I will be there next month, can’t wait. 🇮🇹"}, {"username": "Jenny Payne", "comment_text": "I’m going in October, everyone says do a boat trip around the islands? Was it well worth in? Thanks 🌻"}, {"username": "Jorge Manuel Goncalves Gomes", "comment_text": "I just left. It's beautifully"}]}, {"id": "2201079496957795", "text": "Hi there :)\nTravelling to Venice for 3 days with my Dad.\nAnyone got any cool recommendations, or restaurants or bars or day trip ideas ..or just general tips :) 🚶‍♀️🎒🌊🍸🍝", "link": "facebook.com/groups/1373361046396315/permalink/2201079496957795/", "likes": 7, "comments": [{"username": "Ann Applegarth Veith", "comment_text": "Rooftop bars are my favorite in Florence and Rome...maybe in Venice?"}, {"username": "Margaret Franklin", "comment_text": "Take a ferry to Burano Island. Stay at Lido Island. Take a gondola ride. Enjoy!"}, {"username": "Sandy Michelle Duggan", "comment_text": "Wing it, so many great places, just walk and enjoy and a restaurant will be there waiting for you. Enjoy, I got home a week ago, best way to do it in Venice."}, {"username": "Rhonda Russell", "comment_text": "Torcello is well worth a visit"}, {"username": "Stefano Follador", "comment_text": "Daytrip to Valdobbiadene, birthplace of Prosecco.\nI am a producer here in the area and I will gladly have you here for a wine tasting and visit."}, {"username": "Kathy Flood", "comment_text": "I loved our evening with rowvenice.com we took the wine tour! We rowed to four different bars."}, {"username": "Stacy Prestigiacomo", "comment_text": "Visit burano island . Ristorante sempione and porta de acqua was delicious"}, {"username": "Rebecca Arey", "comment_text": "Take a food tour! Drinks were included and it was a great way to fry to know some different areas and try the different types of local food. We had a great time! Found it on Viator"}, {"username": "Tari Lawson", "comment_text": "Best advice I got was to just walk around and get lost."}, {"username": "Domenica Calvene", "comment_text": "Take the ferry and do Murano & Burano tour."}, {"username": "Becky Picone", "comment_text": "This rooftop terrace above Fondaco dei Tedeschi was a really cool experience. It’s free but you do have to make a reservation. It’s very close to the Rialto bridge.\n\nhttps://\nwww.dfs.com/en/\nvenice/mobile/\nservice/\nrooftop-terrace"}, {"username": "Rose Anderson", "comment_text": "Get on the water taxi and ride around all the islands!"}, {"username": "Annie Slater", "comment_text": "Don't miss Burano!! It's breathtaking!"}, {"username": "Mike Adams", "comment_text": "The Florian is a classic bar on the square.\n\nBTW don’t eat out doors the pigeons Will take the food right out of your hands."}, {"username": "Jorge Manuel Goncalves Gomes", "comment_text": "Buy the vaporetto pass and get in and go. All the way around the island and the gran canal"}, {"username": "Dixie Kotylak", "comment_text": "Do not miss going up in the tower! Not expensive, not overly long waits, and amazing view of Venice! 👌🏻👌🏻👌🏻"}, {"username": "Alicia Cox", "comment_text": "Take a water taxi out of Venice to Murano then burano - half day each so u can do both in one day. Easy & cheap & beautiful."}]}, {"id": "2201086710290407", "text": "Can someone give me the straight truth on dining in Rome? We finish a Colosseum tour at 5 and will want to grab dinner afterward, probably in the Monti area.\n\nMy anxiety is we get done and wander from restaurant to restaurant with no availability or 120 minute waits. I am also anxious of getting bad food.", "link": "facebook.com/groups/1373361046396315/permalink/2201086710290407/", "likes": 9, "comments": [{"username": "Jenn Messina Babore", "comment_text": "That time is early for dinner there. You won’t have a problem getting in."}, {"username": "Miyuki Kanno Paul", "comment_text": "It is a customary to make dinner reservation. Many places do not open for dinner until 7:00-7:30(for tourists). Locals start showing up at 8:00 or later. Plan accordingly"}, {"username": "Toni Rugari", "comment_text": "1st world problems 🙄"}, {"username": "Aidan Wilson", "comment_text": "There is hundreds of restaurants.\nShouldn’t have to wait."}, {"username": "Roland Trego", "comment_text": "Do your homework by using sites likeThe Fork or TripAdvisor to find restaurants, and then reserve online or by phone if necessary. Many places won’t open until 7:00pm, and locals eat later. Unlike what everyone says, not all food is good in Italy. Avoid any place that has people standing out front trying to herd you in to fill their tables."}, {"username": "Giada Todaro", "comment_text": "Pls keep in mind that the only restaurants you will find open at that time are the turistic ones. So if u want eat authentic and good good you should delay your dinner time. Italians have dinner not before 7:30/8:00 and often later"}, {"username": "Tina Connell", "comment_text": "Research and make reservations for 7 or later. Stop for a snack and a spritz after your tour. Only tourist traps are going to be open at 5. If the menus are in English, open at 5 or have pictures, definitely pass."}, {"username": "Claudia Amp", "comment_text": "You don’t dine before 7.30 pm; from 5 to 7 it’s normally when we Italians grab aperitivo. No sensible places serves dinner at that time. You may want to book a table so you can go in relaxed even though some restaurants do not accept reservations (example Enzo al 29)"}, {"username": "Susan Haw", "comment_text": "You can get bad food anywhere, don’t overthink and just enjoy and chill out"}, {"username": "Tracy Foss", "comment_text": "That is early for dinner in Rome you should be fine"}, {"username": "Janice Finn Clemans", "comment_text": "Just got back 2 weeks ago. We had eight people with us and whatever restaurant we choose on the cuff, we were seated immediately. Never a wait. There is a restaurant every five feet in Rome."}, {"username": "Dunia Aldyni", "comment_text": "With my 4 kids I didn’t have any problems getting food in Italy 🇮🇹 in all city I visited in any time 😍😍😍"}, {"username": "Dann Hrusch", "comment_text": "We ate at the Gladiatore, directly across from the Colosseum. Place had tourist trap written all over it, but food was great and we had no complaints. Sure it may be customary to eat at 8:00 or later, but after wandering all day I'm in bed by 8:00. I never had an issue eating a little earlier than the locals."}, {"username": "Brian Kempf", "comment_text": "Pizzeria alle Carrette\nShort walk, great pizza. Enough said."}, {"username": "Jessica Colodny", "comment_text": "Even the \"tourist\" places have good food!!! Might not be the culinary experience of your dreams but better than most Italian places in the US. After early mornings (because I suffer from FOMO) and tours all day I was to tired to stay up till 8 to eat dinner😂."}, {"username": "Susan Annette Wanta", "comment_text": "We make this so stressful, there are hundreds of choices wherever you are in Rome. You can view the menu before you order. You can see the prices and just like any other restaurant that has a good reputation you might get a meal that’s below expectations. It happens. I’ve had great meals right next-door at a tourist attraction."}, {"username": "Jennette Riches", "comment_text": "At 5pm, you will be lucky if a restaurant is serving that early and you definitely will not have a wait. At 7 or 8 pm then you will have a wait. Find a restaurant you want to try and make a reservation online. Tripadvisor has a good system of reviews."}, {"username": "Vasthi Cheddar", "comment_text": "Bad food is usually in the eye of the beholder... there are scores of restaurants around the Colosseum. We finished around 3 and didn't take us more than a short walk across the street to find a dozen places.\nAt 5 you'll have the place to yourself. You won't starve in Italy."}, {"username": "Barbara LoPriore", "comment_text": "They don’t eat dinner till at least 8. You might have issues finding something open at early."}, {"username": "Leanne Dawn Sutton", "comment_text": "When I went in 2019 my friend and I did eat dinner at 5, we had delicious food and no problem getting in"}, {"username": "Elisa Kukielski", "comment_text": "Make reservations on line. Use The Fork!"}, {"username": "Michael Foster", "comment_text": "Want no stress? Stay at home & open a can of beans…"}, {"username": "Brian Marcus", "comment_text": "Nah don't stress over that. There's so many places you'll be fine. We were just there.\nIf you're concerned due to younger kids then maybe make a reservation otherwise eliminate that worry!"}, {"username": "Alice Francesca", "comment_text": "Have an aperitivo at 5.30 pm and wait until at least 7.30 pm to have dinner.\nThat is what we Italians do.\nMonti is a lovely quartier, I am sure you will find a proper romano restaurant there"}, {"username": "Pat King", "comment_text": "I had the exact same concerns as we planned our June trip (family of 4). I kept hearing about the crowds and imagined every restaurant having a long wait. Spent several hours one afternoon trying to scour restaurants online to make reservations. Finally gave up, just hard to know exactly where you are going to be at any given time. Got to Italy and had absolutely no problems walking right in to great restaurants. We did the afternoon Coliseum tour like you, and finished later than 5-around 6:30. Walked by Iari the Vino restaurant a few minutes later; liked the look of it, sat and had a great meal. They were open and busy. People are eating in restaurants at all hours of the day. Don't stress and have a great trip!!"}, {"username": "Gabriella Villasenor", "comment_text": "We just came back and after the tour at 5 we had a light snack to hold us over and the restaurant was across the street. Only tourist places are serving dinner before 7, research and make a reservation if there’s somewhere special you want to go- some places only took reservations we had a party of 6, don’t stress even places we just walked Into we’re good and never a long wait 👍"}, {"username": "Domenica Calvene", "comment_text": "Don't eat at the restaurants on the main St with photos and practically begging you to eat at their establishment. Tourist trap.\nTry Ristoraunte La Nuova Piazette..we walked in at 10pm last night still open.they eat late in Italy.plenty of restaurants down lane ways and you don't need a booking."}, {"username": "Jeanne Cancellieri", "comment_text": "Usually people will see the Colosseum they might walk thru the Roman Forum. There is a set of stairs with a plaza at the end. Continue to walk and you will start to see some tenants of the Jewish Ghetto. First you should walk thru there and there are some of the best small restaurants with delicious food. It was quite the find for us. After eating i you continue walking you will end up in Piazza delForno. The food is delicious of course, but much more crowded and more expensive. We are in both areas. Really never had a bad meal. The Jewish Ghetto restaurants to us were just a little more interesting and the dishes, you can’t go wrong"}, {"username": "Glenn Todd Webb", "comment_text": "There are so many restaurants that finding a seat is no problem. Toss up on quality. Ask hotel or someone you buy something from, where the locals eat. Don’t get a restaurant in a main square at a tourist location, go down smaller street."}, {"username": "Iman Nazaran", "comment_text": "Useful hints"}, {"username": "Brenna Afford", "comment_text": "F"}, {"username": "Kezia Smith", "comment_text": "never had any troubles with waiting plus most people will eat dinner a lot later at around 8pm so you should have no trouble getting anywhere around 5:30 etc"}, {"username": "Lisa Schalig-Winter", "comment_text": "So many amazing restaurants. Never had to wait. Many take online reservations."}, {"username": "Colin Ng", "comment_text": "F"}, {"username": "Karen Blackmore", "comment_text": "No problems at that time! Never had to queue for more than a couple of minutes, if at all"}, {"username": "Jack Giacomo Avondo", "comment_text": "You won't go hunger these are hundreds of good places to eat, you will find a suitable place. Relax and enjoy your trip"}]}, {"id": "2201092533623158", "text": "I am traveling italy in mid November.intially i travel swiss from spiez to milan.\nMilan to Venice 2 days in Venice\nVenice to Florance 1 day\nFlorance to rome .2 days in rome.\nPlease suggest me which train I should catch to travel from spiez to milan.\nIn Venice things to be seen .how to go around city.which trains to catch to travel from milan to Venice\nHow to travel Florance to pisa\nAnd Florance to rome ,which trains.\nAny travel pass to go around city like milan ,Venice , Florance and rome.\nThank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2201092533623158/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "Check the trenitalia.it site"}, {"username": "Rose Stolarek", "comment_text": "Look at Rome2rio they are fantastic"}, {"username": "Jenn Messina Babore", "comment_text": "TrenItalia will have the trains you need to travel city to city.\n\nIn Venice, best way to get around is to walk or take a vaporetto."}, {"username": "Giovanni Pianigiani", "comment_text": "Bye, in English it's FlorEnce, in Italian Firenze. You might have a hard time seeking Florance on train schedules"}, {"username": "Connie Wilson", "comment_text": "Swiss Rail\n\nhttps://\nwww.sbb.ch/en/\nbuying/pages/\nfahrplan/\nfahrplan.xhtml"}, {"username": "Bev Madill", "comment_text": "That’s a very rushed trip. For example when you travel from Venice to Florence you’ll spend 2.5hrs (on the fastest train). You’ll only scratch the surface of Florence where there’s so much to see and absorb. Same for the other cities. Use the Trenitalia site for train tickets."}]}, {"id": "2201094193622992", "text": "Question, thinking of flying into Venice and out of Rome to head home when looking on your own does anybody know how to do that? I'm not finding the option.", "link": "facebook.com/groups/1373361046396315/permalink/2201094193622992/", "likes": 5, "comments": [{"username": "Hilary Bullard Locklear", "comment_text": "I found the price on goggle flights but had to call airline to book… flying into Venice and out from Athens"}, {"username": "Susan Conway", "comment_text": "We flew into Venice and out of Naples. When we were booking our tickets there is a multi city option. I think it’s where you click on one way, round trip….."}, {"username": "Colleen Dawson", "comment_text": "Google flights allows you to check for multi city, try not to buy one way tickets."}, {"username": "Madeline Caporale", "comment_text": "Each airline should allow you to do a multi city ticket rather than a round trip. Round trip is default option buty you should find a drop down box that lets you select the multi-city option. Do not resort to buying one way tickets. The multi-city option is much more cost effective."}, {"username": "Phyllis Snyder", "comment_text": "Try looking at Google flights"}, {"username": "Michele Liggett", "comment_text": "We're using United flying into Venice and leaving from Milan."}, {"username": "Jenny Frank", "comment_text": "Am doing reverse: into Rome out of Venice"}, {"username": "Debbie Potter", "comment_text": "Debbie Potter"}, {"username": "Debbie Potter", "comment_text": "Expedia has an option to do multy city flights....I would look into that."}, {"username": "Tracy Foss", "comment_text": "Put in multi destination"}, {"username": "Lynn Clemens", "comment_text": "Select multiple cities when finding airline tickets… Fly into the city of your choice then the city you want to return from"}, {"username": "Charleen Siegler Schuss", "comment_text": "Easy peasy, find the multi city option on the airline site."}, {"username": "Karen Smart", "comment_text": "It's more expensive to do two one-way, so be sure and choose a multi-city option. That allows for a \"round trip\" but from different cities."}, {"username": "Colleen Dee", "comment_text": "Sometimes it’s even cheaper to fly on two different airlines. Found it was better to fly into Barcelona on United & home via Alaska airlines from Rome for an upcoming trip - booked 9 months in advance… You can go to various airlines’ website, Expedia, etc & do a mock trip."}, {"username": "Jill Medrano Casey", "comment_text": "You should be able to search for multi-city roundtrip tickets."}, {"username": "Tricia Wisehart", "comment_text": "I booked online with Delta with different arrival & departure locations"}, {"username": "Mike Adams", "comment_text": "Look for a multi Citi button or book 2,one ways or call the airlines"}, {"username": "Frank Hunt", "comment_text": "It seems to be very expensive to multi city atm, you might have to reconsider your options."}, {"username": "Sharon Roberts Crossley", "comment_text": "Multi city"}, {"username": "Renee Rundle Stoneham", "comment_text": "Choose Multi city search.\nWe do this all the time to avoid back tracking.\nThis year we did DFW to GVA then LIN to DFW."}, {"username": "Bill Casper", "comment_text": "Look on SKYSCANNER"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I just did multi city through United. I had to leave out of Newark. There’s an option on United’s website that says multi city."}, {"username": "Jennifer Schmidt", "comment_text": "Ty everyone"}, {"username": "Leza Marinesi", "comment_text": "We are doing the same flight. Make sure you do multi city as everyone has said. Delta was definitely the best price for us. You can use Skyscanner as well and it will even alert you when the price drops. ￼"}, {"username": "Mindy Marshall Lavin", "comment_text": "Use multi city on airline site"}, {"username": "Daddie Russ", "comment_text": "Multi city option or two different airlines"}, {"username": "Paul Antal", "comment_text": "NY to Rome is a lot cheaper than NY to Venice… not sure how much time do you have or what your interests are but there is so much to see (and do) between Rome and Venice!!… trains and ride share (blabla cars) are inexpensive and popular in Italy… DO NOT book hotels in Venice (waaaay to expensive) try instead resorts within 30-40 miles from Venice a lot more affordable and with good bus services )Chioggia or Rosolina for instance)… good luck and have fun!!!"}, {"username": "Cindy Corbin Cangelose", "comment_text": "Use multi city. We are flying into Rome and out of Venice."}, {"username": "Susie Grossman Rubin", "comment_text": "That is what we are doing. Just put the multi city when making reservations."}, {"username": "Kayla Caras Prescott", "comment_text": "We flew into Athens and heading home from Rome (to NC). Booked directly thru American Airlines. Did a multi stop ticket. We also had direct flights"}, {"username": "Claire Buccini", "comment_text": "Should be a multi city option in your flight bookings page"}, {"username": "Dave Conroy", "comment_text": "And check one way. You need two one way tickets. Not returns."}, {"username": "Cris Wimer", "comment_text": "Yup, two one way"}, {"username": "Jenny Larsen", "comment_text": "Where is home ? Australia? London? Usa?"}, {"username": "Guia Taylor", "comment_text": "Skyscanner allows for multi city search"}]}, {"id": "2201106873621724", "text": "Do you recommend a boat tour from Sorrento to visit Positano, Amalfi and Ravello …. or a land tour in a van ???", "link": "facebook.com/groups/1373361046396315/permalink/2201106873621724/", "likes": 2, "comments": [{"username": "Brenna Afford", "comment_text": "F"}, {"username": "Erin Trider Kwarciak", "comment_text": "F"}, {"username": "Iliana Zlatareva", "comment_text": "Bus is fine"}, {"username": "Manal Ali", "comment_text": "Following"}, {"username": "Colleen Effler", "comment_text": "Following"}]}, {"id": "2201101160288962", "text": "A friend of mine and I are going to Italy in October. We would love to stay at a winery in Tuscany for a couple of nights and maybe have dinner on a terrace overlooking the vineyard. Can anyone provide recommendations please?", "link": "facebook.com/groups/1373361046396315/permalink/2201101160288962/", "likes": 0, "comments": []}, {"id": "2201107870288291", "text": "Recommendation for dual voltage flat iron and curling wand", "link": "facebook.com/groups/1373361046396315/permalink/2201107870288291/", "likes": 13, "comments": [{"username": "Paula Smith Lemmon", "comment_text": "T3 from Costco. I used mine in Rome"}, {"username": "Cheryl Williams", "comment_text": "I’ve used a GHD in various countries. Previously had a CHI but it sizzled/died when I tried to use it in Germany."}, {"username": "Marlen Zamarron", "comment_text": "I use my chi hair straightener for my 21 day trip to Italy, all I needed was an adaptor."}, {"username": "Alexandra A Welker", "comment_text": "Most newer electronics are dual voltage but must check the label. Check this one out, it's curling iron/hair straightener in one.\nL'ANGE HAIR Le Duo 360° Airflow Styler | 2-in-1 Curling Wand & Titanium Flat Iron Hair Straightener | Professional Hair Curler with Cooling Air Vents to Lock in Style | Dual Voltage & Adjustable Temp https://a.co/d/\nf2zMFm9"}, {"username": "Lana Watson Famiano", "comment_text": "I have a dual voltage Conair curling iron that I have been using in Italy for several years with no problem. Only need an adapter."}, {"username": "Sherry Pritchett-Kelly", "comment_text": "I had no issues with the Paul Mitchell Neuro Smooth (automatic dual voltage)"}, {"username": "Eileen Rossi", "comment_text": "amazon"}, {"username": "Celina Eve", "comment_text": "I have a conair curling iron and it worked just fine in Europe with a converter"}, {"username": "Susan Kirsch Braxton", "comment_text": "I ordered a flat iron and round brush hair dryer on Amazon Italy so I didnt have to worry about converters or dual voltage. Now i have them whenever i travel to europe."}, {"username": "Amy Leimenstoll", "comment_text": "Kristen Ess from target worked great for me."}, {"username": "Virginia Lane", "comment_text": "Amazon"}, {"username": "Gina Hassett Hunt", "comment_text": "I bought this small one off Amazon. Works good. I have shoulder length fine hair."}, {"username": "Kate N Karim Al-Azzawi", "comment_text": "L'ange"}, {"username": "Ivonne Gonzalez", "comment_text": "Buy them there!!!"}, {"username": "Nikki Blosser", "comment_text": "Buy them there. Just read this convo in another post. The adaptors and convertors typically can’t handle them. Something about voltage/\ncurrent. (There was a debate). Guess it works for some and not for others. I know I have used a converter in Greece and Italy and my flat iron stopped working so I bought one there. Easy peasey. No problems."}, {"username": "Amanda Kamel", "comment_text": "Chi hair straightener usually is dual voltage that’s the one I have"}, {"username": "Renee Rundle Stoneham", "comment_text": "Flat iron… Baybliss travel dual voltage it’s worked for years!"}, {"username": "Barb Krieg-Stepien", "comment_text": "I am in Italy right now. Using my hot tools black iron. Comes in spring also"}, {"username": "Janis Monk", "comment_text": "GHD straightener is dual voltage and works well in Europe."}, {"username": "Sheila Brucia", "comment_text": "Made in Italy. From Amazon."}, {"username": "MaryLu Nolan", "comment_text": "I used a dual voltage, dual flat iron and curling wand in one and it worked great."}, {"username": "Courtney Hyson", "comment_text": "Can I just buy a converter and use my own styling tools ?"}, {"username": "Kim Storcella", "comment_text": "So are all Chi’s dual voltage?"}, {"username": "Tammy Lynn Schmitt", "comment_text": "I hadn’t even thought of this until I found this thread. Without my brush hairdryer I am not fit to go into public. I found this.\n\nDual Voltage Hair Dryer Brush, PRITECH Hot Air Brush, Ionic 1000W Blow Dryer Brush 4 in 1 Styler, One Step Volumizer,Styli\nng Brush with Ceramic Coating for Straight and Curling Hair Salon https://a.co/d/\n7WIYlrC"}, {"username": "Lyn Pappas Dahm", "comment_text": "Lange"}, {"username": "Krystal Apolinaro", "comment_text": "I use L’ange, it is dual voltage and love it."}, {"username": "Karen Schmidt", "comment_text": "Buy one when you get there. We tried previously to bring one with us, but it just never worked properly, and we always felt it was somewhat of a fire hazard. ￼ this last time, we bought a hair straightener. Reasonably priced and a lot safer. ￼"}, {"username": "Dana Price", "comment_text": "Dana Price"}, {"username": "Tammy Lynn Schmitt", "comment_text": "Does anybody have recommendations\non CPAP machine? Can we just plug it into to the converter plug or do we need to do something special?"}, {"username": "Eileen Muro", "comment_text": "No need....just get a dual voltage adapter"}, {"username": "Bianca D'Amore", "comment_text": "Buy them there, I bought a curling iron for 16 euro and it works better than my American ones."}, {"username": "Katie White-Meade", "comment_text": "Cloud Nine is a great brand"}, {"username": "Voula Ladas", "comment_text": "GHD"}, {"username": "Vicki Brown", "comment_text": "L’ange is dual voltage"}, {"username": "Krissy DaRusso", "comment_text": "I found a travel combo one from Amazon. I travel in the summer and only uses it a few times bc it was so so hot!"}, {"username": "Sue Ellen Thomas", "comment_text": "Amazon. Bought one for my daughter for her trip."}, {"username": "Terry Pisano", "comment_text": "I've got a dual voltage Chi and I'm praying it works ok. We have an adapter. My only concern is I don't see on it anywhere to \"change\" the voltage, but it says 110/220 on it."}]}, {"id": "2201108116954933", "text": "My husband & I are going to Italy 🇮🇹 for the first time in mid November.\nThis page is so helpful & I’m getting a lot of good advice.\nLove looking at peoples post.\nThis is a dream top of the bucket list forआणखी me .\nAsking for advice. I am handicapped, partially paralyzed in my right arm\nI see there are hairdryers at most hotels.\nWhat do I need to purchase for this plug . I’m unable to use a traditional hairdryer. I’d like to bring mine..", "link": "facebook.com/groups/1373361046396315/permalink/2201108116954933/", "likes": 26, "comments": [{"username": "Pamela Jones", "comment_text": "I took a travel hairdryer 1200 watts & had no problem at all. Get one of these to plug it into 1st"}, {"username": "Pamela Jones", "comment_text": "Pamela Jones"}, {"username": "Diane Wilkerson", "comment_text": "Please look at the plug. It indicates dual voltage in the bottom left corner. It *should* only need an adaptor. However, there have been many cases where even dual voltage devices have blown and ceased to work. I would try to find a similar item at the Amazon Italy (.it) or France (.fr) sites."}, {"username": "Sara Kyle Hargett", "comment_text": "Amazon has them and personally I wouldn't have wanted to go find one when I got there. Just me. Needed them to charge the phones."}, {"username": "Diane Hamilton", "comment_text": "Really appreciate all the positive feedback.\nThis is an excellent way to communicate.\nThank you all for responding. It was very helpful 🇮🇹❤️"}, {"username": "Annick Hupperetz", "comment_text": "Look on the handle or near the cord of your hair dryer to check if it is dual-voltage; it should say 110/240V. If not, you may need a converter. Some devices have a toggle switch for switching between voltages."}, {"username": "Louise Desnoyers", "comment_text": "If your hairdryer doesn’t have a dual voltage switch, you need these two:\n1-transformer for 220 Volts\n2- switch adaptor for Italian switch\nAmazon if your transformer doesn’t provide you one ( picture #2)"}, {"username": "Louise Desnoyers", "comment_text": "Louise Desnoyers"}, {"username": "Louise Desnoyers", "comment_text": "If it does have a dual voltage selection, just need picture no 2 ( switch adaptor), ready to use after you select 220 V on your voltage selector"}, {"username": "Farrell Baker", "comment_text": "I got this at bestbuy before i went in ‘19"}, {"username": "Angela Ciampa", "comment_text": "Purchase the euro plug adapter!"}, {"username": "Angela Ciampa", "comment_text": "Can find them in the airports also.. just in case last minute purchases"}, {"username": "Anna Ciolino Di Bennardo", "comment_text": "Buy a converter on Amazon"}, {"username": "Lana Watson Famiano", "comment_text": "If your hair dryer is not dual voltage you will need a converter to convert the 220v in Italy to our 110v. You also need to make sure the converter is for he correct wattage. Find out how many watts your hair dryer is and then purchase your converter to correspond. If your hair dryer is dual voltage, you only need an adapter for adapt the plug to fit into their 2 round prong outlet."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Amazon … international converter"}, {"username": "Gia Giandomenico Ergood", "comment_text": "i brought a professional grade hair dryer to italy and used it with a converter. i had no problems"}, {"username": "Debbie Schultz", "comment_text": "Even with a converter you will burn your dryer up and it won’t work."}, {"username": "Sandra Ferrante-Kohn", "comment_text": "You can purchase,at a very low cost, AC/DC converters on Amazon. My suggestion is to buy one and take it with you. If it turns out you don’t need it, you can always return it to Amazon."}, {"username": "Mery Jordan", "comment_text": "Even if your dryer says 110/240 V, don't take it with you. I did with mine, and it got very hot, causing damage to my hair. As a hairstylist, all my tools are professional and high-end, but even with a converter, it didn't work very well. Fortunately, I didn't burn my dryer, but I did slightly damage my hair. It's better to use the ones at the hotels, and if you need a curly or flat iron, it's best to purchase one there. The water in Italy is very good, so you'll have a nice blowout."}, {"username": "Helen Lott Wanke", "comment_text": "I always bring a converter/ adapter kit whenever I travel outside the country. There are so many different voltages you could easily destroy your equipment by plugging right into it. Any travel store sells them as does Amazon."}, {"username": "Eivan Maroki", "comment_text": "[2-Pack] European Travel Plug Adapter, VINTAR International Power Plug Adapter with 2 USB Ports,2 American Outlets- 4 in 1 Outlet Adapter,Travel Essentials to Italy,Greece,Fr\nance, Spain (Type C) https://a.co/d/\naC0z03S"}, {"username": "Eivan Maroki", "comment_text": "This is what I used in Greece 🇬🇷 for my flatiron"}, {"username": "Pauline Richardson", "comment_text": "Can't you get a battery operated hair dryer? Anyway it's so warm I just let it air dry!!"}, {"username": "Mary Griffard", "comment_text": "I had conversion plugs, used with brush hairdryer and it burned up. Curling iron with plug was fine"}, {"username": "Annette Tamminga", "comment_text": "I went to a Ulta store in U.S. yesterday and purchased a dual voltage hair dryer brush. Look at the voltage on the device."}, {"username": "Antonina Ingrassia-Arroyave", "comment_text": "An adapter 😅 good luck traveling. Starting off rough already. Stay close to your tour guides.😅"}, {"username": "Anna Gambino", "comment_text": "I had a converter and adapter last time I went. Neither one worked for the fair dryer I brought with me from the US. Almost burned my hair dryer one e. I finally gave up trying to bring my own and used the one provided by the hotel or Airbnb. The converter and adapters worked for my curling iron."}, {"username": "Kim Dixon", "comment_text": "I see from your picture it is dual-voltage, dual wattage, so all you need is the adapter, not a transformer. The adapter is simply a connector with the correct prongs on it. You can buy it in a travel kit at the store"}, {"username": "Toni Marie", "comment_text": "Probably need a converter but be careful I had a converter for my travel steamer and it blew out"}, {"username": "Renee Rundle Stoneham", "comment_text": "If it’s not a dual voltage one you need a converter and an adapter. Unless you can get a travel one that a combo unit.\n\nIf dual voltage an adapter in theory works.\nRead directions as many will say can only be used in low setting.\n\nHowever…..\nI will warn you that hairdryers burn out easily when constantly converting electrical units etc…\nSome last longer than others etc…\nSome blow out a first use, some you can only use on low setting."}, {"username": "Susan Marten", "comment_text": "Leave your dryer at home. Get an inexpensive dual voltage dryer. I got the baby bliss and some others got the conair. They are compact and powerful and now I use it whenever I travel anywhere."}, {"username": "Annette Mayer", "comment_text": "These are what I take."}, {"username": "Sue Ellen Thomas", "comment_text": "Definitely need to purchase a dual voltage appliance as well as plug adapters. Just remember to switch back to US voltage when you get home! Enjoy."}, {"username": "Margaret Mks", "comment_text": "We bought this to charge our electronics."}, {"username": "Sandy Radican Shikaly", "comment_text": "Some comments are not correct... understand the difference between a converter ( change the voltage) and an adapter ( change the shape of the plug)"}, {"username": "Gavino Reloj", "comment_text": "Your Hair Dryer (see bottom of plug in your picture) is good for 240 volts in Italy! You need a plug adapter like this"}, {"username": "Gavino Reloj", "comment_text": "Gavino Reloj"}, {"username": "Cherie M VanCleave", "comment_text": "I didn’t have issues using a convertor but I did bring a dual voltage hairdryer and that made that easier for sure"}, {"username": "Phyllis Snyder", "comment_text": "Really better to use your hotels- or purchase one when you get there. I’ve heard even with adapters they can burn up."}, {"username": "Terry Pisano", "comment_text": "Does the V0220 on the bottom of her picture mean she'd just need a converter? Or.does that mean something else?"}, {"username": "Dominic Po", "comment_text": "Amazon"}, {"username": "Tiffani Hale Marshall", "comment_text": "It was tough for me to find a converter that would work with a hairdryer and even when I found one, it was not good. I finally ordered a hair dryer from the German Amazon site and had shipped to US. Now it’s all I need to pack when going to Europe and it came with a UK adapter."}, {"username": "Robin Barbera", "comment_text": "You can buy one of those little gray plugs that are narrow and round, plug that into that cord and then you need to buy a two prong adapter that is raised a bit around the edges, and the great plug will fit right in there."}, {"username": "Dann Hrusch", "comment_text": "Make sure you accommodations have a balcony. Then air dry with a bottle of wine."}, {"username": "John Bell", "comment_text": "You just need a simple inexpensive 2 prong to 2 pin adapter as above photo as your dryer plug shows it will work with both 110V north american power or 220V european power. No need for a 110V to 220V converter."}, {"username": "Tatyana Garcia", "comment_text": "I wouldn't try to bring it in Italy. They have several stores where you could purchase one inexpensively"}, {"username": "Mary Paron", "comment_text": "You’ll need to find a converter that can handle that type of equipment. Look for one on Amazon that can handle hairdryers"}, {"username": "Maria Badamo DeSocio", "comment_text": "I really wouldn’t bring a regular hair dryer from home, you’ll need a converter and sometimes that’s not enough. I would use the hotel one or buy one that has dual voltage so you just have to use an adapter."}, {"username": "Kim Aranha", "comment_text": "The voltage is different but you probably can buy an adapter - however once you have an adapter to change the voltage and a plug to fit the the sockets - you may do better to check Amazon.it and see what you can buy"}, {"username": "Kim Aranha", "comment_text": "Is it something like this ?\nThis costs €17"}, {"username": "Alicia Cox", "comment_text": "Just a converter"}, {"username": "Alicia Cox", "comment_text": "Converter but still a chance of it frying but I’ve never had one do that. You may have to also change the voltage on the dryer if there is that option"}, {"username": "Liby A. Roude", "comment_text": "We brought an adapter with us that we purchased on Amazon. However, our hotel had adapters for guests who didn’t bring one! I hope you enjoy your trip! Our experience in Italy 🇮🇹 was amazing and everyone we encountered was wonderful!"}, {"username": "Vanessa Durkin", "comment_text": "You can buy a eutopean plyg with about four different plug fittings try amazon"}, {"username": "Nancy Lewis", "comment_text": "I understand your needs!\nFirst check to see if it is dual voltage.\nIf NOT you need a converter or you will blow a fuse a burn out your dryer.\nAnd then an adapter for plug prongs."}, {"username": "Bea Kuckens", "comment_text": "Looks like it's dual-voltage, in which case you just need an adapter like this. https://\nwww.amazon.com/\nGrounded-Univers\nal-Adapter-Ital\ny-Uruguay/dp/\nB004SY9OVA/\nref=sr_1_20_sspa\n?crid=6BZ8YTVPV\nQDL&keywords=ou\ntlet+converter+\nus+to+Italy+typ\ne+L&qid=1690570\n200&sprefix=out\nlet+converter+u\ns+to+italy+type\n+l%2Caps%2C195&\nsr=8-20-spons&s\np_csd=d2lkZ2V0T\nmFtZT1zcF9tdGY&\npsc=1"}, {"username": "Laura Uribe", "comment_text": "Unfortunately the converters cannot handle the required power. I tried using theirs but some are attached to the wall which is a pain. I went out and bought one in Italy. There are two other possibilities. Let your hair dry naturally or buy a dual voltage dryer that works best for you. I just bought a dual voltage curling iron. We will see if it works next month. Good luck!"}, {"username": "Vasthi Cheddar", "comment_text": "You can't bring it unless it's dual voltage or you bring a decent converter but I still wouldn't recommended."}, {"username": "John Layman", "comment_text": "You can purchase a universal adapter kit,probably from Amazon.Comes in a neat little kit.You might want to consider a suit case weight scale,usually less than 20bucks"}, {"username": "Linda B. Fontaine", "comment_text": "Linda B. Fontaine"}, {"username": "Matteo Gallizioli", "comment_text": "this is the italian one"}, {"username": "Marina Rosa Moni", "comment_text": "An adapter"}, {"username": "Matteo Gallizioli", "comment_text": "BUT pay attention to the voltage of the current, the US one (110 volt 60 Hz) is lower than the European one (220-240 V)"}, {"username": "Theresa Ladner", "comment_text": "Is it dual voltage? 120V/230V? Then you would just need an adapter."}, {"username": "Susan Palmer", "comment_text": "You will need to make sure that your hair dryer is capable of dual voltage and then you also need a converter. If it is not dual voltage and you just plug it in to a converter it will fry."}, {"username": "Trish Heymer", "comment_text": "I have one of these. You can get them on Amazon. I also take a power board with me to charge camera and phone. You can use this worldwide"}, {"username": "Shiva Timalsina", "comment_text": "Welcome to Nepal. Nepal is also very beautiful country."}, {"username": "Beverly Bovo", "comment_text": "You need an adapter there electric is not as strong as ours if you plug in your dryer it burn up"}, {"username": "Diane Hamilton", "comment_text": "Thanks for the info.\nI really appreciate the feedback.🇮🇹"}]}]