[{"id": "2212959209103157", "text": "Is it possible to buy tickets to Pompeii the day of, or can you hire a guide onsite when you get there, take a tour, and then spend extra time there?", "link": "facebook.com/groups/1373361046396315/permalink/2212959209103157/", "likes": 1, "comments": [{"username": "Pam Gerretsen", "comment_text": "We went a couple of weeks ago; arrived as it was about to open and didn't have to queue long for tickets at all. We got an audio guide and wandered around on our own, but guided tours were available"}, {"username": "Tanya Lee Knightly", "comment_text": "Get your guide is what we did, amazing!"}, {"username": "Kejdi Okej", "comment_text": "Get your guide is what we did amazing"}, {"username": "Joe-Linda Po Agustin", "comment_text": "You can buy ticket with tour guide on-site. Tour guide so worth it! You can wander on your own after the tour, but you might be exhausted by then."}]}, {"id": "2212973062435105", "text": "I will be traveling on a Sunday from Florence to Siena and was trying to book a bus ticket. When I click on \"purchase ticket\" it says none available. Is this because you need to buy tickets in person?", "link": "facebook.com/groups/1373361046396315/permalink/2212973062435105/", "likes": 1, "comments": [{"username": "Diana Hesse", "comment_text": "I bought mine on the day at the bus station."}]}, {"id": "2212984699100608", "text": "Hello! We are looking for must sees/dos in Taormina and/or Sicily. Best restaurants, bars, places to go, etc. TIA 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2212984699100608/", "likes": 4, "comments": [{"username": "Mary Agozzino Derrick", "comment_text": "Depends on how long you're coming for.... I'd spend 2 days Taormina, 3 days out of Ortigia...if you have a car, see the Valley of the Temples in Agrigento and go to Palermo base yourself there for 3 days...you can do side trips out of both Palermo and Ortigia depending on how many days your trip is for"}, {"username": "Ike Simoncini", "comment_text": "Look for restauants up in the moutains and away from the tourist hot spots. Eat \"involtini pesche spada\" a typicall sicilian dish and streetfood named \"panne panelle\"and afcours if you like sweet you HAVE to eat canolli"}, {"username": "Rose Turdo", "comment_text": "Land in Palermo, Take the drive from Cefalu to Santo Stefano di Camastra via SS113.\nExplore the area ..\nThere's an archeological find in Tusa from 402 BC .. it's a Medieval town.\nContinue to Capo d'Orlando\nBrolo .. Barcelona\n\nTake the turns snd GO\n\nSegesta Temple .. Amphitheater, the drive and views incredible.\n\nTrapani, Terrasini, Spiaggia della Mura Tramontana, Castelmare\n\nAugusta ... Hotel - Ristorante Capo Campolato\n+39 0931 981022\nhttps://\nmaps.app.goo.gl/\ntQKJk6Z2R98KkgVV\nA"}, {"username": "Rose Turdo", "comment_text": "Santo Stefano di Camastra, L'Angolo di Manueliana for dinner."}, {"username": "Rosann Nadle Maher", "comment_text": "Follow Visit Sicily Facebook page"}]}, {"id": "2212972869101791", "text": "Breakfast with a view in Venice 😍💙", "link": "facebook.com/groups/1373361046396315/permalink/2212972869101791/", "likes": 35, "comments": [{"username": "Patricia Chavez", "comment_text": "Beautiful Picture.\nIs this from your Hotel or a Restaurant?"}, {"username": "Tracy Foss", "comment_text": "Looks wonderful! Where is this"}]}, {"id": "2212985895767155", "text": "Ciao! Our family just returned from 12 days in Italy and it was a dream. I can't thank this group enough for all of the indispensable tips in helping plan the vacation of a lifetime. The best I can do is give something back here for anyone who is going to this beautiful country.\n\n-ITINERARY: We spread our vacation out starting in Rome, then to Florence and finally to Venice. All travel was by train between these areas through TrenItalia business class. Best advice I can give here is book your tickets in advance on the app! We mixed into these hub locations several excursions and private tours. 2 travel days, 4 days in Rome, 4 days in Florence, 2 days in Venice. Make sure to schedule downtime with nothing booked (I can't emphasize this enough). We made sure to do this and were still able to cover a lot. There is a saying in Italy that you can see Italy or experience Italy - you have to experience it! Walk around with no plans, pop into a cafe, speak with the locals and brush up on your Italian.\n\n-TOURING: We did several tours through LivTours and their services were top notch as they are family owned. Their guides took us on our tours through the Colosseum, skip the line at the Vatican/St. Peter's Basilica/Sistine as well as a private day trip to Pompeii and Amalfi Coast (Sorrento and surrounding towns). We even used them on a walking tour in Florence which was a lot of fun. Every single one of their guides was great with keeping our young boys engaged (pre-teen age) and had a passion for the story telling on the tour as an art historian or native of the region. These were some of the best memories on our trip, because without understanding the history at these sites you will be missing out. I highly recommend LivTours and would definitely use them again. In addition, we did a day trip to Tuscany when we stayed in Florence through Walks which was also fantastic with a great lunch/winery tour. It's so hard to choose the highlights as they were all amazing!\n\n-CLOTHES: No one cares what you are wearing -- comfort first, fashion second. There was a mix of everything under the sun on our trip and each city was FILLED with tourists lugging backpacks and suitcases. You do you!\n\n-PACKING: After all the stories I read here about not checking bags and packing light - we did a mix of both and were just fine. We checked 2 bags (a carry on and one big suitcase) and carried backpacks between the 4 of us for all essentials and were just fine. Use air tags and be practical about what you are willing to part with in case things get lost. Take direct flights as much as possible to avoid shuffles. I will note that we ultimately chose to check at least 2 bags as we have young children and it didn't make sense to go overseas without peace of mind that we would have enough with us for the duration of our trip. Pro tip: There is a very cheap laundry service in Florence and after a week plus of traveling we opted to just do a load of dirty clothes there that was life saver. The prices were more then reasonable.\n\n-PASSPORTS: Keep a copy on your phone, there is no need to carry these out unless you are going several hours away from your hotel. We were not asked once to show these when we were walking around. The hotel safe is the best place to keep them and make sure you are going to a reputable chain. Almost every hotel scanned our passports (we stayed exclusively at Marriotts) so someone will always have a copy aside from you, it's fairly routine.\n\n-SAFETY/PICKPOCKETING/SCAMS: Every single Italian we met was welcoming and I never felt unsafe in any location. My husband and I have both lived internationally in a few countries so we have more experience than most in international travel -- you just need to stay aware of your environment. Keep your bags on you and visible at all times. Learn to ignore anyone approaching you to sell something or put it in your hand, keep it moving. Also tourist traps will try to get every single Euro out of you and more, so be wary of heavily toured areas or businesses adding on charges. Bathrooms also require payment in public areas, so keep some loose change on you for those. We did not have issues with pickpockets or anything of that nature on this trip, thank goodness.\n\n-PHOTOS: I can't recommend Stas Varych enough - we used his services in Rome for our family shoot (photo for reference sans our boys) and he was AMAZING! He worked with us even when the weather was not working with us (it rained and then there was sunshine) and was super flexible in arranging our shots across different days. They came out beautiful and definitely helped us capture the memories.\n\n-THE HEAT: We lucked out during our stay - the weather was in the 80-90s F and the cloudy days helped a lot with the sun factor. I brought a ton of sunscreen along and only used it once during our entire trip! It even rained in Rome one day which provided some much needed relief from the humidity. Make sure you are hydrating constantly - there are also a ton of fountains everywhere to refill water so definitely take advantage of those. The fountain water is fine and tasty! Find lots of shade where you can and eat your weight in gelato, you won't regret it. Many folks you see will be using them across town throughout the day in heavily toured areas.\n\n-THE WALKING/STEPS: WEAR COMFORTABLE SHOES. I was in my Hokas most of the trip along with a backup pair of New Balances and they were fine throughout hiking, touring etc. We logged what felt like a million steps during our trip and all 4 of us were fine. Cobblestone is everywhere so when you are walking make sure you aren't tripping into gaps in the stone. Your small luggage should also be able to roll on streets without issue.\n\n-THE BOTTOM LINE: Vacation of a lifetime! The food was off the charts good. My kids love seafood and there was plenty of octopus, mussels and clams on almost every menu. We even had Indian food in Florence which was great, so if you want a variety it is there. The Fork app isn't the best but did the trick for us when finding food in a pinch. We did make some reservations in advance to ensure we could go to the busier restaurants during summer that were off the beaten path.\n\nAll in all, Italy is a beautiful country with a rich history and culture and the most welcoming people. We had a fantastic time and will definitely be going back again!", "link": "facebook.com/groups/1373361046396315/permalink/2212985895767155/", "likes": 509, "comments": [{"username": "Debbi Mayfield", "comment_text": "So glad to hear about Liv Tours!! After what seemed a million hours of research we went with them for a few tours throughout Italy! By chance did you do private tours in Rome?"}, {"username": "Maureen Judice", "comment_text": "Cecile Broussard\nEileen Huval\nSusan Rabalais Duplantier"}, {"username": "Michael Goldstein", "comment_text": "Thanks for such in depth information. Going next month so very helpful. Glad you had a wonderful experience with your family."}, {"username": "Gretchen Barretto", "comment_text": "Mel CastilloJoash Isaiah CastilloJoachim Miguel Castillo please read. Goldmine of takeaways"}, {"username": "Mary Anne Bates Shube", "comment_text": "Naveen - Thank you for sharing so much valuable information. I am wondering if you did LivTour's 3 hour small group tour of the Colosseum and Forum. If so, did you feel that 3 hours was too much time, too little time or just the right amount? We only have 3 days in Rome and I want to be sure that we are allocating our time for each valuable sight, so that we can see as much as possible and still have a little wandering around time. Thanks!"}, {"username": "Suellen Spurgeon", "comment_text": "Thanks for a very informative post, we are doing the same itinerary Mid September, can’t wait. Can you share how much the photographer costs?"}, {"username": "Faryal Abbas", "comment_text": "Can you please post the colosseum tour links?"}, {"username": "Robert Dangelo", "comment_text": "Wonderful travelogue"}, {"username": "Ali Everson", "comment_text": "Ah isn't it! Beautiful pics!"}, {"username": "Taylor MacDougall", "comment_text": "Tan Dan Hailey Hamilton"}, {"username": "Deborah Moos", "comment_text": "Great post! Thank you!"}, {"username": "Marcus Ho", "comment_text": "Chantal Mah"}, {"username": "Katrina Gibson", "comment_text": "Jason Gibson Jordan Mildenberger Kianna T"}, {"username": "Sim Greenoli", "comment_text": "Thank you so much - what an amazing trip"}, {"username": "Sharon Howson", "comment_text": "Thank you for sharing your information. Can you please share the restaurants in Rome and Venice that you can recommend and book prior. Many thanks for all your time. 🫶"}, {"username": "Stas Varych", "comment_text": "Thanks a lot! The weather wasn't of a great help but we managed to create some beautiful photos! I'm very glad you liked them and to hear that you had a great time in Italy overall."}, {"username": "Gina Hassett Hunt", "comment_text": "Thank you, great review!❤️\nI leave tomorrow and the temperatures are 96-99!!! Just glad the humidity is low!"}, {"username": "Lisa Ritz-Ciccarone", "comment_text": "This is fantastic. Thank you for sharing. We are going for the first time October 2024 so I’m trying to gather as much info as possible."}, {"username": "Melissa Shepherd", "comment_text": "Barry Bishop"}, {"username": "Marilyn Spector", "comment_text": "We went to the Indian restaurant too 😅"}, {"username": "Peg Telser Espie", "comment_text": "Great recommendations\n!"}, {"username": "Denise Incandela Boccio", "comment_text": "Thanks so much for sharing! I am going to Florence in a week in a half ( counting down the days ) my son is getting married in Florence 🤵🏻👰🏻‍♀️We will be in Italy for 2 weeks, I can’t wait!"}, {"username": "Sharon Hayashi Kunugi", "comment_text": "Great write up. Thank you."}, {"username": "Arianne C. Rigby", "comment_text": "Omg thank you so much!! We are planning a trip next September and this break down helps me so much!!!"}, {"username": "Karen Jorgensen", "comment_text": "Karen Enger Ortiz"}, {"username": "Beverly Lax", "comment_text": "Following ❤️"}, {"username": "Donna Laughlin Huber", "comment_text": "Thank you for posting. I will be going in two weeks and your recommendations\nhave helped."}, {"username": "Donna Laughlin Huber", "comment_text": "Would you mind recommending a restaurant in Florence?"}, {"username": "Eugene Klein", "comment_text": "THANK YOU FOR THIS GREAT SUMMARY WE NEED THAT! Because people get scared here by negative comments"}, {"username": "Kerrianne Morris", "comment_text": "Great tips."}, {"username": "Caroline Muir-Varanesi", "comment_text": "Michael Varanesi"}, {"username": "Maria Nicolucci Wimer", "comment_text": "I did a photo shoot too with Stas the end of July after seeing another member of this group post her beautiful pictures! He is very talented & I would highly recommend also!! Agee with all of your pointers."}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "Thanks for sharing"}, {"username": "Carolyn Danielson Sanchez", "comment_text": "Beautiful write up! Thank you!"}, {"username": "Tracy Foss", "comment_text": "Thank-you sounds like a great trip how did you find the reasonable laundry service in Florence?"}, {"username": "Cindy Breneman Hattrich", "comment_text": "Can’t wait. 8 days and I’ll be there!"}, {"username": "Joanne Siu", "comment_text": "Thank you! This is great info. We are hoping to do similar trip."}, {"username": "Eileen Hudicka", "comment_text": "We are planning to stay at marriotts in Oct/Nov in Venice, Florence and Rome. This is our 1st trip to Italy. Can you suggest which marriotts? We’d prefer one that won’t require too much walking to get to the attractions. We are late 60’s and no handicaps but also not accustomed to a lot of walking and realize there will be a lot of walking to see everything."}, {"username": "Donna Parrish", "comment_text": "AmazIng post! Greatly appreciated! Do you have a link to LivTours?"}, {"username": "Nancy Mahrous Samuel", "comment_text": "Naveen Fatima Bokhari please recommend me Venice tours or itinerary i am going tomorrow and has no clue what to do"}, {"username": "Joanne Smith", "comment_text": "What a great post"}, {"username": "Dawn Garcia", "comment_text": "Thank you for your information going in October"}, {"username": "Dafne Espinoza", "comment_text": "Could you please share the contact information for Stas?"}, {"username": "Janet Thom", "comment_text": "Thank you we are going to Rome in Oct."}, {"username": "Mellodee Davenport", "comment_text": "Love your dress! If you don’t mind where did you find it! Thanks for all your great information!"}, {"username": "Windy Wilcox", "comment_text": "Thanks for the post. We are going in October and I’ve a bit stressed with everything I’ve read"}, {"username": "Debbie Bailey", "comment_text": "Livi Bailey Jess Bailey Fi van Staden some useful tips about clothing etc"}, {"username": "Karen Flavel", "comment_text": "Gregory train tip maybe🤷‍♀️"}, {"username": "Meredith Hill Bishop", "comment_text": "This info is super helpful! Doing a very similar trip in early November. Thank you for the tips!"}, {"username": "Matthew Livio Conti", "comment_text": "I’m not reading all of that, but I’m happy for you or sorry that happened."}, {"username": "Katherine AliNuñez", "comment_text": "Thanks for sharing your beautiful experience."}, {"username": "Katherine AliNuñez", "comment_text": "Can you please shared the Indian restaurant in Florence 😀 We love Indian food. We are on our way to 🇮🇹 🎉"}, {"username": "Bonnie Fitzpatrick Feick", "comment_text": "Thanks so much for the helpful recap. Did you have any methods to keep your luggage from getting stolen on the train?"}, {"username": "Tiffany MacMann Flannagan", "comment_text": "Naveen Fatima Bokhari do you remember name of laundry place in Florence?"}, {"username": "Amanda Stewart", "comment_text": "Karen Stewart Great info here for us to take note of before our trip to the same 3 cities in Italy in November."}, {"username": "Margaret Ryan", "comment_text": "Well done. Excellent review and we love those high speed trains. 👌"}, {"username": "Judy Mc Millan Ferency", "comment_text": "Vivian McMillan Joyce McMillan Bedrick Michelle Pereli"}, {"username": "Lisa Ivey Zollinger", "comment_text": "Such great info!! Looks like the vacation of a lifetime! My husband and I are leaving for Italy in September. Is this all public restrooms even at restaurants where you have to pay? And about how much do they charge￼?"}, {"username": "Stacey Miller Clifton", "comment_text": "Such a helpful post. Thank you! Your picture is beautiful!"}, {"username": "Diane M. Farugia", "comment_text": "Diane M. Farugia"}, {"username": "Naveen Fatima Bokhari", "comment_text": "A couple more items:\n\n*Italians are vacationing in Italy right now, especially at the beaches so be prepared for crowds and traffic if traveling by car.\n*Hole in the wall pizzerias and cafes have some of the best food. Eat eat eat!\n*Lemon soda was a favorite of ours throughout the trip.\n*No need to haul food home from Italy - many goods and stores ship internationally\n.\n*Leather is top notch especially in Toscana. Make sure you shop local in each region!\n*Make sure you dress appropriately when visiting religious sites, the tours usually provide a guide"}, {"username": "Stacy Derouin", "comment_text": "Sounds like a perfect trip!"}]}, {"id": "2212986245767120", "text": "We’re going to Italy in October via trains for 10 days. I’m trying to pack light. Backpack and small 20” suitcase. I want us to enjoy the trip, but be smart about it too. Can I do it??", "link": "facebook.com/groups/1373361046396315/permalink/2212986245767120/", "likes": 39, "comments": [{"username": "Teri Shields", "comment_text": "Absolutely! Great tip: bring a small amount of Baby Shampoo to wash clothes in sinks…. It washes out very easily and works great!!! 😉"}, {"username": "Victoria Williams", "comment_text": "Yep"}, {"username": "Nancy Kinnard", "comment_text": "We did a 6 week trip with a 21\" and small bag for toiletries and 2 pair of shoes. Pack light and without cloths you can hand wash . Took the training and cabs, no rental car this trip."}, {"username": "Jackie Bottenberg Evans", "comment_text": "What if you have a CPAP."}, {"username": "Joe Pisano", "comment_text": "What would happen if you took a real suitcase. Oh my God. You’ll be able to change your clothes change your shoes once in a while oh my God"}, {"username": "Mandy Thurmon McLaughlin", "comment_text": "You will look at all the people lugging around coffin size suit cases and be so happy it's not you. I took coordinating mix and match clothes and a bag of powder detergent. Every hotel has a drying rack, just wash clothes in sink if you need."}, {"username": "Noelene Cameron", "comment_text": "Yep you certainly can. I am a chronic over packer and I just did it your way for 6 weeks in Europe, 7 in UK, and 1 week in UAE. We did hire car and use trains in UK, mostly trains in Europe and 2 flights (no hire car). Travelling light makes travelling so much easier and less stressful. I could never go back to my old style of packing unless perhaps I was going to be in one place for the entire trip and I did not have to use trains. I did cheat a little though: I checked my carry on size suitcase for the flights (have Apple Air Tags), and I did send/post things home as the weather changed, with some keep sake purchases (this is not ideal due to cost but always an option)."}, {"username": "Melissa Santos", "comment_text": "I’m an over packer but starting to see it as a fun challenge to pack light."}, {"username": "Rene van Dyk", "comment_text": "Yesa"}, {"username": "Kelley Koboldt", "comment_text": "All of you that have said you can just pack a carry on. No rude comments please but I need to know do you wear makeup? Use hair products? I swear that stuff takes up so much space."}, {"username": "Nicole Dunbar", "comment_text": "Doing similar in November and found this on the net"}, {"username": "Debra Abrams", "comment_text": "My first trip is planned for October- just 7 days but I’d planned to check a larger bag because I want to have plenty of room for souvenirs, but now I’m doubting myself 🥺. Better safe than sorry, or huge hassle to check a bag?"}, {"username": "Kristine Walker", "comment_text": "We are going for 13 days and I’ve been encouraged not to bring even a carry on suitcase….just a large backpack for all the stairs and train travel."}, {"username": "Renee Rundle Stoneham", "comment_text": "Yes you can I did 15 days with the same (21”bag)\nThe key is compression packing cubes and washing clothes.\nYou only need 2 pair of shoes, wear the bulkiest pair. Limit toiletries etc…"}, {"username": "Gary English", "comment_text": "just keep in mind EU plane 'carry on' size is smaller than in the US."}, {"username": "Tonya Rauton", "comment_text": "I used a Duchamp expandable backpack… there are so many compartments I couldn’t find my Murano bracelets for about 10 minutes😂\n\nDuchamp Getaway Expandable Carry-On Backpack Suitcase https://a.co/d/\n7VYwtGV"}, {"username": "Mike Adams", "comment_text": "Sure"}, {"username": "Janette David Payne", "comment_text": "You can !!! We did it for 3 weeks last year, this year we’re doing carry on for 6 weeks… easy !!!"}, {"username": "Andre Le Huray", "comment_text": "Naomi Murphy"}, {"username": "Rosa Zordan", "comment_text": "Yes you can."}, {"username": "Isagani Abalos", "comment_text": "Train stops for only a few seconds. Lugging a heavy suit case or cases can be a problem. Laundromats are available in many places. We saw a couple got separated because of heavy suitcases."}, {"username": "Janette Graham", "comment_text": "Of course you can. Forget the suitcase. Travel light. Enjoy."}, {"username": "Gail Dial Harris", "comment_text": "Yes!"}, {"username": "Tammy Biasi", "comment_text": "I’ll only pack one suitcase 28 inches it keeps all my clothes and souvenirs and I have a special bag for dirty clothes so I don’t have to do any laundry while I’m on vacation. Everything fits in that one suitcase especially if you plan on buying souvenirs and since we go with globise, they take care of our luggage so we don’t have to worry with anything."}, {"username": "Barrie Maynor Vela", "comment_text": "yes we just did for 12 days italy and switzerland with a girls\nscout troop , each had a carry on and a backpack ( with trolley strap! very important) and worked great especially getting on and off trains, ( wear backpack but roller carryon) one of our places had laundry so did that midway)"}, {"username": "Janis Hall Bockelman", "comment_text": "It’s not just clothing! It’s makeup/skin care products/ hair products and styling tools/ medication and first aid/ jewelry & accessories!!I don’t think it’s possible!🤣"}, {"username": "Julie Slavik Budnik", "comment_text": "Get merino wool tshirts and tanks and packing cubes."}, {"username": "Nina Triassi", "comment_text": "I find it difficult bc temperature varies day night thus need different types of clothing plus nice cloths for evening dinning…how do you do it"}, {"username": "Wolfgang Nitsch", "comment_text": "Where are u going to put the shoes"}, {"username": "Pamela Jones", "comment_text": "We are presently away for 5 months & we've managed with one carry on back pack each & 1 20 inch case between us - even covering 2 seasons! You can do it. 2 dresses 1 nice casual pants 1 skirt 3 tops........."}, {"username": "Jennifer Embrey", "comment_text": "Yes, we were gone 20 days. Each had a carry on, I had a purse and my husband had a back pack. We had plenty of clothing and room for souvenirs!"}, {"username": "Joy Crawford", "comment_text": "Yup"}, {"username": "Tina Bush", "comment_text": "Yes, we managed a 16 day trip last summer with a backpack & carryon bag each. We payed to have laundry done once mid-trip. It was less than 40 euros for 2 loads & we didn’t have to spend our time at the laundromat. Just dropped off & picked up the next day. If it weren’t so hot we probably could have made it without & worn some things twice, but everything was smelling like sweat due to the heat."}, {"username": "Theresa Higgins", "comment_text": "We are going in October for 12 days and planning the same. Good luck to both of us 😂"}, {"username": "Shawn Galbraith", "comment_text": "Absolutely\n8-10 days perfect for carryon size"}, {"username": "Pat Cray", "comment_text": "Yes! Pack light!!!!"}, {"username": "Carlenne Brown Jarvis", "comment_text": "Yes! We only travel with carry on size. We did 20 days in Italy, did one stop at a great laundromat in Florence. Last fall did 18 days, washed once at our apartment. Very doable! Easiest way is with a limited colors wardrobe with a few accent pieces like scarves or light cardigan. I only bring 2 pairs of shoes. Packing cubes help also.\nGood luck and have a great trip!"}, {"username": "Jeanne Eliason", "comment_text": "We go to Tuscany in October. 2 people with very small carryon each. We have a washer in the small town we stay in. No lost luggage! We always take a hooded sweatshirt. If it rains we like that better than umbrellas. Buy our shampoo and all after we get there. Then leave it behind. And the small regional trains we take its hard to put luggag up on the racks. Plus lots steps to the correct bin. And steps up onto trains. We go for minimum 2 weeks and we are 70 & 77."}, {"username": "David Horgen", "comment_text": "I'm in Italy right now. One carry on and a small personal bag. It's easy if you stay organized"}, {"username": "Jane Eichhorn", "comment_text": "Take a few collapsible bags to bring back souvenirs!"}, {"username": "Shelley Phillips", "comment_text": "Yes, wear and outfit and take 3. Pack light & wash if you need to."}, {"username": "Steve Bouffard", "comment_text": "Yes. We did it for 42 days."}, {"username": "John Spensieri", "comment_text": "My wife and I spent 6 weeks there, traveling by trains. We had only a back pack and two carryon luggage. On the last stop in Rome, we purchased a large cheap suitcase to ship clothes and other items we purchased back home. Pack smart and it can be done."}, {"username": "Kyla Love Martin Millard", "comment_text": "TOTALLY doable! I just did 9 days that way and there were several items I didn’t even wear. I should’ve brought less and next time I am.💪🏼 You can do it, less is WAY better and you will enjoy your travel so much more."}, {"username": "Douglas Martin", "comment_text": "Easy we always travel light and do a wash during the trip"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Definitely doable. We just did it for 18 days and brought clothes back I didn't even wear. Bring mix and match clothing and rewear outfits. You'll thank yourself in the end for packing lightly."}, {"username": "Christine Saillant Mitbo", "comment_text": "Totally doable! My sister and I spent 2 weeks in France and 2 in Italy. All we had were small carryon, small backpacks and crossbody purses. So many great suggestions are mentioned in this thread and were utilized by us as well."}, {"username": "Debbie Milne Jenkins", "comment_text": "Yes you can - I’ve gone 2 months plus with a carry-on. Bring your most comfortable quick-drying items and be willing to hand wash a few things if you need to."}, {"username": "Judith Fuller", "comment_text": "Yes! Just did 14 days in the UK with only carryon and had things I didn’t wear. Taking less next time. Washed clothes in a laundromat at the halfway point."}, {"username": "Amber Pena", "comment_text": "I’m in Portugal and Spain for 10 days and packed lightly. It’s doable. Just 2 carry ons"}, {"username": "Melissa Johnson Pero", "comment_text": "We did 16 days in June packing light. Because of the heat re-wear wasn't an option so we did 2 laundry drop offs. Very affordable. They wash and fold, one even delivered to our hotel. Take the laundry detergent sheets for quick washes of small items like bras or suits in the tub or sink and hang to dry. You'll be glad you packed light if you're moving around!"}, {"username": "Gillian O'Callaghan", "comment_text": "I enjoyed every minute of my month in Italy....did 13 train trips with \"checked\" luggage (15kgs) and a small backpack. Take whatever suits your holiday style."}, {"username": "Karla Kodanko", "comment_text": "If I can do that for 16 days across Europe, anyone can. 😂🙂"}, {"username": "Lilia Sharff", "comment_text": "I’ve been doing backpack (8kg) all over Europe for two months for the past 7 years It’s so freeing not carrying heavy stuff around and you find laundromats everyone in the hotels or Airbnbs 🙌🏼 great decision you won’t regret it"}, {"username": "Amanda Hopkins Wiseman", "comment_text": "Karen there is a group on Facebook Called Travel Fashion Girls who teach you how to pack for long trips with Carry On Only. I’m obsessed. Still didn’t do COO on my last three international trips, but definitely packed lighter. I hope this helps."}, {"username": "Tina Payne", "comment_text": "That is what I did for 10 days. You may have to find a laundry."}, {"username": "Carla Belli", "comment_text": "Absolutely yes!\nWe did Spain and Italy for 3 weeks-12 cities!! All we had was a small backpack and carry-on each!!\nMade navigating off/on buses trains and planes soooo much easier, not to mention the countless flights of stairs!! Roll all your clothing and use packing cubes for small items and toiletries.\nYou can do it!! Buon viaggio ✈️"}, {"username": "Yvette Zavatero", "comment_text": "I did 23 days with a 21” bag and a 30L backpack. I highly recommend following Travel Fashion Girl here on FB. They have great suggestions for capsule wardrobes, great clothing & toiletry suggestions."}, {"username": "Sonia Gorton", "comment_text": "Wow you are all impressive! We just got back from Italy -3 weeks. I had 2 suitcases and a carryon.🙈 I need options!!! I also shopped for shoes, clothing and souvenirs. Going to try really hard to pack lighter next trip🙃"}, {"username": "Stacy L Hall", "comment_text": "We’re going in October/\nNovember and I think I could do carryon if not for all the toiletries. What do you all do to keep that type packing light"}, {"username": "Bella Z. Veksler", "comment_text": "We did a backpack only for 24 days traveling through Italy/France, just do laundry every few days"}, {"username": "Marisa Torcasio Talarico", "comment_text": "We did this a couple weeks ago with 3 kids (12, 11 & 9) & it’s completely doable! Have fun!"}, {"username": "Kimberly Harrison Loesche", "comment_text": "We just did 14 days. My husband did a small backpack only. I had a small roller bag (carryon) and small backpack. It is totally doable. We handwashed clothes a couple of times. Bring a travel clothesline. It was a lifesaver and the clothes dried really quick."}, {"username": "Bob Lampo", "comment_text": "Absolutely. We did 28 days and we each packed that way. We used a laudramat but that was easy."}, {"username": "Robin Lifpitz Heyman", "comment_text": "Yes. I just did. Buy packing cubes!"}, {"username": "Jenny Payne", "comment_text": "Definitely, less is best, don’t take the world, if you stay in airb&b they have washing machines. I only wear Linen,cotton,si\nlk and hotel that I stay in Rome I send out my clothes €5 per item. I take one pair of rubber soles sandals, & 3 pairs of sneakers cross body back, backpack with a few zips and a cabin case. I have been going every year forever & I sometimes send my old clothes home from the post office not that cheap but it works for me 🌻"}, {"username": "Alicia Burno", "comment_text": "Yes, we are doing 15 days with carryons and backpacks."}, {"username": "Renae Larcus", "comment_text": "Of course. We do a backpack and small rollerboard each. Two weeks."}, {"username": "Bob Deahl", "comment_text": "Absolutely"}, {"username": "John Wilson", "comment_text": "Take clothes that can all be machine washed together and do a wash every 5th day(day 5, day 10, the day you get home). There are coin laundromats everywhere."}, {"username": "Sandy Abplanalp", "comment_text": "Yes you can. I did it in the spring for 23 days. Felt great having and carting around less. Lots of great videos on YouTube to help you pack."}, {"username": "Allan Olexa", "comment_text": "Yes, take dry wick clothing that are easy to rinse out wherever you stay. Pack a few light layers."}, {"username": "Heath Conn", "comment_text": "Would be better to not have any suitcase."}, {"username": "Dawn Swayney", "comment_text": "Yes! We did 16 days in Europe last summer! Packing cubes and good basic bottoms with mix and match tops. You can do it!!"}, {"username": "Jose Velez", "comment_text": "I have a friend that is an ex airline pilot and flies with a small bag. He has to wash every few days"}, {"username": "Nana Kutateladze", "comment_text": "Yes you can do it."}, {"username": "Cassie Ryan", "comment_text": "Yes, we did 14 days. Carry on only. Packing cubes, quick dry clothes, sudoku packing method. 2 pair of shoes including those on your feet."}]}, {"id": "2212991522433259", "text": "For anyone who has been to Da Adolfo in Positano, how long did you stay? We have a reservation at 1:00 and trying to determine what time car service should pick us up at hotel in Positano to take us to our next stay.", "link": "facebook.com/groups/1373361046396315/permalink/2212991522433259/", "likes": 0, "comments": [{"username": "Colita Ellis Wittenkeller", "comment_text": "They won’t bring you back until 4 pm. Bring towels."}, {"username": "Kejdi Okej", "comment_text": "They won ,t bring you back until 4 pm . Bring tiwels."}]}, {"id": "2212988645766880", "text": "Best VRBO in Florence? 8 people. Looking for gorgeous views! TYIA!", "link": "facebook.com/groups/1373361046396315/permalink/2212988645766880/", "likes": 1, "comments": [{"username": "Maureen McCall Bradley", "comment_text": "We went through Chiara 5 Senses. Antonella is amazing!! You can check out her website and send her a message on WhatsApp.\n100% recommend!"}, {"username": "Stephen Slaughter", "comment_text": "Great question"}, {"username": "Romilly Farina", "comment_text": "Following"}, {"username": "Normandy Georgie", "comment_text": "I posted a link but it pending. We stayed here in May and it was perfect!"}, {"username": "Sherry Somers Willome", "comment_text": "We stayed here - great location by Santa Croce. Had two bedrooms and a couch....might have another apt for rent, too."}]}, {"id": "2212492615816483", "text": "If you're Requesting suggestions;\nInclude your means of transportation !", "link": "facebook.com/groups/1373361046396315/permalink/2212492615816483/", "likes": 0, "comments": [{"username": "Giulia Cardamone", "comment_text": "Bit more specific please"}, {"username": "Buzby Burrows", "comment_text": "Magic carpet"}, {"username": "Virgz Van Møøre", "comment_text": "Public transports"}, {"username": "Ritchie Dakin", "comment_text": "Tardis"}, {"username": "Jed Eldredge", "comment_text": "Walking inside cities, rental cars outside of cities."}, {"username": "Colleen Dawson", "comment_text": "And maybe the requested suggestion does not need transportation."}]}, {"id": "2212992552433156", "text": "Hi ladies, I’ve decided to do a last minute solo trip first stop is Italy, i am planning 3 days in Rome , one in Florence and one in Milan. What the best way to get around ? I’m assuming the train ? Also do trains go from country to country ? As I want to go to Spain after then make my way to Lisbon.\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2212992552433156/", "likes": 1, "comments": [{"username": "Diana Hesse", "comment_text": "You need to do a bit of research.\nRe Italy: I would spend 5 days in one place because you’ll lose too much in travel time and won’t see much really or get a feel for anywhere if you do only a day - or less with travel."}, {"username": "Gianna Onesi", "comment_text": "I would do Florence and Rome. Milan you will be rushing for a day and traveling most of the time! For Spain check where the easiest route is and base yourself there easier to get around."}, {"username": "Cecilia Christine Costantini", "comment_text": "I wouldn't recommend doing 3 cities in a rush, maybe just Florence and Rome, and I would fly from Rome to the city you want to see in Spain and fly again to Portugal. I just used Ryanair recently to fly Italy-Spain-Por\ntugal and back to Italy. It depends on how many cities you want to visit in each country."}, {"username": "Basia Szokarski", "comment_text": "Skip Milan."}, {"username": "Rebecca Yeoh", "comment_text": "Skip Milan and do an extra day in Florence so you can see more of Tuscany. You can book your high speed trains via Trenitalia. Roma Termini to Firenze Santa Maria Novella."}, {"username": "Gillian O'Callaghan", "comment_text": "I did lots of train trips while in Europe including 13 in Italy and many between countries. Booked all my trains on Trainline.\nI did do a few buses including Badajoz (Spain) to Lisbon because no train. For buses I used Flixbus. Also arrived into Italy (Turin) from Switzerland by bus.\nHave fun PS nothing wrong with moving towns frequently but now and then for your sanity stay 2-3 nights 👍"}, {"username": "Mary Anna Machi", "comment_text": "If you are flying into Rome, spend at least 3 nights, taking am train to Florence fir minimum of 2 nights. Skip Milan and find best direct flight to next city out of one of these airports: Florence, Pisa, Bologna. Ryan and other European airlines fly low cost from those and easy train from Florence."}]}, {"id": "2213009905764754", "text": "Currently in Milan. For those of you that are into luxury shopping: get Italian brands in Italy, French brands in France. LV, Dior, etc prices are ALMOST THE SAME AS US PRICES, you’ll just get VAT back to reduce the cost a bit.\nExample of better deal: $2500 Gucci tote back home is about $1700 in Milan PLUS 12.5% VAT refund so about $1320.", "link": "facebook.com/groups/1373361046396315/permalink/2213009905764754/", "likes": 1, "comments": []}, {"id": "2213005512431860", "text": "Hi--I just got back from three weeks in Italy and I found out a few things that may be helpful to some of you. 1) I did a day trip (on my own) from Rome to Tivoli and bought a train ticket but did not know there were a few stops in Tivoli (I did a ton of research on this and it wasn't mentioned anywhere). The stop you want to go to is \"Tivoli,\" not \"Bagni Tivoli\" which is where I got off (based on what people on the train told me). It is about an hour walk rom Tivoli. Luckily, there was a bus that went to Tivoli. 2) You can enter St.Peter's Basilica directly from the Vatican museum, which I didn't know! Will save a ton of time because the lines to St.Peter's are really long most of the day. 3) I stayed in Trastevere and the restaurants are very crowded. You can get in pretty easily between 7:00 and 8:00 if you sit inside. Outside waits at some of the more popular restaurants were two hours! 4) The ferries at Lake Como were crazy crowded and hectic. I bought a day pass--it cost a little more (based on the number of trips I took) but saved a lot of time waiting online to buy tickets, so worth it. None of these things were problems and I had an amazing time in an amazing country.", "link": "facebook.com/groups/1373361046396315/permalink/2213005512431860/", "likes": 2, "comments": []}, {"id": "2213005909098487", "text": "Venice.... places to stay and things to do..... best ideas??", "link": "facebook.com/groups/1373361046396315/permalink/2213005909098487/", "likes": 1, "comments": [{"username": "Karen Dwyer", "comment_text": "We love Hotel Aquarius"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d1226\n3777-Reviews-Pa\nlazzo_Veneziano\n-Venice_Veneto.\nhtml"}, {"username": "Mat PO", "comment_text": "Hotel Cipriani"}, {"username": "Jill Wolder", "comment_text": "Hotel cipriani\nMarriott\nShort morning tour to get a lay of the land and what is important and why. Explore and get lost on your own.\nSpend the afternoon relaxing at pool with a spa service.\nDrinks at hotel Daniele on terrace.\nDinner at aman"}, {"username": "Kejdi Okej", "comment_text": "Hotel Cipriani"}, {"username": "John Spensieri", "comment_text": "Go to the Venice Biennial, it’s happening in 2024. There are all kinds of art events all over the city in addition to the pavilions and armory . Also, The fish market"}, {"username": "William John Belcastro", "comment_text": "Private tour of the Doge palace !"}, {"username": "Lauren Smigielski", "comment_text": "Hotel Metropole was stunning and great location! Also offer free water taxi shuttles to Murano to visit the glass blowing museum / gallery!"}, {"username": "Jenny Frank", "comment_text": "Reasonable hotel: best western Olimpia, today 10% back on Rakuten for any BW hotel\nVery well located , breakfast included."}, {"username": "Helen Pottle", "comment_text": "Art Angelo near St Marks was nice.\nDoges Palace, bike ride around Lido, libreria acqua alto, the other islands."}, {"username": "Lynda Edmiston", "comment_text": "Gondola ride 😍. It’s 85 euros, some take card but not all so better to be prepared and use cash. X"}, {"username": "Nick Tana", "comment_text": "My view,\nskip the Gondola,\nand water taxi.\n\nEnjoy the view in a large comfy govt run ferry , that pretty much acts like a bus, with various stops to both the islands of\nMurano and Burano ,\nalong with other stops\n\nThe ferry may be boarded at the entrance to Venice ( entitled Roma terminal\nbus station)or the ferry may be boarded at close proximity to\nSan Marco’s Basilica Piazza\n\nIt’s a bargain , at only 29$ Euro return , with no set time limits and limited waiting times"}, {"username": "Natalia Ottesen", "comment_text": "Murano, Burano"}]}, {"id": "2213007112431700", "text": "How much time is enough time in the Amalfi coast? Basing in one town or possibly two if we stay a night in Positano and want to take a day trip possibly to Capri.\n\nWe are going to other parts of Italy as well. This will be towards the end of our trip.\n\nTrying to decide if we should spend more time in Almalfi and just do 1 day in Tuscany or split the time for two equally.", "link": "facebook.com/groups/1373361046396315/permalink/2213007112431700/", "likes": 92, "comments": [{"username": "Yaya Mann", "comment_text": "The Amalfi Coast is paradise !!! You can’t spend too much time there !"}, {"username": "Gay Gibson Slough", "comment_text": "Food and scenery is lovely in Amalfi, Capri, Sorrento area. Lake Como is a must see if you can."}, {"username": "Loredana Polichetti", "comment_text": "Stay in Cetara, a real town of costiera amalfitana, you can go in Amalfi and Positano with taxi boat"}, {"username": "Pam Ceci", "comment_text": "We stayed in Sorrento and did Amalfi and Capri as day trips. Also Pompeii"}, {"username": "Roberta Jane Burgland", "comment_text": "Is 80 years old to old to go to Amalfi Coast and surrounding towns my husband and I are pretty active Just wondering!!!❤️❤️"}, {"username": "Donna Cafora Shepard", "comment_text": "This answer would be different for everyone. Do you want to lay on the beach? Hike? Shop? Sit and do nothing? What’s your budget? Unlimited or economical? What about physical endurance? Can you handle hundreds of steps or rather be on flat land? I’ve been to the Amalfi Coast several times. It’s beautiful and I love it but I like to see new things and have things to do. After a day, for me, I’ve had enough. I don’t sit on a beach, and I don’t hike. I liked going to Capri but I can do that much more economically from Naples. Why pay top dollar to stay in Positano and leave to visit somewhere else? If you have an unlimited budget, I guess it’s fine. Sorrento is beautiful too. I’ve stayed there too, and Priano. All the places were beautiful. It just depends on what you like to do and what you want to spend."}, {"username": "Shirley Collar Wilson", "comment_text": "We stayed 3 nights in Positano and had day boat trips to Capri, Amalfi-loved Positano"}, {"username": "Dina Garrett", "comment_text": "Julie Franco Mellow, BillandAngala Verley, Linda Williams"}, {"username": "Amanda Davies", "comment_text": "I would stay in Sorrento for 4 nights if possible. One day to take the ferry to Capri, one day for the train to Pompei and one day for the Amalfi coast including Positano. This is possible on public transport ( bus) or hire a private driver who will stay with the car while you walk down through Positano. Same in Amalfi and from there you can take a boat trip to see the beautiful villas along the coast."}, {"username": "Kelly Thuy-Trang Doan", "comment_text": "Lena Lai 😅🤭\nYou planned this one.."}, {"username": "Brandi Ashlock", "comment_text": "We were there for 6 nights and could easily have spent 6 more. It’s so beautiful."}, {"username": "David Ratkai", "comment_text": "I simply dont understand people who stays for just a couple of days in such splendid places. Spend as many time as you can! We usually go for 3 weeks, but you should go at least for 2 weeks. Take your time, enjoy your vacation, regenerate your soul and body. You really deserve it!!!! A psychologist said that for a complete relaxation you must go for a vacation at least for 10 days, because you need around 3-4 days to let the stress go away. After that you can enjoy your vacation. True story!!\nWe love Italy , it is one of the best country to spend your holidays. We will go this Saturday for 20 days to north Italy, Treviso, Padernello, Montebelluna, Jesolo, Cortellazzo... awmmm, we cant wait!!!\nWhat is the meaning of hard working if you dont spend your money to travel a lot, and regenerate yourself? It is a present for yourself!!!! And then you will be much more motivated to do your job again!!! Love it..."}, {"username": "Delana LaHue", "comment_text": "3"}, {"username": "Valentina Bachi", "comment_text": "1 day in Tuscany makes no sense, it's not worth the effort. Better go to Amalfi and come back toTuscany another time :)"}, {"username": "Pippa Gilbert", "comment_text": "Never enough time! 😂😍"}, {"username": "Rose Moccia", "comment_text": "We loved Ishchia"}, {"username": "Vanessa Durkin", "comment_text": "Did 3 days florence 5 days umbria 4 days rome 5 days salerno amalfi coast etc vusited pompei positano amalfi and capri plenty of time"}, {"username": "Rog Er Young", "comment_text": "Between Amalfi and the Greek islands, which one is better if I only have time for one?"}, {"username": "Sherry Par", "comment_text": "Shirin Salehinia… this 👆"}, {"username": "Courtney Rose", "comment_text": "I did 5 days. I should of stayed longer but I had to move on to other spots. 🙂 if you can stay longer I say do it."}, {"username": "Barbara Beer Brown", "comment_text": "We stayed a week in Positano. We stayed in a beautiful hotel. Unfortunately ￼I don’t remember the name. We took two day trips by boat to Capri and they took us to a restaurant you could only get to by boat. It was just a captain and us so we could do we wanted to do. I loved every minute I could’ve stayed longer."}, {"username": "Laurine Seroka Moore", "comment_text": "i agree with others. Skip Capri and go to\nIschia. Amalfi coast will be super crowded but very beautiful."}, {"username": "Jodi Mazzarelli Calabrese", "comment_text": "We used Sorrento as our home base and stayed for 3 nights…we cried when we left and if it wasn’t in the middle of our trip we would have extended our stay. It’s just beautiful and there’s so much to see. I hope you love it as much as we did! 💕😀 Have fun!"}, {"username": "Kirsten Patterson", "comment_text": "3 is more than enough. It’s small. We just left"}, {"username": "Kirsten Patterson", "comment_text": "Also depends on how much you want to do. We did a lot in 3 days all around. We don’t stay in Amalfi too touristy but Nerano is the best!!"}, {"username": "Josephine L. McGinnis", "comment_text": "Try not to miss Capri"}, {"username": "Tamar Runcer", "comment_text": "3 - 4 days is enough if you want to see more. If you only wanna visit one specific place, and you’re trying to save time for other places, I would say two days. Based on my experience from five days ago enjoy."}, {"username": "Kate Bryant", "comment_text": "It depends how much time you have, and what sort of transportation you’re planning on taking.\nTuscany definitely needs more than 1 day. There is soooo much to see. Firenze alone for 3 days, Sienna, San Giminargo.\nIn Firenze you have the Acadamia gallery where Michel Angelo’s statue of David is, the Ufizzi art gallery. Pont a Vehhio . Sorry about the spelling.\nDo your research, their is so much to see. Amalfi, Sorrento and Positano are breathtaking.\nDon’t forget on your way down south to go and see Pompeii!\nHope that helps. I once lived in Firenze for 3 months.\nHave fun and enjoy 🙏"}, {"username": "Steve Savva", "comment_text": "You can never spend enough time anywhere you are in Italy, especially the Almalfi coast. It depends what you like to to. Why not split it an then in that way you get to better taste the beauty and landscape of the Almalfi coast"}, {"username": "Elle Jay", "comment_text": "I agree that 1 day in Tuscany (a massive region) isn't enough. We spent 9 days there, driving to wherever we wanted to spend 2 nights minimum in a town/village.\nSuch a hard decision.....go\nod luck 😊 we had 4 weeks in Italy and could easily have spent 4 months!"}, {"username": "Susan Bridges", "comment_text": "Skip Capri. Positano and Sorrento"}, {"username": "Jeff McLellan", "comment_text": "I would stay on Capri and do boat trip around island and also boat to Positano and Amalfi."}, {"username": "Susan Lowry Lamb", "comment_text": "I personally feel as though you could have 100 years on the Amalfi coast and it would not be enough time."}, {"username": "Lynn Tritscheller Agnew", "comment_text": "We stayed on the Amalfi Coast for the last five days of a two week trip. We are still talking about the beautiful town of Praiano. Left a permanent mark on our hearts!"}, {"username": "Raymond Mantovani", "comment_text": "There isn’t enough time!"}, {"username": "Amy Corday", "comment_text": "Pompeii and Herculaneum are truly life-changing! If you go to Amalfi Coast, go there. Nothing like it on the face of the earth!"}, {"username": "Julie Agarkov Mayblyum", "comment_text": "I would not spend thi slittle time either in Tuscany or in amalfi coast. There is so much to see to really expolore and enjoy it. If you don't have enough time, leave it for another trip. One night would not to justice to either region."}, {"username": "Rhonda Hope", "comment_text": "How long is trip and when"}, {"username": "Lucrezia Folger", "comment_text": "1 day in Tuscany is impossible, 1 day in the Amalfi Coast is impossible. How much time is enough for me I've been back to Amalfi 4 times 1 week each time, Tuscano, a month twice."}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Kathy Ann Jones", "comment_text": "I’m making my 15th trip to IT in Sept (since 2004). The Amalfi Coast is truly one of the most beautiful places on earth. A week in Naples (3 days), Capri (2 days), and Amalfi (2 days) still leaves me wanting for more time!"}, {"username": "Sonia Dunstan", "comment_text": "Depends on what time of year you are going. If it is peak time, you will need to allow a lot of extra time to get around the Amalfi Coast as buses are full and sometimes you might have 2 or 3 full buses go past before you can get on one. I personally would spend more time in Tuscany. Consider staying in Orvieto - one of our favourite places. And much quieter and less touristy than the Amalfi Coast."}, {"username": "Patricia Hall", "comment_text": "Whatever you have it'll be beautiful and just enjoy"}, {"username": "Patty Ham", "comment_text": "Both are beautiful. Pick one and stay."}, {"username": "Jen Phillips", "comment_text": "We’re leaving this Friday for 18 days in Italy ending with 3 nights Sorrento & 3 nights Amalfi then early private transfer to Naples airport to head over to the Greek islands. I’m hoping 3 nights in each is enough"}, {"username": "Dana McLoughlin", "comment_text": "We absolutely loved the Amalfi coast!! We spent 3 days of our 10 day trip there. Stayed in Maiori- went to Positano, Amalfi, and Capri and did half day on a boat going up and down the coast and went swimming as well. Beautiful!"}, {"username": "Wanda Ashburn", "comment_text": "What is weather like in October and November?"}, {"username": "Octavian Ciobanu", "comment_text": "Ivan Balica Sanda Adam Octavian Ciobanu"}, {"username": "Sara Burrow", "comment_text": "Most definitely."}, {"username": "Cassandra Blanchard", "comment_text": "We have a 12 day trip planned to the amalfi coast - ischia, Sorrento, Positano, Ravello, Naples. I just had so much I wanted to see that I kept this trip all Amalfi Coast!"}, {"username": "Elena Eckley", "comment_text": "When in Almalfi, please try to go to Ishchia!"}, {"username": "Tania Lediard", "comment_text": "Stay the night in Ana Capri if you want more time. That place is magical after the “tourists” go home. We loved it. Capri was too busy for us."}, {"username": "Bernadette Moran McDowell", "comment_text": "I think a month would be ok. Beautiful."}, {"username": "Raffaela Ferrari-Romito", "comment_text": "I’m in Salerno now. We’re going to Revello tomorrow and a boat ride on Tuesday. Then leaving Wednesday morning."}, {"username": "Larry Reinier", "comment_text": "Two nights was enough for me. Way to crowded"}, {"username": "Cess Kearns", "comment_text": "At least 5, two days in the Isle of Capri. It is so beautiful I wish I coulda spent a couple more days."}, {"username": "Don Mchugh", "comment_text": "Buy a place there.. or at least look into it\nLook for something relatively close… then sell after a couple of years"}, {"username": "Graham Sherlock", "comment_text": "More in Tuscany, Amalfi is very difficult to navigate and horrendously steep and beaches are poor."}, {"username": "Nancy Khoury DeRosa", "comment_text": "Dom DeRosa"}, {"username": "Donna Austin Jones", "comment_text": "We spent two weeks on there on two different trips. Part of that time was on Capri❤️❤️❤️ there’s so much to see and so wonderful to enjoy it all at a leisurely pace."}, {"username": "Mary Agozzino Derrick", "comment_text": "Split your time, Florence deserves at few days and so does Amalfi"}, {"username": "Melissa Marth Paretti", "comment_text": "We did 3 nights in Rome and 3 nights in Sorrento, traveling to Capri one day and Positano one day. It was nice to relax at the end of our trip after touring and walking through Rome for 3 days."}, {"username": "Andria Saia", "comment_text": "Really depends on what you want to see - Pompeii, Herculaneum, Iplontis, Sorrento, Positano Amalfi Ravello Capri, Ischia"}, {"username": "Dymphna Clohessy", "comment_text": "We did 4 nights Pompeii/ Amalfi Coast and 2 days Rome."}, {"username": "Nakitha Badon", "comment_text": "We stayed in Amalfi 2 nights and 3 days"}, {"username": "Chris Love", "comment_text": "We leave for the AC in late September. Staying 3 nights in Praiano and 2 in Sorrento.\n\nBut we never try to pack too much travel into any one trip. Leaving parts of Italy unseen makes for great reasons to return."}, {"username": "Alicia Cox", "comment_text": "Well honestly Amalfi, ravello, positano, Capri, Sorrento - lots to see.\nTuscany - Lucca, Volterre, Sienna, San Giamignano, Pisa, Florence\nYou can get a taste by doing both, but if you choose one area over another you can really experience it. Just depends if you think you will have a chance to return to Italy again."}, {"username": "Fetchin Gretchen", "comment_text": "I spent 4 nights based in Sorrento, which gave me a leisurely pace. Took train to Naples, subway one stop to pier and ferry from Naples to Sorrento. There is a bus along the coast to Serrano I recommend sitting on right coast view side, then take ferries to positano, Capri, Amalfi etc."}, {"username": "Jason Hobel", "comment_text": "How many days total for your trip? We did 10 days total ourselves. We did 2.5 days in Sorrento which next time will be longer for sure. 5 days in Florence which was a day or two to long and 2.5 days in Rome which was way too short. It was our first trip to Italy and was a get a feel of it kind of trip. We learned a lot from our experience and will definitely make adjustments next time. Plus there is so much more of Italy to see. Next trip will be more a regional visit so we can take our time and explore more."}, {"username": "Tony Downs", "comment_text": "We stayed 4 days in Sorrento and it seemed like enough. Maybe 1 more day but not more than that"}, {"username": "Elyse Lichtman-Scheiner", "comment_text": "You ￼can’t go wrong no matter what you choose. We stayed in Positano and Sorrento 3/3. We met a couple that stayed in Praiano and loved it! Amalfi, Ravelo, Positano, Sorrento, Capri, Ischia… all accessible by ferry. If it’s your first time there, I think Positano and Sorrento are well worth the peek. Be prepared for thousands of steps in Positano..just sayin’🤪"}, {"username": "Michelle Bergman Davis", "comment_text": "We did 3 nights in Positano and did a day trip to Capri. It was plenty of time."}, {"username": "Susan Sassoon", "comment_text": "In Italy whatever you do there are no wrongs. Rome, Florence, Venice are culture. The smaller places beauty and relaxation."}, {"username": "Bob Deahl", "comment_text": "Four nights, five days. Stay in Positano, get to Sorrento, Ravello, skip Capri and go instead to Ischia, Italy"}, {"username": "Deborah Gold", "comment_text": "We did a 16 day trip that included Amalfi at the end. We stayed 3 or 4 nights in Praiano (not Positano, highly recommend). And 2 nights in Sorrento so we could a) get up to Pompeii, and b) get an early car to the Naples airport to fly home. We loved Sorrento for the day we had to explore it.\n\nWe didn’t get to Ravello but we did the boat trip to Capri for a day, walked the Path of the Gods another day (just part of it) and went to Amalfi Town by bus another day (then walked through to neighbouring village of Atrani). We had enough time, given it was late October so we didn’t need ‘lie on the beach’ time. In Atrani, I definitely put my feet in the Med on the little rocky beach. The walk was a lot of fun through the sleepy village. I’d say we had enough time, except the buses were so packed and uncomfortable, and other tourists SO rude to the locals, and SO loud and obnoxious, that we decided to forego riding yet another one to Ravello."}, {"username": "Tammy Oehler Liggett", "comment_text": "Next spring we will have 2.5 days in Rome, 4 nights in sorrento (doing day trips to Capri and Pompeii) and 4 nights in Florence (day trips to wine country and to cinque de tera). Just cancelled out our 1 night in Venice….5 hour train ride there so would just have evening/early morning only. Decided that last bit was too much running and stress. Trying to find the balance."}]}, {"id": "2213008599098218", "text": "Favourite hotel in Milano City Centre?", "link": "facebook.com/groups/1373361046396315/permalink/2213008599098218/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d7363\n249-Reviews-Hot\nel_The_Square_M\nilano_Duomo-Mil\nan_Lombardy.htm\nl"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213010032431408", "text": "Lovely Alberobello - Apulia", "link": "facebook.com/groups/1373361046396315/permalink/2213010032431408/", "likes": 908, "comments": [{"username": "Linda Miller Ball", "comment_text": "Beautiful!"}, {"username": "Barb Thompson", "comment_text": "Oh, how I wish to go there! ❤"}, {"username": "Marie Cuzzi", "comment_text": "Visited 3 years ago it is so amazing… love it"}, {"username": "Sherry Martin", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Lise Mor", "comment_text": "Hanna"}, {"username": "Ronnie Johnson", "comment_text": "This place looks very cute."}, {"username": "John Joseph Gardella", "comment_text": "Been there on a rick steves trip. Very cool houses"}, {"username": "Katie Potter", "comment_text": "Katie Potter"}, {"username": "Ronald Clement", "comment_text": "Spent the day there, tripping around Italy, beautiful place."}, {"username": "Jo Courage", "comment_text": "Paul McCarthy how cute is this place??"}, {"username": "Kara Tathem", "comment_text": "Michelle Power"}, {"username": "Claire Moore", "comment_text": "Eimear"}, {"username": "Caroline Robin", "comment_text": "Caroline Robin"}, {"username": "Denise O Shea Lacey", "comment_text": "Shelley Adams"}, {"username": "Annie Street Jr.", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Nikita Rivera", "comment_text": "Blair Light😍😍"}, {"username": "Jane Aylward", "comment_text": "Jane Aylward"}, {"username": "Giovanna Angela Carini-Asciutto", "comment_text": "Mike Padovano so cool!"}, {"username": "Ann Casale Grosso", "comment_text": "Wow! Gorgeous! is there plenty to do here ?"}, {"username": "Birgitte Dybdahl", "comment_text": "Which airport to choose is for this amazing place?"}, {"username": "Ana Sanchez", "comment_text": "Beautiful!!"}, {"username": "Agnieszka Górzna", "comment_text": "I haven been there once and I will come back there one day for sure"}, {"username": "Curtis Seppala", "comment_text": "Tania Lirette-Seppala"}, {"username": "Theresa Curran", "comment_text": "So beautiful I would love to walk down there"}, {"username": "Stephanie Earl Peterson", "comment_text": "Such a cool place to see in person. Sadly it was ridiculously crowded when we were there so we didn't stay as long as we would have liked."}, {"username": "Hanlie van den Berg", "comment_text": "Lana De Reuck ..ek het altyd gewonder hoe lyk dit in d somer"}, {"username": "Leigh Skarstrom", "comment_text": "Rhiannon Mitchell"}, {"username": "Jenni Kovacs", "comment_text": "Anna Mercia Puntillo 😃"}, {"username": "Enolita Castillo", "comment_text": "I was there a year ago and I was mesmerized by this lovely & unusual site."}, {"username": "Robyn Young", "comment_text": "How stunning!"}]}, {"id": "2213011519097926", "text": "Beautiful Lake Como - North Italy", "link": "facebook.com/groups/1373361046396315/permalink/2213011519097926/", "likes": 268, "comments": [{"username": "Marie Imperial", "comment_text": "Varenna ❤️🇮🇹"}, {"username": "Ken Vecchia", "comment_text": "Gorgeous"}, {"username": "Shirley Preissler", "comment_text": "So peaceful and beautiful."}, {"username": "Carole Canali", "comment_text": "Gorgeous. George Clooney thinks so!"}, {"username": "Gabby Miller", "comment_text": "Ian Schuster"}, {"username": "Michele Donley", "comment_text": "Angela Lewis"}, {"username": "Phyllis Nel", "comment_text": "Stunning."}, {"username": "Phyllis Nel", "comment_text": "Stunning"}, {"username": "Kim Paetsch", "comment_text": "What is the temperature of water?"}, {"username": "Mark Palmieri", "comment_text": "Fabulous"}, {"username": "Mark Palmieri", "comment_text": "So beautiful"}]}, {"id": "2213012969097781", "text": "Did anyone here visit these botanical gardens while in Rome? Is it worth the time? Would it be a nice nature “break” while I’m in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2213012969097781/", "likes": 0, "comments": []}, {"id": "2213011849097893", "text": "Has anyone done a Vespa tour of the Chianti wine region?", "link": "facebook.com/groups/1373361046396315/permalink/2213011849097893/", "likes": 0, "comments": [{"username": "Pamela Oslin Binson", "comment_text": "F"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nTuscany-Vespa-To\nurs-one-day-ves\npa-tour-through\n-the-hills-of-C\nhianti/\nd519-168744P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2213014522430959", "text": "Has anyone taken the overnight train from Reggio Calabria to Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2213014522430959/", "likes": 0, "comments": []}, {"id": "2169012253497853", "text": "✨Positano, Amalfi Coast✨\n🤩John Steinbeck, who visited in 1953, wrote: 'Positano bites deep. It is a dream place that isn't quite real when you are there and becomes beckoningly real after you have gone.'\n✨The… आणखी best luxury hotel: Le Sirenuse 5*✨\nLe Sirenuse is a wonderful place from which to enjoy the simple pleasures of Positano and the spectacular Amalfi Coast.😍\nThe hotel sits at the heart of Positano village, on scenic ‘Amalfi Drive’, just 55km south of Naples. 💖Perched above the sea, the rooms, terraces, bar and restaurant are an oasis of peace and silence, illuminated by a breathtaking view.\nBook here for the best price👉 https://bit.ly/2ZYpBPz", "link": "facebook.com/groups/1373361046396315/permalink/2169012253497853/", "likes": 95, "comments": [{"username": "Meryam Ali", "comment_text": "⁦❤️⁩⁦❤️⁩⁦❤️⁩⁦❤️⁩😍😍😍"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "😍"}, {"username": "Marilyn Simpatico", "comment_text": "Gorgeous!"}, {"username": "Michelle Broome", "comment_text": "Amazing!!!"}, {"username": "Seonaid Renwick", "comment_text": "Staying here in 3 weeks… can’t wait!!!! 🥰"}, {"username": "Rebecca Yeoh", "comment_text": "As seen in the film “Only You” with Marisa Tomei 👌🏼"}, {"username": "Rocio Isasi Cortazar", "comment_text": "Victor Segovia Jr."}, {"username": "Christine Malota- Kendall", "comment_text": "Wow. Beautiful but not on my salary. 🥴"}, {"username": "Ebony Morelli", "comment_text": "Domenic Morelli yes please"}, {"username": "Bea Ferris", "comment_text": "Edward Durham"}, {"username": "Rachel Godwin", "comment_text": "Clem Ferris"}, {"username": "Susan Buckley Thorpe", "comment_text": "Beautiful!! Stunning!!! ♥️♥️♥️"}]}, {"id": "2212856589113419", "text": "Im visting Italy for some time and I will stay in Pozzuoli for over a week, any activities nearby? Saw some places to visit on internet but im looking for something hidden/breathtaking. I want albo visit Napoli, any places i should see? Im traveling by own car.", "link": "facebook.com/groups/1373361046396315/permalink/2212856589113419/", "likes": 2, "comments": [{"username": "Chiara Normanno", "comment_text": "That's plenty of time to explore that part of Campania. Aside from Naples, Pompeii and Sorrento, you should see the followings: Casina Vanvitelliana, Cuma, Virgilian Park, Nisida Island, Gaiola beach and Island, Pausilypon Archeological Park, Donn'Anna Palace (this can all be done in a whole full day or two half days). Take a day trip to Reggia di Caserta and try Francesco Martucci's pizza (i Masanielli, the best you could wish for, need to book in advance), if the weather is lovely you could go to Laghi Nabli but also Ischia, Capri and Amalfi coast. Helps if you've got a car and surely you'll have to pick some of these not all of them, look at pictures and decide which ones inspire you."}]}, {"id": "2212562272476184", "text": "Hi! Does anyone know of any companies who plan out your day excursions for the entire trip city by city for a fee? We have the flights, hotels, etc. Just need the itinerary.", "link": "facebook.com/groups/1373361046396315/permalink/2212562272476184/", "likes": 3, "comments": [{"username": "Rosa Zordan", "comment_text": "Just go to a travel agent"}, {"username": "Rosemarie Ramunni-beninati", "comment_text": "Trips to Italy.com or the concierge in the hotel"}, {"username": "Diane Davis Lawyer", "comment_text": "Interesting question. I would guess a travel agency could do this, but if you have your hotels and flights, not sure where they would make their commission. Perhaps they can make it from the tours they book for you? I've never used a travel agency, so I'm not sure."}, {"username": "Steven Gregg", "comment_text": "Rick Steves offers that service for really low cost"}, {"username": "Greg Saba", "comment_text": "Google 1,2,3 days in almost in city and you will get numerous itineraries. Then google things to do near that city, and you will get even more ideas. Much more than many travel agents will provide, since they will largely be looking at commissionable and overpriced trips by such companies as Viator."}, {"username": "Elaine King", "comment_text": "I'm planning my own trip,"}, {"username": "Dana Latrice", "comment_text": "Chatgpt"}, {"username": "Trish McIntyre Butters", "comment_text": "I’m using Kim Kim. Check it out. So far I’m pleased."}, {"username": "Maureen McCall Bradley", "comment_text": "We met quite a few Rick Steves tours. They all seemed to be very happy. I think it’s pretty go-go.\nMaybe you can look at their itineraries as a start.\nIt would be great to see a lot and note where you’d like to come back to next time.\nwww.RickSteves.\ncom"}, {"username": "Dominique LeBaron", "comment_text": "I could probably help put an itinerary together for you. I’ve been to Italy several times. I love traveling."}, {"username": "Joanne Atkin", "comment_text": "Globus travel."}, {"username": "Melanie Trahan", "comment_text": "Use the Visit A City app"}, {"username": "Bridget Gieseke", "comment_text": "Figure out what you want to see in each city and then book the tours. We used Viator and were very happy with them."}, {"username": "Marty Harte", "comment_text": "I had a friend use Cultural Italy back in April. She raved about them. Web site is the company name. All her days and excursions were planned from Venice to Amalfi."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "A good travel agent should be able to do that"}, {"username": "Jerry Lyubelsky", "comment_text": "We used a travel agent first time. This year I planned it all and made my own itinerary"}, {"username": "Annika Banks Taylor", "comment_text": "Yes! Italyvacations.\ncom (Perillo tours) was amazing!!! Arranged our tours, transfers, ski the line tickets, classes, etc. highly recommend."}, {"username": "Michele Liggett", "comment_text": "Try JayWay Travel . They are great for customized trips."}]}, {"id": "2212589455806799", "text": "Just learned to besure and rip up your boarding pass after your flight- the boarding pass barcode contains personal sensitive information on you- don’t just toss it or leave it anywhere.", "link": "facebook.com/groups/1373361046396315/permalink/2212589455806799/", "likes": 2, "comments": [{"username": "Isabelle Truong", "comment_text": "Wow that’s interesting to know. I didn’t think the bar code has all your personal details!"}, {"username": "Kristin Johansen Mascia", "comment_text": "Do the same with hotel room key cards! All\nOf your info is imbedded in the magnetic strip. I take mine home and bend them in half before I dispose of them."}]}, {"id": "2212682372464174", "text": "Looking for a transportation from Florence train station to Airbnb for 7 people with luggage. Anyone have recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2212682372464174/", "likes": 1, "comments": [{"username": "Stephen Henn", "comment_text": "We asked our Airbnb host about a pick up and he arranged for it. Check with your host."}]}, {"id": "2212807372451674", "text": "Does anyone know any rental companies, or apartment owners in Salerno?", "link": "facebook.com/groups/1373361046396315/permalink/2212807372451674/", "likes": 1, "comments": [{"username": "Ken Vecchia", "comment_text": "Budget"}, {"username": "Chiara Normanno", "comment_text": "Are you looking for a B&B?"}]}, {"id": "2212813932451018", "text": "Hello can you help please we are staying in Rome in April 2024 would it be better to do a day trip to capri or Amalfi coast?? We can only do 1 😞", "link": "facebook.com/groups/1373361046396315/permalink/2212813932451018/", "likes": 3, "comments": [{"username": "Jon Davis", "comment_text": "Capri will take your breath away!! If you are into sightseeing and several beaches."}, {"username": "Jon Davis", "comment_text": "Jon Davis"}, {"username": "Rebecca Yeoh", "comment_text": "Both great! I’d do Capri."}, {"username": "Gillian Chantrelle", "comment_text": "Hard to choose - both fantastic! Probably pick Amalfi coast if pushed."}, {"username": "Jenny Payne", "comment_text": "It’s a long way from Rome to Amalfi for one day🌻"}, {"username": "Rosemarie Ramunni-beninati", "comment_text": "Amalfi coast"}, {"username": "Chiara Normanno", "comment_text": "I am aware of full day cruises that include both"}, {"username": "Monique Anne", "comment_text": "Check to make sure boats go out in April….thought I read somewhere that it was only may-oct ….but I could be wrong."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "April is pretty early."}, {"username": "Renae Larcus", "comment_text": "Capri"}, {"username": "Pat Cray", "comment_text": "Definitely Amalfi!!!"}, {"username": "Lora Ruscitti Covington", "comment_text": "I recommend Ischia. Near Capri but a lot less touristy. Absolutely beautiful!"}, {"username": "Stacy Prestigiacomo", "comment_text": "Both are beautiful"}, {"username": "Barb Krieg-Stepien", "comment_text": "Almalfi! Capri way too crowded and not really worth it"}, {"username": "Jennifer Avrett", "comment_text": "Neither of those are a pleasant day trip from Rome. Unless you're just trying to check a box to say you've been there, save those for another trip"}, {"username": "Jennifer Gustafson", "comment_text": "1 day isn’t enough time you would have to travel by train to Salerno and then ferry to Amalfi/Capri only to turn around and come back with no time to explore.\n\nI would explore one of the other towns closer to Rome."}, {"username": "Leslie Goodland", "comment_text": "If you're from the USA don't forget your visa."}, {"username": "Robin Terzi", "comment_text": "Cinque Terra!!"}]}, {"id": "2212816145784130", "text": "My husband and I had a month booked touring around Italy, sitting back reflecting on our holiday to come and reading everything on this post we thought we might stay longer and visit the Amalfi Coast or Sicily. Does anyone have any recommendations on Airbnb or reasonably priced places to stay near the beach on the Amalfi Coast, for this October or same for Sicily. Any suggestions would be greatly appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2212816145784130/", "likes": 1, "comments": [{"username": "Mary Agozzino Derrick", "comment_text": "Try checking out VRBO or check idealists.it rentals...."}, {"username": "Chiara Normanno", "comment_text": "October is cheaper in Amalfi, if not, you could choose a place on the coast or stay in Salerno/\nSorrento/Naples and take day trips to explore around"}, {"username": "Jenny Payne", "comment_text": "Great area to stay is a town called Cefalu about one hour from Palermo , a lot of Sicilian’s all stay there for holidays in august 🌻"}, {"username": "Elizabeth Arteaga", "comment_text": "How exciting!!"}, {"username": "Rose Turdo", "comment_text": "Sicily, Augusta Hotel - Ristorante Capo Campolato\n+39 0931 981022\nhttps://\nmaps.app.goo.gl/\ntQKJk6Z2R98KkgVV\nA\n\nTus Hotel on SS113 in Castel di Tusa is central North coast. It's only about 30 minutes from Cefalu.\n\nGoogle maps is great for strategy and not wasting time back tracking.\n\nAlberobello is an absolute must see in Puglia."}, {"username": "Rachel Gray", "comment_text": "Villa Bossa in Ravello was great. It’s actually in Ravello but not up the mountain and easily accessible to the beach, Amalfi and Atrani."}]}, {"id": "2212854479113630", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2212854479113630/", "likes": 1, "comments": []}, {"id": "2212854369113641", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2212854369113641/", "likes": 7, "comments": []}, {"id": "2211710832561328", "text": "Question: just wondering…\nwhy does everyone focus on packing light and taking very little with you? What difference does it make?\nAdded:\nIt seems like everyone is carrying their own bags… and taking public transport. Doesn’t anyone plan private transfers and have hotels where they have staff to carry 💼 luggage?", "link": "facebook.com/groups/1373361046396315/permalink/2211710832561328/", "likes": 30, "comments": [{"username": "Kristy Bretagne", "comment_text": "Comfort, less stress, easier with walking and transportation"}, {"username": "Beth Ann", "comment_text": "Easier to move around and also easier to repack after you inevitably buy things."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "If you move around, especially on public transit, it is a huge hassle to schlep lots of luggage. Plus the wheels on many suitcases don't do well on cobblestone streets"}, {"username": "Andrea Ferretti- Kearney", "comment_text": "It was a game changer for us. We did not rent a car and we’re dependent on trains and walked a lot. That being said, we managed to pack quite a bit of clothes in those packing cubes"}, {"username": "Kasey Jackson", "comment_text": "And to avoid checking bags and the risk of them being lost"}, {"username": "Basia Szokarski", "comment_text": "All of the above!"}, {"username": "Alicia Cox", "comment_text": "All of the above AND it makes you realize you can have a fabulous (easier) trip without your entire closet 🤣."}, {"username": "Colleen Dawson", "comment_text": "To each his own. Depends on the kind of traveler you are and your needs. When we travel to Italy is usually for at 3 months or more so always have a check bag , rental car since we travel to the north from Milan.Others rely on trains, staying in multiple cities so carry on suits them best . Decide what kind of traveler you are and do what suits you best."}, {"username": "Monica Moore", "comment_text": "I’m so glad that I only had this to tote around airports, trains, up and down stairs, taxis, and ferries. Plus, I knew it wasn’t getting lost by the airlines."}, {"username": "Angie Boutzis-Luis", "comment_text": "It will make sense when you see the terrain and number of stair cases"}, {"username": "Veronica Glenn Cerimele", "comment_text": "We were just in Rome and I packed light just like everyone suggested and I’m glad we did! You have no idea how many people are hauling huge suit cases around and they looked very unhappy. Most taxis don’t have room for them. And you will struggle with them on the trains too! And don’t forget it’s very humid and hot right now"}, {"username": "Janine Emma Lucas", "comment_text": "It really depends David Ockman how long are you going, how many cities? Alone or through a tour group? Car or public transport?"}, {"username": "Mugette Matos-Barber", "comment_text": "I mean, we don’t know what kind of trip you are planning. Will you be going from city to city on your own by train ? Yes pack as light as you can . If you are going on an all inclusive tour with everything done for you like transport , luggage carrying and such for then pack as much as you want."}, {"username": "Ken Lerch", "comment_text": "Where to start: costs of transport on planes, storage, tips; effort to load, unload, stairs, cobblestones, trains; not looking like an inexperienced, ignorant traveler; focusing on what and where you are, not what you wear."}, {"username": "Maria Timpano Borowitz", "comment_text": "I take a large checked bag with all the clothes I want. I’ve done trains, taxis, cobblestones.. you name it. It’s what makes me happy.. it’s all about what works best for you.. you do you !!"}, {"username": "Paula Brink", "comment_text": "It all depends on you and how you travel. I check a 24 in bag and have a small (19in) carry on. I use taxis between airports/train stations and my hotels, the few times taxis couldnt drop me off right at my hotel I was fine maneuvering on the cobblestones.\nI’m fit so have no problem lifting my bags onto trains, overhead racks etc.\nJust do whatever suits your lifestyle and the type of trip you are taking."}, {"username": "Pooja Patel", "comment_text": "Easier transportation and to leave space to go shopping 😂 I’m planning to bring a collapsible duffel so I can reorganize and check one bag after I inevitably shop my way through Italy"}, {"username": "Coral Musgrave", "comment_text": "Ryan Air. 😁 Also I genuinely can live with one to wash one to wear and one spare. And on trains you do not want big bags."}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Make it easier to travel around. Doesn't matter too much if you're staying one place and going airport to hotel only, but if you're taking trains to different cities it's a thousand times easier!"}, {"username": "David Ockman", "comment_text": "I plan 100% private transfers and never to be on public transportation.\n\nI thought as a first timer… I shouldn’t ruin my trip with transport worries."}, {"username": "David Ockman", "comment_text": "Danielle Marks- Ockman"}, {"username": "Rosanna Baiata Lake", "comment_text": "We pack only a carry on and I search for a local laundromat to drop off our clothes midway through a trip. Game changer."}, {"username": "Mary Brown", "comment_text": "Great question. We went for 15 days, while I traveled with just a carry on, I had everthing I needed. We had access to a washer in 2 out of our 5 accommodations.\n1. We stayed in 5 different hotels so it definitely made unpacking and packing much more efficient\n2. One of our airbnbs was charming but had no elevator so we had to carry our luggage up a few flights of stairs. Can’t imagine doing this with a large suitcase\n3. Cobblestones, steps and narrow doorways\n4. Getting of a long flight and not having to wait for our luggage was awesome\n5. Traveling light, made unpacking/\nlaundry much simpler when we got home"}, {"username": "Evelyn Brown", "comment_text": "Carrying lots of luggage is cumbersome and inconvenient, and potentially prohibitive (see posts about car rentals and train travel, for example). If you use every bit of what you pack, great! Most folks don't though."}, {"username": "Elizabeth Elle", "comment_text": "Stairs, cobblestone streets, trains and ferries, and the increased tendency for airlines to lose luggage were plenty of reasons for me. And past experience with all these things in Europe."}, {"username": "Dawn Falsinotti", "comment_text": "You have to haul it around."}, {"username": "Bianca Ones", "comment_text": "Family of 4 (a 7 yr old and a baby). We tried to pack as lightly as we can and used backpacks for most of our luggages and it was still a challenge to move around. Train from Bologna to Milan was pretty tight as you pass through the stops. Gladly, we were seated at the beginning of the trip from Bologna Centrale. Should we have got in midway, there was no way to even get in the train with the amount of people crammed in there."}, {"username": "Jan Buess", "comment_text": "The 2 of us are taking a 29 inch suitcase and a carryon and taking private cars and only one train. I can certainly take care of a 29th suitcase the same way I can a backpack. To me, one od the pleasant things of a vacation is dressing up or wearing nice clothes and shoes. So that's what I am doing on my fabulous vacation to Italy!"}, {"username": "Debbie Morton", "comment_text": "Because of my purchases my checked luggage is now 24kgs. Imagine if i hadn’t started out with a half empty suitcase. None of those purchases are clothes."}, {"username": "Cindy Navarro Arsola", "comment_text": "Convenience & less stress"}, {"username": "Emily Smith", "comment_text": "Because you will likely be on the move a lot - trains, public transport, boats, etc. There is not a ton of storage space in these places and packing light will allow you to get around easier. On trains, small bags can fit above you but large bags will have to go on racks at the front or back of the train where you will not always be able to keep an eye on them. Also every street is cobblestone or uneven making it difficult to roll around luggage. Many accommodations have stairs only and no elevators. I wouldn’t want to lug a giant bag up 8 flights of stairs."}]}, {"id": "2211961945869550", "text": "Cannes, France or Milan to fly into before Florence? 2 days.", "link": "facebook.com/groups/1373361046396315/permalink/2211961945869550/", "likes": 6, "comments": [{"username": "Chiara Normanno", "comment_text": "They're completely different so it depends on what are your favourite activities"}, {"username": "Donna Mauerhan", "comment_text": "Milan....get tickets to see the Last\nSuper ahead of time!!"}, {"username": "Lisa Hobert", "comment_text": "France"}, {"username": "Jacklyn Arnest", "comment_text": "I love Cannes"}, {"username": "Robbie Flaherty", "comment_text": "Milan!"}, {"username": "Alain Gielen", "comment_text": "From where you fly in ?"}, {"username": "Soubbotina Janna", "comment_text": "Milan"}, {"username": "Chris Avanzato", "comment_text": "Rome—easy one hour train ride to Florence. Milan is a 3 hour train ride."}, {"username": "Barbara Krot Barrett", "comment_text": "Cannes"}, {"username": "Nora Arrechea", "comment_text": "Milan"}, {"username": "Manuel Macias", "comment_text": "Milan- you will be in Milan."}, {"username": "Elina Grigoryan", "comment_text": "Milan"}, {"username": "Heath Conn", "comment_text": "Not Milan. I’d go Turin."}, {"username": "Lisa Rodriguez", "comment_text": "Milan"}, {"username": "Jack Tabibian", "comment_text": "Milan/lake como"}, {"username": "Patty Ham", "comment_text": "Milan"}, {"username": "Christy Blanco-Frias", "comment_text": "Milan, the cathedral is magnificent\nThe shopping is amazing\nWe couldn’t get tickets to the Last Supper but accross the street from the church we paid 10 euros to tour Da Vinci’s vineyard, beautiful.\nInstead of staying in Milan, we stayed in a cute town, Sesto Calende, 15 min away from Malpensa airport\nBest decision !"}]}, {"id": "2212199619179116", "text": "I am very close to being all packed for Italy. For the plane, I have a backpack and a bag(personal item). My carry on luggage will be checked. My husband thinks the bag (personal item) is too big as a personal item. I brought it as a carryon when I flew to Toronto last month and it fit under the seat perfectly. I would like to put the things Iआणखी will need on the flight in my personal bag—- headphones, iPad, phone, little purse for before and after, maybe some snacks, chords, definitely medication/anti nausea pills. I am stuck with ideas (I feel like I have overthought this). Any suggestions would be appreciated.\nPlease keep your posts kind. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2212199619179116/", "likes": 8, "comments": [{"username": "Liz Ariar", "comment_text": "From Montreal here. Italy bound our plane was Air Canada, no problem with 1 hand carry luggage and 1 personal bag. However, flying back home, we were on Austrian Air from Milan, they’re strict with hand carry luggage size and weight, so be careful."}, {"username": "Charleen Siegler Schuss", "comment_text": "Check the airline measurements and weight carefully. Lufthansa limits the carry on wt to 18 lbs for instance"}, {"username": "Amelia Bonannella", "comment_text": "Definitely check with your airline. Taking a backpack and another ‘carry on’ on board, may not be allowed. An additional ‘carry on’ might considered too big as your personal item."}, {"username": "Allison Cunningham", "comment_text": "The quickest way to ruin your trip is to get sick— wear and pack a well-fitting N95 mask! Bring anything you’d need in your backpack in case you do have to check your carryon- meds, toothbrush, change of undies etc etc"}, {"username": "Jenny Payne", "comment_text": "I always take a change of clothes in carry in just in case🌻"}, {"username": "Lisa Akira", "comment_text": "As long as it fits under the seat you are good. Long flights require more padding and equipment the older you get; enjoy your trip!!!!"}, {"username": "Kerri Bevilacqua", "comment_text": "As long as the bag fits the airlines dimensions for personal item it’s not too big. I put anything I have to have to get through a couple of days in my personal item bag in case I’m forced to fate check my carry on. I put a compression cube with a full set of clothing and pajamas in there as well as electronics and chargers, toiletries, medications, etc"}, {"username": "Vasthi Cheddar", "comment_text": "I took a rather large bag as a personal item. It fit under the seat, but it had all my electronic gizmos plus neck pillow (which I left on the plane LOL) etc and my regular purse inside. It was heavy but got no push back from the airline. I also had a carry-on, which was the correct size and weight. The carry-on went on the overhead bin, the personal bag went under the seat.\nI flew Swiss from Miami, then ITA from Zurich to Rome a few days later. Same for both."}, {"username": "Nikki Hannan", "comment_text": "I always pack a toothbrush/\ntoothpaste and a change of underwear and socks (if I have space… a clean t-shirt and skirt/shorts). We have had our suitcases miss the flight and the change of clothes has been a god send."}, {"username": "Lucrezia Folger", "comment_text": "If that's what you're accustomed to caring, then so be it. Don't worry about it, it's only a flight."}, {"username": "Gillian O'Callaghan", "comment_text": "Check the allowance for the fare you bought and the exact measurements on your airline's site."}, {"username": "Sara Hollinbeck Anderson", "comment_text": "I always pack my basic toiletries and one change of clothes in my personal item if I’m checking a bag. That way I can clean up and have fresh clothes if my suitcase is delayed or lost."}, {"username": "Pam Kimak", "comment_text": "Check your airline's website that you are flying and it will list exact measurements for carryon and more."}, {"username": "Shelley Howard", "comment_text": "just remember u need room for your feet .. smaller the better ..."}, {"username": "Lisa Nordby Robilliard", "comment_text": "In case of distressed infants I might add some earplugs unless you have ear cancelling headphones."}, {"username": "Christie Lisk Rogers", "comment_text": "On our way home now. Take as little carryon as possible as it’s never a short distance to drag everything. Also the liquids must fit in a small clear bag and some airports are strict. Are you checking a suitcase too?"}, {"username": "Mbell Arteaga", "comment_text": "I second checking the specific airline specifications.\nFor example, British airways only allows what measures out to be a “big” purse but American Airlines allows a slightly bigger bag. If you’re flying multiple airlines throughout your trip, you’ll want to check each airline just so you don’t run into any issues."}, {"username": "Ann Marie", "comment_text": "Curious what your bag is that your hubby thinks is too big ?"}, {"username": "Bonnie Loftspring", "comment_text": "Always hv an emergency change of clothes w U. Always!"}, {"username": "Kejdi Okej", "comment_text": "Check online what your airlines allows,"}, {"username": "Chris ORiordan Dean", "comment_text": "I think you are addressing the size of your bags. My best advice is to go on your airlines website and get the dimensions for your personal item and backpack carryon. Then get out a tape measure. Practice packing and measure after it is packed. Also get a digital luggage scale and weigh the carryon. We have to pack for our Italia flight because their dimensions are smaller than our Delta flight over there. We are flying from Florence to Brindisi on Italia."}, {"username": "Francisca Lis", "comment_text": "Recuerda que vas a un lugar civilizado. Si falta alguna cosa, podrás comprarla en Italia.\nSimplemente disfruta del viaje ❤️"}, {"username": "Jen Belsito", "comment_text": "Thanks everyone! I checked with the airline. I purchased a messenger bag as my “personal item” and it will fit nicely under the seat in front of me."}, {"username": "Lynette Weir", "comment_text": "Check individual airlines as they aren't all the same."}, {"username": "Cindy Holtfreter", "comment_text": "I heard… wear your heaviest clothes. Like walking shoes, pants, jacket/sweater on the plane saves space in luggage.\n\nI also like to have 1-2 days of outfits and underwear in my backpack just in case. Like bringing an umbrella so it doesn’t rain on my parade. 😬"}, {"username": "Alison Alborough", "comment_text": "Remember that you have to carry, haul, lift your own stuff. You are traveling. No one else knows if you have worn that same outfit everyday. (Take light weight dark coloured pants/skirt, a few tops, a lightweight dress - sandals, reduce toiletries and makeup. Done. That would fit in a carry on. Do take all medications and extras with you inside purse or carry on.\nI take a plastic zip lock with laundry detergent."}, {"username": "Lisa Wylin", "comment_text": "We recommend a couple emergency snack, like granola bar, and some nuts."}, {"username": "Sandy Burton", "comment_text": "Keep in mind the area in front of your seat is small. You may want to make that personal item smaller so you will have more foot room."}, {"username": "Jen Belsito", "comment_text": "This is what I ended up choosing. Thanks everyone."}, {"username": "Valerie Rippey", "comment_text": "European flights do have different (smaller) measurements for their bags so double check the airlines. And I’d suggest a change of clothes for your personal bag in case your checked bag gets lost."}, {"username": "Karen Blackmore", "comment_text": "Check what your airline allows. They are not all the same! Some only allow one bag. Measurements and weight can be checked at the airport and if too big can cost a lot!"}, {"username": "Victoria Moorhead Murrow", "comment_text": "As long as it fits under the seat what’s the issue? I would definitely have a bag for your electronics, medications AND a change of clothes. Sometimes they will make you gate check a bag."}, {"username": "Samantha May", "comment_text": "check online what your airlines allows,"}, {"username": "Colleen Dawson", "comment_text": "Each airline will have it’s own set of requirements, best to check your specific airline website."}, {"username": "Lisa Szal", "comment_text": "If you’ve used it as a carry-on before I would absolutely give it a try again. If they don’t like it once you’re boarding the plane, they will always gate-check it for free. But most of the time those international flights are so busy they’re not really looking at everybody’s luggage there more concerned about getting people on the plane and taking off on time."}, {"username": "Tara Roed", "comment_text": "So a carry on suitcase and a backpack? Plus another ? I’m a little confused. I always bring a carry on suitcase and very big backpack. If I notice an airline that restricted this I don’t buy the ticket. As long as your second bag can get squished under the seat in front of you it should be fine. They only give a hard time if the bag isn’t under the seat typically."}, {"username": "Kathy Boyle", "comment_text": "Your correct. Don't over think things. If u find you have left anything behind you can always buy it and you will be prepared next time. Lugging alot of luggage around is a pain in the neck. Jut go with the flow and enjoy."}]}, {"id": "2212338202498591", "text": "We are arriving early morning from our cruise in Civitavecchia and planning to take a taxi or train to Rome. So more likely we will be in Rome before noon. We plan to leave luggage in the hotel explore around and come back at 4pm check in, relax and unwind and do the Colosseum at night tour. The next day we plan to do the early entry to Vaticanआणखी with breakfast, do the St-Peter’s Basilica and Sistine Chapel, in the afternoon visit the Pantheon and use the remaining of the day exploring around. Is this plan doable considering we get all the tickets we wanted for the Colosseum and The Vaticans?\n\nThen we intend to fly to Milan (to save time) and visit Duomo and whatever we can visit on the same day stay in Milan for one night, Then taxi to Bellagio the following day and explore Lake combo for 3 nights.\n\nNow please tell me if these plans are doable or do we need one more night in Rome and do 2 nights Bellagio instead?", "link": "facebook.com/groups/1373361046396315/permalink/2212338202498591/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nCivitavecchia-Pr\nivate-Transfer-\nCentral-Rome-to\n-Civitavecchia-\nCruise-Port/\nd511-5476ROMHTLP\nRT?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}, {"username": "Ona Gardemeister", "comment_text": "I would take the fast train from Rome to Milan, you’ll save transport to and from airport + waiting time at the airport. It takes 1 hour from Malpensa to Milano centro, Linate is closer. Check frecciarossa.it\nor italotrain.it"}, {"username": "Chiara Normanno", "comment_text": "You'll probably need more time in Rome if you don't want to stress"}, {"username": "Sa Mar", "comment_text": "Ciao! I would suggest an additional night in Rome and just 2 in Bellagio that is more than enough! Make sure about the cost for the taxi from Civitavecchia to Rome (I think it could be quite expensive), and if you plan to take the train, double check if there are no strikes planned (in any case give yourself some room in case of possible delays)."}]}, {"id": "2212433639155714", "text": "Thank you for all the helpful comments!\nDifferent question\nI have fair skin and know I will need to wear a hat walking around all day. Should I get one before I leave or wait and find a cute one there? I will fly into Rome and be there a few days.\nIf now, any favorites? If in Rome, good place to go for a resonable priced hat?", "link": "facebook.com/groups/1373361046396315/permalink/2212433639155714/", "likes": 23, "comments": [{"username": "Elisha Lynn Simon", "comment_text": "Either a packable one or buy one there . Lots of cute ones for around 15.00. I packed one and by the time we got there it looked like a scarecrow hat.🤣"}, {"username": "Julie Koenig Cooper", "comment_text": "I had the same question!"}, {"username": "Pia Reilley Loughin", "comment_text": "Buy one in Rome.\nThere will be vendors everywhere selling them."}, {"username": "Lisa Valdovinos", "comment_text": "I brought one with me and then I also bought one while I was there too. Now I have two! 😊"}, {"username": "Bonnie Loftspring", "comment_text": "Always bring a hat, then get another hat, & there’s a wonderful accessory that safely pinches your hat to your purse or whatever, U can find on Amazon, of course!"}, {"username": "Todd N Nicole Clarke", "comment_text": "I took my own but was tempted to buy another you can never have too many hats but for me it was a bit expensive, But they easy to buy all the vendors have a variety of hats\nJust on packing it I just packed in suitcase with clothes inside it and around it and it survived I also used the magnetic clip on my bag so when inside didn’t have to carry"}, {"username": "Joanne Nacson", "comment_text": "I would take one with you and if you find something in your travels then that’s a bonus."}, {"username": "Debbie Riffe Fulco", "comment_text": "I bought a fedora in Venice and I love it!"}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "My mom got hers in Venice. It was cute."}, {"username": "Amy So", "comment_text": "Pack one that you can fold and if you see one in Italy, then buy another one."}, {"username": "Elaine C. Macalolooy", "comment_text": "Please bring one now you’re going to need it and just buy another one as extra and souvenir . I left my baseball cap + my SPF in my suitcase at the luggage deposit in Barcelona. As soon as we were out of the airport in Rome I knew I was in trouble 😂 . First day in Rome and it was over +40c , it was so hot and there was no way we would walk around to do our sightseeing and never mind to look for a hat .Day 2 was tolerable but still didn’t think I needed it until 10am hit and it was even hotter , I couldn’t find a descent hat I like and we went in the dept store too . Finally was able to find one for €10 by a kiosk near the Vatican train station ."}, {"username": "Lisa Nordby Robilliard", "comment_text": "Living in Australia where most people wear hats when they’re outside, I would recommend bringing a wide brimmed foldable hat. It prevents you overheating and being sunburned, and you can fold it up in your bag/suitcase as you travel or enter buildings. As someone suggests you can always buy another one, but you might not find that special cute one on your first or second day."}, {"username": "Sigrid Cormier", "comment_text": "Here is a great tip on how to pack your hat in a suitcase. Try to avoid anything stiff like straw as it could get damaged in packaging."}, {"username": "Vivian Mann", "comment_text": "Bring one with you Incase you don’t have time to look for one when arrive"}, {"username": "Ruth Hackert", "comment_text": "I’m buying a hat when I arrive 😊"}, {"username": "Jazz Caldwell", "comment_text": "I am also very fair and yes, I wore a hat - I had a couple of cute ones when I left but I'm sure the Italian economy would love you to buy one or two!"}, {"username": "Eileen Thoma", "comment_text": "If you are going there soon, please make sure you get a hat that won’t be too hot. It’s still hot in Rome for at least another three weeks."}, {"username": "Rach LJ", "comment_text": "Anonymous participant I'm having a similar thought re lightweight wraps/scarves. I am having trouble finding any in store at home, and everyone is saying how good the shopping is over there that I am thinking I just take what I need for the first few days and try to find everything else there 😊"}, {"username": "Elise Garner", "comment_text": "I found a cute hat at Costco that was very reasonable and had the UV protection. I would get it before you leave!"}, {"username": "John Mccormick", "comment_text": "Buy it there. They r not too expensive. I bought one last year. Used it for almost 2 weeks and just left it behind."}, {"username": "Carra Gia Gia", "comment_text": "I just blocked Julie Cavanaugh...I feel free"}, {"username": "Tina China Monday", "comment_text": "I bought mine in Florence, and I decided then that next time I'm buying nearly everything over there. Coming with a mostly empty suitcase & coming home full and happy!"}, {"username": "Jean Monteforte Capuano", "comment_text": "Bring one. So many other wonderful things to buy!"}, {"username": "Elizabeth Zavala-Castrillo", "comment_text": "I would take one just to be on the safe side"}, {"username": "Jeanette Paulus Cookson", "comment_text": "Please feel free to ask any questions as that’s why we are here to learn….\nI bought 2 to take with me. One rolls up small so I was going to put it in my day bag that I carry. Then my bigger one will be for when I know I’ll be out in the sun a lot.\nThen like others say if you find one you want to buy get it as a souvenir 🙂\nYou can always donate one when you get back if you don’t want them all\n\nI hope you have an amazing trip!!!"}, {"username": "Raquel Pickering", "comment_text": "Take one over so you're good for a few days, then buy a nice one that catches your eye over there and you'll have a great souvenir. Just make sure the one you pack is foldable/\ncrushable so you don't wreck it in your bag. I'm a red head with albino like white skin and burn like bacon if I'm out in the sun for more than 20 minutes 😆 unfortunately I look like a roofing nail when wearing a sun hat and I sweat so badly through my scalp, once I put a hat on I can't take it off as I am a wet, hot, sweaty mess and my hair is soaked."}, {"username": "Anna Butt", "comment_text": "I would advise to get one of those packable flexible type visors that have Velcro and don’t squish when you flatten. That way, your hair is still relatively good when you take it off, it survives the trip/packing and is light when you are day tripping."}, {"username": "Paulyn Hoffman", "comment_text": "Buy one before you leave! Just in case you want to spend your $ on something else. Since Summer items are all on sale you’ll find a lot of bargains."}, {"username": "Phyllis Snyder", "comment_text": "Shop in Rome! My first stop in Italy will be Rome for 15 days- plan to pack very few clothes and then shop when I get there. Buy a fun Italian hat for sure!"}, {"username": "Cynthia Guillen", "comment_text": "My son just got back and said there are hats everywhere. You can get one really easily. I’d wait and buy there."}, {"username": "Jenny Payne", "comment_text": "Get one before you go , just in case u don’t find one u like. One that covers your face & if windy stays on🌻"}, {"username": "Francisca Lis", "comment_text": "Compra bruma factor 50 para tu piel."}, {"username": "Joe-Linda Po Agustin", "comment_text": "Get it now and bring with you, you might need it the very first day you arrive and won’t want to waste time hunting for one."}, {"username": "Nancy Day", "comment_text": "Get one now"}, {"username": "Laura Miller Bailey", "comment_text": "I found a good variety of Sun hats on Etsy. Actually ordered 2, now I have to decide which to take. I’m not a big hat wearer, and didn’t feel my baseball cap would give me much Sun coverage. Both have under chin ties to keep secure in wind."}, {"username": "Diane Mason", "comment_text": "Live the dream! Take one with you but if you stumble across the perfect Italian creation just go for it and sling the old one 🥳"}, {"username": "Lisa Wylin", "comment_text": "I have to wear hats, I would bring a couple. I believe in being prepared! (As much as you can, cuz as we all know something might go wrong, or you forget something, etc). In the heat, and sun, bring hats."}, {"username": "Jennifer Nguyen", "comment_text": "I got the hat from Roma and Positano. It is good for souvenirs too.\nThey sell hats all over Rome and Positano. At Rome they sell all over the street. I got one while waiting at the hop-on-hop bus stop. At Positano, I got it at the boutique. That’s why it costs more than at Rome.\nI don’t remember the exact price. It is around 30-36 euro in Positano and 20-25 euro or so in Rome.\nI want to get one from Amalfi next year. Anybody knows if they sell one at Amalfi or Sorrento?"}, {"username": "Colleen Church", "comment_text": "Get a packable one, that way you don’t have to carry it. Look up on line but better yet go now to look as everything is on sale as it’s the end of the season and you are going to want to try them on. I say this as I hate wearing hats, so it’s hard to find one you like."}, {"username": "Joe LaLonde", "comment_text": "Street sellers everywhere have cheap ones, especially in Trastevere and near the Vatican. But for any kind of shopping from slightly above street vendors to luxury brands, Via del Corso is the street to go to, it runs from Piazza del Popolo to Piazza Venezia."}, {"username": "Alicia Cox", "comment_text": "Get one at home - maybe a foldable packable one eventhough they r not as stylish. Then if u see a stylish one there, get it. Otherwise save ur money for something more Italian like leather or a purse or blown glass or jewelry 🤣. My list could get lengthy 🤷🏻‍♀️"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2212435985822146", "text": "Looking for a great cooking class in the Tuscan region. We are staying in Montefollonico and have a rental car but would like to stay in the general area. A farmhouse or vineyard experience would be nice.", "link": "facebook.com/groups/1373361046396315/permalink/2212435985822146/", "likes": 2, "comments": []}, {"id": "2212447379154340", "text": "When traveling on the high speed trains, I am reading that sometimes the luggage needs to be stored away from where you are sitting. Are there places to lock the luggage to prevent someone from walking off train with your luggage since they potentially are out of your sight? Should I purchase a cable lock? Thank you in advance for any input!", "link": "facebook.com/groups/1373361046396315/permalink/2212447379154340/", "likes": 3, "comments": [{"username": "Coral Musgrave", "comment_text": "I used a cable lock when I had to store my luggage where I couldn't see it. It's important that you always are aware that people do target travellers on trains. You can also get a tag that you can track your luggage too. Keep valuables on you at all times. Travel light too as it's so much easier to jump on and off the train that way. Many stations have steps too."}, {"username": "Samantha Richardson", "comment_text": "We stored our luggage in the compartments above our seats and also you can sit near the luggage compartment if needed..I travelled for 2 weeks with two children and never felt unsafe at all. We were vigilant in Rome as it's a big city, busy with narrow streets in some parts and wore cross over body bags. We were approached by men selling bracelets and offering us water and roses. We did buy a bracelet each but the man was very polite and had a great sense of humour. I feel that he just wanted to stop and chat. We never felt vulnerable."}, {"username": "Rebecca Yeoh", "comment_text": "I travelled on Trenitalia trains. Cabin size baggage goes above your head on a rack that runs the entire length of the carriage. Bigger bags can go in the large rack sections which are located in each individual carriage, at both ends of the carriage where the doors are, so they should be in view from wherever you are sitting. There is usually about 10 or so bags here, stacked on one another. There is also the area between seats (yellow arrow in the picture) where you can place larger bags but my medium suitcase could only fit in this section in business class, economy was a bit tighter. I booked my seats near the doors so I was generally near my bag when placed in the large suitcase area. When we stopped I usually kept an eye on my suitcase. High speed trains don’t stop that much and I wouldn’t say people are moving around a lot…it felt somewhat safe."}, {"username": "Graham Sherlock", "comment_text": "Just get up at stops to check your luggage does not leave the train, of course locking it up will help."}, {"username": "Tamara Hillard", "comment_text": "Our friends were close enough to check on their luggage and as they went the few steps to check, were able to see their luggage being carried away by thieves. Gone. We now cable ours if it isn’t close enough for us to touch. We think of this as a “seatbelt”. We just wear it every time we are I in a car. Most of the time we get a safe drive, but in the random times that something happens, we want that increased security. The cable is just the same."}, {"username": "Shanaz Haroon", "comment_text": "Our Medium size 24\" luggage fit in the overhead luggage racks, as long as you can lift it, it's fine. We also had 1 large suitcase that fit between the seats."}, {"username": "Claudia Meyers", "comment_text": "Hello, I’m going to Italy in a month and I would like to know how far in advance do you have to book your train tickets?"}, {"username": "Valerie Rippey", "comment_text": "I use a cable lick & purchased it off Amazon."}]}, {"id": "2212450629154015", "text": "I have a question and if it has been asked before, Lord please be nice and scroll on and don't be mean to me. I hate drama. Anyway. Me and 2 friends are flying into Venice in Feb for 3 nights, train to Florence for 3 nights then train to Sorrento for 3. That train ride is long like 5 to 6 hours. Looking for a 2 night stay in between Florence and Sorrento to break it up. Not Rome though. After Sorrento we will travel to Rome for 4 nights and then fly out. No car. Train travel. Young 55+. Any ideas? Something with cool things to see or do.", "link": "facebook.com/groups/1373361046396315/permalink/2212450629154015/", "likes": 20, "comments": [{"username": "Ria White", "comment_text": "The only think I have is for Venice - the water busses are brilliant, but once whilst you’re there treat yourself to a water taxi - they love to show you the sights and give deep insight into the city."}, {"username": "Ishbel Raffle", "comment_text": "It’s only 3 hours to Naples by direct train. Either stay a couple of nights there (great city) or hop on the local train to Sorrento the same day after a nice lunch"}, {"username": "Terry Pisano", "comment_text": "Fiumicino?"}, {"username": "Kathy Burns Doer", "comment_text": "Maybe Orvieto?"}, {"username": "Colleen Dawson", "comment_text": "I would say Orvieto, or Viterbo."}, {"username": "Lisa Belleri Douse", "comment_text": "Naples. Lots to do."}, {"username": "Terri Bradford", "comment_text": "What about La Spezia? Could do cinque terre for a couple days."}, {"username": "Fetchin Gretchen", "comment_text": "Here are some ideas for a 2-night stay between Florence and Sorrento that are not Rome:\n\n* **Siena:** This beautiful medieval town is a UNESCO World Heritage Site and is known for its Piazza del Campo, a shell-shaped square with a striking fountain. There are also plenty of other things to see and do in Siena, such as visiting the Duomo, the Santa Maria della Scala museum, and the Pinacoteca Nazionale.\n\n* **Pienza:** This small town in Tuscany is known for its Renaissance architecture and its stunning views of the Val d'Orcia. There are also a number of great restaurants and shops in Pienza, making it a perfect place to relax and enjoy the Italian countryside.\n\n* **Montepulciano\n:** This hill town in Tuscany is known for its red wine and its views of the Val di Chiana. There are also a number of great restaurants and shops in Montepulciano, making it a perfect place to relax and enjoy the Italian countryside.\n\n* **Orvieto:** This cliffside town in Umbria is known for its Duomo, a Gothic cathedral with beautiful frescoes. There are also a number of other great things to see and do in Orvieto, such as visiting the Etruscan Necropolis, the Pinacoteca Civica, and the Museo dell'Opera del Duomo.\n\nI hope this helps!"}, {"username": "Tricia Lander Antonis", "comment_text": "So not an answer to your question, but a heads up. Carnivale in Venice is usually the first 2 weeks of February. Book accommodations earlier. We were in Verona this year for a week and talked to locals and a few tourists and it’s a different experience during that time. We were thinking of a day trip, we’ve been to Venice before, but opted not too after talking to people."}, {"username": "Sarah Luisa Hughes", "comment_text": "Naples. Perfect for 2 nights. Book on to the street food tour if you do go."}, {"username": "Alison Diamond", "comment_text": "Pompeii is a very cute little town close to\nthe ruins and handy for Naples - so a direct train to Naples then 2 night between them both .. could visit gorgeous opera house in Naples .. Pompei and Vesuvius over 2 days"}, {"username": "Nicole Bedree", "comment_text": "Following"}, {"username": "Michael Zoubourlis", "comment_text": "Option - Add your 2 nights to Sorrento, plenty of beautiful things to see, do and eat there and in surrounding areas (you’d want a day for trips to Capri and possibly Amalfi/\nPositano if you wanted to)"}, {"username": "Jeanne Eliason", "comment_text": "When in Florence check out Fiesole. A quick bus ride or taxi. What a gem and the views over Florence are breath taking."}, {"username": "Laura Uribe", "comment_text": "We loved Montelpuciano!"}, {"username": "Amy So", "comment_text": "Hotel Duomo in Orvieto hands down."}]}, {"id": "2212472729151805", "text": "Good evening everyone.\nI just completed a tour with 'The Tour Guy/ Roman Guy' from Rome to Pompeii. Fantastic tour, highly recommended it.\nWe went to Sorrento and seen some fantastic views over to Pompeii andआणखी had lunch (1hr and 30mins to do want you like) I would recommend the restaurant that the tour guild recommended to us. Fantastic food and views.\nThen we went to Pompeii with the Tour giuld for just over 2hrs.\n\n10 out of 10!", "link": "facebook.com/groups/1373361046396315/permalink/2212472729151805/", "likes": 13, "comments": [{"username": "Prithviraj Sengupta", "comment_text": "Is 2 hours good enough for Pompeii?"}, {"username": "Kejdi Okej", "comment_text": "Is 2 hours good enough for pompeli ?"}, {"username": "Karen Klipple Buron", "comment_text": "We met him 12 years ago in front of the Colosseum and was lucky to get a last minute tour with him. He was The Roman Guy back then. We used his company the following year for transportation to our cruise. Highly recommend"}, {"username": "Mary Robinson Boggs", "comment_text": "Was it a shared small group tour.Sounds like what we want to do from Rome next yeR"}]}, {"id": "2212473112485100", "text": "In Rome is best to take scooters and see a lot of places .Scooters can be found all over the city You can literally unlock one anywhere by using the relevant app👍", "link": "facebook.com/groups/1373361046396315/permalink/2212473112485100/", "likes": 0, "comments": []}, {"id": "2212475782484833", "text": "We have three days to visit the Amalfi Coast in late October. We are thinking of staying in Positano or Praiano and would like visit other towns. What are advantages of one town over the other? What’s the best way to travel between towns in late October? We haven’t decided if we should have a car with us. Also, do restaurants tend to shut down this late in the season? Any suggestions appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2212475782484833/", "likes": 0, "comments": [{"username": "Michele Couzens Simourd", "comment_text": "We stayed in Praiano in late August last year. It’s much quieter and cheaper than Positano. Cute shoe store there on main drag as well:) You can go from town to town in a Sita bus. I was told not to drive the coast for various reasons, one being hard to find parking. Maybe in late October that might be different. But the Sita busses are Very convenient. It’s about 15 min from Praiano to Positano. Check Sita bus schedule. We were able to see Positano, Amalfi Town, Ravello and Capri in 4 days. Restaurants should still be open but hopefully someone who’s been there at that time of year can comment on that. It’s beautiful ! Enjoy your time there!"}, {"username": "Chiara Normanno", "comment_text": "You should still be able to find ferries, they should stop running at the end of October iirc. If they do run and the weather is ok, don't hesitate to use them as they're faster and hassle free."}, {"username": "Alicia Cox", "comment_text": "I have driven all over Italy but would never drive Amalfi coast. Buses or ferries are the way to go."}, {"username": "Jennifer Avrett", "comment_text": "Praiano is smaller and farther down the coast a bit. Ferries and other boats run through October 31st. Things shut down pretty quickly after the 31st.\nWe always have a car on the Amalfi Coast. Just arrange for parking BEFORE you get there. Otherwise parking is a nightmare."}]}, {"id": "2212479642484447", "text": "What is the protocol for leaving a tip, if any, in your hotel room for the housekeepers?", "link": "facebook.com/groups/1373361046396315/permalink/2212479642484447/", "likes": 1, "comments": [{"username": "Angie Mattin", "comment_text": "If the hotel staff accept tips they will have a jar at the reception desk normally, leaving a tip in the hotel room isn’t really the done thing"}, {"username": "Vivien Paulik", "comment_text": "Do not leave tip at the hotel room!\n\nIf you meet the housekeepers give it to them. (But it can happen they do not take it)\nOt is there is a jar for tips at the repection, leave the tip there."}, {"username": "Lora de Vries", "comment_text": "Please do not leave any tips in the room for housekeeping, as when the room is inspected by the housekeeping supervisor, they may end up taking the tip, which was actually meant for the person who did the actual cleaning. It is better to hand over the tip to the person cleaning your room in person. They will usually be on your floor. I always ask their name when I see them out and about and tip them in person, which is so much appreciated. I would also advise against leaving any tips at reception, as this will only add to the tipping culture which is not a thing in Italy."}, {"username": "Laura Laura Brescia", "comment_text": "Every worker in Italy has a salary, there is no need nowhere to tip. Riders, waiters, cleaning personnel, luggage personnel will be very happy if you give them even 2€ tip because they never get tips. No need"}]}, {"id": "2212483779150700", "text": "I am cruising with MSC Cruises in Dec 16 we will be going to Barcelona, Palma de Mallorca, Genoa, Naples, Marseille, La Spezia and additionally me and my fam will be going to Madrid, Paris and Rome how is weather? Really cold? I am from Texas and we do have 65 to 67 on winter. How cold would those places will be from December 12 to December 26? Tips are welcome. Fisrt time going to Europe thanks", "link": "facebook.com/groups/1373361046396315/permalink/2212483779150700/", "likes": 0, "comments": [{"username": "Rosa Zordan", "comment_text": "Do you like snow?"}, {"username": "Chiara Normanno", "comment_text": "Those places don't get too cold but still it's Dec, you'll need a coat and it may rain sometimes, you can't really predict weather anymore"}]}, {"id": "2212487075817037", "text": "Is it possible to buy tickets to Pompeii the day of, or can you hire a guide onsite when you get there, take a tour, and then spend extra time there?", "link": "facebook.com/groups/1373361046396315/permalink/2212487075817037/", "likes": 1, "comments": [{"username": "Temponi Luca", "comment_text": "You can do both !"}, {"username": "Angie Mattin", "comment_text": "Yes to both 😊 I’ve been to Pompeii twice, didn’t book in advance either time.. we just hired a audio guide while we were there"}, {"username": "Kejdi Okej", "comment_text": "Yes to both 😄 l ve been to pompeli twice , didn t book in advance either time we just hired a audio guide while we were there"}, {"username": "Joe-Linda Po Agustin", "comment_text": "Yes to all your questions, but I highly recommend getting the ticket with a guided tour."}, {"username": "Paul Anderson", "comment_text": "Notice how some people copy comments?"}]}, {"id": "2212487802483631", "text": "Hi everyone looking for some tips. we are planning to visit Italy from October 7 th to 15 and returning on 16th two days in venice two days Florence and two to 3days in Rome\nLooking for some suggestions from experts mainly what are the best must to see places here and do they need any reservations ,any tips and recommendations appreciated.\nThank you in Advance", "link": "facebook.com/groups/1373361046396315/permalink/2212487802483631/", "likes": 2, "comments": [{"username": "Rosa Zordan", "comment_text": "Buy a travel book"}, {"username": "Kejdi Okej", "comment_text": "Buy a travel book"}, {"username": "Rosemarie Ramunni-beninati", "comment_text": "The pope only does services on Wednesday and Sunday, book in advance if you have any intentions! I didn’t know. Pompei was amazing."}, {"username": "Sa Mar", "comment_text": "Ciao! I would suggest, for Venice: discover it by walking and plan a visit to the island of Murano, there are several boats (vaporetto) that departure from Venice and then book a visit to Palazzo Ducale. In Florence for sure Piazza del Duomo and a must is book an entrance to Galleria degli Uffizi. In Rome, well, in just three days you can see the most known sites: Colosseo and make sure to book in advance a ticket, better with priority entrance (in October I do not think there will be so many tourists, but it may happen that if there is a lot of people you waste precious time in queue). Then you can visit Fori Imperiali (maybe is better if you purchase a cumulative ticket for Colosseo + Fori). For sure the Basilica di S.Pietro and Musei Vaticani (book in advance a ticket, also here better with priority). Finally if you want not only see the Fontana di Trevi, but discover how the water arrives, try to look for the underground tour of the acqueduct."}, {"username": "Jenny Payne", "comment_text": "Rome I would do the Vatican ( cover your shoulders) google dress code,I would book and pay for jumping the queue, I take friends and show them around ,I don’t go till afternoon around 2pm or first thing in the morning. I stay near the termini at a 3 star hotel ( read all the reviews) and Colosseum book a night tour I find is best as you have all day to walk to Pantheon , buy jump the queue,use head phones and do it your self & walk to Trevi fountain & Spanish steps. Florence book jump the queue tickets for Uffizi or Accademia gallery , pat the boar at some leather markets right next to H&M, walk over the Ponti Vecchio ,always have lunch or dinner off all the main streets🌻"}, {"username": "Stephanie Dean", "comment_text": "Get a vaparetto pass in Venice for the length of your stay at veneziaunica.it"}]}, {"id": "2212496585816086", "text": "Does anyone have a private driver they would refer, that can pick us up in Amalfi, drive to Ravello & Sorrento for a day trip?", "link": "facebook.com/groups/1373361046396315/permalink/2212496585816086/", "likes": 4, "comments": [{"username": "Rosemarie Ramunni-beninati", "comment_text": "Trips to Italy. Com has great private drivers that took us there, no rush!"}, {"username": "Brad Nelsen", "comment_text": "mydaytrip.com"}, {"username": "Lisa DiSalvo Timmoneri", "comment_text": "Enrico Natale was amazing! We spent two days with him and he was awesome! Highly recommend him!"}, {"username": "Judi Rinaldo", "comment_text": "Ciro la Motta"}, {"username": "Tara Roed", "comment_text": "We used these guys. Our driver was great. They picked us up at our hotel in Positano and stored our luggage in the car all day while we toured. We did the green grotto, amalfi and ravello. Then he brought us to our hotel in Sorrento. It was very easy\n\nhttps://\nwww.goodheartlim\nos.com/"}, {"username": "Jeff Gentner EA", "comment_text": "Giovanni is great!\ngioguidone1975@\ngmail.com"}, {"username": "Kate Aquino", "comment_text": "Tina McCully"}, {"username": "Aiden Sone", "comment_text": "Transferelax"}, {"username": "Karen Espinoza", "comment_text": "Raffaele Giordano he is the best"}, {"username": "Debbie Blaskie", "comment_text": "Carmine Amalfi Coast Tour. Secret tour. Best. ❤️❤️❤️"}, {"username": "Melissa Cortez", "comment_text": "Taxi Mister Cab Driver-Naples & Amalfi coast-"}]}, {"id": "2212488815816863", "text": "My wife will be landing in Catania at 11:55 pm tomorow evening. What is our best option for getting to Taormina that late?", "link": "facebook.com/groups/1373361046396315/permalink/2212488815816863/", "likes": 0, "comments": [{"username": "Natalie de Gray", "comment_text": "Taxi €120"}, {"username": "Sergio Milone", "comment_text": "No bus at 11:55pm, train stops 15 min drive from Taormina city center. Best will be by private transportation.\nTry to pm @salvatorericca\n, he is an NCC driver in Taormina, sure can sort you out."}, {"username": "Maria Agius", "comment_text": "I would recommend Mario Caruso he is the best reliable taxi driver in catania"}, {"username": "Joseph Massaro", "comment_text": "Calogero Burrogano was fantastic would recommend him to anyone"}]}, {"id": "2212507625814982", "text": "Hi everyone, I am on the hunt for a clean self service laundry mat in Rome. Does anyone have any suggestions?\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2212507625814982/", "likes": 1, "comments": [{"username": "Nadia Filice", "comment_text": "Target Laundry"}, {"username": "Jaime Wilson", "comment_text": "We used the below laundromat in Rome, it says self service but they actually wash, dry and fold your clothes for you with a really quick turn around 🙂 https://\nmaps.app.goo.gl/\n3CyiEV7pKrwY8ME2\n6?g_st=ic"}]}, {"id": "2212511365814608", "text": "We leave this week for Italy! We will visit Florence, Milan, Lake Como, and Monte Carlo Monaco while there.\n\nKeeping in mind that we are not big history and museum people, my question for you … while inआणखी Florence, would you choose a day trip to Cinque Terre or a day trip to Tuscany that includes Pisa and Siena?\n\nThanks for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2212511365814608/", "likes": 60, "comments": [{"username": "Gary W Anderson", "comment_text": "Tuscany"}, {"username": "Rana Umair", "comment_text": "A day trip? Lol. I just don't get Americans. I understand if you want to cover one location in a day trip but a region or multiple locations?? What's the fun in a rushed trip just to tick a mark? Cinque Terre needs at least 5 days minimum and Tuscany is a huge region on it's own. I would say, just go for a day trip to Siena and Castello di Brolio for the time you have."}, {"username": "Steve Watkins", "comment_text": "Pisa and Siena"}, {"username": "Gaye Watkins", "comment_text": "One day in Cinque Terre was enough for us. Pisa is good in a couple hours. I could have spent days in Siena, but only had a couple hours one day and then couple hours next day. Tuscany - if you are into wine, then a day trip is not nearly enough. BUT, if you had to pick just one, Tenuta Torciano for the win! Do their pasta or pizza making class. In Florence, get yourself a great leather coat at David II, Franco Fonati. I’ll never need another coat. It’s light-weight and reversible."}, {"username": "Deborah Schroeder", "comment_text": "Stay in Tuscany area. You can do a train day trip yourself to Lucca and Pisa or take the train to Siena. It really deserves a full day."}, {"username": "Kimberly Lampros", "comment_text": "Stay in Tuscany and visit siena, lucca, montepulciano or any of the amazing towns. Cinque Terre really isn't a day trip in my opinion."}, {"username": "Fiorenza Bruni", "comment_text": "I don’t understand why no one seems to want to go to Assisi. It’s magical."}, {"username": "Jenine Gallardo", "comment_text": "Skip Florence"}, {"username": "Amy Corday", "comment_text": "Sienna"}, {"username": "Daniela Parhar", "comment_text": "I’d do Siena and Pisa. I think Siena is absolutely breathtaking and Pisa is one of those cities you have to see if you’re in Italy. I went to Cinque Terre and although it’s very pretty, IMO it’s not as special or unique as Siena. In Pisa I highly suggest you going inside the baptistery and walking around the gardens."}, {"username": "Kim Dixon", "comment_text": "I would agree it would be at least a few hours train travel to Cinque Terre, but I disagree it takes 5 days to see it. I live in Italy (Napoli). Went north, and as part of the trip, spent one day in Cinque Terre (and half of that was on a boat in the water). Got the flavor of it and that's all I needed. Of course, it's like the Amalfi Coast, which I have visited with guests more times than I need."}, {"username": "Graham Sherlock", "comment_text": "Cinque Terre is unique so do that. Siena is a mini Florence, but a lot more up and down. The Leaning Tower is great to see. There is a day trip that does Sienna, San Gimignano and Pisa... if you don't do CT."}, {"username": "Marcus Ho", "comment_text": "Chantal Mah"}, {"username": "Paola Barbetti", "comment_text": "Amy, Pisa and Siena are located on opposite geographical direction: Siena south, Pisa kind of west-north of Florence. I’d never plan to visit these two cities on the same day…I’m mean with a private driver is doable, but it’s a lot of driving and short time to actually visit. Therefore, if you go for Tuscany I d rather choose Pisa or Siena…perhaps, adding Lucca to Pisa and San Gimignano to Siena.\nBut here, you go to ancient building, churches, and town/\nvillages dating back hundreds of years ago…in other words, if you are not very much for history, art, architecture, perhaps you might be disappointed; in any cases if you go for Tuscany, I take the liberty to suggest Pisa and Lucca, according to your preferences…Pisa is easy to visit, you can also go there by regional train climb the Leaning Tower, then go by train again to Lucca, rent a bike and ride all around the medieval walls of this lovely town, grabbing a bite somewhere and returning to Florence at the end of the afternoon\nCinque Terre in one day is though but doable. You need to like walking or even better, hiking.\nComfortable shoes, train from Florence to La Spezia and the Cinque Terre Express, a train that stops at the all 5 villages. You can elaborate your itinerary there mixing train, public boat and walking!"}, {"username": "DerricknCatherine Fejarang", "comment_text": "In your post, you have a picture of Manarola in Cinque Terre. If you’re leaning or are drawn to Cinque Terre like I am then I’d go there. I’ve visited twice and plan to return. It’s more my vibe. Getting into the water, the hiking through colorful, picturesque landscape of the villages. Wish you had more than a day."}]}, {"id": "2212533772479034", "text": "I wanted to comment on the post this was mentioned but, alas, Facebook had other plans. Here’s a huge thank you to the person that said you can check Pinterest for walking tours of Rome. Thank you so much forआणखी the information. I never thought about using Pinterest for trips until you mentioned it. Cannot wait until I am able to visit Italy again soon.", "link": "facebook.com/groups/1373361046396315/permalink/2212533772479034/", "likes": 213, "comments": [{"username": "Cleo Forrey", "comment_text": "Beautiful!!"}, {"username": "Claudine Auclair", "comment_text": "How did you manage that! Nobody?"}, {"username": "Kyle Pajor", "comment_text": "Beautiful picture!"}, {"username": "Annette Oosthuizen", "comment_text": "Pinterest is wonderful for just about anything you need info for…have a board for each of our stops for our trip end September 🇮🇹🎊"}, {"username": "Theresa Caruthers Ansbaugh", "comment_text": "Beautiful photo"}, {"username": "Nicole Tucker", "comment_text": "I create Pinterest boards for all my upcoming travel plans. Its a great source of information!"}, {"username": "Jennifer Kump", "comment_text": "Only place that I’ve been that I would go back to over and over again! I want to see ALL. THE.PLACES. But Italy is so diverse in each area!"}, {"username": "Dawn Pribis", "comment_text": "Stupid question. Which fountain is this?"}, {"username": "Mahsa Shelly", "comment_text": "I couldn't even get one 😁"}, {"username": "Gail Passanante", "comment_text": "Wonderful picture!"}, {"username": "Sandy Thomson", "comment_text": "Love your skirt- where is it from?"}, {"username": "Pamela Jones", "comment_text": "I may have because I mention it a lot. Pinterest has got the best ideas for travel"}, {"username": "Mourad Bozid", "comment_text": "😘"}, {"username": "Fetchin Gretchen", "comment_text": "also helpful in searches is google bard, which is available to beta test. It will build suggested itineraries, give you specialized tours with contact info etc. Only as good as input, though so you have to learn how to write the prompts!"}]}, {"id": "2212537369145341", "text": "Has anyone had experience with Free Now in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2212537369145341/", "likes": 0, "comments": []}, {"id": "2212546035811141", "text": "Hi everyone! We are wanting to plan a family trip to Italy to celebrate my daughter’s high school graduation next summer, July 2024. We have not booked anything yet. Those of you who have used Costco Travel, how far out do they publish packages? Or is it best to go ahead and book airfare and not wait on package deals? We are flying out of southeast US. Thank you in advance for any tips/recommendations!", "link": "facebook.com/groups/1373361046396315/permalink/2212546035811141/", "likes": 0, "comments": []}, {"id": "2212547865810958", "text": "I'm headed towards Milan from a 2 day stay in lauterbrunnen area in Switzerland and was wondering what train pass would you recommend I purchase ? Eurorail pass is this a good purchase?", "link": "facebook.com/groups/1373361046396315/permalink/2212547865810958/", "likes": 0, "comments": []}, {"id": "2212548432477568", "text": "Hello! A group of 5 of us are holidaying for 2 weeks in Italy next month. As a way to reduce travel time, my brother wants us to drive from Genoa to Venice rather than take the train. Has anyone done it before, or have any advice on this? From what I’ve read in this group so far it’s best to avoid driving but would love for that not to be the case. For context, we’re all Australian but 2 in the group have lived and driven around Vancouver/Canada for 5 years. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2212548432477568/", "likes": 1, "comments": [{"username": "Alessandro Iannelli", "comment_text": "It's 4 hours driving, if everything goes smoothly; 5 hours by train. So for me it would be a no brainer, I wouldn't add all the hassle of renting a car for the sake of maybe saving one hour. If it's about saving money, then maybe. The cheapest ticket from Genoa to Venice is around 30 euros, so if you can rent a car for half a day and spend less than 150 euros, seeing as you are 5, then you would save something."}, {"username": "Aaron Peterson", "comment_text": "I used to drive this route every 4-6 weeks visiting customers between Genoa and Trieste above Venice. Its a nice easy drive and plenty of places to stop and see if interested. One of the biggest discount malls for designer fashions Serravale is between Milan and Genoa https://\nwww.mcarthurglen\n.com/en/\noutlets/it/\ndesigner-outlet-\nserravalle/\nstores/"}, {"username": "Nikki Buxman", "comment_text": "Do check how much it will cost to pick up a car from one place to drop it off in another. Last time we considered it, it was outrageous."}, {"username": "Keith Al-Dijaili", "comment_text": "Rent a car and drive"}, {"username": "Jenny Payne", "comment_text": "I always travel by train ,fast,comfortab\nle and no hassles, I use Italo company as I know the 4 or 5 platforms are also easy to find and close to where u stand🌻"}, {"username": "Tau Wen", "comment_text": "All good travelling by car. A few tolls but quicker easier. You may have to park out of Venice so I would google that part but the rest is easy and interesting towns on the way."}, {"username": "Tony Mancini", "comment_text": "Taking the train is a no brainer! The trains are fast and you avoid the crazy parking or the lack of. Renting a car is expensive and gaz is not cheap there either. Also diving in Vancouver is one thing city driving in Italy is not for the faint of hearth."}, {"username": "Nancy Day", "comment_text": "Rent a vehicle and drive with 5 of you splitting cost is reasonable"}, {"username": "David Silverstone", "comment_text": "We're from Aust too. Driving across to Venice is easy and the freeway system in Italy is excellent. Maybe make the most of your time with the rental car and go via Como or Verona since you won't need the car in Venice. We booked with Sixt and dropped off the car at Piazzale Roma which is just a quick water taxi trip from the centre of Venice."}, {"username": "Jess Parkinson", "comment_text": "Thank you all so much for your input!! We really appreciate it 😊"}]}, {"id": "2212560625809682", "text": "Good morning all,\nI need some advice or tell me not to stress to much. Me and my husband are travelling to Italy in October which I cannot wait for ! But can I pre booked trains to get around Italy or do it while I’m there ? If I can pre book trains what website can I do that on.\nThank you all 😊", "link": "facebook.com/groups/1373361046396315/permalink/2212560625809682/", "likes": 9, "comments": [{"username": "Rebecca Yeoh", "comment_text": "Try Trenitalia. I pre-booked all my tickets in advance and printed out my ticket, but you can also use your phone, it’s just a\nQR code on a ticket that you will be emailed as soon as you purchase. https://\nwww.trenitalia.c\nom/en.html"}, {"username": "Sam Mah", "comment_text": "Use Trenitalia. If you are booking the fast trains ( FRECCIAROSSA) it is best to book early as that may be cheaper and some trips can get booked out. For regular local (slower) trains a few days before hand or even at the station."}, {"username": "Karen Blackmore", "comment_text": "For the longer journeys it is cheaper to book ahead. For short trips, say Milan to Como, no need to book. Can use Trainline, good for seeing the options and prices. Also Trenitalia."}, {"username": "Todd N Nicole Clarke", "comment_text": "Trainline app is great and tickets can be put into your apple wallet, regional you can do on day or even a few days before other trains book in advance as they get more expensive the closer you get"}, {"username": "Abby O'Mara", "comment_text": "I used Omio app and I pre booked all my trains to get be between cities. I’m here now and the app has worked perfectly and really easy to use."}, {"username": "Janette David Payne", "comment_text": "Trainline app is great, and we also used Rome to Rio for a couple … we’re also there in October …"}, {"username": "Ibbu Mohd", "comment_text": "Italo -use this as this is privately owned. Less to no chance of strikes. Book seats as well, if you miss train they will give u next one. If you book via third party then no adjustments or refunds.\nTrenitalia is govt owned trains-if strike happens then your schedule will be screwed up."}, {"username": "Rhona OConnor", "comment_text": "You will get lots of advice on this in previous posts.... Have a look at them. Good info in them."}, {"username": "Fiona Cameron", "comment_text": "Use the Trenitalia website. There is an English option but you still have to use the Italian place names-Roma, Firenze (Florence) Milano etc. tickets sre emailed to you. No need to “register”. I always print the tickets to be on the safe side but you just need to be able to show the bar code or PNR number."}, {"username": "Jeanette Ramos-Gonzalez", "comment_text": "I already booked all my trains for October on Omio app .. very easy .."}, {"username": "Amy Joseph", "comment_text": "Maybe a dumb question but how did you decide which stations to use? Is there a station map I am\nmissing? Seems like there are many in Rome but less in like Florence or Venice? I am trying to book from Rome to Florence then Florence to Venice but not sure how to pick stations."}, {"username": "Basia Szokarski", "comment_text": "Use trenitlia website. Strikes highly unlikely this time of year."}, {"username": "Lisa Akira", "comment_text": "Trenitalia is the train website. You can get it in English. You can pre buy and even pay for first class with assigned seats if it’s a longer trip.\nYou are stressing too much. Trains run all day and you can buy tickets at the station too.\nThey are the best way to travel around Italy in my opinion!\nTip: Just write down the train numbers you plan to take! When reading the electronic boards at the train stations to find your boarding platform, they have origin and end of line cities listed, but the intermediate stops only scroll by, which is tough to read quickly. If you know your train number reading the board is SO much easier!\nDon’t sweat it! Worst that could happen is you miss your train and have to take the next one. The ticket agents at the counters are very helpful with that. It’s no biggie. Enjoy Italy! It’s wonderful!!!\nAlso, pack light!!! Smaller train stations don’t always have lifts. Lugging big suitcases up and down stairs is a pain. (So are cobblestones with luggage). Only pack what you are willing to carry!"}, {"username": "Line Gregoire", "comment_text": "I always book directly on Italo app"}, {"username": "Diane Davis Lawyer", "comment_text": "I've gone ahead and prebooked all of ours. I used ItaliaRail and Omio. I tried on the official train sites but found it difficult with language barriers."}, {"username": "Cassie Ryan", "comment_text": "Yes, Trenitalia"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Rose Turdo", "comment_text": "I really don't understand the whole scheduling every minute of vacation. Get there, breathe the air, relax 1 day at a time. The tourist traps, yes, go see, get out and drive."}, {"username": "Maryanne Grieve", "comment_text": "My travel agent booked all our trains for October"}, {"username": "Erinn McCarty Barelli", "comment_text": "Italo is who we booked with in advance. Worked perfectly. They were great."}, {"username": "Donna Summerfield", "comment_text": "We have just booked all our transfers though the Rome2Rio app, it gives you all the available ways of travel to your destination & costs, you then get transferred to the appropriate websites, very easy to use."}, {"username": "Beverley Bedford", "comment_text": "Yes you can"}, {"username": "Dina Garrett", "comment_text": "Linda Williams, Julie Franco Mellow, BillandAngala Verley"}, {"username": "Laurie Francis Menk", "comment_text": "Don’t stress. Do it when you’re there"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2212566349142443", "text": "Those that have been to the Vatican and Basilica what is the dress code ? Do you need to have your arms covered ?", "link": "facebook.com/groups/1373361046396315/permalink/2212566349142443/", "likes": 2, "comments": [{"username": "Seán Ó Confhaola", "comment_text": "Certainly upper arms and upper legs."}, {"username": "Eden Seery Thornton", "comment_text": "Cover your shoulders and your thighs to your knees."}, {"username": "Kerrin Barassi", "comment_text": "Shoulders need to be covered"}, {"username": "Judi Rinaldo", "comment_text": "Shoulders"}, {"username": "Sandy Radican Shikaly", "comment_text": "Shoulders and knees covered"}, {"username": "Barbie Munoz", "comment_text": "No you don’t. Just shoulders."}, {"username": "Johanna Gillen", "comment_text": "I had a sundress on And was told my shoulders needed covered."}, {"username": "Margarita Lipkin", "comment_text": "Was there few days ago. We came prepared but didn’t seem like anyone was checking except for the StPeters- they will hand you a scarf if shoulders not covered"}, {"username": "Genny Zimmer Painter", "comment_text": "Genny Zimmer Painter"}, {"username": "Andrea Corey Andrews", "comment_text": "Shoulder knees coveted including men . RESPECT"}, {"username": "Lisa Valdovinos", "comment_text": "Shoulders"}, {"username": "Catalina Daniel", "comment_text": "shoulders & knees, men & women…\nHow ever, Ive seen other churches lenient of the knees… No one covers their full knees these days… Also, Ive seen some giving while other churches selling, paper coverings for those that didn’t preplan. Pretty strict on the shoulders tho"}]}, {"id": "2212589195806825", "text": "Hi all\n\nwe are heading to greece and italy in october and we are trying to figure out the best options and places to secure the tourist site passes .. its a little overwhelming a pass for this and that but you have to pass less for this and that etc\n\nany one able to provide any insight into if these roma passes are worth it as it just seems like you buy a roma pass then still end up paying more to go see other sites as the roma passonly seems to cover 1/2 entrys before you have to spend more money.\n\nhope that made sense thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2212589195806825/", "likes": 0, "comments": [{"username": "Alexandra A Welker", "comment_text": "Multi-day City Pass includes entry to some museums (skip the line Tix), landmarks, hop on/\nhop off bus and public transportation. Basically you choose which ones you want to see/visit, I think the more you choose the more savings you get. When you take the tour you are doing it at your own pace. Also, these passes include transportation so I think it's totally worth it. I can't remember what website I used for when I went to Rome, Florence and Athens but I found these websites so check them out.\n\nhttps://\nwww.turbopass.co\nm/\nathens-city-pass\n\nhttps://\ngocity.com/rome/\nen-us/products/\nexplorer"}]}, {"id": "2212593409139737", "text": "Im looking into planning a European holiday. Is there a great APP that helps you plan your entire trip. Paris -Italy - Switzerland -Italy -Greece. Preferably free.", "link": "facebook.com/groups/1373361046396315/permalink/2212593409139737/", "likes": 0, "comments": [{"username": "Emily Lundberg", "comment_text": "I think the Wanderlog app is great and completely free (you do have to pay if you want to export to google maps or download it offline but it’s <$5 for a month). I plan on upgrading to pro for the month we are traveling just to have those features but planning can be done in the completely free version.\n\nIt allows you to browse itineraries for each location and add it to your own itinerary, and makes suggestions on other close by sightseeing locations. It also has a map view to plot all your places, and currently offers a beta AI helper that you can ask questions to about anything travel related.\n\nYou can also add dates and times in your itinerary, add lodging and transport, and it will calculate walking distance between each point on your itinerary. Different dates of your itinerary are color coded on the map to make it easier to see. Once added to your itinerary, it also automatically tells you what times that day the place is open, which was super helpful knowing ahead of time if we had to move something to a different day.\n\nI also found it helpful for lodging because it told me when the hotel prices dropped so I could rebook and get a cheaper price.\n\nYou can also add the cost of everything and it will calculate total amount in the budget section. If you are traveling with others it allows you to split between multiple people."}, {"username": "Emily Lundberg", "comment_text": "Emily Lundberg"}]}, {"id": "2212594615806283", "text": "Four of us are planning on going the first two weeks in May next year. Flights seem a like pricey. Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2212594615806283/", "likes": 2, "comments": [{"username": "Antonia Dosik", "comment_text": "Look at Going. They often have lots of bargains depending on where and when."}, {"username": "Rachael Richardson", "comment_text": "Sky scanner is a good site , no idea where you flying from to offer full advice"}, {"username": "Jenny Frank", "comment_text": "Book.\nI booked last Nov for this sept: my tix up over $500"}, {"username": "Allan Olexa", "comment_text": "Wait to book. Start looking regularly in early November."}, {"username": "Colleen Dawson", "comment_text": "I use google search as you will see multiple options.There’s\nalso website that you can use to monitor any changes in price."}, {"username": "Madeline Caporale", "comment_text": "Use Google flights to check your options-direct is best but those with layovers will be less pricey. Google flights gives you the option to receive cost tracking. In most cases you cannot book further out than nine months. I would start watching seriously beginning in October, the closer to your travel date the higher prices will likely be and you will have less options."}, {"username": "Graham Sherlock", "comment_text": "Try flying from Australia"}, {"username": "Kejdi Okej", "comment_text": "Book. I booked last nov for this sept . My tix up over s 500"}]}, {"id": "2212596632472748", "text": "Will I find a Bank of America easily in Italy or other popular banks? I’ve read in a post to exchange your American dollars to Euros while your over there at your bank to get the best rate and use their ATM’s. It seems odd that they would have the same banks as here in the US. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2212596632472748/", "likes": 17, "comments": [{"username": "Kathy Sommer Garibay", "comment_text": "I carry my Schwab card & no matter where I use an ATM anywhere in the world, Schwab pays the fees."}, {"username": "Rebecca Borden Alca", "comment_text": "The BNL Paribas banks throughout Italy are affiliated with BofA in the U.S. Once you select the amount you want to withdraw, DECLINE the conversion rate the ATM gives you and let your bank in the US determine the conversion. My understanding is that you get a better rate that way."}, {"username": "Cess Kearns", "comment_text": "We were able to withdraw euros from a credit union affiliated bank with Logix and Logix refunded whatever fees were charged in Italy."}, {"username": "Helen Layton Brechler", "comment_text": "Just do it online\nBefore you go"}, {"username": "Pat Cray", "comment_text": "I had a hard time finding banks in Italy!"}, {"username": "Rhonda Hope", "comment_text": "Bancomat for Bank of America"}, {"username": "Susan Janssen Harshell Stokley", "comment_text": "I walk off the plane, hit an ATM and and off and running."}, {"username": "Sam Hersh", "comment_text": "Open a capital one account zero fees"}, {"username": "Laura Uribe", "comment_text": "Deutsche Bank and Bancomat have minimal fees. The banks in Europe are seldom the same as ours."}, {"username": "Bill Haenlein", "comment_text": "Very few American atms...you can ask your bank if they have affiliation with a bank in the country you are visiting....usi\nng any banks atm the charge fee is not much and you don't have tiMe chasing around town....do not exchange dollars here in U.S. Fee to high....there are atm and exchange bank in most airports!!\nIf you have an account with Charles Schwab there is no fee at any atm"}, {"username": "Bill Casper", "comment_text": "Get a Charles Scwabb card and just use ATM’s."}, {"username": "Judy Keenmon Janik", "comment_text": "Can you go to any bank there and get US dollars without having a debit card?"}, {"username": "Joe Pisano", "comment_text": "People make such a big deal about this all the time. The only thing else they make a bigger deal about is worried about getting pick pocketed.\n\n￼ you spent so much money on airfare and hotels and got the cars or transfers. Relax. I usually take about $3000 worth of euros. I don’t have to worry about anything.\n\nIf I need more I go to the bank. Big deal 3% how much money did you spend all along and that you were about 3% charge￼"}, {"username": "Fran Scotti Lindner", "comment_text": "They don’t\nBut have atm affiliations. Ask BofA which network to use"}, {"username": "Kimberly Baer Oren", "comment_text": "I opened a Chime account just for our Italy trip and only withdrew from BNL ATMs. Flat $2.50 and no international exchange fee."}, {"username": "Michael Rabkin", "comment_text": "Open a Schwab Investor Checking account. Deposit money in it. Get the debit card in the mail. Use it at any ATM in Italy, and you will not incur an international transaction fee. Make sure to NOT select the option to covert it to dollars first. You will get euros out at a good rate with no fees."}, {"username": "Brice Blosser", "comment_text": "I have not seen one. Bank of America though so I wouldn’t expect to."}, {"username": "Amalia Cristina", "comment_text": "Popular banks??? The US is not the whole world…"}, {"username": "Luca Tocci", "comment_text": "Why would there be Bank of America in Italy?"}, {"username": "Steve Keen", "comment_text": "BOA owns Community Bank which is on every American military base which you can get Euros from their ATM at a great rate if you can get onto the base.."}, {"username": "Glenda Schroeder", "comment_text": "AAA member - amounts greater than $200 will be shipped free to the branch location of your choosing – just remember that shipping can take up to three business days, so plan accordingly. During peak travel seasons, like holidays or summer vacation, shipping can take from five to seven days. Exchanges for less than $200 have a $10 shipping fee. Doing your foreign currency exchange at AAA is a great way to avoid extra fees and the last-minute hassle of airport exchanges."}, {"username": "JCampbell Hodnette Jr.", "comment_text": "You won’t need to bring much cash at all or go into a bank. Just any ATM to draw out Euros. The “good” banks and credit unions will often credit foreign ATM fees back on the next statement YMMV"}, {"username": "Shayla Monique Canton", "comment_text": "We exchange here in the US at Bank of America. If you order the currency online you just stop at a local bank to pick it up."}, {"username": "Edmond Nolan", "comment_text": "Bank of America in Italy tell me another joke 😂"}, {"username": "Barrie Maynor Vela", "comment_text": "when my son was in Rome for a semester he was able to use Bank Paribas money machines as they are part of Bank of America system and the atm fee was very low but before I went to visit him I ordered euros from BoA and used a credit card with no international fee 95% of the time, most places take credit cards so I was there for 2 weeks and never needed an ATM I brought 500 euros and def didn’t need that much."}, {"username": "Beverly Lax", "comment_text": "Thank you for all your helpful comments!! Have a wonderful rest of your summer!! 🙂"}, {"username": "Ted Larson", "comment_text": "Just buy and take some €€€ with you."}, {"username": "Jillo Duffy", "comment_text": "Only use \"real\" bank. Atms..do not accept \"conversation \" I have done this on my BoA acct for years..should get best rate and no fees..check your BoA statement for fees and make sure you get imbursed any fees"}, {"username": "Brenda Andrews Priolo", "comment_text": "Francis Priolo check this out."}, {"username": "Lisa Wylin", "comment_text": "Beverly! Get Euros in the US before you go! How can people travel with no cash, seems insane to me. You might be hungry, flight delayed, you don’t feel well, atm not working, etc., etc. I bring Euros, credit cards and some American cash I could convert in a bank if I really have to. To each his own, but as I’ve said before, I couldn’t sleep at night, if I tried to go to Italy (or anywhere) without a good allotment of Euros- cash is king😊"}, {"username": "Allan Olexa", "comment_text": "Look for an Italian partner bank, or better choice…get a no fee US debit card to get cash euros at a bank ATM. Exchange rates at transportation centers or destination sites are not advantageous. Go to a bank. By the way…we charge almost everything using our American credit cards, spending few cash euros."}, {"username": "Kari Kunkel Anderson", "comment_text": "You can order Euros in the Bank of America App before you go.\n\nIt is ready in 1-3 business days and they can ship them to you or you can schedule a pick up at a local bank.\nThat is how we have always done it.\nThe fee is minimal.\n\nIf you have a preferred rewards account it discounts it even more.\n\nI just ordered $500.00\nUSD\nIt was €435 (exchange rate for this morning was $1.1563\n\nTotal $502.99\nPreferred rewards account\n-$7.54\n\nTotal $495.45\n\nI can pick up Wednesday at my local bank"}, {"username": "Angela Genduso", "comment_text": "Use American Express office no exchange rate."}, {"username": "Fetchin Gretchen", "comment_text": "Bank of America partners with BNL Italia, which means no atm fees at those outlets."}, {"username": "Linda Lasorsa", "comment_text": "Get a Schwab checking account with an ATM card. You can use it anywhere in the world and you will get your ATM fees reimbursed. Worked great when we were in Italy and Spain."}, {"username": "Norah Guerin", "comment_text": "Open a Charles Schwab account….easy peasy online. You get a debit card and they reimburse all ATM fees worldwide. They you can get cash wherever and no fees. Just did this for our European trip that ended August 1st. We were in 8 countries and it worked like a charm"}, {"username": "Katie Marie", "comment_text": "They have an affiliate bank in Italy but I had a really hard time finding it… better yet one that had an atm or allowed me to take cash out. Bring as many Euros that you can ahead of time or save yourself the worry and just do the 3% conversion. I walked 2 miles to find that out lol."}, {"username": "Eva McLean", "comment_text": "Before you leave home, check with your bank to see if they belong to any kind of global alliance with banks in Europe. If they do, you can use the ATMS of those banks while there and possibly avoid some of the foreign transactions fees.\n\nNote don’t assume all banks have international alliances. Some do and some don’t."}, {"username": "Anthony Seeton", "comment_text": "When I travel I take no more than $200 USD. When I get to my destination I look for an ATM for a national bank (not local or regional and not a no-name ATM) and withdraw a couple hundred dollars in the local currency. Whenever possible I use my debit card (or credit card) for purchases, but always ask that the transaction be conducted in the local currency. On the whole, I find this strategy costs me the least in fees and poor exchange rates."}, {"username": "Andria Saia", "comment_text": "Just use the ATMs that are everywhere - don’t spend your vacation looking for a bank😊"}, {"username": "Renee Rundle Stoneham", "comment_text": "No. US banks are not in Europe.\nBOA has many partner banks throughout Europe and you can use your BOA Debit card at these to pull cash.\nBarclays is in UK not sure which bank is in Italy, just go on BOA website and search, they are listed.\n\nDO NOT USE CC TO PULL CASH!!\nThat’s considered a cash advance and you will pay high fees!"}, {"username": "Tami Sue", "comment_text": "You use a bank atm. But u need to make sure ur bank doesn't charge. All banks have different rules. I have to use a credit union bank card not my chase bank card."}, {"username": "Lainie Bennett", "comment_text": "An ATM connected to a bank (not a Euronet Cash Machine on the street) is definitely the way to go. If your US Bank has an Italian partner bank, that's even better- you'll save the international fees (which are usually about 3€). Remember, when pulling out your cash, OPT for \"NO CONVERSION\". Otherwise this will convert your currency at a terrible exchange rate to the benefit of the bank."}, {"username": "Cee Esperance", "comment_text": "Please remember that when taking a CASH ADVANCE out of your credit card, you are charged interest right away and usually the interest rate is much higher than for regular purchases . It will be more costly than if you were to withdraw money from your own bank account using the ATM."}, {"username": "Patti Porter", "comment_text": "No, you won’t find your US bank there…. you don’t want take dollars to exchange there, you use your debit card to get euros out of an atm, preferably one at a bank"}, {"username": "Anne Davidson", "comment_text": "Check your bank card and see the symbols on it then look for bank machines in Europe with the same symbol. There’s no problem. But they often require your four digit code."}, {"username": "Hollis H McGuire", "comment_text": "We go right to any ATM anywhere in Europe and use a debit card connected to our US bank. No fees. Easy-peasy."}, {"username": "Carolyn Hall Raffo", "comment_text": "We changed aT airport"}, {"username": "Valerie Collanton", "comment_text": "You can get the locations for the affiliated banks on the Bank of America website. You want to be sure to only use an affiliated bank to avoid fees"}, {"username": "Alicia Cox", "comment_text": "I think most of the people were referring to your bank at home in America. But there are ATMs in banks in Italy that are affiliated with American banks; they should be on the back of your ATM card. A bank ATM in Italy is usually preferred over say an airport or train station & they will be located inside or outside the bank so you don’t have to worry about the hours. They are everywhere."}, {"username": "Ian Beyer", "comment_text": "If you’re getting Euros, just go to any ATM anywhere in Europe (they call them “Bancomat” there) and do a cash withdrawal. The machine will ask if you want to process the transaction in Euros or let it do the exchange rate and send it to your bank as dollars, plus a commission, just like any credit card transaction will. Always do it in the local currency so that you get your bank’s exchange rate.\n\nThere are generally no American banks outside the US because of the myriad rules around American banking.\n\nThere are, however, many American banks that are divisions of foreign/\neuropean banks. TD, RBC, BNP, and others… Some European banks in the US only operate credit cards, like Barclays, HSBC, CreditSuisse…"}, {"username": "Camille Mccoy Lmt", "comment_text": "Just use the ATM."}, {"username": "Jeannine Carta Hanson", "comment_text": "I never had any problems at bancomats in Italy. Don’t use ATM they give a poor exchange rates I think they must be private and not associated with any bank. Bancomats give you the current exchange rate."}, {"username": "Helen Clark", "comment_text": "Only go to ATMs that are connected to a bank. Do not use private currency services as they have much worse exchange rates."}, {"username": "Alexandra A Welker", "comment_text": "There's no BofA in Italy. Exchange your $ to € before you leave, TripleA can do that. It's best to have working currency upon arrival."}, {"username": "Kim Weston", "comment_text": "We exchanged at BOA before our trip."}, {"username": "Judy Sabo", "comment_text": "My debit card from Wells Fargo only uses a 3 digit security number. Will any ATM’s in Amalfi Coast area accept this card?"}, {"username": "Stacey Miller", "comment_text": "An aside...if you frequently travel and have other \"non-euro\" foreign currency, convert that $ to euros (as long as you don't plan on visiting that country again!)"}, {"username": "Lesley Stewart-D'Ortenzio", "comment_text": "Buy Euros before you go. You will need some cash for little things and not all cabs take cards."}, {"username": "Melissa Torres Collins", "comment_text": "No. Go to your BOA in the US and ask to exchange dollars to euros. They will need 2-4 weeks. Doing it in Italy is much more expensive. Also, if you do use an ATM in Italy it will give you euros but with a fairly high fee attached."}, {"username": "Kimberly Harrison Loesche", "comment_text": "No they are Italian banks but your ATM card will work and it is dispensed as Euros. It is often cheaper to pay your minimal ATM fee for a withdrawal than to pay to order Eutos ahead of time."}, {"username": "Emma Whiting", "comment_text": "They won't have American banks in Europe, you can either change them into Euros before you leave or you can withdraw cash in Italy and/or use your card to pay for things. You'll get charged a small fee each time you take cash out though. I personally have always got cash exchanged before I leave but its entirely upto you."}, {"username": "Eden Seery Thornton", "comment_text": "Get them from your own bank before you leave town. Go several days before you leave for your trip. If you need more when you are in Italy, use an ATM connected to a bank."}, {"username": "Marc Spiegel", "comment_text": "I've been living overseas for 20 years. I always use my ATM card when I travel and never buy local currency.\n\nI also pay my last bill on the last day of my trip in cash and put the balance on my credit card this way I have no local currency leftover, unless I'm planning to visit again anytime soon"}, {"username": "Terry Hamlet", "comment_text": "Get a Schwab account and ATM fees are free worldwide. Can even use at any ATM in the US."}, {"username": "Santo Finocchiaro", "comment_text": "The best exchange is at triple a here in the united states. If you are a member. You can exchange at airports but it will be expensive. When using a credit card, they'll charge you a fee. For every transaction. Get yourself a capital one card they do not have a fee transaction charge."}, {"username": "Rosa Zordan", "comment_text": "Just withdraw money as you need from ATM. Make sure your cards are compatible and do not incur exorbitant transaction fees. Check with your bank."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "No. That is incorrect. Use your BOA debit card at any bank affiliated ATM in Italy. Look for Bancomat ATMs. The first ones you see will be just past baggage claim at the airport. Be sure your debit card has a four-digit pin."}, {"username": "Roxanne Franquelli", "comment_text": "Pre-order euros from your bank. Go at least one week before. All your bank and let them know you are traveling. Take out euros when you need. I just learned in this thread that triple A-AAA- can do this. So if you are a member try them too. Do not exchange at the airport. You will lose a lot."}, {"username": "Bill Gillespie", "comment_text": "Best is...find a Credit Union or bank that don't charge for overseas ATM charges when exchanging for Euros. Then you can use ATM at AP to get initial Euros. I get 200 and usually charge everything on the CC. If I need more Euros, for comfort I get them from the ATM."}, {"username": "Jose Velez", "comment_text": "Credit cards will cover most of your payment and atm at a bank (not airport atm or exchange). Make sure your cards do not have a transaction fee and always pay in euros when ask on your credit card charges. Chase, capital1, and Citi do not have transaction fee. Check on their website or call them to be sure"}, {"username": "Karen Klipple Buron", "comment_text": "https://\nlocators.bankofa\nmerica.com/\ninternational.ht\nml"}, {"username": "Michelle Plutto", "comment_text": "Navy federal charges a flat fee $1.00 with no conversion fee so I will use any atm"}, {"username": "Heather McNamara Witt", "comment_text": "Can you exchange American cash to euros once you’re in Italy?"}, {"username": "Heather Nixon", "comment_text": "Get a Schwab debit card. No transaction exchange fees. No atm fees. Use it worldwide."}, {"username": "Diane Davis Lawyer", "comment_text": "This is a list/location of BOA partner banks in Italy: https://\nbanksofitaly.com\n/\nbnp-paribas-bnl-\nditalia/"}, {"username": "Steven Torres", "comment_text": "BNL is the sister bank of BOA in Italy. We were able to use the ATM with no fees. Some of the other ATM charged to use"}, {"username": "Joe Pisano", "comment_text": "Not a chance. Why would Bank of America be in Italy?￼"}, {"username": "Shirley Lewis", "comment_text": "BOA does not charge a fee to use other banks' ATMs ... just be sure to use a bank ATM and not a stand alone machine (such as you might find in a convenience store here) as they will charge you a fee ... it is no more difficult to get cash in Italy than it is here! using and ATM will always give you the best exchange rate"}, {"username": "Serna Teixeira", "comment_text": "If you are a preferred member - I think that is what it is called- you get a discount in addition to no transaction fees. Buy in US at BA- then you don’t need to worry about using ATM, which can be risky in heavily tourist areas as there are sometimes issues with either the ATM Or they are targeted by pickpockets, etc."}, {"username": "Sharon Menegoni", "comment_text": "In Italy the BOA affiliate bank is BNL, and there are many branches in a multitude of locations"}, {"username": "Patty Ham", "comment_text": "ATM!!"}]}, {"id": "2212605072471904", "text": "We are staying in Prati and booked tickets on high speed train to Naples leaving Rome Termini at 6am. I have looked it up, about a 50 minute walk. While we plan on walking a lot- I’d like to know options . How available are taxis that early ? I don’t want to leave it up to last minute trying to get a cab , any suggestions are much appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2212605072471904/", "likes": 1, "comments": [{"username": "Rebecca Yeoh", "comment_text": "I’m not sure how many cabs about at that time but I would check with your hotel to see if they offer a service to call a taxi for you and have them arrive straight to your hotel. I did that with our hotel and it took only a few mins for it to arrive."}, {"username": "Jenny Payne", "comment_text": "If staying at hotel get them to order you a taxi or airb&b ask the owner to pre book the taxi the night before 🌻"}, {"username": "Abby O'Mara", "comment_text": "I’m in Italy now and we have been using FREENOW taxi app and pre booking when needing early taxis. I book the night before for the time I need the next morning. So far they haven’t let me down. They have cancelled at last minute but a new taxi gets reassigned within a few minutes."}, {"username": "Sarah Nichols Hogue", "comment_text": "We stayed in Prati and took the metro to Termini the day we had our luggage. It was around 6:30 am."}, {"username": "Lisa Adams Robertson", "comment_text": "I would say take the metro, or, there is a taxi stand right next to the Pantheon, if that is close enough to you. They were lined up there very early in the morning."}]}, {"id": "2212606825805062", "text": "I'm so confused about how to book the Bernina Express for September of 2024. I understand there is a ticket and reservation that is done at different times. Could anyone please tell me the timeframe of when I can book each one? I know I'm still too early to start the booking. Also, any advice of where to get seats ( last car?) 1st class or second class? Panoramic window? It seems to be confusing to many people. If someone could explain the process, I'd be so appreciative ! Thank you !!!!", "link": "facebook.com/groups/1373361046396315/permalink/2212606825805062/", "likes": 2, "comments": [{"username": "Joe-Linda Po Agustin", "comment_text": "2 steps- reservations come out 6 months before travel date, book early as this can run out. Then 2 months before, the tickets come out, you can book anytime till day of travel. Prices remain the same. Just make sure that you book same class for both. First class has more room, 3 in a row while second class have 4. Most organized tour groups as you see in Viator use 2nd class, good enough as they also have panoramic windows. If you want less people in your compartment, go first class though the price difference for ticket is significant ( reservations are same price regardless of class).BTW, if you’re travelling in September, you should be booking reservations now."}, {"username": "Silvia Roth", "comment_text": "If you have time I recommend staying 2 nights in the Engadine valley in or around St Moritz"}]}, {"id": "2212608972471514", "text": "Hi all, I’m a newy to travel overseas.. next year we will need to get from Florence to Venice to our accomodation . We are going to go by train. I have read about going first class so you have your luggage inआणखी view. My question is… would you say fast train? Or will we miss scenery? Also Who do we buy our tickets off? Any tips please 🙏 😊", "link": "facebook.com/groups/1373361046396315/permalink/2212608972471514/", "likes": 0, "comments": [{"username": "Ryan Monahan", "comment_text": "Depends on how much luggage I guess. We did the trip with small backpacks that fit in the overhead bin and small suitcases that slid under our seats. Took the fastest train available with econo tickets (I think around €25 each) had USB ports too and was fairly comfy"}, {"username": "Gianna Onesi", "comment_text": "Trenitalia"}, {"username": "Marissa McLean", "comment_text": "1. Unless you have massive luggage you’re bringing, most trains have over head compartments you can store you luggage, not just first class.\n2. The fast trains aren’t so fast that you won’t see any scenery, plus it mostly just goes through fields and country sides, not anything too spectacular imo\n3. I would use the trenitalia app directly or the app Omio which is good for booking trains, ferry’s, busses, etc in any city"}]}, {"id": "2212612545804490", "text": "I'm looking to book a tour of The Vatican, Sistine Chapel and St Peters Basilica.\nI have read that SPB is closed on weds or closed until 1pm. Respectfully, do you know if I purchase tour tickets if we can go back to SPB on weds afternoon or Thursday morning.\nI am in Rome one full day on a Weds. Flying out Thursday at 4pm.", "link": "facebook.com/groups/1373361046396315/permalink/2212612545804490/", "likes": 0, "comments": [{"username": "Rosemarie Ramunni-beninati", "comment_text": "Trips to Italy.com"}, {"username": "Francisca Lis", "comment_text": "El acceso a la Basilica es gratuito.\nPuedes ir cuando quieras.\nLos miércoles hay audiencia papal por la mañana, por eso quizás esté cerrada.\nPero a partir de las 7 am te pones en cola y entras a la basílica."}]}, {"id": "2212616615804083", "text": "I note that there is a general national strike planned for October 20, 2023. Will this affect other services such as museums? Or just transportation?\nThank you for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2212616615804083/", "likes": 1, "comments": [{"username": "Joanne Cadogan", "comment_text": "Earlier general strike posts say government services - education, medical - and transportation will be disrupted. Museums aren’t mentioned specifically, but if they are government operated…"}]}, {"id": "2212630229136055", "text": "Do a lot of men wear shorts in Italy? I want to buy a pair of pickpocket proof shorts for my husband, but not if no men wear shorts except tourists. Thanks !", "link": "facebook.com/groups/1373361046396315/permalink/2212630229136055/", "likes": 16, "comments": [{"username": "Robert Brenner", "comment_text": "Most people were wearing shorts yesterday in Pompeii."}, {"username": "Maurizio Damonte", "comment_text": "What kind of question is!!?! Why italians shouldn't wear shorts??? Porca eva, che cazzo di domande!"}, {"username": "Martin-John Rubio", "comment_text": "Anti pickpocket shorts ??😆😆"}, {"username": "Nan Smith Butler", "comment_text": "Remember in religious sites, cathedrals etc knees and shoulders must be covered. I assume that would apply to men as well. Just dress accordingly for your day!"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "The pickpocketing craze continues…"}, {"username": "Rhona OConnor", "comment_text": "Forget trying to blend in..... None of us look italian!! 😁 Wear what you are comfortable in."}, {"username": "Tim Hill", "comment_text": "We will be there 32 days and both of us will wear shorts every single day. Church the exception"}, {"username": "Randy Aull", "comment_text": "I just got back from 2 months in Italy. I wore shorts the entire time. Not once did anybody make me feel inappropriately\ndressed. And, by the way, yes, even Italians wear shorts. They did wear pants more often than I would in the heat, but shorts were common."}, {"username": "Ally Dickerson", "comment_text": "My Italian partner wears shorts all the time and so do his friends, sick of these posts, wear whatever you want and who cares if you look like a tourist we will be able to tell anyway"}, {"username": "Jenny Payne", "comment_text": "Linen shorts Italian wear to the knee . Look on Pinterest for men that tells you what you can wear🌻"}, {"username": "Alaide Stuart", "comment_text": "We just got back and the much older relatives wore pants but most of the guys wore shorts—"}, {"username": "Frank Hunt", "comment_text": "Yes they do, I also wear dress shorts at night too if I want the look. No rules!"}, {"username": "Alison Steinberg", "comment_text": "Yes just got back from 2 weeks there. Majority of men of all ages wore shorts. Some were snappy and paired them with loafers but many pairs of shirts with sneakers in Treviso, Venice, Rome and Florence. We had been warned no shorts worn by Italian men but we observed huge majority in shorts and even counted-easily 19/20. Fewer baseball style caps and more straw or fedora style for head wear."}, {"username": "Dagmara Pagliaro", "comment_text": "From last month"}, {"username": "Norma McElroy Frisina", "comment_text": "My Italian cousin just posted a picture just yesterday and he’s wearing long blue jean shorts . Always Keep your money in your front pocket or in a pouch underneath your clothes and you won’t ever have the problem with pickpocketing ever . I’ve been traveling to Italy all my life . My mom was born in Italy. My dad had his tobacco pouch stolen out of his back pocket several times 😂 He just wouldn’t learn !"}, {"username": "Brice Blosser", "comment_text": "Tourist do not typically blend in. If you want to wear them, but them and where them. A lot of tourist do, me including, have worn them; I’m on vacation, I can dress comfortably."}, {"username": "Judite Lopes", "comment_text": "I’m Portuguese and I’ve been to Italy a lot of times! My husband only brings cargo shorts. We carry backpacks (for water and snacks) but in busier areas and on the subway we put the backpack in front of the belly. We never had problems…"}, {"username": "Tilla Olivier", "comment_text": "All wear shorts."}, {"username": "Flavia Di Bello", "comment_text": "If the image of Italy is that of a 60s movie probably not many shorts there, but we are in 2023…\nPlease keep your eyes open and you’ll be fine. Having been pickpocketed 3x over 5 visits to Italy suggests walking with an open wallet and a “PLEASE MUG ME” sign… 😳"}, {"username": "Ally Dickerson", "comment_text": "Men in Italy do wear shorts, if you disagree you can FaceTime me and I can show you the two Italian men at this bar or my partner who is leaving for work. If your worried about pickpockets just don’t have all these stupid side bags, obviously touristy backpacks, get a light jacket with a pocket inside and get pockets with zips, that’s all me and my partner use and we’ve never been pickpocketed."}, {"username": "Andrea Paquette Haber", "comment_text": "My husband is wearing shorts everyday for the 2 weeks we’re there. He’s bring a few pair of pants for dinners."}, {"username": "Rosalia Ciminella Caramanica", "comment_text": "Yes, lot of men wear shirts in Italy!"}, {"username": "Jason Weiss", "comment_text": "We were just in Florence and everyone was wearing shorts"}, {"username": "Valentina Bachi", "comment_text": "Hey, we are Italians but we're human just like everybody else :D of course men wear shorts in the summer, don't worry!"}, {"username": "Karyn McCluskey", "comment_text": "Shorts everywhere wear what you like ."}, {"username": "Tom O'Hara", "comment_text": "Please tell these Italians in Italy that Italian men don't wear shorts:"}, {"username": "Tom O'Hara", "comment_text": "Nope, no Italian men in shorts in this photo from Domodossola 3 weeks ago:"}, {"username": "Alastair Hodge", "comment_text": "This can’t be a serious question. It’s 38 degrees here at the moment."}, {"username": "Karen Robertson", "comment_text": "We spent 5 weeks in Italy, just wear something comfortable. My husband wore walking shorts, comfy shoes and a comfortable breathable shirt. My sister and I wore comfortable dresses and Birkenstocks or runners. We put a travel lock on our bags and never had any issues. It was a bit of a nuisance to undo the lock when we wanted to pay for something but it was nice not to have to be concerned about pickpockets"}, {"username": "Gina Winterstein", "comment_text": "Men wear shorts."}, {"username": "Lina Costantino Sirianni", "comment_text": "Mary buy hubby a bum bag or cross body bag. He can wear it in front under a tshirt. We saw pick pocketing in como, milan, rome, catania and agrigento in our 7 week visit in 2019. You just need to be observant of your surroundings and who is watching. Keeping your bag across the front of your body and no wallets in back pockets is sufficient. And don’t wear expensive jewellery - i wore sterling silver and zirconia jewellery. Also note they usually target large tour groups who are blissfully unaware"}, {"username": "Melanie Fay Wais", "comment_text": "I think mostly Italians just wear shorts to the beach, at least when I lived there (but that was 20 years ago). As Americans living overseas, we still wore shorts. But it depends on where you are going. If you are going to visit churches or going to restaurants, I would not wear shorts. Just be respectful of the culture."}, {"username": "Desiree Jimenez", "comment_text": "My husband always wears shorts on Italy, unless we go to a church. Just buy the shorts and take them with you. I'm sure you'll use them!"}, {"username": "Joanne-Peter Hart", "comment_text": "You are going to look like a tourist no matter what you do. Many were wearing shorts, just ensure they are down to the knees in case you want to enter a church. Pickpockets are bad - don’t have a wallet or a bag on you or you will increase your chances of being a target. We had RFID pouches cross body under our clothes with our passport, cards and small change, and used our phone to pay for everything so we didn’t handle money, or a wallet in a crowd, and had a metal tether to our phone attached to our belt and were holding the phone at all times. No one went near us, but I personally saw people get robbed in Rome and Florence. One occasion it was when a man pulled out his wallet to buy something at the Trevi Fountain. Another man ran past and grabbed the wallet. The police saw it and took chase, but the thief got away. Be prepared, alert, but not alarmed."}, {"username": "Ritchie Dakin", "comment_text": "Yes I live here and I wear shorts and I don’t care if I look like a tourist (does it really matter anyhow ?)"}, {"username": "Jacquie Johnston", "comment_text": "Last October I visited 5 regions an my husband and I saw all styles of clothing. We dressed for the activity we were doing. Please focus on where you are, take in the surroundings, the building that was our hotel was 900 years old. As Americans we have no ancient architecture. Be aware as you would in a large city. Enjoy yourself. ￼ Even the Italians are tourist. In some cities I met Italians who had never been to Rome."}, {"username": "Paul Anderson", "comment_text": "They dress like we do. One key to not getting picked is an over sized wallet that would be difficult for your husband to get out of his pocket. If it hard for him it’s impossible for thieves."}, {"username": "Greg Baker", "comment_text": "Keep your wits about you and you should be fine we just got back from spending a week in Italy and Portugal and yes wear shorts it’s not a big thing and plenty of people wear them. I wore chino shorts and no issues"}, {"username": "Natalie Macdonald", "comment_text": "Its too hot to not wear shorts. And italian men carry a small crossbody bag for wallet and phone"}, {"username": "Sandy Hookerman Kriger", "comment_text": "They wear shorts in the appropriate places!"}, {"username": "Shirley Lewis", "comment_text": "whatever you wear the local people will know you are a tourist 🙂 🙂"}, {"username": "Berndt Weihs", "comment_text": "Shorts are no problem.\nBut I would recomand no shorts if you are going in an upscale restaurant for a dinner."}, {"username": "Holly Clifton", "comment_text": "Not a lot wear shorts. Just buy nicer ones like golf short or chinos. Buy a front pocket wallet for him."}, {"username": "Enrica Palla", "comment_text": "I'm sorry, but really? Why Italian men shouldn't wear shorts?"}, {"username": "Pearl Lucero", "comment_text": "Of course"}, {"username": "Irene Oda", "comment_text": "Of course Italian men wear shorts."}, {"username": "Allan Olexa", "comment_text": "Yes wearing, yes buying."}, {"username": "Lauren Vassallo Beattie", "comment_text": "Wear what you want, if you are a tourist they will pick u out even if u dress like a local."}, {"username": "Sandy Michelle Duggan", "comment_text": "My goodness, wear what you are comfortable in, anti pickpocket shorts is a stretch, majority of peoe are lovely over there, not out to rip us off, be aware of surroundings. I nearly ruined my holiday worrying about this. Just got back. Go and enjoy this beautiful country, embrace it all and just travel as you always would, With caution."}, {"username": "Mike Guluk", "comment_text": "Izod with 2 extra front pockets shorts everywhere"}, {"username": "Dawn Falsinotti", "comment_text": "Men wear shorts to the beach. In general Italians dress a wee bit more formal than American. I’ve never seen any of my Italian relatives in anything but slacks."}, {"username": "Maria Antidormi Corica", "comment_text": "As tourists from Australia my hubby has worn shorts throughout the whole time we’ve been here except when we went to Moulin Rouge in France. We’ve been here nearly 6 weeks and it doesn’t look like he’ll be changing attire anytime soon"}, {"username": "Jessie Billiet", "comment_text": "My husband wore shorts. He kept his wallet, passport and phone in his front pockets"}, {"username": "Ataru Moroboshi", "comment_text": "Yes, we do"}, {"username": "Kim Geary Keidel", "comment_text": "He is a tourist. Who cares if he looks like one? He needs to wear what is comfortable. It’s obvious he’s a tourist no matter what he wears."}, {"username": "Gundega Barkane", "comment_text": "If you are worried looking like tourist- 1) you are 2)you will not blend in regardless"}, {"username": "John Green", "comment_text": "This is a picture from July. Seems to be lots of shorts"}, {"username": "Renae Larcus", "comment_text": "Everyone is wearing shorts. No one cares what you are wearing"}, {"username": "Rachael Richardson", "comment_text": "My husband just doesn’t carry anything ! He wears shorts with front zip pockets if he does and is just wary of pickpockets"}, {"username": "Robert Brenner", "comment_text": "I have those and they're incredible, but a pain in the ass for quick access to items... which is the point I guess."}, {"username": "Gitte Ebbesen", "comment_text": "🤣"}, {"username": "Angie Mattin", "comment_text": "Yes, Italian men get hot too"}, {"username": "Rosa Zordan", "comment_text": "Rosa Zordan"}, {"username": "Pietro Adami", "comment_text": "We do, don’t worry"}, {"username": "Allison Mir", "comment_text": "No shorts are banned."}, {"username": "Jaime Cleek", "comment_text": "Yes lots of ppl in shorts and unless you’re going to be in a tight congested area I wouldn’t worry about it. Be aware and travel smart."}, {"username": "Elaine Phillips", "comment_text": "Look at a few posts on this site and you’ll see the men are wearing shorts"}, {"username": "Rosanne Ziviani", "comment_text": "Sew Velcro in the pockets."}, {"username": "Raymond Capkin", "comment_text": "95 percent wearing shorts.. im in Verona"}, {"username": "Bianca Balderas-Saenz", "comment_text": "We’re here now. Wear whatever you want. Honestly, no one is dressed a certain way. Everyone wears shorts. If you’re coming during the summer or hotter months bring lighter clothing."}, {"username": "Ewa Kolodziej", "comment_text": "🤣🤣🤣🤣🤣🤣🤣"}, {"username": "Roberta Nanni", "comment_text": "What is the deal if a tourist looks like a tourist? Btw italian men in informal contexts of course wear shorts, \"bermudas\" in blue, black, Brown, khaki, etc"}, {"username": "Pam Deluca Spicer", "comment_text": "My husband wears shorts night and day at night with a shirt or a t shirt"}, {"username": "Kye Goff", "comment_text": "What is this post"}, {"username": "Angie Mattin", "comment_text": "Just to add.. please don’t focus too much on the pickpocketing aspect. Yes, it happens, but no where near as frequently as the posts on here suggest. We’ve lived here 18 months and traveled all over Italy, without ever having been pickpocketed, just keep your wits about you, as you would in any major city in any part of the world."}, {"username": "Ville Lignell", "comment_text": "The Italian men wearing shorts in Naples mostly are tourists from other regions. There's nothing wrong with looking like a tourist. It's better though avoid shorts at a dinner restaurant."}, {"username": "David Horgen", "comment_text": "I am here now in Italy. We've been here for over a week. Several different cities. Shorts are everywhere. Don't worry so much about the pickpocketing thing. As long as you're not oblivious to someone sticking their hands in your pockets, you'll be fine"}, {"username": "Tanya Gomes", "comment_text": "Nah they all wear dresses 👗"}, {"username": "Tom O'Hara", "comment_text": "I wear shorts May to October in Italy!"}, {"username": "Kristina Ruk", "comment_text": "How you imagine italian men dress up in +40 C degrees ?🤣"}, {"username": "Darlene Bonura", "comment_text": "Its Summer, unless you doing 5 star everywhere"}, {"username": "Tony Palombino", "comment_text": "Yes, it’s a myth. Where what you want."}, {"username": "Etschi Bruckner", "comment_text": "how do pickpocket-proo\nf shorts look like?"}, {"username": "Viraf NZ", "comment_text": "Wear what you are comfortable in and enjoy your holiday . Italy is beautiful."}, {"username": "Leila Myftija", "comment_text": "Yes, but even if they didn't, who cares.\nBelieve me, we don't care how you dress.\nWear whatever you like most.\nYou're on vacation."}, {"username": "Richelle Trezise", "comment_text": "My hubby will be wearing shorts"}, {"username": "Marscha Fransisca Debora Basdew", "comment_text": "Wear whatever you want."}, {"username": "Roxanne Curzi", "comment_text": "I always thought it was women in Italty who don't wear shorts. I believe the men do. Anyway, if their style is Capri pants for example, but that is not your style.... don't wear just to \"not look like a tourist\" No matter what you wear, they will probably still know 🤷‍♀️"}, {"username": "Rita Sanza", "comment_text": "Yes they do wear shorts. And please relax. Pickpocketing happens every were you go not just Italy. Just be aware of your surroundings and enjoy your holiday"}, {"username": "Ken Vecchia", "comment_text": "No rules just do your thing"}]}, {"id": "2212637852468626", "text": "Are there trains from the Rome airport, Fiumicino to Naples? Or do we have to go to Rome Termini to go to Naples? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2212637852468626/", "likes": 0, "comments": [{"username": "Rebecca Yeoh", "comment_text": "Yes! With Trenitalia you can get a direct train but it does stop at Roma Termini anyway, but you don’t have to get off. If you find that this direct train doesn’t come as frequently as you’d like, just go to Roma Termini and change for a connecting train. You’ll find they come more frequently and won’t add too much time to your trip vs a direct train."}, {"username": "David Hibbs", "comment_text": "You’re awesome. Thanks so much we’ll check it out"}]}, {"id": "2212642132468198", "text": "So can you buy a rail pass that will be good for 2 to 3 weeks. Naples to sorrento\nNaples to Rome, Rome to Florence, Venice\nOr do you need to buy a ticket for each leg of the trip", "link": "facebook.com/groups/1373361046396315/permalink/2212642132468198/", "likes": 1, "comments": [{"username": "Jenny Payne", "comment_text": "I buy each leg just in case one of the trains gets cancelled & if your going from local to fast you don’t get your money bk . As I have been going to Italy for many years once or twice a year and I find for me is the best way, might pay more but I don’t care 🌻"}, {"username": "Kejdi Okej", "comment_text": "I buy each leg just in case one of the trains gets cancelled & if your going from local to fast you don t get your money bk . As l have been going to italy for many years once or twice a year and l find for me is the best way might pay more but l non t care 🌻"}]}, {"id": "2212695565796188", "text": "Does anyone know if the Duomo (climb) and Galleria dell Academia tickets sell out quickly towards end Oct? Thinking of not pre-booking too early in case of unforeseen or needing to move things around due to weather.\n\nTIA ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2212695565796188/", "likes": 0, "comments": []}, {"id": "2212698459129232", "text": "Does anyone like to immerse themselves in a culture by reading books set there? Any recommendations\nof great books set in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2212698459129232/", "likes": 73, "comments": [{"username": "Johanne Guérin", "comment_text": "Books…. and movies as well!"}, {"username": "Amy Beth", "comment_text": "Eternal"}, {"username": "LonDeb Peterson", "comment_text": "Brides of Rome, first of a trilogy about the vestal virgins."}, {"username": "May Chambers", "comment_text": "Laura Morelli has written historical novels set in Italy, very well researched and written. The last Painting is her most recent--very good and easy reading."}, {"username": "Mike Makofske", "comment_text": "A Room With A View by E. M. Forster"}, {"username": "JA Var", "comment_text": "The Glass Blower of Murano,"}, {"username": "JA Var", "comment_text": "Also Rhys Bowen, reading The Venice Sketchbook, And The Tuscan CHild"}, {"username": "Bill Elias", "comment_text": "I just finished the Cypress Maze."}, {"username": "SE Rosenberg", "comment_text": "Following"}, {"username": "Janet Knight", "comment_text": "F"}, {"username": "Stefan Pescollderungg", "comment_text": "Why not read some books written by Italian authors and not foreign authors (with a romanticizing view on Italy). Maybe Maurizio de Giovanni or Andrea Camilleri"}, {"username": "Paula Wines", "comment_text": "Dianna Donohue Vicki Nicholls"}, {"username": "Claire Tarry Rahme", "comment_text": "Tanna FYI ❤️"}, {"username": "Laura Di Martino - Kempt", "comment_text": "Anything by Donna Leon, Marina Fiorato, Tim Parks"}, {"username": "Amy Kaye", "comment_text": "Following"}, {"username": "Reyes Manrique de Lara", "comment_text": "From scratch and under the Tuscan sun"}, {"username": "Robin Kaiser", "comment_text": "Beautiful Ruins"}, {"username": "Grant Smith", "comment_text": "Any Italian based novel written by NZ author, Nicky Pellegrino. The books literally draw you in and you are there♥️"}, {"username": "Anne Tirrell McLaughlin", "comment_text": "Lisa Scotteline's Eternal and Loyalty."}, {"username": "Dianna Donohue", "comment_text": "Beneath a Scarlet Sky. Mark Sullivan"}, {"username": "Rita Follacchio", "comment_text": "Ciao Bella by Kate Lambroek"}, {"username": "Cate Neil", "comment_text": "Donna Leon - great detective books set in Venice"}, {"username": "Cindy Bafaloukos", "comment_text": "My Brillyant Friend series!!! Loved reading them!"}, {"username": "Lizzie Garza Lizcano", "comment_text": "The Decameron"}, {"username": "Cindy Neilson", "comment_text": "Well of course there’s Frances Mayes Under the Tuscan Sun, but frankly I think, in this case, the films better"}, {"username": "Anita Bonaminio Krimm", "comment_text": "I’ve enjoyed these 2 books I bought years ago from Barnes & Noble"}, {"username": "Anita Bonaminio Krimm", "comment_text": "Anita Bonaminio Krimm"}, {"username": "Louise Cerretani LaMothe", "comment_text": "Brunelleschi’s Dome by Ross King"}, {"username": "Angela Tutt-Callaway", "comment_text": "."}, {"username": "Elena Marcuzzo", "comment_text": "All the thrillers of Paola Barbato!"}, {"username": "Stephanie Osborn Rushing", "comment_text": "Voice in the wind by Francine Rivers. All about historic Rome"}, {"username": "Anne Ingham", "comment_text": "I've lots of books., written by italian authors.buts they are all crime. Marco vichi is an excellent writer, and his books are set in Florence and surrounding areas."}, {"username": "Sheri Dettman", "comment_text": "I've read just about everything that I can. Not so much about the history, but other's stories of moving there. Look in iBooks and put Italy in the search. You can read a sample of each book to see if it's of interest."}, {"username": "Maria NoBa", "comment_text": "Any book by Marlena di Blasi. My favourite is “1000 days in Venice”. There are also recipes, recommendations\nof where to stay and eat. She has on book set in Sicily and one in Tuscany and others."}, {"username": "Kris Seppa", "comment_text": "following"}, {"username": "Juliette Wohlrab", "comment_text": "The Venice Sketchbook"}, {"username": "Kalindi Corens", "comment_text": "\"Medici\" currently on Netflix. Captures political and financial relationship between the Papacy and the Medici. Makes 2016 and upcoming 2024 presidential elections look like mere child's play. Highly recommend reading some non fiction history before watching to better understand and also to provide context."}, {"username": "Ronald Margherio", "comment_text": "Donna Leon's Commissario Guido Brunetti mysteries set in Venice and Andrea Camilleri's Commissario Salvo Montalbano mysteries set in Sicily."}, {"username": "Kathleen Roll", "comment_text": "SPQR\nA room with a view\nThe House of Medici\nUnder the Tuscan Sun\nLove and Gelato\nDepends what you like, SPQR is a thick book but really interesting."}, {"username": "Julie Hinton", "comment_text": "My Modena: A year of fear, laughter, and exhilaration in Italy. Its funny."}, {"username": "Teresa Whitehouse", "comment_text": "Nicky Pellegrino is a great author . I would certainly reccomend her. https://\nwww.nickypellegr\nino.com/"}, {"username": "Sonia Cyr-Lo", "comment_text": "The DaVinci Code"}, {"username": "Katie Ewers", "comment_text": "Idk about books, but the new Mission Impossible is filmed in Rome and Venice. 🤩🤩🤩"}, {"username": "Lara Rebecca", "comment_text": "A Rosie Life in Italy series is fun."}, {"username": "Karen Schmidt", "comment_text": "It’s a light read…but I enjoy all her books"}, {"username": "Stef Gen", "comment_text": "I read Four Seasons in Rome by Anthony Doerr before our trip, and wow the details in that book couldn’t be more true than our experience exploring Rome."}, {"username": "Grazia Maria Giordano", "comment_text": "For a touch of Sicily and of a world long gone read Stefania Auci’s saga in the Florio family\n\nhttps://\nwww.thriftbooks.\ncom/a/\nstefania-auci/\n4058625/"}, {"username": "April Berry", "comment_text": "Lots of suggestions on this post: https://\nm.facebook.com/\ngroups/\n1373361046396315\n/permalink/\n2180662255666186\n/\n?sfnsn=mo&ref=sh\nare&mibextid=6a\namW6"}, {"username": "Jo Porter Smith", "comment_text": "Signora DaVinci…set in the Florence area."}, {"username": "Jo Porter Smith", "comment_text": "Vivaldi Virgins…set in Venice"}, {"username": "Niki Sewell", "comment_text": "Angels & Demons ( we did this tour in Rome) . The Di Vinci Code.\nLighter reading One Italian Summer. ❤️"}, {"username": "Cheryl Eickhorn Jorgensen", "comment_text": "James Patterson-The Broker"}, {"username": "Jim Hackney", "comment_text": "The Pope’s Ceiling!"}, {"username": "Claire Ickes", "comment_text": "Becoming Italian by Bret Thoman is a recently written delight. Raised in the American South, Bret now lives and works in Italy."}, {"username": "Cheryl May Colbey", "comment_text": "This is a fun little read"}, {"username": "Lisa Joanna", "comment_text": "Bella Figura"}, {"username": "Grace Veniero", "comment_text": "I read several books by Laura Morelli including The Painter’s Apprentice and The Gondola Maker."}, {"username": "Phyllis Waring", "comment_text": "\"Last Days of Pompeii\""}, {"username": "Janeen Tanner Skoda", "comment_text": "My Italian Daughter-multi generational story. Especially if like wine and Nutella 😊"}, {"username": "Jane Kauffman-Marinelli", "comment_text": "We stay d in Florence and before our trip watched the Medici series. It was great !\nThen we watched the Dan Brown movie with Tom hanks called Inferno.\nGood luck."}, {"username": "Hilly Mills", "comment_text": "Still Life is about Florence just after the war. Fantastic book"}, {"username": "Magdolna Hursán", "comment_text": "Stefania Auci: The Florios of Sicily"}, {"username": "Marcia Kellogg", "comment_text": "Every Day in Tuscany- Seasons of an Italian Life"}, {"username": "Maria LaPietra Guerrero", "comment_text": "Yes I love to do that. I recommend the Star Crossed Sisters of Tuscany, One Italian Summer and 4 seasons in Rome"}, {"username": "Sandy Radican Shikaly", "comment_text": "One Italian Summer❤️"}, {"username": "Diana Hesse", "comment_text": "Donna Leon’s books set in Venice."}, {"username": "Bob Deahl", "comment_text": "The Italians, Luigi Barzinni"}, {"username": "K M Uí Fhionnaláin", "comment_text": "Elena Ferrante...Mia amica geniale...My brilliant friend..it is possible to get English translation version ..set in Napoli."}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Janice Vaznonis", "comment_text": "Janice Vaznonis"}, {"username": "Ed Wren", "comment_text": "Nonfiction but they are great. All by H. V. Morton:\nA Traveler in Italy\nA Traveler in Rome"}, {"username": "Rosemary Dailey", "comment_text": "Rosemary Dailey"}, {"username": "Rosemary Dailey", "comment_text": "Heres a good one"}, {"username": "Kathy Burns Doer", "comment_text": "I'm not much of a book reader, but I do like to watch movies and documentaries of places I'm going. For movies, there's Under the Tuscan Sun, The Tourist, A Room with a View, The Talented Mr Ripley. Some of these movies may also be books. And there are several James Bond movies set in Italy such as No Time to Die, From Russia with Love, Moonraker, Casino Royale, Quantum of Solace."}, {"username": "Linda Cormack", "comment_text": "Beneath A Scarlet Sky...wonderful\nbook..."}, {"username": "Antonio Aloè", "comment_text": "I would suggest you first learn the history and can suggest a great book that you can find in Amazon \"history of the Italian people\" of Giuliano Procacci or Storia degli Italiani in Italian.\nI believ it is a must for anybody visiting Italy not only for gelato ,cacio e pepe or pizza.\nThe book skips a couple of thousand years and starts from around the year 1.000 .Enjoy it"}, {"username": "Carole Garron", "comment_text": "The stones of Florence by Mary McCarthy and a village in Umbria by Lisa st aubin de teran"}, {"username": "Carole Garron", "comment_text": "Italian neighbours and an Italian education by Tim parks"}, {"username": "Shannon Kampf", "comment_text": "I’m about to start The Agony and the Ecstasy by Irving Stone - classic historical fiction about Michelangelo."}, {"username": "Stephanie Butler Morris", "comment_text": "Oil & Marble"}, {"username": "Denise Shea", "comment_text": "If you are going to Florence this is a must read. It’s an amazing book 😊"}, {"username": "Dana Talusani", "comment_text": "Definitely The Talented Mr. Ripley!"}, {"username": "Sherry Somers Willome", "comment_text": "Always loved Under The Tuscan Sun"}, {"username": "Linda Seckler-Rufkahr", "comment_text": "I like to read historical fiction situated in the places I have visited around the world. On a trip to Italy I read a book titled “Michelangelo and the Pope’s Ceiling.” As I walked through the Raphael Suites and the Sistine Chapel it brought the history to life for me."}, {"username": "Emily Johnson", "comment_text": "These suggested books are great."}, {"username": "Margaret Rybicki", "comment_text": "The Time Returns by Alexandra Ripley is set in fifteenth century Florence and is my favorite ❤️🇮🇹📚 and Bella Figura by Kamin Mohammadi is delightful about her experiences living in Florence and there are also her favorite recipes added to each chapter 😋👍🇮🇹"}]}, {"id": "2212701872462224", "text": "We're travelling to Heathrow international and changing to BA with two hours to change to Naples. Interested in thoughts about the timing and process at Heathrow.", "link": "facebook.com/groups/1373361046396315/permalink/2212701872462224/", "likes": 0, "comments": [{"username": "Ella Rooke", "comment_text": "Heathrow is very busy, will you need to check in again?"}]}, {"id": "2212743742458037", "text": "Traveling to Rome in October. Can someone explain how to recoup VAT tax for things booked online in advance and bought onsite? I heard there was a place in the airport but what's the process?", "link": "facebook.com/groups/1373361046396315/permalink/2212743742458037/", "likes": 0, "comments": []}, {"id": "2212763465789398", "text": "Hello everyone. I'll be in Sicily in a months time. I have heard about the fires there. Can anyone who is there now please update on what is currently happening.\n\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2212763465789398/", "likes": 0, "comments": []}, {"id": "2212766852455726", "text": "Great dinner at trattoria Za Za (Florence)", "link": "facebook.com/groups/1373361046396315/permalink/2212766852455726/", "likes": 55, "comments": [{"username": "Diana Boucher", "comment_text": "My favorite restaurant in Florence!!!!"}, {"username": "Michelle Boudreau", "comment_text": "What is the price point of this restaurant? Do we need reservations for 2 at the end of September?"}, {"username": "Matt Henderson", "comment_text": "We really enjoyed it too!"}, {"username": "Kyle Pajor", "comment_text": "This is making my mouth water and I just ate"}, {"username": "Karen Martinez", "comment_text": "We ate there too. Soo good. We had the Florentine steak and the pasta bolognese with duck meat."}, {"username": "Scott Taylor", "comment_text": "ZaZa never disappoints"}, {"username": "Faryal Abbas", "comment_text": "I am checking and they have reservation available at 10 pm. Are they open this late?"}, {"username": "Jack Partington", "comment_text": "Best steak ever."}, {"username": "Theresa Skipper", "comment_text": "Will book for our trip in a few weeks,looks fantastic!"}, {"username": "Kejdi Okej", "comment_text": "Will book for our trip in a few weeks , looks fantastic !"}]}, {"id": "2212770515788693", "text": "Best area to stay in Milan with a 18 month old please?\nI’ve been looking at staying near the central station, would you say this is accessible to most places, duomo etc?\n\nVisiting in November and was looking to do a bit of shopping, can anyone recommend any malls or areas please that has different brands, not all high end?\nThank you😊", "link": "facebook.com/groups/1373361046396315/permalink/2212770515788693/", "likes": 0, "comments": [{"username": "Francesca Giovanelli", "comment_text": "Close the central station there is corso Buenos Aires with many shops. Walking to the Duomo area from corso Buenos Aires there is also corso Vittorio Emanuele"}, {"username": "Bellafab Fabrizio", "comment_text": "Montenapoleone Suites was brilliant. There was a supermarket at the end of the street. The most amazing bakery nearby for breakfast and duomo and shops was a stone throw away. The room was massive. 2 bedrooms 2 bathrooms but the reception people we just amazing to us with recommendations\nand calling us taxis and everything really"}, {"username": "Tony Gesmundo", "comment_text": "Ibis Centro Milan is a funky and well priced hotel 10-15 mins walk from the train station. About EUR100 per night."}, {"username": "Tony Gesmundo", "comment_text": "Tony Gesmundo"}, {"username": "Leanne Thompson", "comment_text": "Recommendations\nfor hotels central to duomo would be grateful for families. Thank you 😊"}, {"username": "Valentina Di Francesco", "comment_text": "I suggest you \"zona isola\" next to Garibaldi train station. A beautiful new park, lots of small venues and places to eat. Very well connected with all areas of Milan."}, {"username": "Paola Bersano", "comment_text": "Look for a hotel in the area Duomo/Brera/\nCastello"}, {"username": "Rosa Zordan", "comment_text": "Why on earth would you want to take an 18 month old baby to one of the busiest places in Italy. If you have an opportunity to leave your child with a sitter I strongly recommend it. Italians are very baby intolerant unlike Asian countries."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2212782739120804", "text": "2 adults + a 7 year old. It’s been 15+ years since my last visit to Italy & planning our first family trip. Hubby & daughter never been. How many days would you recommend for the following places?\nVenice\nFlorence\nRome\nThe heading south to the Amalfi coast\nPossibly Sorrento, Positano etc\nMaybe onto Sicily\n\nThinking we will train it in the north & then hire a car to go slower & more relaxed along the coast", "link": "facebook.com/groups/1373361046396315/permalink/2212782739120804/", "likes": 4, "comments": [{"username": "Rosa Zordan", "comment_text": "3 days in each and I recommend bus because coastal road treacherous and train lots of tunnels."}, {"username": "Kristi Britt-Stearns", "comment_text": "I am on our last day in Rome with 2 young teens and my husband. If I were doing it over I would do:\nVenice -2 nights\nFlorence-3 nights\nRome-3 nights (when I do this again, I would dine all meals outside of Rome in them little local areas surrounding Rome, some are walkable)\nSorrento - 6 nights with lots of boat time booked on the water seeing all the sites. Maybe 3 nights Sorrento and 3 nights Positano or Almalfi. We didn’t do Sicily but that sounds lovely. We flew into Milan for 3 nights and did a day trip to Como which was really fun, before heading to Venice."}, {"username": "Sara Punis", "comment_text": "Venice - 1 whole day\nFlorence - 2 or 3 days just for the city (nothing else in Tuscany)\nRome - 7 da s\nAmalfi 3-4 days\nSicily - road trip 10 days"}, {"username": "Kay M Gregan", "comment_text": "Don't miss out on Burano if you are going to Venice. I was in Venice towards the end of July and of course it was busy! Toscana is a gem. I had time in Siena, San Gimiango and Montepulciano, with wine tasting in Chianti and San G. Sorrento, Capri and Positano 3-4 days. Heading over to Sicily tomorrow."}, {"username": "Lucrezia Folger", "comment_text": "How many days, weeks, months are you going for?"}, {"username": "Kay M Gregan", "comment_text": "And Rome, again I would look at a good 3-4 days. I was there mid July so peak season."}, {"username": "Laura Uribe", "comment_text": "I would say no less than 3 days per city. Especially if you’re planning day trips."}]}, {"id": "2212784189120659", "text": "Is there Uber/ Lyft in Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2212784189120659/", "likes": 0, "comments": [{"username": "Sarah Soave", "comment_text": "I used Uber in Milan last year. Not sure if anything has changed!"}, {"username": "Oppa Ho", "comment_text": "Don't use uber in milan"}, {"username": "Joy Pascxa", "comment_text": "taxi"}, {"username": "Lou Goldberg", "comment_text": "I was just there. Uber isn’t the same as in the US. If you want the same experience use freenow app but I found taxis easy and honest"}, {"username": "Francesca Giovanelli", "comment_text": "Regular taxis must have a number on the car or a silver shield. Be careful there are many illegal taxis around (they ask for cash payment because they don’t pay taxes). Regular drivers are tested for drug and alcohol"}, {"username": "Francesca Giovanelli", "comment_text": "There is Uber app for Milan, but are taxis or NCC (a legal driver with silver shield on the car). Ride by private drivers with their own car are not allowed in Italy."}, {"username": "Ibbu Mohd", "comment_text": "Freenow\ninTaxi\n\nThese apps are used most. Uber not much."}, {"username": "John Bruckman", "comment_text": "Taxi only"}, {"username": "Enrico Lecce", "comment_text": "Rent a car 🚗 it's worth the experience...."}, {"username": "Oppa Ho", "comment_text": "Italy taxi driver hate uber rip off"}]}, {"id": "2212808035784941", "text": "So, how are my fellow Australian travellers coping with the Euro exchange rate being so low? Best money saving tips please ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2212808035784941/", "likes": 24, "comments": [{"username": "Nadia Gabellone", "comment_text": "Applying the YOLO principle"}, {"username": "Nadia Nadia", "comment_text": "Going there in 5 days\nJust trying to book as much as I can from home e.g. intercity trains etc\n\nOnce there, just I am planning to stop converting unless shopping to bring something back home , in that case should consider"}, {"username": "Caitlyn Rose Feder", "comment_text": "4 weeks in we have just decided to stop converting the euros to aud in our head and enjoy ourselves 😂😂 will deal with the damage when we get home"}, {"username": "Angela Symons", "comment_text": "We haven’t noticed really as we keep getting our salary while we are here so we essentially just use our normal grocery spending here and Europe fund haha! I’d just see how you track for a few days and then scale back from there that’s what we did. Also bought groceries 3 nights and made our own pasta and snacks etc"}, {"username": "Imperia Arcidiacono", "comment_text": "Going 24/12/23, so hopefully it will be better, but the trip I have is England Germany Spain Austria France and Italy, going with my son and his wife for my birthday. Can’t wait"}, {"username": "Annette Oosthuizen", "comment_text": "Lol we coming from South Africa end September. Have to multiply by 20 for everything 🤦🏻‍♀️VERY pricey but hey we only live once. I usually budget an amount per day and don’t convert, else will end up sitting in hotel room."}, {"username": "Nina Churchill", "comment_text": "I’ve always assumed Australia is more expensive compared to Europe, and wages were higher in Aus. To give the coffee example, I’d assume that would be about €3 unless it was on a tourist piazza."}, {"username": "Kezia Smith", "comment_text": "when i started my travels back in May, conversion through my wise account was 0.63 and now it’s 0.59 😭"}, {"username": "Lynette Weir", "comment_text": "Traveling from the UK ££ to Euro €€ wasn't that bad...just watch out for the usual tourist rip offs."}, {"username": "Maria Antidormi Corica", "comment_text": "I can’t be bothered. It is what it is"}, {"username": "Laurel Buchanan Layton", "comment_text": "Canadian here, our exchange is similar. We had breakfast with many accommodations or bought fruit from markets & croissants for breakfasts. Lunch was often grab and go style. Many options for hot sandwiches or pizza that we ate by the water/in a park/back at hotel/etc so saved on sitting fees. Dinner was always at a sit down restaurant. One gelato or treat per day. This saved us a lot of money on food while still experiencing the flavors of Italy. \"The fork\" app had many deals for 20-50% off at highly rated restaurants. We checked for deals and booked shortly before dinner. Water fountains are everywhere in Italy to refill your bottle throughout the day."}, {"username": "Allison Mir", "comment_text": "Get a Revolut card - €0.59 to AUS$"}, {"username": "Courtney Walford", "comment_text": "I am not 🤣 burning through $$ painfully fast"}, {"username": "Sharon Woollgar Rabe", "comment_text": "Try being. South African 20 to 1!! But we still had the best holiday... the food in italy is still really affordable"}, {"username": "Jo McManus", "comment_text": "In Paris right now. Even with shitty conversion a glass of fabulous red wine at 6Euros is cheaper than Oz. Enjoy the moment🍷🥰"}, {"username": "Bellafab Fabrizio", "comment_text": "Dont sit to eat. Eat offf the little holes in the wall u can eat really cheaply. Go to the supermarket for water u can get a 6 pack for 1.80 euro"}, {"username": "Rachie Kitto", "comment_text": "It is absolutely awful!"}, {"username": "Debbie Morton", "comment_text": "You should try the £. It’s about AUD$2 for £1."}, {"username": "Rebecca Korpershoek", "comment_text": "Honestly food is your biggest expense. Italians don’t really do breakfast, just a coffee and croissant, so we went to the supermarkets and brought milk, cereal, yoghurt etc for Brekky. Also cheaper if you can take a packed lunch with you. Some nights we were also happy with some local meats and cheeses with bread for dinner as we were over eating out all the time. If you come across food markets you can pick up meats, cheeses and fruit so cheap and they taste amazing.\nI much prefer to spend money on experiences, but I don’t always go into churches if you have to pay, sometimes the outside if enough to look at, don’t feel you have to look at everything, if you have to pay to look at something do your research and make sure it’s something you really want to see. The exchange rate has never been great so it’s not going to get much better"}, {"username": "Katryna Tancred", "comment_text": "We have just been. Best advice. Ignore the price and have fun.\nPerspective on price - We paid over $100.aud for Macca's for 4.\nSwitzerland doesn't work on a budget."}, {"username": "Kiana Cathy-Ann Strong", "comment_text": "Trying not to think about how much it costs in aud 😭 just trying to enjoy my holiday. I transferred money into my wise account in euros so as long as I have enough euros I’m fine. Not thinking about about the conversion"}, {"username": "Lori Greco", "comment_text": "Just do it. Eat up at breakfast, lots of.protein. gelato for afternoon tea and a pizza or.pasta for dinner.. an afternoon spritz will be served with nibbles. It is what it is."}, {"username": "Jenny Kendrick", "comment_text": "Dont even think about it - just enjoy!!"}, {"username": "Erin Magee", "comment_text": "Not a tip but just enjoy each day - don’t worry about the money - we only live once 😊 but you can buy drinks and food at supermarkets like Conad - buy train tickets way ahead of date and save $$ - fill up water at dedicated fountains - know your prices of certain food - don’t eat in the main areas like a piazza etc take a back street and wander the back areas"}, {"username": "Colleen Jennings", "comment_text": "Hi. Here are my tips for an Italian trip :\nStand at the bar in caffès for eats/drinks - in some places this works out a third of the price compared to table service.\nDon’t go to places in a large square - you’ll pay extra for the view!\nShare courses ie an antipasti for 1 & ask for 2 plates, ditto pasta/mains.\nDrink Vino de la casa - often comes in a quarter/half/\nlitre carafe.\nDo your own itinerary- don’t pay for someone to do it for you! Google for info on tickets etc\nCheck out free places where you’re staying - parks etc.\nFill your water bottle at the water fountains.\nEnjoy your trip - Italy is amazing!"}, {"username": "Edmond Nolan", "comment_text": "If your pinching pennies like that is it wise to travel"}, {"username": "Susan Orr", "comment_text": "Yolo. Going to Italy in a month. Don't even look at exchange. Hotels and flights are prepaid in cdn and i just use my cc for the rest. I dont want to have to worry about a vacation. Life is too short and I love traveling"}, {"username": "Melissa Steyn", "comment_text": "🤣🤣 first world problems. Try coming from South Africa. We pay R20.78 for €1. That’s AU$1.69 that we pay for €1\nPlus a rand is really worth nothing."}, {"username": "Cynthia Marie", "comment_text": "I didn’t realize the exchange rates were getting low. That’s too bad 😐 Once we knew we were going again this year, we kept an eye on the rates and bought when it looked good. A couple months ago it was almost equal $ for €. I remember years ago it was 2 $ for 1 £ , Ouch!\nHave a safe trip!"}, {"username": "Julie Evans", "comment_text": "We are just sucking it up im afraid it is what it is"}, {"username": "Rebecca Millhouse", "comment_text": "If you’re already over there - don’t convert. It will just make you want to cry 🤪"}, {"username": "Sam Mah", "comment_text": "Go to Italy. We found it was one of the cheaper countries. On the other hand Switzerland is quite expensive but sooooooo beautiful."}, {"username": "Sheila Gale", "comment_text": "Nothing much you can do about it. You only have two choices, stay home or watch your budget. Will be in Italy 3 weeks time. Don't think the exchange rate will improve by then."}, {"username": "Sinny Wei", "comment_text": "Live your best life (reasonably) 😂 look up some more budget friendly places to eat/drink - found some great deals and happy hour drinks! Converting too much can make the time less enjoyable thinking about it! Accomodation is something we try to stick to more whereas activities and food we are a bit more flexi! If you really want to do something do it, especially if it’s a once a life time trip - work it off later 😂"}, {"username": "Todd N Nicole Clarke", "comment_text": "The way I looked at it, you have paid so much, and travelled so far just enjoy, you can’t change it. But for drinks we used to find the local supermarket and buy drinks and snacks there. London was a lot more expensive 😂"}, {"username": "Linda Paton", "comment_text": "Just don’t convert otherwise you will realise you are paying $10 for a coffee! Travel is more than the price we pay! It’s about the experience and what it adds to our lives!"}, {"username": "Tony Gesmundo", "comment_text": "Meals are no more expensive than back home (Perth). In some cases a lot cheaper. Only the soft drinks are expensive, so drink wine or sparkling mineral water."}, {"username": "Julie Norris", "comment_text": "Last September it was easy converting EU to AUD, EU x 1.5. This year I think I'll be buying a sandwich at the supermarket but still take it somewhere lovely to eat it 😀 I read that the rate will improve around November and I'm there mid October to mid November so fingers crossed 🤞"}, {"username": "Lynette Garland", "comment_text": "Stay home till it improves or just suck it up and ignore it u can’t change it or get around it"}, {"username": "Sarah Kam", "comment_text": "It’s around 0.59 euro to 1 AUD right?"}, {"username": "Kerry Aldred", "comment_text": "I'm just ignoring it...."}, {"username": "Jude Finch", "comment_text": "Wise card exchange rates are good. Load Euros onto your card before you go and use as a paywave or cash card. No currency exchange fees each transaction."}, {"username": "Wendy Gauci", "comment_text": "Hoping it’ll improve by January, until then saving money on not buying a coffee at work each day ($5 ea, so cheaper in Italy!) will cater for 1 or 2 meals most days in our apartment when over there, will soak up the atmosphere, see the many sights, and not buy as many organised “tours” per se but be selective on the experiences we do buy - travelling with our daughters so will be more $$$. Oh and of course pinning lots of ideas on places to see and where to eat from this page on a pin app!"}, {"username": "Erilyn Wedd", "comment_text": "I take my favourite coffee sachets and some cup a soups for the occasional cheap meal.\nAlso take a small lunchbox in my bag when I go to breakfast and if I happen to have food I can’t eat 😉 I put in the lunchbox for later."}, {"username": "Kay Kosar", "comment_text": "No better for us Kiwi’s 😢"}, {"username": "Helen Abbott", "comment_text": "Is quite a shock.\nI bought a gelato without checking … $nearly 20 AU.\nDo have to try and ignore it a bit. Supermarkets are useful."}, {"username": "Kejdi Okej", "comment_text": "Just don t convert otherwuse you will realise you are payikg s 10 for a coffe l travel is more than the price we pay lt s about the experience and what i t adds to our lives"}, {"username": "Kerrie Reeves", "comment_text": "Find a local supermarket to stock up on wine, beer and snacks. Most hotel rooms have mini bars. Have a few drinks before you go out."}, {"username": "Rebecca Goldsmith", "comment_text": "I leave in a week but I ordered a wise card month ago and started to convert when I first got card rate was sitting around 61 then but if you going now it’s sitting around 59 so still low but not as bad as travelx I change some Aussie to euro there on Friday rate was 55 😭"}, {"username": "Mal Holmes", "comment_text": "Get out to the villages outside of the tourist areas. It’s so cheap and the quality of food is exceptional."}, {"username": "Lynair Bergman", "comment_text": "Use a Wise card and use supermarkets"}, {"username": "Angela Elsley", "comment_text": "The holidays we have in Australia can be just as expensive or more. It’s just the timeframes are shorter. Once in a lifetime opportunity so gonna enjoy it and worry about the rest later 😂"}, {"username": "Pamela Jones", "comment_text": "When you need the toilets go buy a coffee & use them in the cafe instead of paying for public."}, {"username": "Pamela Jones", "comment_text": "Just buy entry tickets only & use Rick Steves free audio guides"}, {"username": "Pamela Jones", "comment_text": "..also ask for the jug of local wine rather than buying a bottle. Cheaper by far"}, {"username": "Lara Anderson", "comment_text": "You only live once. If travel is important to you and enhances your life (like me) you just do everything in your power to make it happen. I’m fortunate enough to have already crossed off every major “bucket list” on my list and now ticking off every other thing. I feel truly alive when I’m on a trip, that I’ve usually put a lot of time and effort into researching and the feeling for me that I get when I start each and every tip is like nothing else out there. Don’t sweat the small stuff, moneys not everything, you can’t take it with you. Install in yourself and your kids a bigger sense of the world. Could I drive a fancy car and live in a better post code and travel less? Yes I could. Would I be happy doing that? No I would not. If your priority is travel, then do it and do it well. For me personally- memories are far more important. (I’m an Aussie too and I travel internationally\na minimum of twice a year)"}, {"username": "Pamela Jones", "comment_text": "Don't sitdown for coffee stand at the counter . It costs to sitdown"}, {"username": "Robyn Lawson", "comment_text": "Unfortunately there is little we can do about it. Just enjoy the travel I say. It is what it is. Trying to pay for as much as we before we go in 5 weeks. Taking mostly cash with me and only paying for big stuff on card. Travel Money Aus seem to have the best rates with no fees after first transaction. Always worked well that way in past trips. 😊"}]}, {"id": "2212809555784789", "text": "Today is our last morning in Rome, hoping to find a cool vintage flea market..have heard of a few but not sure if they are open on sundays…like one in Trastevere or Monti neighborhoods. Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2212809555784789/", "likes": 1, "comments": []}, {"id": "2212824699116608", "text": "Doing a day trip to St Moritz from Lake Como… anyone have a good lunch recommendation in St Moritz? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2212824699116608/", "likes": 1, "comments": [{"username": "Trevor Brown", "comment_text": "When I did the Bernina Express train in May it was very quiet in St Moritz. There were only a few outlets open in the plaza area as it was off season and it may still be the case depending on your travel date."}, {"username": "Trevor Brown", "comment_text": "This is me and my buddy having lunch and beers in St Moritz😀"}]}, {"id": "2212833962449015", "text": "Strange question… does anyone know if you can purchase nicorette gum or any nicotine replacement products in Italy ????", "link": "facebook.com/groups/1373361046396315/permalink/2212833962449015/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Yes, they are called NICORETTE GOMME DA MASTICARE, pharmacies have them."}]}, {"id": "2212840572448354", "text": "What do you think is the best.. car higher or catching trains? traveling to multiple places.", "link": "facebook.com/groups/1373361046396315/permalink/2212840572448354/", "likes": 2, "comments": [{"username": "Nicholas Nick Smith", "comment_text": "Definitely get a higher car. Definitely don’t get a Fiat 500."}, {"username": "Sam Mah", "comment_text": "How far are you going and how long for? Check a Eurail/\nInterrail pass if you going to quite a few places and you want flexibility."}, {"username": "Francisca Lis", "comment_text": "Pues depende de adonde vayas. Si son ciudades, posiblemente tren.\nSi son zonas menos accesibles o de desplazarte todos los días, coche."}, {"username": "Rosa Zordan", "comment_text": "Trains"}, {"username": "Fetchin Gretchen", "comment_text": "Depends on what part of Italy, but usually trains are best, especially cities where parking is difficult and driving is restricted."}, {"username": "Renae Larcus", "comment_text": "Trains. So easy."}, {"username": "Antonia Dosik", "comment_text": "It depends. To see smaller towns and villages you would need a car. But to see larger towns and cities, trains work very well."}, {"username": "Jeanne Eliason", "comment_text": "Trains depending on where you are going. We go to Sinalunga in Tuscany. We can't go to Montepulciano because the train station is too far from the walled city. Keep that in mind as the stop says Montepulciano. We can go by regional train to Siena, Arrezo,Poppi, Orvieto, Florence and Lucca. Car if you are comfortable parking and paying at some cities, getting petrol and have a lot of insurance. A friend of ours received a ticket in the USA 6 months after he returned. Seems he drove in a restricted area for 10 minutes before he realized. 500 euros. Yikes"}, {"username": "Jennifer Avrett", "comment_text": "Trains unless you're going to be in the south, in which case I'd say rent a car"}, {"username": "Paul Anderson", "comment_text": "A car is best Imagine yourself carting all your luggage at every destination or paying some one. By train you end up seeing what everyone sees."}, {"username": "Beth Stewart", "comment_text": "Train"}, {"username": "Basia Szokarski", "comment_text": "In the Tuscan wine country you'll def need a car...between big cities take the train so you don't have to worry about parking..."}]}, {"id": "2212843362448075", "text": "Just wondering if the hop on hop off bus in Rome is a must or could we just walk to the various sites. If you have taken one of these buses, which one would you recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2212843362448075/", "likes": 32, "comments": [{"username": "Rickie Vivrette Corman", "comment_text": "I wanted to do this whale there last week the buses looked fine, it was the lines to get picked back up that turned me off."}, {"username": "Candace Skelly Crouch", "comment_text": "Just walk you will see so much more and is easy walking!"}, {"username": "Barbara Kleinhans", "comment_text": "The bus is a terrific way to get a good overview. There is a good distance between some of the sights you would want to see and by taking the hop on hop off you can get a introduction to the entire ancient city…then go back to see the ones that most interested you."}, {"username": "Sherri Leis Dillavou", "comment_text": "I just walked🤷‍♀️"}, {"username": "Cindy Frenette Pawley", "comment_text": "We took the hop on hop off. It was great. They give you audio telling you about all the places. Great value."}, {"username": "Doreen Burbeck Engel", "comment_text": "We did the HOHO bus in Rome. I wasn't a fan."}, {"username": "Brittany Armstrong", "comment_text": "I walk, it’s so fun to see everything and you run into unexpected beauty everywhere"}, {"username": "Cassie Ryan", "comment_text": "We walked, and took Uber if it was more than a few miles away"}, {"username": "Dixie Kotylak", "comment_text": "First time in Italy and Rome this July…so glad we happened on the hop\nOn hop off bus! It was a fluke, loved it, riding it around was fabulous!"}, {"username": "Dawn Teach", "comment_text": "I’d walk."}, {"username": "Patti Seei", "comment_text": "Big Bus Tour is amazing! Great way to get to all the best spots"}, {"username": "Graham Sherlock", "comment_text": "Better to walk"}, {"username": "Jeannie Shaffer", "comment_text": "Is the Big Red Bus cheaper if purchased in advance? The website says 33 euro."}, {"username": "Karen Curci", "comment_text": "Rome is very walkable, but the HOHO bus is a great way to see where everything is. You can ride the route more than once, so you could get off on the second circuit and the walk around."}, {"username": "Yateesh Kumar", "comment_text": "Nileema Kumar"}, {"username": "Patti Farrell", "comment_text": "I love the hop on bus. Rome is much bigger than you think"}, {"username": "Steve Cruickshank", "comment_text": "I have liked the on-off bus on the first day to get a feel for the lay of the land"}, {"username": "Mandy Jonas", "comment_text": "I did the hop on hop off bus on my first day in Rome. I enjoyed it as it gave me the lay of the land"}, {"username": "Tissie McClure", "comment_text": "Big Bus Tour bus is great. ￼ We also took the regular bus line as we needed both to get to where we were staying over by Trevi fountain. Between the two buses we got to go anywhere you wanted to go and then when you get off, you￼ walk some! Just get one day and then, when you go back to renew, it is cheaper than buying two days!"}, {"username": "Tracey Fairbrother", "comment_text": "The hop on bus is a great way to get your bearings and an audio commentary we usually do the whole tour then use it as transport for the places we want to revisit."}, {"username": "Kitty Silvano", "comment_text": "How much is the hop on and hop off bus?"}, {"username": "Kate MH", "comment_text": "I usually do it in a Big city like Rome to get an overview of the city. I took the hop on hop off and was really excited to get to the coliseum it was a great experience!"}, {"username": "Gay White", "comment_text": "Definatately use the hop on hop off bus"}, {"username": "Claire Lewis", "comment_text": "Easy enough to walk and use the metro."}, {"username": "Jenny Kendrick", "comment_text": "We did a half day golf cart tour advertised in Viator app. It was excellent. Then just walked to Trevi fountain and colosseum (did a self tour there)"}, {"username": "Dolly Cote", "comment_text": "It’s a must, you’ll be happy you did."}, {"username": "Louise Ronan", "comment_text": "I walked everywhere didn’t use a hop on and off bus xx"}, {"username": "Joel Fiset", "comment_text": "Walk. You’ll get some steps in while viewing all the beauty the city has to offer. Unless you have mobility issues."}, {"username": "Maureen Hart", "comment_text": "When we couldn’t walk, we took the regular buses. It was easy"}, {"username": "Michelle Bergman Davis", "comment_text": "I would just walk"}, {"username": "Glenys Cooper", "comment_text": "We travelled by bus number 87 to see most of everything. Apparently number 87 is the tourist’s bus and easy to find"}, {"username": "Aymen Fterich", "comment_text": "I take the green line for 48h its fantastic"}, {"username": "Claire Dowson", "comment_text": "If you can walk, I would. You’ll discover and see so much more."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Do not do the bus. You will do more walking going to and from the bus than if you just walk between sites. The buses are not permitted to enter the historic district. The buses are also already full and will pass you by."}, {"username": "Renae Larcus", "comment_text": "It’s not a must but it’s a great way to get the lay of the land. We walked everywhere but the bus was fun to see the spots we wanted to go back to."}, {"username": "Tracy Foss", "comment_text": "I love the hoho bus we are never disappointed in any city we take the whole tour once & then decide on the stops"}, {"username": "Victoria Williams", "comment_text": "We love these. Reasonable price and we can see all the sights and stop and have food and wine. We actually went around twice"}, {"username": "Mia Catalano", "comment_text": "Best thing we did! Big bus tours"}, {"username": "Alison Roberts Yeh", "comment_text": "I’ve been to Rome half a dozen times and never used hop on hop off bus. Very walkable."}, {"username": "Fiona Cameron", "comment_text": "I use the metro, buy a 3 day ticket from a “tabbachi”(?) then figure out which stop is closest to where I want yo be and walk the rest. You see/discover more on foot."}, {"username": "Patricia Foley Mastrorilli", "comment_text": "We enjoy it in Rome!"}, {"username": "Allan Olexa", "comment_text": "We are active runners/\nwalkers so walk to all our destinations."}, {"username": "Maggie Manger", "comment_text": "I love the bus."}, {"username": "Terry Pisano", "comment_text": "Doing a golf cart tour on day 1 to get acquainted, then walking the next day. Looks pretty walkable. Our walking tour starts at Sant Angelo castle to Colosseum (my own tour) with bunch of stops and good eats in between 😄"}, {"username": "Katherine Baldwin", "comment_text": "Carmen Torres Geribon check this out."}, {"username": "Holly Clifton", "comment_text": "It’s not a must but it’s informative and an easy way to see all the sites. It’s also allows you to rest your feet between!"}, {"username": "Emma Kay", "comment_text": "Walk"}, {"username": "Annette Mayer", "comment_text": "Walked our 1st trip. Did HOHO last trip. Next probably mixture of train, bus and foot"}, {"username": "Barbara Bastianini", "comment_text": "I like to walk to see the sights. Especially the first time in any city, because I think it’s much easier to learn your way around when walking. The perspective from the seat of a bus is different from that of the sidewalk. Actual “boots on the ground” walking gives me confidence. But the bus kind of removes me from a city rather than integrates me into it. It feels like a barrier between myself and the life of the city. After strolling through a city once I have a better idea of the lay of the land than I do after a bus ride. And walking gives you a better feel for the pulse of a city. You can “feel” the atmosphere and the street life rather than just get a visual over-view of things. You kind of become a part of the city in an exciting way. The thrill of discovery when stumbling on something on your own is hard to beat for me. Orienting myself while walking makes me feel I’ve mastered a city right off the bat.\n\nPlus Rome is a very walkable city that’s simply just fun to immerse yourself in. Even getting lost is fun and educational. After you get lost just once and find your own way back the city belongs to you!!\n\nBut everyone’s different and some people just love the hop on hop off bus. So you should do what you feel is best for yourself."}, {"username": "Debbie Zaleski Cincurak", "comment_text": "I always do the Big Bus. A great way to see everything and also use for transportation"}, {"username": "Caitlin Quinlivan", "comment_text": "we just did the bus tour and it was 100% worth doing. you all of the sites and it was amazing"}, {"username": "Leslie Goodland", "comment_text": "I walked or took the subway. Never bothered with a hop on hop off bus. I also love to walk- you see a lot more and I was conditioning for a bit of El Camino de Santiago in Spain."}, {"username": "Lesley Stewart-D'Ortenzio", "comment_text": "The hop on hop off in Rome didn't drop you at the major attractions it took you to ones close by."}, {"username": "Lea Tenzer", "comment_text": "Great way to introduce the city..after..lo\nts of walking!"}, {"username": "Marcus Hiesler", "comment_text": "You can walk the bus was still good also"}, {"username": "Gundega Barkane", "comment_text": "It deppends. Walking and metro was fine. You can get Vatican, Spanish Steps, Piazza del Poppolo, Colloseum-by metro. Things like Pantheon- or Angelo Bridge walking to it anyway. I would say everything in the old centre is walkable just really lots of"}, {"username": "Julie Koziol", "comment_text": "I love the Hop on Hop off bus. Saves your feet. You can see a lot in one day. Some people don’t know what to see. I might discover someplace not on my list. I’m also using it as my main means of transportation."}, {"username": "Kelliann DiTullio", "comment_text": "We have found the hop off hop on bus is ineffective. Use the metro or buses. Cheap fast and easy . And safe"}, {"username": "Charlene Noll", "comment_text": "We walked, keep in mind it was 30,000 steps logged… 15 miles. Wish I had known there was a hoho bus 🤪."}, {"username": "Rachel Berry", "comment_text": "We do the big bus tour every city we go to, its our favourite thing to do, but honestly don't think it was worth it in Rome, however we booked a golf cart tour which I would recommend 100%"}, {"username": "Karen Blackmore", "comment_text": "We just walked, a lot! Metro to get to the Vatican. Didn't do the bus"}, {"username": "Julie Norris", "comment_text": "I got a three day pass but I was in Rome for a month. I thought it was worth it to find my feet but two days would have been enough. It doesn't go as far as the Vatican. Just to the Tiber."}, {"username": "David Horgen", "comment_text": "We did the bus. We actually got on not far from our Airbnb, and just rode all around the city. We did it a couple days in a row just to see everything. Never hopped off. The lower section is air conditioned and the upper deck is not."}, {"username": "Kejdi Okej", "comment_text": "We just walked , a lot l metro to get to the vatican . Didn t do the bus"}, {"username": "Jojo Hanna", "comment_text": "We do the Big Bus Tour wherever we go . Very impressed with the punctuality of the buses in Rome. We did a full route first, then hopped on and off at the places we wanted a closer look at."}, {"username": "Vicki Douglas", "comment_text": "I went on the HOHO bus but found it very crowded. Ended up getting off and using GPS to walk back to hotel….found suburbs/shops I would never have seen if I hadn’t have got off and wandered. Great to get your bearings - I always do HOHO bus to start so I can see where things are in relation to each other and discover places I want to explore more"}, {"username": "Marie Cunningham", "comment_text": "I'm on it now and at the Vatican and is worth it in this heat."}, {"username": "Rosa Zordan", "comment_text": "I love hoho bus, it orientates you to where everything is and you just keep travelling until you make up your mind where and what you want to see. Far too hot in summer heat to walk."}, {"username": "Kerry Aldred", "comment_text": "Going to 6 major cities and using hoho in each on arrival or the following day. Paris have booked a night cruise hoho. Some are 24 hours others 48 hours. Booked all at same time and received a discount. Can use from up to 6 or 12 months from date of nominated date of arrival for each city."}, {"username": "Jaime Cleek", "comment_text": "We walked everywhere. Those buses were like sardines"}]}, {"id": "2212846835781061", "text": "Siena - travel back in medieval times. Immerse yourself in the past and enjoy the vibe. It’s a truly fascinating city. Please make a stop at Siena if you are near Florence, it’s highly recommended.\n\nThumbs up to Il Masgalano Gelateria. A refreshing flavour, basil lemon mint, is perfect for a summer day.", "link": "facebook.com/groups/1373361046396315/permalink/2212846835781061/", "likes": 177, "comments": [{"username": "Lynn Haldane", "comment_text": "Maja Sikora"}, {"username": "Donna Harrison", "comment_text": "Agree Siena is definitely worth a visit, was only there for a few hours but so glad we went there 🤗"}, {"username": "Gary W Anderson", "comment_text": "A beautiful town"}, {"username": "Prithviraj Sengupta", "comment_text": "How long is Sienna from Florence by bus?"}, {"username": "Kimberly Lampros", "comment_text": "Loved siena!"}, {"username": "Donna Pasteris", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Natasha Welage", "comment_text": "Top things to see or do there?"}, {"username": "Laura Cary Veeder", "comment_text": "We stayed there last summer during the Palio! It was amazing-celebra\ntions every night w/ singing and parades. And, we found our favorite restaurant in Italy-Bagoga there! We stayed in Florence the year before and liked Siena much better. Be sure to go to the church on the hill that has St Catherine’s head and finger! It was crazy & one of the things my kids talk about still!"}, {"username": "Sue Farrell", "comment_text": "Loved all our visits to Sienna.🇮🇹❤️"}, {"username": "Justina Walker", "comment_text": "Melissa Cane Jones"}, {"username": "Erwin Andres", "comment_text": "The town is beautiful! The Duomo especially 😍"}, {"username": "Yateesh Kumar", "comment_text": "Nileema Kumar"}, {"username": "Kylie Lovejoy", "comment_text": "Kim Dudin"}]}, {"id": "2212848272447584", "text": "Has anyone used the Tour Guy - How To See Rome In A Day. USD360 for 2. Offers skip the queue at most attractions. If you have been, please would you mind sharing the experience. TIA Nathan", "link": "facebook.com/groups/1373361046396315/permalink/2212848272447584/", "likes": 0, "comments": []}, {"id": "2212477339151344", "text": "Wow if looking for somewhere fab to eat in Rome along the River Tibor and some fab markets I can highly recommend Lungo Tevere.", "link": "facebook.com/groups/1373361046396315/permalink/2212477339151344/", "likes": 69, "comments": [{"username": "Linda Shanks", "comment_text": "Looks wonderful!. Is there a specific day for market"}, {"username": "Veronika Bisani", "comment_text": "Cuccurucù"}, {"username": "Darryl Kinson", "comment_text": "Thanks for the recommendation."}, {"username": "Janet Thom", "comment_text": "Thank you we visit in Oct"}, {"username": "Vivian Meca", "comment_text": "Gina de Bono 💕🥰💕🥰"}, {"username": "Yateesh Kumar", "comment_text": "Nileema Kumar"}, {"username": "Denielle Sutton", "comment_text": "We were there last night 😎"}]}, {"id": "2212491455816599", "text": "Hi all! Headed to Italy in a couple of weeks. I am bit paranoid on getting my stuff stolen and being pickpocketed since it happened to me last time I was there. Please share your best safety tips/ products. Also, does anyone recommend locks for a suitcase when on a train? It’s a group of 4 of us traveling together. We all will have a backpack and a carry on rolling suitcase.", "link": "facebook.com/groups/1373361046396315/permalink/2212491455816599/", "likes": 3, "comments": [{"username": "Bill Gillespie", "comment_text": "Buy a pair of Pick Pocket Proof pants. They are expensive, $115, but in Naples last year they tried and gave up, buy a pair, you'll see why."}, {"username": "Angel Stoll", "comment_text": "Haven’t been to Italy yet, but I grew up riding the subways in NYC. I never put important things in my pockets, especially back pockets, except in a zipped breast pocket.\n\nFor backpacks, I would wear them in front while walking around. I bought a Pacsafe sling bag a few years ago and have used it on different travels, I highly recommend!!\n\nNot sure what suitcase lock would be best for trains, but if possible, I would sit close to the rack where you will store your luggage so you can keep an eye.\n\nI use a wrist lanyard for my phone so I can use it to navigate, take photos, etc. while walking around. It’s very affordable and well worth it for safety and peace of mind!\n\nGeneral safety tips: never walk around with headphones/ear phones on, always be alert, don’t walk around alone, and don’t leave your stuff unattended.\n\nHope this helps! Have fun and be safe!"}, {"username": "Isabelle Truong", "comment_text": "I was in Italy in June so it was getting very busy already. I walked a lot and caught train/tram/ metro/bus daily so in my bag I only have 1 physical debit card (Wise), around 50 euros and a bottle of water. My other credit cards were in my Applepay, a screenshot of my passport in my phone which I have in hand all the time as I took a lot of photos. I dressed casually and always had my bag across at the front. Just be aware of your surroundings. Don’t carry a lit of cash on you, you can pay even a small amount of 1.50 euro for metro on the card! Have a great trip!"}, {"username": "Graham Sherlock", "comment_text": "Locks certainly don't hurt, a chain to secure y our case can be useful too if it's out of sight"}, {"username": "Grace Scinto", "comment_text": "1. Travel wallet carried across your body that locks the zippers together.\n2. Don’t put anything in your pockets.\n3. Get backpacks that you can hide the tags of the zippers or close them at the bottom.\n4. Take a bicycle chain/lock and loop through the handles of the bags together so if they try to steal one they have to take the lot.\n5. In an underground train or bus take off your backpack and put it between your feet.\n6. Split your credit cards with your partner to have backup\n7. Don’t take out a wad of cash in front of anyone. Just take out the bills you need."}, {"username": "Eden Seery Thornton", "comment_text": "I have been in Rome 5 days and thankfully have had no problems. Wore a small crossbody purse in the front and kept my hand on it the whole time. One of our tour guides noted as we walked that we should be careful through a particular crowd as the pickpockets were out. So they are indeed a real issue."}, {"username": "Jenny Payne", "comment_text": "Definitely lock your cases everywhere 🌻"}, {"username": "Marie Cunningham", "comment_text": "I've been here a week and travelled by train from Milan to Venice, back to Milan and now to Rome out and about and seen not one. Just a bag over your shoulder and keep an eye on things.\nCan be lucky on train if can squeeze big luggage in between sitar seats. Don't travel cattle class."}, {"username": "Holly Clifton", "comment_text": "Locks on suitcases on the train. Look for hard to cut gauge metal with combinations. Get a travel purse that has a wire that runs through the strap so they can cut (Amazon or Magellan has them) and add zipper lock guards if you are worried (I got mine on Amazon for my trip to Latin America)"}]}, {"id": "2212494252482986", "text": "Did anyone use Omio web-site to buy train tickets? Is it a reliable website? thank you", "link": "facebook.com/groups/1373361046396315/permalink/2212494252482986/", "likes": 2, "comments": [{"username": "Sam Mah", "comment_text": "Use Trenitalia. Go online and register first."}, {"username": "Eric Parks", "comment_text": "Yes, I've used it but tend to stick to the train lines app."}, {"username": "Suzanne Joslin Oliveria", "comment_text": "Yes! On 2 separate trips in italy used it for atleast 15 train trips. So easy. Can literally book a train so fast. And it looks at both trainlines which is so easy."}, {"username": "Jeff Odom", "comment_text": "Yes. It’s easy and great."}, {"username": "Frank Hunt", "comment_text": "No, Trainline App"}, {"username": "Amanda Ross", "comment_text": "I used it for 4 weeks travel in June, it was easy, and reliable. I didn’t experience any problems with it."}, {"username": "Sarah Lynn", "comment_text": "I did, it was great!"}, {"username": "Angel Stoll", "comment_text": "Yes, and I suggest you also get the app!"}, {"username": "Isabelle Truong", "comment_text": "I used Trenitalia app, very easy to use."}, {"username": "Sara Beth", "comment_text": "No I book direct with the train company and avoid fees."}, {"username": "Ibbu Mohd", "comment_text": "Book directly via ITALO train website, book seats too."}, {"username": "Paula De Rienzo", "comment_text": "Trainline is so much easier!!"}]}, {"id": "2212498549149223", "text": "Has anyone used Aer Lingus airlines? What has your experiences been with them? Thank you in advance.\nAlso, thank you to all who have posted replies for other posts. I have learned so much for planning a trip for next summer.", "link": "facebook.com/groups/1373361046396315/permalink/2212498549149223/", "likes": 10, "comments": [{"username": "Lean Ni Chleirigh", "comment_text": "Remember Ireland isn’t in Schengen, so you’ll do passport control in Italy."}, {"username": "Rosemary Giuffre", "comment_text": "Aer liguis great. If you’re going to the states you go thru American customs in Dublin."}, {"username": "Jennifer Jenkins", "comment_text": "No problems, flew to Dublin then on to Naples, Italy, I’d go with them again."}, {"username": "Cindy Neal Norvell", "comment_text": "I thought they were great☺️"}, {"username": "Cindy Santa Ana", "comment_text": "Loved them. Flew to Italy twice now using them. Funniest thing is walking through Dublin Airport at 6am and seeing the pubs all full with beer drinking lads! 6am!!"}, {"username": "Shauna Kate Nic Gabhann", "comment_text": "So comfy, staff are nice, prices might look expensive but they do include a bit more depending in your destination :)"}, {"username": "Renae Larcus", "comment_text": "Used them once. Not a good experience but it looks like I’m in the minority"}, {"username": "Mary Robinson Boggs", "comment_text": "Very happy with them. Flew last summer and would use again"}, {"username": "Rhona OConnor", "comment_text": "The pre clearance when returning to the US is the real bonus with Aer Lingus"}, {"username": "Roxanne Franquelli", "comment_text": "We just took them from jfk to Dublin then to Rome. Awesome. American customs there, on time, bags went straight, layover was short but enough time to sit and relax, stretch. Highly recommend. And back Rome to Dublin to jfk. Luggage was out before we got to the carousel."}, {"username": "Collette Lawson Duffield", "comment_text": "Just flew with them in June and return in early July. Great flight and friendly staff."}, {"username": "Nancy Day", "comment_text": "Over 30yrs ago did fly and drive with Aer Lingus and was perfect"}, {"username": "Gregory Smith", "comment_text": "I thought they were fine. Family complained about the food and the seats, but tickets were a good price. Clearing US customs and immigration in Dublin is nice."}, {"username": "Pamela Martin", "comment_text": "Flew with them about two weeks ago round trip from Seattle to Amsterdam. They are fine except for coming home. They only gave us 1 hour and fifteen minutes to change planes in Dublin for Seattle. Absolutely not enough time. When we landed in Dublin had to take a bus to the other terminal. Then had to go through screening and customs for US. Ran the whole way. They held the gate for us about ten minutes past departure. Others were not so lucky. I had ask to change times because I didn’t think it was enough time. They said it would be no problem . It was."}, {"username": "Rachel Collins", "comment_text": "Excellent, we used them in March."}, {"username": "Nancy D'Alessandro Ginder", "comment_text": "Used them a couple times, with no complaints"}, {"username": "Michelle LaMantea Talbot", "comment_text": "They were great going over but coming back they lost 3 out of 4 bags and mine was beat up! They did deliver them to our home 2 days later though and gave us an allowance in New York for clothes. We had a tight connection between their flights from Edinburgh to Dublin and had to do customs but they waited the plane and we super nice."}, {"username": "Agne Krause", "comment_text": "Just did round trip with air lingus. They are always late. Late to board, late to take off, late to arrive. Fortunately, connecting flights are late too so you don't have to worry about missing the flight 🤷‍♀️\nOtherwise basic airline, older planes. Customs in Dublin was really nice! They didn't weigh or measure my carry on luggage. That said, if the price was right I would fly with them again."}, {"username": "Carolyn Straniere", "comment_text": "They were great. No issues at all."}, {"username": "Ann Neville", "comment_text": "Aer Lingus are the best airline company in rhe world!"}, {"username": "Lori Huffaker", "comment_text": "Flew Aer Lingus RT Philly to Dublin in May. Loved them."}, {"username": "Siobhan Aherne", "comment_text": "Best airline ever. Best pilots in the world 🌎 Aer Lingus 🥰"}, {"username": "Daphne Seretis", "comment_text": "My daughter swears by them for European travel."}, {"username": "Judie Mc Adam", "comment_text": "More room than Ryan air and the staff actually smiling is a huge bonus air lingus all the way"}, {"username": "Linda Chase", "comment_text": "I flown Aer Lingus twice, Boston to Rome and Boston to Venice and returns. Excellent experience each time."}, {"username": "Joe Kolf", "comment_text": "To Dublin, yes. Good airline."}, {"username": "Elizabeth Yu", "comment_text": "We flew from San Francisco to Dublin on Aer Lingus in 2018. No problems."}]}, {"id": "2212502785815466", "text": "Can anyone comment on the Hop on hop off bus in Rome?? Which company and how was the experience??", "link": "facebook.com/groups/1373361046396315/permalink/2212502785815466/", "likes": 2, "comments": [{"username": "James-Kathy Dickerson", "comment_text": "Wonderful! bought the tickets at the bus stop gave u a great perspective of must see sights and some a drive by were ok highly recommended"}, {"username": "Sarah Lynn", "comment_text": "Big Bus Tours (app) easy!"}]}, {"id": "2212506342481777", "text": "My piece of advice after travelling Italy for a month is: don’t worry about your shoes (I walked everyday in my comfy Birks)\nDon’t worry where the bathrooms are! (Seriously do you worry about them when you’reआणखी anywhere else)\nDon’t worry about the best restaurants- they’re all fantastic.\nDon’t worry about InstaSnaps, all your photos will be amazing\nDon’t worry about the food - it’s all delish and if you don’t try it in this town you can try it in that town\nDon’t worry about how to catch a train\nDon’t worry about long queues - it’s actually all organised chaos.\nEnjoy every special moment that Italy gives you. Enjoy Aperivo, enjoy magic hour, enjoy the journey and make special memories. Italy is Bellissimo!🥰💙🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2212506342481777/", "likes": 6656, "comments": [{"username": "Ann Casale Grosso", "comment_text": "Perfectly said!"}, {"username": "Suzie Mendoza", "comment_text": "Great message. We’re planning our 45th anniversary trip for May. 🇮🇹"}, {"username": "Beverley Ford", "comment_text": "Love this!❤️"}, {"username": "Michele Dunn", "comment_text": "Love this 💖👏"}, {"username": "Meg Sliski", "comment_text": "Just got back from Italy yesterday- this is great advice!!"}, {"username": "Wilma Resta", "comment_text": "Great advice! That is what Italy is all about!"}, {"username": "Robin Cole", "comment_text": "Don’t worry…be happy…🎶"}, {"username": "John Chandler", "comment_text": "Well said Bridget. 🇮🇹 Travelled the country for the last 5 weeks and agree with all of the above.\nImmerse yourself in the culture, the people and the experience and you will enjoy it even more."}, {"username": "Sharon Menegoni", "comment_text": "I 100% agree!"}, {"username": "Antoinette Schultz Vogt", "comment_text": "I Love it"}, {"username": "Jessica Jordan", "comment_text": "So true!"}, {"username": "Pao Magnoler", "comment_text": "This is the best post I've ever read. 👏\nItaly is amazing!"}, {"username": "Robyn Mendenhall Gardner", "comment_text": "Love this Bridget! My sister and I are visiting in November from Montana. I’ve definitely gotten caught up in a lot of the worries, what ifs, etc. and I needed to see your post. Thank you!"}, {"username": "Linda Caterina", "comment_text": "Love this!❤️"}, {"username": "Andrea Ponder Roche", "comment_text": "Love this attitude so much! ♥️"}, {"username": "James Conlon", "comment_text": "Great advice thanks"}, {"username": "James Conlon", "comment_text": "I am going to Italy soon fir a month cannot wait love Italy\nDoing a eating trip like Stanley Tucci\nLive his show , he is the best dresser"}, {"username": "Dunia Aldyni", "comment_text": "I agree I agree I agree each corner in Italy 🇮🇹 is unique just enjoy 😊"}, {"username": "John Trani", "comment_text": "Exactly!!! This is the best advice i have seen on this group 😀"}, {"username": "Donna Parrish", "comment_text": "Donna Parrish"}, {"username": "Donna Parrish", "comment_text": "What is the magic hour?"}, {"username": "Linda Mascaro", "comment_text": "Exactly correct, it’s all very very good!"}, {"username": "Diane Kuzma-Harvey", "comment_text": "Love this ❤️"}, {"username": "Brenda Remus", "comment_text": "Thank you for this loving, positive, simple message ❤️"}, {"username": "Jacquie Johnston", "comment_text": "Best advice ever"}, {"username": "Jane Nielsen", "comment_text": "I will take your advice to heart for my trip"}, {"username": "Linda Copeland", "comment_text": "Love this!❤️ I completely agree!!!"}, {"username": "Angela Brevetti-Cantone", "comment_text": "Exactly 🇮🇹❤️"}, {"username": "Sharon Park-Robertson", "comment_text": "Perfectly said! Oh I love Italy!!"}, {"username": "Luanne Carey", "comment_text": "Well said and I agree 100%!"}, {"username": "Jazz Caldwell", "comment_text": "And enjoy the fact that the restaurants are NOT expecting multiple seatings for the evening so you can relax and have all the courses you want!"}, {"username": "Sheri Dettman", "comment_text": "I agree with you. You have to trust that it will all work out. You can plan the flights, make your hotel reservations, a few dinner reservations, and maybe a tour or two, but don't sweat the small stuff. Too many people on the FB sites are worrying about every little thing that in the end makes not a lot of difference. And if they would just read a bit prior to going (if this is a vacation), then they'd be prepared. Rick Steves books are great for giving all of the pertinent info. Your photo looks like you were at the gardens in Bellagio. I love that place and always go there when on Como. It never gets old."}, {"username": "Beth Shoemaker Koechner", "comment_text": "Love this!❤️"}, {"username": "Grian Schaeffer", "comment_text": "Finally someone who gets the ‘dolce vita’ 🙌🏼"}, {"username": "Alan Coe", "comment_text": "Don't worry, just enjoy the fantastic country!!"}, {"username": "Kathy Wilkey Smith", "comment_text": "Great post!"}, {"username": "Elaine M Woodward", "comment_text": "WOW a whole month"}, {"username": "Barbara Johnessee", "comment_text": "Love this!❤️"}, {"username": "Bambi Harris", "comment_text": "I love this sentiment, seize the day! (I am optimistic, on the other hand my bladder needs to know where bathrooms are, yes my bladder likes to know no matter where I am haha)"}, {"username": "Brenda Pappalardo", "comment_text": "Love your advice and attitude. Italy is special"}, {"username": "Melissa Jane Brown", "comment_text": "Well said!"}, {"username": "Maria Piccolo Stern", "comment_text": "Perfetto. I always say, find your own Italy❤️"}, {"username": "Patricia Ricci", "comment_text": "Well said"}, {"username": "Elaine Wilson", "comment_text": "Love it💕"}, {"username": "Cindy Sguazzin", "comment_text": "This is a wonderful post, and so true! Thanks, Bridget!"}, {"username": "Dee Cola Charlton", "comment_text": "Obviously not spoken by a woman! I do agree with everything except numbers 1 and 2. You don't know my bladder.😆"}, {"username": "MaryLou Partin Tyner", "comment_text": "Yes! ❤️"}, {"username": "Monica Paz Gannon", "comment_text": "Best post ever!!! Go with the flow. I am that kind of traveler. I love to get lost on purpose and find my way around trying to talk to people. Best experiences happen that way."}, {"username": "Jennifer Louise Snedden", "comment_text": "Wonderful advise and tis what I try to practice when holidaying anywhere .... after all you are on holidays!!!"}, {"username": "Gianna Onesi", "comment_text": "Well said!!"}]}, {"id": "2212528272479584", "text": "Hi ! 👋\nNeed some recommendations. We going to Europ next summer and we start to search for the best sandal to walk.\n\n*we going with backpack only, so something that fit with a lot of activity and outfit.\n\nThank you !", "link": "facebook.com/groups/1373361046396315/permalink/2212528272479584/", "likes": 2, "comments": [{"username": "Elena Melodini-Charles", "comment_text": "I am absolutely in love with Taos. They are fashionable and comfortable."}, {"username": "Jillo Duffy", "comment_text": "Sketchers sandals have done me well across a lot of miles across Europe and they make some simple cute ones that even work with dresses.\nPlus the stretchy staph ones dry quick."}, {"username": "Jillo Duffy", "comment_text": "Jillo Duffy"}, {"username": "Jillo Duffy", "comment_text": "Jillo Duffy"}, {"username": "Elaine M Woodward", "comment_text": "Why not close toed?"}, {"username": "Diane Wilkerson", "comment_text": "Join the Travel Fashion Girls FB group and take a look at their web site. This is frequently asked in that group."}, {"username": "Donna Dougherty", "comment_text": "Sorel!!"}, {"username": "Donna Dougherty", "comment_text": "Just did 21 days. Wore sorel every day!!"}, {"username": "Julie Gayde Benden", "comment_text": "I wore Crocs flip flops on my 12 day trip. They were actually more comfortable than my skecher tennis shoes. You just have to use a little caution on the cobblestone."}, {"username": "Rhona OConnor", "comment_text": "Wear what's comfortable as you will walk a lot. Lots of people wear runners. No one is looking at your feet."}, {"username": "Margaret Frey", "comment_text": "My sisters wore Tevas and Chacos. Both are sporty looking sandals."}, {"username": "Lucrezia Folger", "comment_text": "Berkinstock"}, {"username": "Alberta Brack McAviney", "comment_text": "Any recommendations\non someone that needs a wide?"}, {"username": "Rosa Guerra", "comment_text": "Sorel"}, {"username": "Jenny Kendrick", "comment_text": "Not a sandal but converse shoes lasted the distance for me"}, {"username": "Pam McIntyre", "comment_text": "Wore NAOTs every day for six months during my first European trip and plan to do the same for our next trip. No blisters or pain at all and held up during rain and high temps."}, {"username": "Heather Carey Roper", "comment_text": "Merrell sandals are the best I’ve ever worn."}, {"username": "Debbie Palamone", "comment_text": "I wore these for 27 days on our last trip. Adjustable at toe & ankle. Buying the same sandal for our next trip. Pricey, but well worth it."}, {"username": "Sheri Dettman", "comment_text": "I'd have a sandal like the one that Jillo Duffy suggested, along with a pair of very light, cushiony, closed-toe sneakers. Everyone wears sneakers with sundresses as well."}, {"username": "Beth Stewart", "comment_text": "I buy sketchers for travelling"}, {"username": "Gwen Kalathil", "comment_text": "Last year on the way to Spain and Portugual I somehow hurt my foot and couldn’t wear anything that went over the top of my foot, so I was forced to walk all over in sandals. My Sorels got the job done! And no slipping on the cobblestone."}]}, {"id": "2212435902488821", "text": "Options for SUP, kayaking or sailing near Minori end of September?", "link": "facebook.com/groups/1373361046396315/permalink/2212435902488821/", "likes": 3, "comments": []}, {"id": "2211823515883393", "text": "We will be spending a week in Bologna, this November. I would love to to do a cooking class. Any recommendations based on personal experience? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2211823515883393/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Bologna/\nTraditional-Home\n-Cooking-Experi\nence-in-Bologna\n/\nd791-17024P7?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Scott Perry", "comment_text": "Guero on via Goito for cocktails. Tell them Scott sent you. 😁"}]}, {"id": "2212420995823645", "text": "Meeting my husband in Florence after he attends a conference but was thinking of going somewhere before by myself for 2 days. Any suggestions? We are doing Florence and then Rome .", "link": "facebook.com/groups/1373361046396315/permalink/2212420995823645/", "likes": 4, "comments": [{"username": "Esther Newcombe Mahon", "comment_text": "Lucca or the cinque terre"}, {"username": "Julie Gentle Bassett", "comment_text": "Cinque Terre"}, {"username": "Rose Turdo", "comment_text": "Bolsena Lake"}, {"username": "Debbie DiOssi", "comment_text": "Viareggio….grea\nt little beach town."}, {"username": "Isabel Jones", "comment_text": "Lucca is beautiful, close to Florence and safe on your own."}, {"username": "Ken Lerch", "comment_text": "In Tuscany go to Lucca. In Umbria go to Orvieto or Assisi."}, {"username": "Gillian O'Callaghan", "comment_text": "If arriving in Florence do 2 day trips.....go to Pisa and Orvieto."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}]